
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第三周 目标检测 · 深度学习教程</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/style.css">

    
            
                
                <link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-back-to-top-button/plugin.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="lesson4-week4.html" />
    
    
    <link rel="prev" href="lesson4-week2.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://www.editcode.net" target="_blank" class="custom-link">编程网</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        <li class="header">第一门课 神经网络和深度学习</li>
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="lesson1-week1.html">
            
                <a href="lesson1-week1.html">
            
                    
                    第一周：深度学习引言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="lesson1-week2.html">
            
                <a href="lesson1-week2.html">
            
                    
                    第二周：神经网络的编程基础
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="lesson1-week3.html">
            
                <a href="lesson1-week3.html">
            
                    
                    第三周：浅层神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="lesson1-week4.html">
            
                <a href="lesson1-week4.html">
            
                    
                    第四周：深层神经网络
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第二门课 改善深层神经网络</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="lesson2-week1.html">
            
                <a href="lesson2-week1.html">
            
                    
                    第一周：深度学习的实践层面
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="lesson2-week2.html">
            
                <a href="lesson2-week2.html">
            
                    
                    第二周：优化算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="lesson2-week3.html">
            
                <a href="lesson2-week3.html">
            
                    
                    第三周超参数调试，batch正则化和程序框架
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第三门课 结构化机器学习项目</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="lesson3-week1.html">
            
                <a href="lesson3-week1.html">
            
                    
                    第一周：机器学习策略
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="lesson3-week2.html">
            
                <a href="lesson3-week2.html">
            
                    
                    第二周：机器学习策略
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第四门课 卷积神经网络</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="lesson4-week1.html">
            
                <a href="lesson4-week1.html">
            
                    
                    第一周 卷积神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="lesson4-week2.html">
            
                <a href="lesson4-week2.html">
            
                    
                    第二周 深度卷积网络：实例探究
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="4.3" data-path="lesson4-week3.html">
            
                <a href="lesson4-week3.html">
            
                    
                    第三周 目标检测
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.4" data-path="lesson4-week4.html">
            
                <a href="lesson4-week4.html">
            
                    
                    第四周 特殊应用：人脸识别和神经风格转换
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第五门课 序列模型</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="lesson5-week1.html">
            
                <a href="lesson5-week1.html">
            
                    
                    第一周 循环序列模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.2" data-path="lesson5-week2.html">
            
                <a href="lesson5-week2.html">
            
                    
                    第二周 自然语言处理与词嵌入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.3" data-path="lesson5-week3.html">
            
                <a href="lesson5-week3.html">
            
                    
                    第三周 序列模型和注意力机制
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">附件</li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="interview.html">
            
                <a href="interview.html">
            
                    
                    人工智能大师访谈
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.2" data-path="notation.html">
            
                <a href="notation.html">
            
                    
                    深度学习符号指南（原课程翻译）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.3" data-path="notation.html">
            
                <a href="notation.html">
            
                    
                    机器学习的数学基础
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第三周 目标检测</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x7B2C;&#x4E09;&#x5468;-&#x76EE;&#x6807;&#x68C0;&#x6D4B;&#xFF08;object-detection&#xFF09;">&#x7B2C;&#x4E09;&#x5468; &#x76EE;&#x6807;&#x68C0;&#x6D4B;&#xFF08;Object detection&#xFF09;</h2>
<p>[TOC]</p>
<h3 id="31-&#x76EE;&#x6807;&#x5B9A;&#x4F4D;&#xFF08;object-localization&#xFF09;">3.1 &#x76EE;&#x6807;&#x5B9A;&#x4F4D;&#xFF08;Object localization&#xFF09;</h3>
<p>&#x5927;&#x5BB6;&#x597D;&#xFF0C;&#x6B22;&#x8FCE;&#x56DE;&#x6765;&#xFF0C;&#x8FD9;&#x4E00;&#x5468;&#x6211;&#x4EEC;&#x5B66;&#x4E60;&#x7684;&#x4E3B;&#x8981;&#x5185;&#x5BB9;&#x662F;&#x5BF9;&#x8C61;&#x68C0;&#x6D4B;&#xFF0C;&#x5B83;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x9886;&#x57DF;&#x4E2D;&#x4E00;&#x4E2A;&#x65B0;&#x5174;&#x7684;&#x5E94;&#x7528;&#x65B9;&#x5411;&#xFF0C;&#x76F8;&#x6BD4;&#x524D;&#x4E24;&#x5E74;&#xFF0C;&#x5B83;&#x7684;&#x6027;&#x80FD;&#x8D8A;&#x6765;&#x8D8A;&#x597D;&#x3002;&#x5728;&#x6784;&#x5EFA;&#x5BF9;&#x8C61;&#x68C0;&#x6D4B;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x4E86;&#x89E3;&#x4E00;&#x4E0B;&#x5BF9;&#x8C61;&#x5B9A;&#x4F4D;&#xFF0C;&#x9996;&#x5148;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x5B83;&#x7684;&#x5B9A;&#x4E49;&#x3002;</p>
<p><img src="../images/0107af10b33fcb955cc3c588dfb78d49.png" alt=""></p>
<p>&#x56FE;&#x7247;&#x5206;&#x7C7B;&#x4EFB;&#x52A1;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x719F;&#x6089;&#x4E86;&#xFF0C;&#x5C31;&#x662F;&#x7B97;&#x6CD5;&#x904D;&#x5386;&#x56FE;&#x7247;&#xFF0C;&#x5224;&#x65AD;&#x5176;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#x662F;&#x4E0D;&#x662F;&#x6C7D;&#x8F66;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x56FE;&#x7247;&#x5206;&#x7C7B;&#x3002;&#x8FD9;&#x8282;&#x8BFE;&#x6211;&#x4EEC;&#x8981;&#x5B66;&#x4E60;&#x6784;&#x5EFA;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5373;&#x5B9A;&#x4F4D;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x4EC5;&#x8981;&#x7528;&#x7B97;&#x6CD5;&#x5224;&#x65AD;&#x56FE;&#x7247;&#x4E2D;&#x662F;&#x4E0D;&#x662F;&#x4E00;&#x8F86;&#x6C7D;&#x8F66;&#xFF0C;&#x8FD8;&#x8981;&#x5728;&#x56FE;&#x7247;&#x4E2D;&#x6807;&#x8BB0;&#x51FA;&#x5B83;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x7528;&#x8FB9;&#x6846;&#x6216;&#x7EA2;&#x8272;&#x65B9;&#x6846;&#x628A;&#x6C7D;&#x8F66;&#x5708;&#x8D77;&#x6765;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x5B9A;&#x4F4D;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#x3002;&#x5176;&#x4E2D;&#x201C;&#x5B9A;&#x4F4D;&#x201D;&#x7684;&#x610F;&#x601D;&#x662F;&#x5224;&#x65AD;&#x6C7D;&#x8F66;&#x5728;&#x56FE;&#x7247;&#x4E2D;&#x7684;&#x5177;&#x4F53;&#x4F4D;&#x7F6E;&#x3002;&#x8FD9;&#x5468;&#x540E;&#x9762;&#x51E0;&#x5929;&#xFF0C;&#x6211;&#x4EEC;&#x518D;&#x8BB2;&#x8BB2;&#x5F53;&#x56FE;&#x7247;&#x4E2D;&#x6709;&#x591A;&#x4E2A;&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x5E94;&#x8BE5;&#x5982;&#x4F55;&#x68C0;&#x6D4B;&#x5B83;&#x4EEC;&#xFF0C;&#x5E76;&#x786E;&#x5B9A;&#x51FA;&#x4F4D;&#x7F6E;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x4F60;&#x6B63;&#x5728;&#x505A;&#x4E00;&#x4E2A;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x7A0B;&#x5E8F;&#xFF0C;&#x7A0B;&#x5E8F;&#x4E0D;&#x4F46;&#x8981;&#x68C0;&#x6D4B;&#x5176;&#x5B83;&#x8F66;&#x8F86;&#xFF0C;&#x8FD8;&#x8981;&#x68C0;&#x6D4B;&#x5176;&#x5B83;&#x5BF9;&#x8C61;&#xFF0C;&#x5982;&#x884C;&#x4EBA;&#x3001;&#x6469;&#x6258;&#x8F66;&#x7B49;&#x7B49;&#xFF0C;&#x7A0D;&#x540E;&#x6211;&#x4EEC;&#x518D;&#x8BE6;&#x7EC6;&#x8BB2;&#x3002;</p>
<p>&#x672C;&#x5468;&#x6211;&#x4EEC;&#x8981;&#x7814;&#x7A76;&#x7684;&#x5206;&#x7C7B;&#x5B9A;&#x4F4D;&#x95EE;&#x9898;&#xFF0C;&#x901A;&#x5E38;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x8F83;&#x5927;&#x7684;&#x5BF9;&#x8C61;&#x4F4D;&#x4E8E;&#x56FE;&#x7247;&#x4E2D;&#x95F4;&#x4F4D;&#x7F6E;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x5BF9;&#x5B83;&#x8FDB;&#x884C;&#x8BC6;&#x522B;&#x548C;&#x5B9A;&#x4F4D;&#x3002;&#x800C;&#x5728;&#x5BF9;&#x8C61;&#x68C0;&#x6D4B;&#x95EE;&#x9898;&#x4E2D;&#xFF0C;&#x56FE;&#x7247;&#x53EF;&#x4EE5;&#x542B;&#x6709;&#x591A;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x751A;&#x81F3;&#x5355;&#x5F20;&#x56FE;&#x7247;&#x4E2D;&#x4F1A;&#x6709;&#x591A;&#x4E2A;&#x4E0D;&#x540C;&#x5206;&#x7C7B;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x56FE;&#x7247;&#x5206;&#x7C7B;&#x7684;&#x601D;&#x8DEF;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x5B66;&#x4E60;&#x5206;&#x7C7B;&#x5B9A;&#x4F4D;&#xFF0C;&#x800C;&#x5BF9;&#x8C61;&#x5B9A;&#x4F4D;&#x7684;&#x601D;&#x8DEF;&#x53C8;&#x6709;&#x52A9;&#x4E8E;&#x5B66;&#x4E60;&#x5BF9;&#x8C61;&#x68C0;&#x6D4B;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x4ECE;&#x5206;&#x7C7B;&#x548C;&#x5B9A;&#x4F4D;&#x5F00;&#x59CB;&#x8BB2;&#x8D77;&#x3002;</p>
<p>&#x56FE;&#x7247;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#x4F60;&#x5DF2;&#x7ECF;&#x5E76;&#x4E0D;&#x964C;&#x751F;&#x4E86;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x8F93;&#x5165;&#x4E00;&#x5F20;&#x56FE;&#x7247;&#x5230;&#x591A;&#x5C42;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x5B83;&#x4F1A;&#x8F93;&#x51FA;&#x4E00;&#x4E2A;&#x7279;&#x5F81;&#x5411;&#x91CF;&#xFF0C;&#x5E76;&#x53CD;&#x9988;&#x7ED9;<strong>softmax</strong>&#x5355;&#x5143;&#x6765;&#x9884;&#x6D4B;&#x56FE;&#x7247;&#x7C7B;&#x578B;&#x3002;</p>
<p><img src="../images/d4a47c2041807f891c0a606d246330c5.png" alt=""></p>
<p>&#x5982;&#x679C;&#x4F60;&#x6B63;&#x5728;&#x6784;&#x5EFA;&#x6C7D;&#x8F66;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x7CFB;&#x7EDF;&#xFF0C;&#x90A3;&#x4E48;&#x5BF9;&#x8C61;&#x53EF;&#x80FD;&#x5305;&#x62EC;&#x4EE5;&#x4E0B;&#x51E0;&#x7C7B;&#xFF1A;&#x884C;&#x4EBA;&#x3001;&#x6C7D;&#x8F66;&#x3001;&#x6469;&#x6258;&#x8F66;&#x548C;&#x80CC;&#x666F;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x56FE;&#x7247;&#x4E2D;&#x4E0D;&#x542B;&#x6709;&#x524D;&#x4E09;&#x79CD;&#x5BF9;&#x8C61;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x56FE;&#x7247;&#x4E2D;&#x6CA1;&#x6709;&#x884C;&#x4EBA;&#x3001;&#x6C7D;&#x8F66;&#x548C;&#x6469;&#x6258;&#x8F66;&#xFF0C;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x4F1A;&#x662F;&#x80CC;&#x666F;&#x5BF9;&#x8C61;&#xFF0C;&#x8FD9;&#x56DB;&#x4E2A;&#x5206;&#x7C7B;&#x5C31;&#x662F;softmax&#x51FD;&#x6570;&#x53EF;&#x80FD;&#x8F93;&#x51FA;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p><img src="../images/6461ff27c00dff4205688de4cf9d8803.png" alt=""></p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x6807;&#x51C6;&#x7684;&#x5206;&#x7C7B;&#x8FC7;&#x7A0B;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8FD8;&#x60F3;&#x5B9A;&#x4F4D;&#x56FE;&#x7247;&#x4E2D;&#x6C7D;&#x8F66;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x8BE5;&#x600E;&#x4E48;&#x505A;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8BA9;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x591A;&#x8F93;&#x51FA;&#x51E0;&#x4E2A;&#x5355;&#x5143;&#xFF0C;&#x8F93;&#x51FA;&#x4E00;&#x4E2A;&#x8FB9;&#x754C;&#x6846;&#x3002;&#x5177;&#x4F53;&#x8BF4;&#x5C31;&#x662F;&#x8BA9;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x518D;&#x591A;&#x8F93;&#x51FA;4&#x4E2A;&#x6570;&#x5B57;&#xFF0C;&#x6807;&#x8BB0;&#x4E3A;$b<em>{x}$,$b</em>{y}$,$b<em>{h}$&#x548C;$b</em>{w}$&#xFF0C;&#x8FD9;&#x56DB;&#x4E2A;&#x6570;&#x5B57;&#x662F;&#x88AB;&#x68C0;&#x6D4B;&#x5BF9;&#x8C61;&#x7684;&#x8FB9;&#x754C;&#x6846;&#x7684;&#x53C2;&#x6570;&#x5316;&#x8868;&#x793A;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5148;&#x6765;&#x7EA6;&#x5B9A;&#x672C;&#x5468;&#x8BFE;&#x7A0B;&#x5C06;&#x4F7F;&#x7528;&#x7684;&#x7B26;&#x53F7;&#x8868;&#x793A;&#xFF0C;&#x56FE;&#x7247;&#x5DE6;&#x4E0A;&#x89D2;&#x7684;&#x5750;&#x6807;&#x4E3A;$(0,0)$&#xFF0C;&#x53F3;&#x4E0B;&#x89D2;&#x6807;&#x8BB0;&#x4E3A;$(1,1)$&#x3002;&#x8981;&#x786E;&#x5B9A;&#x8FB9;&#x754C;&#x6846;&#x7684;&#x5177;&#x4F53;&#x4F4D;&#x7F6E;&#xFF0C;&#x9700;&#x8981;&#x6307;&#x5B9A;&#x7EA2;&#x8272;&#x65B9;&#x6846;&#x7684;&#x4E2D;&#x5FC3;&#x70B9;&#xFF0C;&#x8FD9;&#x4E2A;&#x70B9;&#x8868;&#x793A;&#x4E3A;($b<em>{x}$,$b</em>{y}$)&#xFF0C;&#x8FB9;&#x754C;&#x6846;&#x7684;&#x9AD8;&#x5EA6;&#x4E3A;$b<em>{h}$&#xFF0C;&#x5BBD;&#x5EA6;&#x4E3A;$b</em>{w}$&#x3002;&#x56E0;&#x6B64;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0D;&#x4EC5;&#x5305;&#x542B;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8981;&#x9884;&#x6D4B;&#x7684;&#x5BF9;&#x8C61;&#x5206;&#x7C7B;&#x6807;&#x7B7E;&#xFF0C;&#x8FD8;&#x8981;&#x5305;&#x542B;&#x8868;&#x793A;&#x8FB9;&#x754C;&#x6846;&#x7684;&#x8FD9;&#x56DB;&#x4E2A;&#x6570;&#x5B57;&#xFF0C;&#x63A5;&#x7740;&#x91C7;&#x7528;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#xFF0C;&#x8F93;&#x51FA;&#x4E00;&#x4E2A;&#x5206;&#x7C7B;&#x6807;&#x7B7E;&#xFF0C;&#x8FD8;&#x6709;&#x56DB;&#x4E2A;&#x53C2;&#x6570;&#x503C;&#xFF0C;&#x4ECE;&#x800C;&#x7ED9;&#x51FA;&#x68C0;&#x6D4B;&#x5BF9;&#x8C61;&#x7684;&#x8FB9;&#x6846;&#x4F4D;&#x7F6E;&#x3002;&#x6B64;&#x4F8B;&#x4E2D;&#xFF0C;$b<em>{x}$&#x7684;&#x7406;&#x60F3;&#x503C;&#x662F;0.5&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x8868;&#x793A;&#x6C7D;&#x8F66;&#x4F4D;&#x4E8E;&#x56FE;&#x7247;&#x6C34;&#x5E73;&#x65B9;&#x5411;&#x7684;&#x4E2D;&#x95F4;&#x4F4D;&#x7F6E;&#xFF1B;$b</em>{y}$&#x5927;&#x7EA6;&#x662F;0.7&#xFF0C;&#x8868;&#x793A;&#x6C7D;&#x8F66;&#x4F4D;&#x4E8E;&#x8DDD;&#x79BB;&#x56FE;&#x7247;&#x5E95;&#x90E8;$\frac{3}{10}$&#x7684;&#x4F4D;&#x7F6E;&#xFF1B;$b<em>{h}$&#x7EA6;&#x4E3A;0.3&#xFF0C;&#x56E0;&#x4E3A;&#x7EA2;&#x8272;&#x65B9;&#x6846;&#x7684;&#x9AD8;&#x5EA6;&#x662F;&#x56FE;&#x7247;&#x9AD8;&#x5EA6;&#x7684;0.3&#x500D;&#xFF1B;$b</em>{w}$&#x7EA6;&#x4E3A;0.4&#xFF0C;&#x7EA2;&#x8272;&#x65B9;&#x6846;&#x7684;&#x5BBD;&#x5EA6;&#x662F;&#x56FE;&#x7247;&#x5BBD;&#x5EA6;&#x7684;0.4&#x500D;&#x3002;</p>
<p><img src="../images/21b37dcb413e7c86464f88484796420c.png" alt=""></p>
<p>&#x4E0B;&#x9762;&#x6211;&#x518D;&#x5177;&#x4F53;&#x8BB2;&#x8BB2;&#x5982;&#x4F55;&#x4E3A;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x4EFB;&#x52A1;&#x5B9A;&#x4E49;&#x76EE;&#x6807;&#x6807;&#x7B7E; $y$&#x3002;</p>
<p><img src="../images/02d85ab36285cd21b5df4d1c253df57e.png" alt=""></p>
<p>&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x8FD9;&#x6709;&#x56DB;&#x4E2A;&#x5206;&#x7C7B;&#xFF0C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8F93;&#x51FA;&#x7684;&#x662F;&#x8FD9;&#x56DB;&#x4E2A;&#x6570;&#x5B57;&#x548C;&#x4E00;&#x4E2A;&#x5206;&#x7C7B;&#x6807;&#x7B7E;&#xFF0C;&#x6216;&#x5206;&#x7C7B;&#x6807;&#x7B7E;&#x51FA;&#x73B0;&#x7684;&#x6982;&#x7387;&#x3002;&#x76EE;&#x6807;&#x6807;&#x7B7E;$y$&#x7684;&#x5B9A;&#x4E49;&#x5982;&#x4E0B;&#xFF1A;$y= \ \begin{bmatrix} p<em>{c} \ b</em>{x} \ b<em>{y} \ b</em>{h} \ b<em>{w} \ c</em>{1} \ c<em>{2}\ c</em>{3} \\end{bmatrix}$</p>
<p>&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x5411;&#x91CF;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x7EC4;&#x4EF6;$p<em>{c}$&#x8868;&#x793A;&#x662F;&#x5426;&#x542B;&#x6709;&#x5BF9;&#x8C61;&#xFF0C;&#x5982;&#x679C;&#x5BF9;&#x8C61;&#x5C5E;&#x4E8E;&#x524D;&#x4E09;&#x7C7B;&#xFF08;&#x884C;&#x4EBA;&#x3001;&#x6C7D;&#x8F66;&#x3001;&#x6469;&#x6258;&#x8F66;&#xFF09;&#xFF0C;&#x5219;$p</em>{c}= 1$&#xFF0C;&#x5982;&#x679C;&#x662F;&#x80CC;&#x666F;&#xFF0C;&#x5219;&#x56FE;&#x7247;&#x4E2D;&#x6CA1;&#x6709;&#x8981;&#x68C0;&#x6D4B;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5219;$p<em>{c} =0$&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x7406;&#x89E3;$p</em>{c}$&#xFF0C;&#x5B83;&#x8868;&#x793A;&#x88AB;&#x68C0;&#x6D4B;&#x5BF9;&#x8C61;&#x5C5E;&#x4E8E;&#x67D0;&#x4E00;&#x5206;&#x7C7B;&#x7684;&#x6982;&#x7387;&#xFF0C;&#x80CC;&#x666F;&#x5206;&#x7C7B;&#x9664;&#x5916;&#x3002;</p>
<p>&#x5982;&#x679C;&#x68C0;&#x6D4B;&#x5230;&#x5BF9;&#x8C61;&#xFF0C;&#x5C31;&#x8F93;&#x51FA;&#x88AB;&#x68C0;&#x6D4B;&#x5BF9;&#x8C61;&#x7684;&#x8FB9;&#x754C;&#x6846;&#x53C2;&#x6570;$b<em>{x}$&#x3001;$b</em>{y}$&#x3001;$b<em>{h}$&#x548C;$b</em>{w}$&#x3002;&#x6700;&#x540E;&#xFF0C;&#x5982;&#x679C;&#x5B58;&#x5728;&#x67D0;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x90A3;&#x4E48;$p<em>{c}=1$&#xFF0C;&#x540C;&#x65F6;&#x8F93;&#x51FA;$c</em>{1}$&#x3001;$c<em>{2}$&#x548C;$c</em>{3}$&#xFF0C;&#x8868;&#x793A;&#x8BE5;&#x5BF9;&#x8C61;&#x5C5E;&#x4E8E;1-3&#x7C7B;&#x4E2D;&#x7684;&#x54EA;&#x4E00;&#x7C7B;&#xFF0C;&#x662F;&#x884C;&#x4EBA;&#xFF0C;&#x6C7D;&#x8F66;&#x8FD8;&#x662F;&#x6469;&#x6258;&#x8F66;&#x3002;&#x9274;&#x4E8E;&#x6211;&#x4EEC;&#x6240;&#x8981;&#x5904;&#x7406;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x56FE;&#x7247;&#x4E2D;&#x53EA;&#x542B;&#x6709;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x6240;&#x4EE5;&#x9488;&#x5BF9;&#x8FD9;&#x4E2A;&#x5206;&#x7C7B;&#x5B9A;&#x4F4D;&#x95EE;&#x9898;&#xFF0C;&#x56FE;&#x7247;&#x6700;&#x591A;&#x53EA;&#x4F1A;&#x51FA;&#x73B0;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x3002;</p>
<p><img src="../images/fd37e4750b64a07cc1f29880c9b97261.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x518D;&#x770B;&#x51E0;&#x4E2A;&#x6837;&#x672C;&#xFF0C;&#x5047;&#x5982;&#x8FD9;&#x662F;&#x4E00;&#x5F20;&#x8BAD;&#x7EC3;&#x96C6;&#x56FE;&#x7247;&#xFF0C;&#x6807;&#x8BB0;&#x4E3A;$x$&#xFF0C;&#x5373;&#x4E0A;&#x56FE;&#x7684;&#x6C7D;&#x8F66;&#x56FE;&#x7247;&#x3002;&#x800C;&#x5728;$y$&#x5F53;&#x4E2D;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;$p<em>{c} =1$&#xFF0C;&#x56E0;&#x4E3A;&#x56FE;&#x4E2D;&#x6709;&#x4E00;&#x8F86;&#x8F66;&#xFF0C;$b</em>{x}$&#x3001;$b<em>{y}$&#x3001;$b</em>{h}$&#x548C;$b<em>{w}$&#x4F1A;&#x6307;&#x660E;&#x8FB9;&#x754C;&#x6846;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x6240;&#x4EE5;&#x6807;&#x7B7E;&#x8BAD;&#x7EC3;&#x96C6;&#x9700;&#x8981;&#x6807;&#x7B7E;&#x7684;&#x8FB9;&#x754C;&#x6846;&#x3002;&#x56FE;&#x7247;&#x4E2D;&#x662F;&#x4E00;&#x8F86;&#x8F66;&#xFF0C;&#x6240;&#x4EE5;&#x7ED3;&#x679C;&#x5C5E;&#x4E8E;&#x5206;&#x7C7B;2&#xFF0C;&#x56E0;&#x4E3A;&#x5B9A;&#x4F4D;&#x76EE;&#x6807;&#x4E0D;&#x662F;&#x884C;&#x4EBA;&#x6216;&#x6469;&#x6258;&#x8F66;&#xFF0C;&#x800C;&#x662F;&#x6C7D;&#x8F66;&#xFF0C;&#x6240;&#x4EE5;$c</em>{1}= 0$&#xFF0C;$c<em>{2} = 1$&#xFF0C;$c</em>{3} =0$&#xFF0C;$c<em>{1}$&#x3001;$c</em>{2}$&#x548C;$c_{3}$&#x4E2D;&#x6700;&#x591A;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x7B49;&#x4E8E;1&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x56FE;&#x7247;&#x4E2D;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x68C0;&#x6D4B;&#x5BF9;&#x8C61;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5982;&#x679C;&#x56FE;&#x7247;&#x4E2D;&#x6CA1;&#x6709;&#x68C0;&#x6D4B;&#x5BF9;&#x8C61;&#x5462;&#xFF1F;&#x5982;&#x679C;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#x662F;&#x8FD9;&#x6837;&#x4E00;&#x5F20;&#x56FE;&#x7247;&#x5462;&#xFF1F;</p>
<p><img src="../images/131239883224f03709ddc66d9481c3c7.png" alt=""></p>
<p>&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;$p<em>{c} =0$&#xFF0C;$y$&#x7684;&#x5176;&#x5B83;&#x53C2;&#x6570;&#x5C06;&#x53D8;&#x5F97;&#x6BEB;&#x65E0;&#x610F;&#x4E49;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x5168;&#x90E8;&#x5199;&#x6210;&#x95EE;&#x53F7;&#xFF0C;&#x8868;&#x793A;&#x201C;&#x6BEB;&#x65E0;&#x610F;&#x4E49;&#x201D;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x56E0;&#x4E3A;&#x56FE;&#x7247;&#x4E2D;&#x4E0D;&#x5B58;&#x5728;&#x68C0;&#x6D4B;&#x5BF9;&#x8C61;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x7528;&#x8003;&#x8651;&#x7F51;&#x7EDC;&#x8F93;&#x51FA;&#x4E2D;&#x8FB9;&#x754C;&#x6846;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x4E5F;&#x4E0D;&#x7528;&#x8003;&#x8651;&#x56FE;&#x7247;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#x662F;&#x5C5E;&#x4E8E;$c</em>{1}$&#x3001;$c<em>{2}$&#x548C;$c</em>{3}$&#x4E2D;&#x7684;&#x54EA;&#x4E00;&#x7C7B;&#x3002;&#x9488;&#x5BF9;&#x7ED9;&#x5B9A;&#x7684;&#x88AB;&#x6807;&#x8BB0;&#x7684;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#xFF0C;&#x4E0D;&#x8BBA;&#x56FE;&#x7247;&#x4E2D;&#x662F;&#x5426;&#x542B;&#x6709;&#x5B9A;&#x4F4D;&#x5BF9;&#x8C61;&#xFF0C;&#x6784;&#x5EFA;&#x8F93;&#x5165;&#x56FE;&#x7247;$x$&#x548C;&#x5206;&#x7C7B;&#x6807;&#x7B7E;$y$&#x7684;&#x5177;&#x4F53;&#x8FC7;&#x7A0B;&#x90FD;&#x662F;&#x5982;&#x6B64;&#x3002;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x6700;&#x7EC8;&#x5B9A;&#x4E49;&#x4E86;&#x8BAD;&#x7EC3;&#x96C6;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x635F;&#x5931;&#x51FD;&#x6570;&#xFF0C;&#x5176;&#x53C2;&#x6570;&#x4E3A;&#x7C7B;&#x522B;$y$&#x548C;&#x7F51;&#x7EDC;&#x8F93;&#x51FA;$\hat{y}$&#xFF0C;&#x5982;&#x679C;&#x91C7;&#x7528;&#x5E73;&#x65B9;&#x8BEF;&#x5DEE;&#x7B56;&#x7565;&#xFF0C;&#x5219;$L\left(\hat{y},y \right) = \left( \hat{y<em>1} - y</em>{1} \right)^{2} + \left(\hat{y<em>2} - y</em>{2}\right)^{2} + \ldots\left( \hat{y<em>8} - y</em>{8}\right)^{2}$&#xFF0C;&#x635F;&#x5931;&#x503C;&#x7B49;&#x4E8E;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x76F8;&#x5E94;&#x5DEE;&#x503C;&#x7684;&#x5E73;&#x65B9;&#x548C;&#x3002;</p>
<p><img src="../images/d50ae3ee809da4c728837fee2d055f00.png" alt=""></p>
<p>&#x5982;&#x679C;&#x56FE;&#x7247;&#x4E2D;&#x5B58;&#x5728;&#x5B9A;&#x4F4D;&#x5BF9;&#x8C61;&#xFF0C;&#x90A3;&#x4E48;$y<em>{1} = 1$&#xFF0C;&#x6240;&#x4EE5;$y</em>{1} =p<em>{c}$&#xFF0C;&#x540C;&#x6837;&#x5730;&#xFF0C;&#x5982;&#x679C;&#x56FE;&#x7247;&#x4E2D;&#x5B58;&#x5728;&#x5B9A;&#x4F4D;&#x5BF9;&#x8C61;&#xFF0C;$p</em>{c} =1$&#xFF0C;&#x635F;&#x5931;&#x503C;&#x5C31;&#x662F;&#x4E0D;&#x540C;&#x5143;&#x7D20;&#x7684;&#x5E73;&#x65B9;&#x548C;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#x662F;&#xFF0C;$y<em>{1} = 0$&#xFF0C;&#x4E5F;&#x5C31;&#x662F;$p</em>{c} = 0$&#xFF0C;&#x635F;&#x5931;&#x503C;&#x662F;$\left(\hat{y<em>1} - y</em>{1}\right)^{2}$&#xFF0C;&#x56E0;&#x4E3A;&#x5BF9;&#x4E8E;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x7528;&#x8003;&#x8651;&#x5176;&#x5B83;&#x5143;&#x7D20;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x5173;&#x6CE8;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8F93;&#x51FA;$p_{c}$&#x7684;&#x51C6;&#x786E;&#x5EA6;&#x3002;</p>
<p>&#x56DE;&#x987E;&#x4E00;&#x4E0B;&#xFF0C;&#x5F53;$y<em>{1} =1$&#x65F6;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF08;&#x7F16;&#x53F7;1&#xFF09;&#xFF0C;&#x5E73;&#x65B9;&#x8BEF;&#x5DEE;&#x7B56;&#x7565;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x8FD9;8&#x4E2A;&#x5143;&#x7D20;&#x9884;&#x6D4B;&#x503C;&#x548C;&#x5B9E;&#x9645;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x4E4B;&#x95F4;&#x5DEE;&#x503C;&#x7684;&#x5E73;&#x65B9;&#x3002;&#x5982;&#x679C;$y</em>{1}=0$&#xFF0C;$y$  &#x77E9;&#x9635;&#x4E2D;&#x7684;&#x540E;7&#x4E2A;&#x5143;&#x7D20;&#x90FD;&#x4E0D;&#x7528;&#x8003;&#x8651;&#xFF08;&#x7F16;&#x53F7;2&#xFF09;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x8003;&#x8651;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8BC4;&#x4F30;$y<em>{1}$&#xFF08;&#x5373;$p</em>{c}$&#xFF09;&#x7684;&#x51C6;&#x786E;&#x5EA6;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x8BA9;&#x5927;&#x5BB6;&#x4E86;&#x89E3;&#x5BF9;&#x8C61;&#x5B9A;&#x4F4D;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x7528;&#x5E73;&#x65B9;&#x8BEF;&#x5DEE;&#x7B80;&#x5316;&#x4E86;&#x63CF;&#x8FF0;&#x8FC7;&#x7A0B;&#x3002;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x4E2D;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4E0D;&#x5BF9;$c<em>{1}$&#x3001;$c</em>{2}$&#x3001;$c<em>{3}$&#x548C;<strong>softmax</strong>&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x5E94;&#x7528;&#x5BF9;&#x6570;&#x635F;&#x5931;&#x51FD;&#x6570;&#xFF0C;&#x5E76;&#x8F93;&#x51FA;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x503C;&#xFF0C;&#x901A;&#x5E38;&#x505A;&#x6CD5;&#x662F;&#x5BF9;&#x8FB9;&#x754C;&#x6846;&#x5750;&#x6807;&#x5E94;&#x7528;&#x5E73;&#x65B9;&#x5DEE;&#x6216;&#x7C7B;&#x4F3C;&#x65B9;&#x6CD5;&#xFF0C;&#x5BF9;$p</em>{c}$&#x5E94;&#x7528;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x51FD;&#x6570;&#xFF0C;&#x751A;&#x81F3;&#x91C7;&#x7528;&#x5E73;&#x65B9;&#x9884;&#x6D4B;&#x8BEF;&#x5DEE;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#x3002;</p>
<p>&#x4EE5;&#x4E0A;&#x5C31;&#x662F;&#x5229;&#x7528;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x89E3;&#x51B3;&#x5BF9;&#x8C61;&#x5206;&#x7C7B;&#x548C;&#x5B9A;&#x4F4D;&#x95EE;&#x9898;&#x7684;&#x8BE6;&#x7EC6;&#x8FC7;&#x7A0B;&#xFF0C;&#x7ED3;&#x679C;&#x8BC1;&#x660E;&#xFF0C;&#x5229;&#x7528;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8F93;&#x51FA;&#x6279;&#x91CF;&#x5B9E;&#x6570;&#x6765;&#x8BC6;&#x522B;&#x56FE;&#x7247;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#x662F;&#x4E2A;&#x975E;&#x5E38;&#x6709;&#x7528;&#x7684;&#x7B97;&#x6CD5;&#x3002;&#x4E0B;&#x8282;&#x8BFE;&#xFF0C;&#x6211;&#x60F3;&#x548C;&#x5927;&#x5BB6;&#x5206;&#x4EAB;&#x53E6;&#x4E00;&#x79CD;&#x601D;&#x8DEF;&#xFF0C;&#x5C31;&#x662F;&#x628A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8F93;&#x51FA;&#x7684;&#x5B9E;&#x6570;&#x96C6;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x56DE;&#x5F52;&#x4EFB;&#x52A1;&#xFF0C;&#x8FD9;&#x4E2A;&#x601D;&#x60F3;&#x4E5F;&#x88AB;&#x5E94;&#x7528;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x7684;&#x5176;&#x5B83;&#x9886;&#x57DF;&#xFF0C;&#x4E5F;&#x662F;&#x975E;&#x5E38;&#x6709;&#x6548;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x4E0B;&#x8282;&#x8BFE;&#x89C1;&#x3002;</p>
<h3 id="32-&#x7279;&#x5F81;&#x70B9;&#x68C0;&#x6D4B;&#xFF08;landmark-detection&#xFF09;">3.2 &#x7279;&#x5F81;&#x70B9;&#x68C0;&#x6D4B;&#xFF08;Landmark detection&#xFF09;</h3>
<p>&#x4E0A;&#x8282;&#x8BFE;&#xFF0C;&#x6211;&#x4EEC;&#x8BB2;&#x4E86;&#x5982;&#x4F55;&#x5229;&#x7528;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8FDB;&#x884C;&#x5BF9;&#x8C61;&#x5B9A;&#x4F4D;&#xFF0C;&#x5373;&#x901A;&#x8FC7;&#x8F93;&#x51FA;&#x56DB;&#x4E2A;&#x53C2;&#x6570;&#x503C;$b<em>{x}$&#x3001;$b</em>{y}$&#x3001;$b<em>{h}$&#x548C;$b</em>{w}$&#x7ED9;&#x51FA;&#x56FE;&#x7247;&#x4E2D;&#x5BF9;&#x8C61;&#x7684;&#x8FB9;&#x754C;&#x6846;&#x3002;&#x66F4;&#x6982;&#x62EC;&#x5730;&#x8BF4;&#xFF0C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8F93;&#x51FA;&#x56FE;&#x7247;&#x4E0A;&#x7279;&#x5F81;&#x70B9;&#x7684;$(x,y)$&#x5750;&#x6807;&#x6765;&#x5B9E;&#x73B0;&#x5BF9;&#x76EE;&#x6807;&#x7279;&#x5F81;&#x7684;&#x8BC6;&#x522B;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x51E0;&#x4E2A;&#x4F8B;&#x5B50;&#x3002;</p>
<p><img src="../images/623baa12a417a4ffe6d1de210974cabc.png" alt=""></p>
<p>&#x5047;&#x8BBE;&#x4F60;&#x6B63;&#x5728;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x5E94;&#x7528;&#xFF0C;&#x51FA;&#x4E8E;&#x67D0;&#x79CD;&#x539F;&#x56E0;&#xFF0C;&#x4F60;&#x5E0C;&#x671B;&#x7B97;&#x6CD5;&#x53EF;&#x4EE5;&#x7ED9;&#x51FA;&#x773C;&#x89D2;&#x7684;&#x5177;&#x4F53;&#x4F4D;&#x7F6E;&#x3002;&#x773C;&#x89D2;&#x5750;&#x6807;&#x4E3A;$(x,y)$&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8BA9;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x6700;&#x540E;&#x4E00;&#x5C42;&#x591A;&#x8F93;&#x51FA;&#x4E24;&#x4E2A;&#x6570;&#x5B57;$l<em>{x}$&#x548C;$l</em>{y}$&#xFF0C;&#x4F5C;&#x4E3A;&#x773C;&#x89D2;&#x7684;&#x5750;&#x6807;&#x503C;&#x3002;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x77E5;&#x9053;&#x4E24;&#x53EA;&#x773C;&#x775B;&#x7684;&#x56DB;&#x4E2A;&#x773C;&#x89D2;&#x7684;&#x5177;&#x4F53;&#x4F4D;&#x7F6E;&#xFF0C;&#x90A3;&#x4E48;&#x4ECE;&#x5DE6;&#x5230;&#x53F3;&#xFF0C;&#x4F9D;&#x6B21;&#x7528;&#x56DB;&#x4E2A;&#x7279;&#x5F81;&#x70B9;&#x6765;&#x8868;&#x793A;&#x8FD9;&#x56DB;&#x4E2A;&#x773C;&#x89D2;&#x3002;&#x5BF9;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7A0D;&#x505A;&#x4E9B;&#x4FEE;&#x6539;&#xFF0C;&#x8F93;&#x51FA;&#x7B2C;&#x4E00;&#x4E2A;&#x7279;&#x5F81;&#x70B9;&#xFF08;$l<em>{1x}$&#xFF0C;$l</em>{1y}$&#xFF09;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x7279;&#x5F81;&#x70B9;&#xFF08;$l<em>{2x}$&#xFF0C;$l</em>{2y}$&#xFF09;&#xFF0C;&#x4F9D;&#x6B64;&#x7C7B;&#x63A8;&#xFF0C;&#x8FD9;&#x56DB;&#x4E2A;&#x8138;&#x90E8;&#x7279;&#x5F81;&#x70B9;&#x7684;&#x4F4D;&#x7F6E;&#x5C31;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8F93;&#x51FA;&#x4E86;&#x3002;</p>
<p><img src="../images/100b265aefc4b0170fb39ed339e5181a.png" alt=""></p>
<p>&#x4E5F;&#x8BB8;&#x9664;&#x4E86;&#x8FD9;&#x56DB;&#x4E2A;&#x7279;&#x5F81;&#x70B9;&#xFF0C;&#x4F60;&#x8FD8;&#x60F3;&#x5F97;&#x5230;&#x66F4;&#x591A;&#x7684;&#x7279;&#x5F81;&#x70B9;&#x8F93;&#x51FA;&#x503C;&#xFF0C;&#x8FD9;&#x4E9B;&#xFF08;&#x56FE;&#x4E2D;&#x773C;&#x7736;&#x4E0A;&#x7684;&#x7EA2;&#x8272;&#x7279;&#x5F81;&#x70B9;&#xFF09;&#x90FD;&#x662F;&#x773C;&#x775B;&#x7684;&#x7279;&#x5F81;&#x70B9;&#xFF0C;&#x4F60;&#x8FD8;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x5634;&#x90E8;&#x7684;&#x5173;&#x952E;&#x70B9;&#x8F93;&#x51FA;&#x503C;&#x6765;&#x786E;&#x5B9A;&#x5634;&#x7684;&#x5F62;&#x72B6;&#xFF0C;&#x4ECE;&#x800C;&#x5224;&#x65AD;&#x4EBA;&#x7269;&#x662F;&#x5728;&#x5FAE;&#x7B11;&#x8FD8;&#x662F;&#x76B1;&#x7709;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x63D0;&#x53D6;&#x9F3B;&#x5B50;&#x5468;&#x56F4;&#x7684;&#x5173;&#x952E;&#x7279;&#x5F81;&#x70B9;&#x3002;&#x4E3A;&#x4E86;&#x4FBF;&#x4E8E;&#x8BF4;&#x660E;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8BBE;&#x5B9A;&#x7279;&#x5F81;&#x70B9;&#x7684;&#x4E2A;&#x6570;&#xFF0C;&#x5047;&#x8BBE;&#x8138;&#x90E8;&#x6709;64&#x4E2A;&#x7279;&#x5F81;&#x70B9;&#xFF0C;&#x6709;&#x4E9B;&#x70B9;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x4F60;&#x5B9A;&#x4E49;&#x8138;&#x90E8;&#x8F6E;&#x5ED3;&#x6216;&#x4E0B;&#x988C;&#x8F6E;&#x5ED3;&#x3002;&#x9009;&#x5B9A;&#x7279;&#x5F81;&#x70B9;&#x4E2A;&#x6570;&#xFF0C;&#x5E76;&#x751F;&#x6210;&#x5305;&#x542B;&#x8FD9;&#x4E9B;&#x7279;&#x5F81;&#x70B9;&#x7684;&#x6807;&#x7B7E;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x7136;&#x540E;&#x5229;&#x7528;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8F93;&#x51FA;&#x8138;&#x90E8;&#x5173;&#x952E;&#x7279;&#x5F81;&#x70B9;&#x7684;&#x4F4D;&#x7F6E;&#x3002;</p>
<p>&#x5177;&#x4F53;&#x505A;&#x6CD5;&#x662F;&#xFF0C;&#x51C6;&#x5907;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x548C;&#x4E00;&#x4E9B;&#x7279;&#x5F81;&#x96C6;&#xFF0C;&#x5C06;&#x4EBA;&#x8138;&#x56FE;&#x7247;&#x8F93;&#x5165;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#xFF0C;&#x8F93;&#x51FA;1&#x6216;0&#xFF0C;1&#x8868;&#x793A;&#x6709;&#x4EBA;&#x8138;&#xFF0C;0&#x8868;&#x793A;&#x6CA1;&#x6709;&#x4EBA;&#x8138;&#xFF0C;&#x7136;&#x540E;&#x8F93;&#x51FA;&#xFF08;$l<em>{1x}$&#xFF0C;$l</em>{1y}$&#xFF09;&#x2026;&#x2026;&#x76F4;&#x5230;&#xFF08;$l<em>{64x}$&#xFF0C;$l</em>{64y}$&#xFF09;&#x3002;&#x8FD9;&#x91CC;&#x6211;&#x7528;$l$&#x4EE3;&#x8868;&#x4E00;&#x4E2A;&#x7279;&#x5F81;&#xFF0C;&#x8FD9;&#x91CC;&#x6709;129&#x4E2A;&#x8F93;&#x51FA;&#x5355;&#x5143;&#xFF0C;&#x5176;&#x4E2D;1&#x8868;&#x793A;&#x56FE;&#x7247;&#x4E2D;&#x6709;&#x4EBA;&#x8138;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;64&#x4E2A;&#x7279;&#x5F81;&#xFF0C;64&#xD7;2=128&#xFF0C;&#x6240;&#x4EE5;&#x6700;&#x7EC8;&#x8F93;&#x51FA;128+1=129&#x4E2A;&#x5355;&#x5143;&#xFF0C;&#x7531;&#x6B64;&#x5B9E;&#x73B0;&#x5BF9;&#x56FE;&#x7247;&#x7684;&#x4EBA;&#x8138;&#x68C0;&#x6D4B;&#x548C;&#x5B9A;&#x4F4D;&#x3002;&#x8FD9;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x8BC6;&#x522B;&#x8138;&#x90E8;&#x8868;&#x60C5;&#x7684;&#x57FA;&#x672C;&#x6784;&#x9020;&#x6A21;&#x5757;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x73A9;&#x8FC7;<strong>Snapchat</strong>&#x6216;&#x5176;&#x5B83;&#x5A31;&#x4E50;&#x7C7B;&#x5E94;&#x7528;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x5BF9;<strong>AR</strong>&#xFF08;&#x589E;&#x5F3A;&#x73B0;&#x5B9E;&#xFF09;&#x8FC7;&#x6EE4;&#x5668;&#x591A;&#x5C11;&#x6709;&#x4E9B;&#x4E86;&#x89E3;&#xFF0C;<strong>Snapchat</strong>&#x8FC7;&#x6EE4;&#x5668;&#x5B9E;&#x73B0;&#x4E86;&#x5728;&#x8138;&#x4E0A;&#x753B;&#x7687;&#x51A0;&#x548C;&#x5176;&#x4ED6;&#x4E00;&#x4E9B;&#x7279;&#x6B8A;&#x6548;&#x679C;&#x3002;&#x68C0;&#x6D4B;&#x8138;&#x90E8;&#x7279;&#x5F81;&#x4E5F;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x56FE;&#x5F62;&#x6548;&#x679C;&#x7684;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x6784;&#x9020;&#x6A21;&#x5757;&#xFF0C;&#x6BD4;&#x5982;&#x5B9E;&#x73B0;&#x8138;&#x90E8;&#x626D;&#x66F2;&#xFF0C;&#x5934;&#x6234;&#x7687;&#x51A0;&#x7B49;&#x7B49;&#x3002;&#x5F53;&#x7136;&#x4E3A;&#x4E86;&#x6784;&#x5EFA;&#x8FD9;&#x6837;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x51C6;&#x5907;&#x4E00;&#x4E2A;&#x6807;&#x7B7E;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x56FE;&#x7247;$x$&#x548C;&#x6807;&#x7B7E;$y$&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x8FD9;&#x4E9B;&#x70B9;&#x90FD;&#x662F;&#x4EBA;&#x4E3A;&#x8F9B;&#x82E6;&#x6807;&#x6CE8;&#x7684;&#x3002;</p>
<p><img src="../images/fb7fffc14dc60f98003a8ce20f527ab8.png" alt=""></p>
<p>&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x4EBA;&#x4F53;&#x59FF;&#x6001;&#x68C0;&#x6D4B;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x4F60;&#x8FD8;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x4E00;&#x4E9B;&#x5173;&#x952E;&#x7279;&#x5F81;&#x70B9;&#xFF0C;&#x5982;&#x80F8;&#x90E8;&#x7684;&#x4E2D;&#x70B9;&#xFF0C;&#x5DE6;&#x80A9;&#xFF0C;&#x5DE6;&#x8098;&#xFF0C;&#x8170;&#x7B49;&#x7B49;&#x3002;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6807;&#x6CE8;&#x4EBA;&#x7269;&#x59FF;&#x6001;&#x7684;&#x5173;&#x952E;&#x7279;&#x5F81;&#x70B9;&#xFF0C;&#x518D;&#x8F93;&#x51FA;&#x8FD9;&#x4E9B;&#x6807;&#x6CE8;&#x8FC7;&#x7684;&#x7279;&#x5F81;&#x70B9;&#xFF0C;&#x5C31;&#x76F8;&#x5F53;&#x4E8E;&#x8F93;&#x51FA;&#x4E86;&#x4EBA;&#x7269;&#x7684;&#x59FF;&#x6001;&#x52A8;&#x4F5C;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x8981;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x8BBE;&#x5B9A;&#x8FD9;&#x4E9B;&#x5173;&#x952E;&#x7279;&#x5F81;&#x70B9;&#xFF0C;&#x4ECE;&#x80F8;&#x90E8;&#x4E2D;&#x5FC3;&#x70B9;($l<em>{1x}$&#xFF0C;$l</em>{1y}$)&#x4E00;&#x76F4;&#x5F80;&#x4E0B;&#xFF0C;&#x76F4;&#x5230;($l<em>{32x}$&#xFF0C;$l</em>{32y}$)&#x3002;</p>
<p>&#x4E00;&#x65E6;&#x4E86;&#x89E3;&#x5982;&#x4F55;&#x7528;&#x4E8C;&#x7EF4;&#x5750;&#x6807;&#x7CFB;&#x5B9A;&#x4E49;&#x4EBA;&#x7269;&#x59FF;&#x6001;&#xFF0C;&#x64CD;&#x4F5C;&#x8D77;&#x6765;&#x5C31;&#x76F8;&#x5F53;&#x7B80;&#x5355;&#x4E86;&#xFF0C;&#x6279;&#x91CF;&#x6DFB;&#x52A0;&#x8F93;&#x51FA;&#x5355;&#x5143;&#xFF0C;&#x7528;&#x4EE5;&#x8F93;&#x51FA;&#x8981;&#x8BC6;&#x522B;&#x7684;&#x5404;&#x4E2A;&#x7279;&#x5F81;&#x70B9;&#x7684;$(x,y)$&#x5750;&#x6807;&#x503C;&#x3002;&#x8981;&#x660E;&#x786E;&#x4E00;&#x70B9;&#xFF0C;&#x7279;&#x5F81;&#x70B9;1&#x7684;&#x7279;&#x6027;&#x5728;&#x6240;&#x6709;&#x56FE;&#x7247;&#x4E2D;&#x5FC5;&#x987B;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#xFF0C;&#x5C31;&#x597D;&#x6BD4;&#xFF0C;&#x7279;&#x5F81;&#x70B9;1&#x59CB;&#x7EC8;&#x662F;&#x53F3;&#x773C;&#x7684;&#x5916;&#x773C;&#x89D2;&#xFF0C;&#x7279;&#x5F81;&#x70B9;2&#x662F;&#x53F3;&#x773C;&#x7684;&#x5185;&#x773C;&#x89D2;&#xFF0C;&#x7279;&#x5F81;&#x70B9;3&#x662F;&#x5DE6;&#x773C;&#x5185;&#x773C;&#x89D2;&#xFF0C;&#x7279;&#x5F81;&#x70B9;4&#x662F;&#x5DE6;&#x773C;&#x5916;&#x773C;&#x89D2;&#x7B49;&#x7B49;&#x3002;&#x6240;&#x4EE5;&#x6807;&#x7B7E;&#x5728;&#x6240;&#x6709;&#x56FE;&#x7247;&#x4E2D;&#x5FC5;&#x987B;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#xFF0C;&#x5047;&#x5982;&#x4F60;&#x96C7;&#x7528;&#x4ED6;&#x4EBA;&#x6216;&#x81EA;&#x5DF1;&#x6807;&#x8BB0;&#x4E86;&#x4E00;&#x4E2A;&#x8DB3;&#x591F;&#x5927;&#x7684;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x90A3;&#x4E48;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4FBF;&#x53EF;&#x4EE5;&#x8F93;&#x51FA;&#x4E0A;&#x8FF0;&#x6240;&#x6709;&#x7279;&#x5F81;&#x70B9;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x5B83;&#x4EEC;&#x5B9E;&#x73B0;&#x5176;&#x4ED6;&#x6709;&#x8DA3;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x6BD4;&#x5982;&#x5224;&#x65AD;&#x4EBA;&#x7269;&#x7684;&#x52A8;&#x4F5C;&#x59FF;&#x6001;&#xFF0C;&#x8BC6;&#x522B;&#x56FE;&#x7247;&#x4E2D;&#x7684;&#x4EBA;&#x7269;&#x8868;&#x60C5;&#x7B49;&#x7B49;&#x3002;</p>
<p>&#x4EE5;&#x4E0A;&#x5C31;&#x662F;&#x7279;&#x5F81;&#x70B9;&#x68C0;&#x6D4B;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x4E0B;&#x8282;&#x8BFE;&#x6211;&#x4EEC;&#x5C06;&#x5229;&#x7528;&#x8FD9;&#x4E9B;&#x6784;&#x9020;&#x6A21;&#x5757;&#x6765;&#x6784;&#x5EFA;&#x5BF9;&#x8C61;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;&#x3002;</p>
<h3 id="33-&#x76EE;&#x6807;&#x68C0;&#x6D4B;&#xFF08;object-detection&#xFF09;">3.3 &#x76EE;&#x6807;&#x68C0;&#x6D4B;&#xFF08;Object detection&#xFF09;</h3>
<p>&#x5B66;&#x8FC7;&#x4E86;&#x5BF9;&#x8C61;&#x5B9A;&#x4F4D;&#x548C;&#x7279;&#x5F81;&#x70B9;&#x68C0;&#x6D4B;&#xFF0C;&#x4ECA;&#x5929;&#x6211;&#x4EEC;&#x6765;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;&#x3002;&#x8FD9;&#x8282;&#x8BFE;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x901A;&#x8FC7;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x8FDB;&#x884C;&#x5BF9;&#x8C61;&#x68C0;&#x6D4B;&#xFF0C;&#x91C7;&#x7528;&#x7684;&#x662F;&#x57FA;&#x4E8E;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x7684;&#x76EE;&#x6807;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;&#x3002;</p>
<p><img src="../images/2f4e567978bb62fcbec093887de37783.png" alt=""></p>
<p>&#x5047;&#x5982;&#x4F60;&#x60F3;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x6C7D;&#x8F66;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;&#xFF0C;&#x6B65;&#x9AA4;&#x662F;&#xFF0C;&#x9996;&#x5148;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6807;&#x7B7E;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;$x$&#x548C;$y$&#x8868;&#x793A;&#x9002;&#x5F53;&#x526A;&#x5207;&#x7684;&#x6C7D;&#x8F66;&#x56FE;&#x7247;&#x6837;&#x672C;&#xFF0C;&#x8FD9;&#x5F20;&#x56FE;&#x7247;&#xFF08;&#x7F16;&#x53F7;1&#xFF09;$x$&#x662F;&#x4E00;&#x4E2A;&#x6B63;&#x6837;&#x672C;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x662F;&#x4E00;&#x8F86;&#x6C7D;&#x8F66;&#x56FE;&#x7247;&#xFF0C;&#x8FD9;&#x51E0;&#x5F20;&#x56FE;&#x7247;&#xFF08;&#x7F16;&#x53F7;2&#x3001;3&#xFF09;&#x4E5F;&#x6709;&#x6C7D;&#x8F66;&#xFF0C;&#x4F46;&#x8FD9;&#x4E24;&#x5F20;&#xFF08;&#x7F16;&#x53F7;4&#x3001;5&#xFF09;&#x6CA1;&#x6709;&#x6C7D;&#x8F66;&#x3002;&#x51FA;&#x4E8E;&#x6211;&#x4EEC;&#x5BF9;&#x8FD9;&#x4E2A;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x671F;&#x671B;&#xFF0C;&#x4F60;&#x4E00;&#x5F00;&#x59CB;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x9002;&#x5F53;&#x526A;&#x5207;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x5C31;&#x662F;&#x6574;&#x5F20;&#x56FE;&#x7247;$x$&#x51E0;&#x4E4E;&#x90FD;&#x88AB;&#x6C7D;&#x8F66;&#x5360;&#x636E;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x7167;&#x5F20;&#x7167;&#x7247;&#xFF0C;&#x7136;&#x540E;&#x526A;&#x5207;&#xFF0C;&#x526A;&#x6389;&#x6C7D;&#x8F66;&#x4EE5;&#x5916;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x4F7F;&#x6C7D;&#x8F66;&#x5C45;&#x4E8E;&#x4E2D;&#x95F4;&#x4F4D;&#x7F6E;&#xFF0C;&#x5E76;&#x57FA;&#x672C;&#x5360;&#x636E;&#x6574;&#x5F20;&#x56FE;&#x7247;&#x3002;&#x6709;&#x4E86;&#x8FD9;&#x4E2A;&#x6807;&#x7B7E;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x8BAD;&#x7EC3;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x4E86;&#xFF0C;&#x8F93;&#x5165;&#x8FD9;&#x4E9B;&#x9002;&#x5F53;&#x526A;&#x5207;&#x8FC7;&#x7684;&#x56FE;&#x7247;&#xFF08;&#x7F16;&#x53F7;6&#xFF09;&#xFF0C;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x8F93;&#x51FA;$y$&#xFF0C;0&#x6216;1&#x8868;&#x793A;&#x56FE;&#x7247;&#x4E2D;&#x6709;&#x6C7D;&#x8F66;&#x6216;&#x6CA1;&#x6709;&#x6C7D;&#x8F66;&#x3002;&#x8BAD;&#x7EC3;&#x5B8C;&#x8FD9;&#x4E2A;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x7528;&#x5B83;&#x6765;&#x5B9E;&#x73B0;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x76EE;&#x6807;&#x68C0;&#x6D4B;&#xFF0C;&#x5177;&#x4F53;&#x6B65;&#x9AA4;&#x5982;&#x4E0B;&#x3002;</p>
<p><img src="../images/2ac2ab6dcdcc0fe26a9833ff9da49bd2.png" alt=""></p>
<p>&#x5047;&#x8BBE;&#x8FD9;&#x662F;&#x4E00;&#x5F20;&#x6D4B;&#x8BD5;&#x56FE;&#x7247;&#xFF0C;&#x9996;&#x5148;&#x9009;&#x5B9A;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x5927;&#x5C0F;&#x7684;&#x7A97;&#x53E3;&#xFF0C;&#x6BD4;&#x5982;&#x56FE;&#x7247;&#x4E0B;&#x65B9;&#x8FD9;&#x4E2A;&#x7A97;&#x53E3;&#xFF0C;&#x5C06;&#x8FD9;&#x4E2A;&#x7EA2;&#x8272;&#x5C0F;&#x65B9;&#x5757;&#x8F93;&#x5165;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x5F00;&#x59CB;&#x8FDB;&#x884C;&#x9884;&#x6D4B;&#xFF0C;&#x5373;&#x5224;&#x65AD;&#x7EA2;&#x8272;&#x65B9;&#x6846;&#x5185;&#x6709;&#x6CA1;&#x6709;&#x6C7D;&#x8F66;&#x3002;</p>
<p><img src="../images/c55f22f302899d5f9d77bef958465660.png" alt=""></p>
<p>&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x76EE;&#x6807;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;&#x63A5;&#x4E0B;&#x6765;&#x4F1A;&#x7EE7;&#x7EED;&#x5904;&#x7406;&#x7B2C;&#x4E8C;&#x4E2A;&#x56FE;&#x50CF;&#xFF0C;&#x5373;&#x7EA2;&#x8272;&#x65B9;&#x6846;&#x7A0D;&#x5411;&#x53F3;&#x6ED1;&#x52A8;&#x4E4B;&#x540E;&#x7684;&#x533A;&#x57DF;&#xFF0C;&#x5E76;&#x8F93;&#x5165;&#x7ED9;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#xFF0C;&#x56E0;&#x6B64;&#x8F93;&#x5165;&#x7ED9;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x7684;&#x53EA;&#x6709;&#x7EA2;&#x8272;&#x65B9;&#x6846;&#x5185;&#x7684;&#x533A;&#x57DF;&#xFF0C;&#x518D;&#x6B21;&#x8FD0;&#x884C;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#xFF0C;&#x7136;&#x540E;&#x5904;&#x7406;&#x7B2C;&#x4E09;&#x4E2A;&#x56FE;&#x50CF;&#xFF0C;&#x4F9D;&#x6B21;&#x91CD;&#x590D;&#x64CD;&#x4F5C;&#xFF0C;&#x76F4;&#x5230;&#x8FD9;&#x4E2A;&#x7A97;&#x53E3;&#x6ED1;&#x8FC7;&#x56FE;&#x50CF;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x89D2;&#x843D;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x6ED1;&#x52A8;&#x5F97;&#x66F4;&#x5FEB;&#xFF0C;&#x6211;&#x8FD9;&#x91CC;&#x9009;&#x7528;&#x7684;&#x6B65;&#x5E45;&#x6BD4;&#x8F83;&#x5927;&#xFF0C;&#x601D;&#x8DEF;&#x662F;&#x4EE5;&#x56FA;&#x5B9A;&#x6B65;&#x5E45;&#x79FB;&#x52A8;&#x7A97;&#x53E3;&#xFF0C;&#x904D;&#x5386;&#x56FE;&#x50CF;&#x7684;&#x6BCF;&#x4E2A;&#x533A;&#x57DF;&#xFF0C;&#x628A;&#x8FD9;&#x4E9B;&#x526A;&#x5207;&#x540E;&#x7684;&#x5C0F;&#x56FE;&#x50CF;&#x8F93;&#x5165;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#xFF0C;&#x5BF9;&#x6BCF;&#x4E2A;&#x4F4D;&#x7F6E;&#x6309;0&#x6216;1&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684;&#x56FE;&#x50CF;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x64CD;&#x4F5C;&#x3002;</p>
<p><img src="../images/34507c03fbda16049faeb3caf075fe50.png" alt=""></p>
<p>&#x91CD;&#x590D;&#x4E0A;&#x8FF0;&#x64CD;&#x4F5C;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD9;&#x6B21;&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x7684;&#x7A97;&#x53E3;&#xFF0C;&#x622A;&#x53D6;&#x66F4;&#x5927;&#x7684;&#x533A;&#x57DF;&#xFF0C;&#x5E76;&#x8F93;&#x5165;&#x7ED9;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5904;&#x7406;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x5BF9;&#x8F93;&#x5165;&#x5927;&#x5C0F;&#x8C03;&#x6574;&#x8FD9;&#x4E2A;&#x533A;&#x57DF;&#xFF0C;&#x7136;&#x540E;&#x8F93;&#x5165;&#x7ED9;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#xFF0C;&#x8F93;&#x51FA;0&#x6216;1&#x3002;</p>
<p><img src="../images/f2b6d5bfedc5298160bc2628544e315c.png" alt=""></p>
<p>&#x518D;&#x4EE5;&#x67D0;&#x4E2A;&#x56FA;&#x5B9A;&#x6B65;&#x5E45;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#xFF0C;&#x91CD;&#x590D;&#x4EE5;&#x4E0A;&#x64CD;&#x4F5C;&#xFF0C;&#x904D;&#x5386;&#x6574;&#x4E2A;&#x56FE;&#x50CF;&#xFF0C;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x3002;</p>
<p><img src="../images/c14524aa0534ed78c433e1cd0a8dff50.png" alt=""></p>
<p>&#x7136;&#x540E;&#x7B2C;&#x4E09;&#x6B21;&#x91CD;&#x590D;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD9;&#x6B21;&#x9009;&#x7528;&#x66F4;&#x5927;&#x7684;&#x7A97;&#x53E3;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x8FD9;&#x6837;&#x505A;&#xFF0C;&#x4E0D;&#x8BBA;&#x6C7D;&#x8F66;&#x5728;&#x56FE;&#x7247;&#x7684;&#x4EC0;&#x4E48;&#x4F4D;&#x7F6E;&#xFF0C;&#x603B;&#x6709;&#x4E00;&#x4E2A;&#x7A97;&#x53E3;&#x53EF;&#x4EE5;&#x68C0;&#x6D4B;&#x5230;&#x5B83;&#x3002;</p>
<p><img src="../images/ef8afff4e50fc1c50a46b8443f1d6976.png" alt=""></p>
<p>&#x6BD4;&#x5982;&#xFF0C;&#x5C06;&#x8FD9;&#x4E2A;&#x7A97;&#x53E3;&#xFF08;&#x7F16;&#x53F7;1&#xFF09;&#x8F93;&#x5165;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#xFF0C;&#x5E0C;&#x671B;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x5BF9;&#x8BE5;&#x8F93;&#x5165;&#x533A;&#x57DF;&#x7684;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x4E3A;1&#xFF0C;&#x8BF4;&#x660E;&#x7F51;&#x7EDC;&#x68C0;&#x6D4B;&#x5230;&#x56FE;&#x4E0A;&#x6709;&#x8F86;&#x8F66;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x7B97;&#x6CD5;&#x53EB;&#x4F5C;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x76EE;&#x6807;&#x68C0;&#x6D4B;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x4EE5;&#x67D0;&#x4E2A;&#x6B65;&#x5E45;&#x6ED1;&#x52A8;&#x8FD9;&#x4E9B;&#x65B9;&#x6846;&#x7A97;&#x53E3;&#x904D;&#x5386;&#x6574;&#x5F20;&#x56FE;&#x7247;&#xFF0C;&#x5BF9;&#x8FD9;&#x4E9B;&#x65B9;&#x5F62;&#x533A;&#x57DF;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#xFF0C;&#x5224;&#x65AD;&#x91CC;&#x9762;&#x6709;&#x6CA1;&#x6709;&#x6C7D;&#x8F66;&#x3002;</p>
<p>&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x76EE;&#x6807;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;&#x4E5F;&#x6709;&#x5F88;&#x660E;&#x663E;&#x7684;&#x7F3A;&#x70B9;&#xFF0C;&#x5C31;&#x662F;&#x8BA1;&#x7B97;&#x6210;&#x672C;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x5728;&#x56FE;&#x7247;&#x4E2D;&#x526A;&#x5207;&#x51FA;&#x592A;&#x591A;&#x5C0F;&#x65B9;&#x5757;&#xFF0C;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x8981;&#x4E00;&#x4E2A;&#x4E2A;&#x5730;&#x5904;&#x7406;&#x3002;&#x5982;&#x679C;&#x4F60;&#x9009;&#x7528;&#x7684;&#x6B65;&#x5E45;&#x5F88;&#x5927;&#xFF0C;&#x663E;&#x7136;&#x4F1A;&#x51CF;&#x5C11;&#x8F93;&#x5165;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x7684;&#x7A97;&#x53E3;&#x4E2A;&#x6570;&#xFF0C;&#x4F46;&#x662F;&#x7C97;&#x7CD9;&#x95F4;&#x9694;&#x5C3A;&#x5BF8;&#x53EF;&#x80FD;&#x4F1A;&#x5F71;&#x54CD;&#x6027;&#x80FD;&#x3002;&#x53CD;&#x4E4B;&#xFF0C;&#x5982;&#x679C;&#x91C7;&#x7528;&#x5C0F;&#x7C92;&#x5EA6;&#x6216;&#x5C0F;&#x6B65;&#x5E45;&#xFF0C;&#x4F20;&#x9012;&#x7ED9;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x7684;&#x5C0F;&#x7A97;&#x53E3;&#x4F1A;&#x7279;&#x522B;&#x591A;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x8D85;&#x9AD8;&#x7684;&#x8BA1;&#x7B97;&#x6210;&#x672C;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x5728;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5174;&#x8D77;&#x4E4B;&#x524D;&#xFF0C;&#x4EBA;&#x4EEC;&#x901A;&#x5E38;&#x91C7;&#x7528;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x5206;&#x7C7B;&#x5668;&#x8FDB;&#x884C;&#x5BF9;&#x8C61;&#x68C0;&#x6D4B;&#xFF0C;&#x6BD4;&#x5982;&#x901A;&#x8FC7;&#x91C7;&#x7528;&#x624B;&#x5DE5;&#x5904;&#x7406;&#x5DE5;&#x7A0B;&#x7279;&#x5F81;&#x7684;&#x7B80;&#x5355;&#x7684;&#x7EBF;&#x6027;&#x5206;&#x7C7B;&#x5668;&#x6765;&#x6267;&#x884C;&#x5BF9;&#x8C61;&#x68C0;&#x6D4B;&#x3002;&#x81F3;&#x4E8E;&#x8BEF;&#x5DEE;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x4E2A;&#x5206;&#x7C7B;&#x5668;&#x7684;&#x8BA1;&#x7B97;&#x6210;&#x672C;&#x90FD;&#x5F88;&#x4F4E;&#xFF0C;&#x5B83;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x7EBF;&#x6027;&#x51FD;&#x6570;&#xFF0C;&#x6240;&#x4EE5;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x76EE;&#x6807;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;&#x8868;&#x73B0;&#x826F;&#x597D;&#xFF0C;&#x662F;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x7B97;&#x6CD5;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x8FD0;&#x884C;&#x5355;&#x4E2A;&#x5206;&#x7C7B;&#x4EBA;&#x7269;&#x7684;&#x6210;&#x672C;&#x5374;&#x9AD8;&#x5F97;&#x591A;&#xFF0C;&#x50CF;&#x8FD9;&#x6837;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x592A;&#x6162;&#x3002;&#x9664;&#x975E;&#x91C7;&#x7528;&#x8D85;&#x7EC6;&#x7C92;&#x5EA6;&#x6216;&#x6781;&#x5C0F;&#x6B65;&#x5E45;&#xFF0C;&#x5426;&#x5219;&#x65E0;&#x6CD5;&#x51C6;&#x786E;&#x5B9A;&#x4F4D;&#x56FE;&#x7247;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#x3002;</p>
<p>&#x4E0D;&#x8FC7;&#xFF0C;&#x5E86;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x8BA1;&#x7B97;&#x6210;&#x672C;&#x95EE;&#x9898;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x5F88;&#x597D;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x5927;&#x5927;&#x63D0;&#x9AD8;&#x4E86;&#x5377;&#x79EF;&#x5C42;&#x4E0A;&#x5E94;&#x7528;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x76EE;&#x6807;&#x68C0;&#x6D4B;&#x5668;&#x7684;&#x6548;&#x7387;&#xFF0C;&#x5173;&#x4E8E;&#x5B83;&#x7684;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#xFF0C;&#x6211;&#x4EEC;&#x4E0B;&#x8282;&#x8BFE;&#x518D;&#x8BB2;&#x3002;</p>
<h3 id="34-&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x7684;&#x5377;&#x79EF;&#x5B9E;&#x73B0;&#xFF08;convolutional-implementation-of-sliding-windows&#xFF09;">3.4 &#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x7684;&#x5377;&#x79EF;&#x5B9E;&#x73B0;&#xFF08;Convolutional implementation of sliding windows&#xFF09;</h3>
<p>&#x4E0A;&#x8282;&#x8BFE;&#xFF0C;&#x6211;&#x4EEC;&#x5B66;&#x4E60;&#x4E86;&#x5982;&#x4F55;&#x901A;&#x8FC7;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x5B9E;&#x73B0;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x5BF9;&#x8C61;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;&#xFF0C;&#x4F46;&#x6548;&#x7387;&#x5F88;&#x4F4E;&#x3002;&#x8FD9;&#x8282;&#x8BFE;&#x6211;&#x4EEC;&#x8BB2;&#x8BB2;&#x5982;&#x4F55;&#x5728;&#x5377;&#x79EF;&#x5C42;&#x4E0A;&#x5E94;&#x7528;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x6784;&#x5EFA;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x7684;&#x5377;&#x79EF;&#x5E94;&#x7528;&#xFF0C;&#x9996;&#x5148;&#x8981;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x628A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x8F6C;&#x5316;&#x6210;&#x5377;&#x79EF;&#x5C42;&#x3002;&#x6211;&#x4EEC;&#x5148;&#x8BB2;&#x89E3;&#x8FD9;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#xFF0C;&#x4E0B;&#x4E00;&#x5F20;&#x5E7B;&#x706F;&#x7247;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x6309;&#x7167;&#x8FD9;&#x4E2A;&#x601D;&#x8DEF;&#x6765;&#x6F14;&#x793A;&#x5377;&#x79EF;&#x7684;&#x5E94;&#x7528;&#x8FC7;&#x7A0B;&#x3002;</p>
<p><img src="../images/d17d151e534753cc6ba17a57a927deb9.png" alt=""></p>
<p>&#x5047;&#x8BBE;&#x5BF9;&#x8C61;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;&#x8F93;&#x5165;&#x4E00;&#x4E2A;14&#xD7;14&#xD7;3&#x7684;&#x56FE;&#x50CF;&#xFF0C;&#x56FE;&#x50CF;&#x5F88;&#x5C0F;&#xFF0C;&#x4E0D;&#x8FC7;&#x6F14;&#x793A;&#x8D77;&#x6765;&#x65B9;&#x4FBF;&#x3002;&#x5728;&#x8FD9;&#x91CC;&#x8FC7;&#x6EE4;&#x5668;&#x5927;&#x5C0F;&#x4E3A;5&#xD7;5&#xFF0C;&#x6570;&#x91CF;&#x662F;16&#xFF0C;14&#xD7;14&#xD7;3&#x7684;&#x56FE;&#x50CF;&#x5728;&#x8FC7;&#x6EE4;&#x5668;&#x5904;&#x7406;&#x4E4B;&#x540E;&#x6620;&#x5C04;&#x4E3A;10&#xD7;10&#xD7;16&#x3002;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x53C2;&#x6570;&#x4E3A;2&#xD7;2&#x7684;&#x6700;&#x5927;&#x6C60;&#x5316;&#x64CD;&#x4F5C;&#xFF0C;&#x56FE;&#x50CF;&#x51CF;&#x5C0F;&#x5230;5&#xD7;5&#xD7;16&#x3002;&#x7136;&#x540E;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x8FDE;&#x63A5;400&#x4E2A;&#x5355;&#x5143;&#x7684;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#xFF0C;&#x63A5;&#x7740;&#x518D;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#xFF0C;&#x6700;&#x540E;&#x901A;&#x8FC7;<strong>softmax</strong>&#x5355;&#x5143;&#x8F93;&#x51FA;$y$&#x3002;&#x4E3A;&#x4E86;&#x8DDF;&#x4E0B;&#x56FE;&#x533A;&#x5206;&#x5F00;&#xFF0C;&#x6211;&#x5148;&#x505A;&#x4E00;&#x70B9;&#x6539;&#x52A8;&#xFF0C;&#x7528;4&#x4E2A;&#x6570;&#x5B57;&#x6765;&#x8868;&#x793A;$y$&#xFF0C;&#x5B83;&#x4EEC;&#x5206;&#x522B;&#x5BF9;&#x5E94;<strong>softmax</strong>&#x5355;&#x5143;&#x6240;&#x8F93;&#x51FA;&#x7684;4&#x4E2A;&#x5206;&#x7C7B;&#x51FA;&#x73B0;&#x7684;&#x6982;&#x7387;&#x3002;&#x8FD9;4&#x4E2A;&#x5206;&#x7C7B;&#x53EF;&#x4EE5;&#x662F;&#x884C;&#x4EBA;&#x3001;&#x6C7D;&#x8F66;&#x3001;&#x6469;&#x6258;&#x8F66;&#x548C;&#x80CC;&#x666F;&#x6216;&#x5176;&#x5B83;&#x5BF9;&#x8C61;&#x3002;</p>
<p><img src="../images/38be387e37d131e44aff9d7fc9e3488a.png" alt=""></p>
<p>&#x73B0;&#x5728;&#x6211;&#x8981;&#x6F14;&#x793A;&#x7684;&#x5C31;&#x662F;&#x5982;&#x4F55;&#x628A;&#x8FD9;&#x4E9B;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x8F6C;&#x5316;&#x4E3A;&#x5377;&#x79EF;&#x5C42;&#xFF0C;&#x753B;&#x4E00;&#x4E2A;&#x8FD9;&#x6837;&#x7684;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#xFF0C;&#x5B83;&#x7684;&#x524D;&#x51E0;&#x5C42;&#x548C;&#x4E4B;&#x524D;&#x7684;&#x4E00;&#x6837;&#xFF0C;&#x800C;&#x5BF9;&#x4E8E;&#x4E0B;&#x4E00;&#x5C42;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;5&#xD7;5&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x6765;&#x5B9E;&#x73B0;&#xFF0C;&#x6570;&#x91CF;&#x662F;400&#x4E2A;&#xFF08;&#x7F16;&#x53F7;1&#x6240;&#x793A;&#xFF09;&#xFF0C;&#x8F93;&#x5165;&#x56FE;&#x50CF;&#x5927;&#x5C0F;&#x4E3A;5&#xD7;5&#xD7;16&#xFF0C;&#x7528;5&#xD7;5&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x5BF9;&#x5B83;&#x8FDB;&#x884C;&#x5377;&#x79EF;&#x64CD;&#x4F5C;&#xFF0C;&#x8FC7;&#x6EE4;&#x5668;&#x5B9E;&#x9645;&#x4E0A;&#x662F;5&#xD7;5&#xD7;16&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x5377;&#x79EF;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x8FC7;&#x6EE4;&#x5668;&#x4F1A;&#x904D;&#x5386;&#x8FD9;16&#x4E2A;&#x901A;&#x9053;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E24;&#x5904;&#x7684;&#x901A;&#x9053;&#x6570;&#x91CF;&#x5FC5;&#x987B;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#xFF0C;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x4E3A;1&#xD7;1&#x3002;&#x5047;&#x8BBE;&#x5E94;&#x7528;400&#x4E2A;&#x8FD9;&#x6837;&#x7684;5&#xD7;5&#xD7;16&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x8F93;&#x51FA;&#x7EF4;&#x5EA6;&#x5C31;&#x662F;1&#xD7;1&#xD7;400&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x518D;&#x628A;&#x5B83;&#x770B;&#x4F5C;&#x4E00;&#x4E2A;&#x542B;&#x6709;400&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x4E2A;1&#xD7;1&#xD7;400&#x7684;&#x8F93;&#x51FA;&#x5C42;&#x3002;&#x4ECE;&#x6570;&#x5B66;&#x89D2;&#x5EA6;&#x770B;&#xFF0C;&#x5B83;&#x548C;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;400&#x4E2A;&#x8282;&#x70B9;&#x4E2D;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x90FD;&#x6709;&#x4E00;&#x4E2A;5&#xD7;5&#xD7;16&#x7EF4;&#x5EA6;&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x6240;&#x4EE5;&#x6BCF;&#x4E2A;&#x503C;&#x90FD;&#x662F;&#x4E0A;&#x4E00;&#x5C42;&#x8FD9;&#x4E9B;5&#xD7;5&#xD7;16&#x6FC0;&#x6D3B;&#x503C;&#x7ECF;&#x8FC7;&#x67D0;&#x4E2A;&#x4EFB;&#x610F;&#x7EBF;&#x6027;&#x51FD;&#x6570;&#x7684;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x518D;&#x6DFB;&#x52A0;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#xFF08;&#x7F16;&#x53F7;2&#x6240;&#x793A;&#xFF09;&#xFF0C;&#x8FD9;&#x91CC;&#x7528;&#x7684;&#x662F;1&#xD7;1&#x5377;&#x79EF;&#xFF0C;&#x5047;&#x8BBE;&#x6709;400&#x4E2A;1&#xD7;1&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x5728;&#x8FD9;400&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#x7684;&#x4F5C;&#x7528;&#x4E0B;&#xFF0C;&#x4E0B;&#x4E00;&#x5C42;&#x7684;&#x7EF4;&#x5EA6;&#x662F;1&#xD7;1&#xD7;400&#xFF0C;&#x5B83;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x4E0A;&#x4E2A;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x8FD9;&#x4E00;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x3002;&#x6700;&#x540E;&#x7ECF;&#x7531;1&#xD7;1&#x8FC7;&#x6EE4;&#x5668;&#x7684;&#x5904;&#x7406;&#xFF0C;&#x5F97;&#x5230;&#x4E00;&#x4E2A;<strong>softmax</strong>&#x6FC0;&#x6D3B;&#x503C;&#xFF0C;&#x901A;&#x8FC7;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#xFF0C;&#x6211;&#x4EEC;&#x6700;&#x7EC8;&#x5F97;&#x5230;&#x8FD9;&#x4E2A;1&#xD7;1&#xD7;4&#x7684;&#x8F93;&#x51FA;&#x5C42;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8FD9;4&#x4E2A;&#x6570;&#x5B57;&#xFF08;&#x7F16;&#x53F7;3&#x6240;&#x793A;&#xFF09;&#x3002;</p>
<p>&#x4EE5;&#x4E0A;&#x5C31;&#x662F;&#x7528;&#x5377;&#x79EF;&#x5C42;&#x4EE3;&#x66FF;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x7ED3;&#x679C;&#x8FD9;&#x51E0;&#x4E2A;&#x5355;&#x5143;&#x96C6;&#x53D8;&#x6210;&#x4E86;1&#xD7;1&#xD7;400&#x548C;1&#xD7;1&#xD7;4&#x7684;&#x7EF4;&#x5EA6;&#x3002;</p>
<p>&#x53C2;&#x8003;&#x8BBA;&#x6587;&#xFF1A;<strong>Sermanet, Pierre, et al. &quot;OverFeat: Integrated Recognition, Localization and Detection using Convolutional Networks.&quot; <em>Eprint Arxiv</em> (2013).</strong></p>
<p>&#x638C;&#x63E1;&#x4E86;&#x5377;&#x79EF;&#x77E5;&#x8BC6;&#xFF0C;&#x6211;&#x4EEC;&#x518D;&#x770B;&#x770B;&#x5982;&#x4F55;&#x901A;&#x8FC7;&#x5377;&#x79EF;&#x5B9E;&#x73B0;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x5BF9;&#x8C61;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;&#x3002;&#x8BB2;&#x4E49;&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#x501F;&#x9274;&#x4E86;&#x5C4F;&#x5E55;&#x4E0B;&#x65B9;&#x8FD9;&#x7BC7;&#x5173;&#x4E8E;<strong>OverFeat</strong>&#x7684;&#x8BBA;&#x6587;&#xFF0C;&#x5B83;&#x7684;&#x4F5C;&#x8005;&#x5305;&#x62EC;<strong>Pierre Sermanet</strong>&#xFF0C;<strong>David Eigen</strong>&#xFF0C;<strong>&#x5F20;&#x7FD4;</strong>&#xFF0C;<strong>Michael Mathieu</strong>&#xFF0C;<strong>Rob Fergus</strong>&#xFF0C;<strong>Yann LeCun</strong>&#x3002;</p>
<p><img src="../images/00c4fb1a1af9b50f0fd0bcf5eacca6ff.png" alt=""></p>
<p>&#x5047;&#x8BBE;&#x5411;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x8F93;&#x5165;14&#xD7;14&#xD7;3&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x4E3A;&#x4E86;&#x7B80;&#x5316;&#x6F14;&#x793A;&#x548C;&#x8BA1;&#x7B97;&#x8FC7;&#x7A0B;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x4F9D;&#x7136;&#x7528;14&#xD7;14&#x7684;&#x5C0F;&#x56FE;&#x7247;&#x3002;&#x548C;&#x524D;&#x9762;&#x4E00;&#x6837;&#xFF0C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6700;&#x540E;&#x7684;&#x8F93;&#x51FA;&#x5C42;&#xFF0C;&#x5373;<strong>softmax</strong>&#x5355;&#x5143;&#x7684;&#x8F93;&#x51FA;&#x662F;1&#xD7;1&#xD7;4&#xFF0C;&#x6211;&#x753B;&#x5F97;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#xFF0C;&#x4E25;&#x683C;&#x6765;&#x8BF4;&#xFF0C;14&#xD7;14&#xD7;3&#x5E94;&#x8BE5;&#x662F;&#x4E00;&#x4E2A;&#x957F;&#x65B9;&#x4F53;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;10&#xD7;10&#xD7;16&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x957F;&#x65B9;&#x4F53;&#xFF0C;&#x4F46;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#xFF0C;&#x6211;&#x53EA;&#x753B;&#x4E86;&#x6B63;&#x9762;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5BF9;&#x4E8E;1&#xD7;1&#xD7;400&#x7684;&#x8FD9;&#x4E2A;&#x8F93;&#x51FA;&#x5C42;&#xFF0C;&#x6211;&#x4E5F;&#x53EA;&#x753B;&#x4E86;&#x5B83;1&#xD7;1&#x7684;&#x90A3;&#x4E00;&#x9762;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x663E;&#x793A;&#x7684;&#x90FD;&#x662F;&#x5E73;&#x9762;&#x56FE;&#xFF0C;&#x800C;&#x4E0D;&#x662F;3D&#x56FE;&#x50CF;&#x3002;</p>
<p><img src="../images/2a8750d733379aebf58f4354203153f2.png" alt=""></p>
<p>&#x5047;&#x8BBE;&#x8F93;&#x5165;&#x7ED9;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x7684;&#x56FE;&#x7247;&#x5927;&#x5C0F;&#x662F;14&#xD7;14&#xD7;3&#xFF0C;&#x6D4B;&#x8BD5;&#x96C6;&#x56FE;&#x7247;&#x662F;16&#xD7;16&#xD7;3&#xFF0C;&#x73B0;&#x5728;&#x7ED9;&#x8FD9;&#x4E2A;&#x8F93;&#x5165;&#x56FE;&#x7247;&#x52A0;&#x4E0A;&#x9EC4;&#x8272;&#x6761;&#x5757;&#xFF0C;&#x5728;&#x6700;&#x521D;&#x7684;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x7B97;&#x6CD5;&#x4E2D;&#xFF0C;&#x4F60;&#x4F1A;&#x628A;&#x8FD9;&#x7247;&#x84DD;&#x8272;&#x533A;&#x57DF;&#x8F93;&#x5165;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#xFF08;&#x7EA2;&#x8272;&#x7B14;&#x6807;&#x8BB0;&#xFF09;&#x751F;&#x6210;0&#x6216;1&#x5206;&#x7C7B;&#x3002;&#x63A5;&#x7740;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#xFF0C;&#x6B65;&#x5E45;&#x4E3A;2&#x4E2A;&#x50CF;&#x7D20;&#xFF0C;&#x5411;&#x53F3;&#x6ED1;&#x52A8;2&#x4E2A;&#x50CF;&#x7D20;&#xFF0C;&#x5C06;&#x8FD9;&#x4E2A;&#x7EFF;&#x6846;&#x533A;&#x57DF;&#x8F93;&#x5165;&#x7ED9;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#xFF0C;&#x8FD0;&#x884C;&#x6574;&#x4E2A;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#xFF0C;&#x5F97;&#x5230;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x6807;&#x7B7E;0&#x6216;1&#x3002;&#x7EE7;&#x7EED;&#x5C06;&#x8FD9;&#x4E2A;&#x6A58;&#x8272;&#x533A;&#x57DF;&#x8F93;&#x5165;&#x7ED9;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#xFF0C;&#x5377;&#x79EF;&#x540E;&#x5F97;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x6807;&#x7B7E;&#xFF0C;&#x6700;&#x540E;&#x5BF9;&#x53F3;&#x4E0B;&#x65B9;&#x7684;&#x7D2B;&#x8272;&#x533A;&#x57DF;&#x8FDB;&#x884C;&#x6700;&#x540E;&#x4E00;&#x6B21;&#x5377;&#x79EF;&#x64CD;&#x4F5C;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x8FD9;&#x4E2A;16&#xD7;16&#xD7;3&#x7684;&#x5C0F;&#x56FE;&#x50CF;&#x4E0A;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#xFF0C;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x8FD0;&#x884C;&#x4E86;4&#x6B21;&#xFF0C;&#x4E8E;&#x662F;&#x8F93;&#x51FA;&#x4E86;&#x4E86;4&#x4E2A;&#x6807;&#x7B7E;&#x3002;</p>
<p><img src="../images/b33768b46b3a06ff229a153765782b48.png" alt=""></p>
<p>&#x7ED3;&#x679C;&#x53D1;&#x73B0;&#xFF0C;&#x8FD9;4&#x6B21;&#x5377;&#x79EF;&#x64CD;&#x4F5C;&#x4E2D;&#x5F88;&#x591A;&#x8BA1;&#x7B97;&#x90FD;&#x662F;&#x91CD;&#x590D;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x6267;&#x884C;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x7684;&#x5377;&#x79EF;&#x65F6;&#x4F7F;&#x5F97;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x5728;&#x8FD9;4&#x6B21;&#x524D;&#x5411;&#x4F20;&#x64AD;&#x8FC7;&#x7A0B;&#x4E2D;&#x5171;&#x4EAB;&#x5F88;&#x591A;&#x8BA1;&#x7B97;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5728;&#x8FD9;&#x4E00;&#x6B65;&#x64CD;&#x4F5C;&#x4E2D;&#xFF08;&#x7F16;&#x53F7;1&#xFF09;&#xFF0C;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x8FD0;&#x884C;&#x540C;&#x6837;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x4F7F;&#x5F97;&#x76F8;&#x540C;&#x7684;5&#xD7;5&#xD7;16&#x8FC7;&#x6EE4;&#x5668;&#x8FDB;&#x884C;&#x5377;&#x79EF;&#x64CD;&#x4F5C;&#xFF0C;&#x5F97;&#x5230;12&#xD7;12&#xD7;16&#x7684;&#x8F93;&#x51FA;&#x5C42;&#x3002;&#x7136;&#x540E;&#x6267;&#x884C;&#x540C;&#x6837;&#x7684;&#x6700;&#x5927;&#x6C60;&#x5316;&#xFF08;&#x7F16;&#x53F7;2&#xFF09;&#xFF0C;&#x8F93;&#x51FA;&#x7ED3;&#x679C;6&#xD7;6&#xD7;16&#x3002;&#x7167;&#x65E7;&#x5E94;&#x7528;400&#x4E2A;5&#xD7;5&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF08;&#x7F16;&#x53F7;3&#xFF09;&#xFF0C;&#x5F97;&#x5230;&#x4E00;&#x4E2A;2&#xD7;2&#xD7;400&#x7684;&#x8F93;&#x51FA;&#x5C42;&#xFF0C;&#x73B0;&#x5728;&#x8F93;&#x51FA;&#x5C42;&#x4E3A;2&#xD7;2&#xD7;400&#xFF0C;&#x800C;&#x4E0D;&#x662F;1&#xD7;1&#xD7;400&#x3002;&#x5E94;&#x7528;1&#xD7;1&#x8FC7;&#x6EE4;&#x5668;&#xFF08;&#x7F16;&#x53F7;4&#xFF09;&#x5F97;&#x5230;&#x53E6;&#x4E00;&#x4E2A;2&#xD7;2&#xD7;400&#x7684;&#x8F93;&#x51FA;&#x5C42;&#x3002;&#x518D;&#x505A;&#x4E00;&#x6B21;&#x5168;&#x8FDE;&#x63A5;&#x7684;&#x64CD;&#x4F5C;&#xFF08;&#x7F16;&#x53F7;5&#xFF09;&#xFF0C;&#x6700;&#x7EC8;&#x5F97;&#x5230;2&#xD7;2&#xD7;4&#x7684;&#x8F93;&#x51FA;&#x5C42;&#xFF0C;&#x800C;&#x4E0D;&#x662F;1&#xD7;1&#xD7;4&#x3002;&#x6700;&#x7EC8;&#xFF0C;&#x5728;&#x8F93;&#x51FA;&#x5C42;&#x8FD9;4&#x4E2A;&#x5B50;&#x65B9;&#x5757;&#x4E2D;&#xFF0C;&#x84DD;&#x8272;&#x7684;&#x662F;&#x56FE;&#x50CF;&#x5DE6;&#x4E0A;&#x90E8;&#x5206;14&#xD7;14&#x7684;&#x8F93;&#x51FA;&#xFF08;&#x7EA2;&#x8272;&#x7BAD;&#x5934;&#x6807;&#x8BC6;&#xFF09;&#xFF0C;&#x53F3;&#x4E0A;&#x89D2;&#x65B9;&#x5757;&#x662F;&#x56FE;&#x50CF;&#x53F3;&#x4E0A;&#x90E8;&#x5206;&#xFF08;&#x7EFF;&#x8272;&#x7BAD;&#x5934;&#x6807;&#x8BC6;&#xFF09;&#x7684;&#x5BF9;&#x5E94;&#x8F93;&#x51FA;&#xFF0C;&#x5DE6;&#x4E0B;&#x89D2;&#x65B9;&#x5757;&#x662F;&#x8F93;&#x5165;&#x5C42;&#x5DE6;&#x4E0B;&#x89D2;&#xFF08;&#x6A58;&#x8272;&#x7BAD;&#x5934;&#x6807;&#x8BC6;&#xFF09;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;14&#xD7;14&#x533A;&#x57DF;&#x7ECF;&#x8FC7;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x5904;&#x7406;&#x540E;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x540C;&#x6837;&#xFF0C;&#x53F3;&#x4E0B;&#x89D2;&#x8FD9;&#x4E2A;&#x65B9;&#x5757;&#x662F;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x5904;&#x7406;&#x8F93;&#x5165;&#x5C42;&#x53F3;&#x4E0B;&#x89D2;14&#xD7;14&#x533A;&#x57DF;(&#x7D2B;&#x8272;&#x7BAD;&#x5934;&#x6807;&#x8BC6;)&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p><img src="../images/ad1743ff113f9d30080f63a16c74ed64.png" alt=""></p>
<p>&#x5982;&#x679C;&#x4F60;&#x60F3;&#x4E86;&#x89E3;&#x5177;&#x4F53;&#x7684;&#x8BA1;&#x7B97;&#x6B65;&#x9AA4;&#xFF0C;&#x4EE5;&#x7EFF;&#x8272;&#x65B9;&#x5757;&#x4E3A;&#x4F8B;&#xFF0C;&#x5047;&#x8BBE;&#x4F60;&#x526A;&#x5207;&#x51FA;&#x8FD9;&#x5757;&#x533A;&#x57DF;&#xFF08;&#x7F16;&#x53F7;1&#xFF09;&#xFF0C;&#x4F20;&#x9012;&#x7ED9;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#xFF0C;&#x7B2C;&#x4E00;&#x5C42;&#x7684;&#x6FC0;&#x6D3B;&#x503C;&#x5C31;&#x662F;&#x8FD9;&#x5757;&#x533A;&#x57DF;&#xFF08;&#x7F16;&#x53F7;2&#xFF09;&#xFF0C;&#x6700;&#x5927;&#x6C60;&#x5316;&#x540E;&#x7684;&#x4E0B;&#x4E00;&#x5C42;&#x7684;&#x6FC0;&#x6D3B;&#x503C;&#x662F;&#x8FD9;&#x5757;&#x533A;&#x57DF;&#xFF08;&#x7F16;&#x53F7;3&#xFF09;&#xFF0C;&#x8FD9;&#x5757;&#x533A;&#x57DF;&#x5BF9;&#x5E94;&#x7740;&#x540E;&#x9762;&#x51E0;&#x5C42;&#x8F93;&#x51FA;&#x7684;&#x53F3;&#x4E0A;&#x89D2;&#x65B9;&#x5757;&#xFF08;&#x7F16;&#x53F7;4&#xFF0C;5&#xFF0C;6&#xFF09;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x8BE5;&#x5377;&#x79EF;&#x64CD;&#x4F5C;&#x7684;&#x539F;&#x7406;&#x662F;&#x6211;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x628A;&#x8F93;&#x5165;&#x56FE;&#x50CF;&#x5206;&#x5272;&#x6210;&#x56DB;&#x4E2A;&#x5B50;&#x96C6;&#xFF0C;&#x5206;&#x522B;&#x6267;&#x884C;&#x524D;&#x5411;&#x4F20;&#x64AD;&#xFF0C;&#x800C;&#x662F;&#x628A;&#x5B83;&#x4EEC;&#x4F5C;&#x4E3A;&#x4E00;&#x5F20;&#x56FE;&#x7247;&#x8F93;&#x5165;&#x7ED9;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x8FDB;&#x884C;&#x8BA1;&#x7B97;&#xFF0C;&#x5176;&#x4E2D;&#x7684;&#x516C;&#x5171;&#x533A;&#x57DF;&#x53EF;&#x4EE5;&#x5171;&#x4EAB;&#x5F88;&#x591A;&#x8BA1;&#x7B97;&#xFF0C;&#x5C31;&#x50CF;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x7684;&#x8FD9;&#x4E2A;4&#x4E2A;14&#xD7;14&#x7684;&#x65B9;&#x5757;&#x4E00;&#x6837;&#x3002;</p>
<p><img src="../images/5fd2f8d039a3bfc5187dfe33f5276235.png" alt=""></p>
<p>&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x518D;&#x770B;&#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x7684;&#x56FE;&#x7247;&#x6837;&#x672C;&#xFF0C;&#x5047;&#x5982;&#x5BF9;&#x4E00;&#x4E2A;28&#xD7;28&#xD7;3&#x7684;&#x56FE;&#x7247;&#x5E94;&#x7528;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x64CD;&#x4F5C;&#xFF0C;&#x5982;&#x679C;&#x4EE5;&#x540C;&#x6837;&#x7684;&#x65B9;&#x5F0F;&#x8FD0;&#x884C;&#x524D;&#x5411;&#x4F20;&#x64AD;&#xFF0C;&#x6700;&#x540E;&#x5F97;&#x5230;8&#xD7;8&#xD7;4&#x7684;&#x7ED3;&#x679C;&#x3002;&#x8DDF;&#x4E0A;&#x4E00;&#x4E2A;&#x8303;&#x4F8B;&#x4E00;&#x6837;&#xFF0C;&#x4EE5;14&#xD7;14&#x533A;&#x57DF;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#xFF0C;&#x9996;&#x5148;&#x5728;&#x8FD9;&#x4E2A;&#x533A;&#x57DF;&#x5E94;&#x7528;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#xFF0C;&#x5176;&#x7ED3;&#x679C;&#x5BF9;&#x5E94;&#x8F93;&#x51FA;&#x5C42;&#x7684;&#x5DE6;&#x4E0A;&#x89D2;&#x90E8;&#x5206;&#x3002;&#x63A5;&#x7740;&#x4EE5;&#x5927;&#x5C0F;&#x4E3A;2&#x7684;&#x6B65;&#x5E45;&#x4E0D;&#x65AD;&#x5730;&#x5411;&#x53F3;&#x79FB;&#x52A8;&#x7A97;&#x53E3;&#xFF0C;&#x76F4;&#x5230;&#x7B2C;8&#x4E2A;&#x5355;&#x5143;&#x683C;&#xFF0C;&#x5F97;&#x5230;&#x8F93;&#x51FA;&#x5C42;&#x7684;&#x7B2C;&#x4E00;&#x884C;&#x3002;&#x7136;&#x540E;&#x5411;&#x56FE;&#x7247;&#x4E0B;&#x65B9;&#x79FB;&#x52A8;&#xFF0C;&#x6700;&#x7EC8;&#x8F93;&#x51FA;&#x8FD9;&#x4E2A;8&#xD7;8&#xD7;4&#x7684;&#x7ED3;&#x679C;&#x3002;&#x56E0;&#x4E3A;&#x6700;&#x5927;&#x6C60;&#x5316;&#x53C2;&#x6570;&#x4E3A;2&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;&#x4EE5;&#x5927;&#x5C0F;&#x4E3A;2&#x7684;&#x6B65;&#x5E45;&#x5728;&#x539F;&#x59CB;&#x56FE;&#x7247;&#x4E0A;&#x5E94;&#x7528;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;</p>
<p><img src="../images/c778140e6b853a26a7c9cd8440cf8a3e.png" alt=""></p>
<p><img src="../images/84a6a0505acc165c6600d4b6f03d5e3c.png" alt=""></p>
<p>&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x7684;&#x5B9E;&#x73B0;&#x8FC7;&#x7A0B;&#xFF0C;&#x5728;&#x56FE;&#x7247;&#x4E0A;&#x526A;&#x5207;&#x51FA;&#x4E00;&#x5757;&#x533A;&#x57DF;&#xFF0C;&#x5047;&#x8BBE;&#x5B83;&#x7684;&#x5927;&#x5C0F;&#x662F;14&#xD7;14&#xFF0C;&#x628A;&#x5B83;&#x8F93;&#x5165;&#x5230;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x3002;&#x7EE7;&#x7EED;&#x8F93;&#x5165;&#x4E0B;&#x4E00;&#x5757;&#x533A;&#x57DF;&#xFF0C;&#x5927;&#x5C0F;&#x540C;&#x6837;&#x662F;14&#xD7;14&#xFF0C;&#x91CD;&#x590D;&#x64CD;&#x4F5C;&#xFF0C;&#x76F4;&#x5230;&#x67D0;&#x4E2A;&#x533A;&#x57DF;&#x8BC6;&#x522B;&#x5230;&#x6C7D;&#x8F66;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x6B63;&#x5982;&#x5728;&#x524D;&#x4E00;&#x9875;&#x6240;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x4F9D;&#x9760;&#x8FDE;&#x7EED;&#x7684;&#x5377;&#x79EF;&#x64CD;&#x4F5C;&#x6765;&#x8BC6;&#x522B;&#x56FE;&#x7247;&#x4E2D;&#x7684;&#x6C7D;&#x8F66;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5BF9;&#x5927;&#x5C0F;&#x4E3A;28&#xD7;28&#x7684;&#x6574;&#x5F20;&#x56FE;&#x7247;&#x8FDB;&#x884C;&#x5377;&#x79EF;&#x64CD;&#x4F5C;&#xFF0C;&#x4E00;&#x6B21;&#x5F97;&#x5230;&#x6240;&#x6709;&#x9884;&#x6D4B;&#x503C;&#xFF0C;&#x5982;&#x679C;&#x8DB3;&#x591F;&#x5E78;&#x8FD0;&#xFF0C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4FBF;&#x53EF;&#x4EE5;&#x8BC6;&#x522B;&#x51FA;&#x6C7D;&#x8F66;&#x7684;&#x4F4D;&#x7F6E;&#x3002;</p>
<p><img src="../images/447080411189a0a4544747c2380fbda4.png" alt=""></p>
<p>&#x4EE5;&#x4E0A;&#x5C31;&#x662F;&#x5728;&#x5377;&#x79EF;&#x5C42;&#x4E0A;&#x5E94;&#x7528;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x7B97;&#x6CD5;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x5B83;&#x63D0;&#x9AD8;&#x4E86;&#x6574;&#x4E2A;&#x7B97;&#x6CD5;&#x7684;&#x6548;&#x7387;&#x3002;&#x4E0D;&#x8FC7;&#x8FD9;&#x79CD;&#x7B97;&#x6CD5;&#x4ECD;&#x7136;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x7F3A;&#x70B9;&#xFF0C;&#x5C31;&#x662F;&#x8FB9;&#x754C;&#x6846;&#x7684;&#x4F4D;&#x7F6E;&#x53EF;&#x80FD;&#x4E0D;&#x591F;&#x51C6;&#x786E;&#x3002;&#x4E0B;&#x8282;&#x8BFE;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<h3 id="35-bounding-box&#x9884;&#x6D4B;&#xFF08;bounding-box-predictions&#xFF09;">3.5 Bounding Box&#x9884;&#x6D4B;&#xFF08;Bounding box predictions&#xFF09;</h3>
<p>&#x5728;&#x4E0A;&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#x4E2D;&#xFF0C;&#x4F60;&#x4EEC;&#x5B66;&#x5230;&#x4E86;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x6CD5;&#x7684;&#x5377;&#x79EF;&#x5B9E;&#x73B0;&#xFF0C;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x6548;&#x7387;&#x66F4;&#x9AD8;&#xFF0C;&#x4F46;&#x4ECD;&#x7136;&#x5B58;&#x5728;&#x95EE;&#x9898;&#xFF0C;&#x4E0D;&#x80FD;&#x8F93;&#x51FA;&#x6700;&#x7CBE;&#x51C6;&#x7684;&#x8FB9;&#x754C;&#x6846;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x89C6;&#x9891;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x5982;&#x4F55;&#x5F97;&#x5230;&#x66F4;&#x7CBE;&#x51C6;&#x7684;&#x8FB9;&#x754C;&#x6846;&#x3002;</p>
<p><img src="../images/cd3e263bf279739afe62eb8730b4e167.png" alt=""></p>
<p>&#x5728;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x6CD5;&#x4E2D;&#xFF0C;&#x4F60;&#x53D6;&#x8FD9;&#x4E9B;&#x79BB;&#x6563;&#x7684;&#x4F4D;&#x7F6E;&#x96C6;&#x5408;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x5B83;&#x4EEC;&#x4E0A;&#x8FD0;&#x884C;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x4E9B;&#x8FB9;&#x754C;&#x6846;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x80FD;&#x5B8C;&#x7F8E;&#x5339;&#x914D;&#x6C7D;&#x8F66;&#x4F4D;&#x7F6E;&#xFF0C;&#x4E5F;&#x8BB8;&#x8FD9;&#x4E2A;&#x6846;&#xFF08;&#x7F16;&#x53F7;1&#xFF09;&#x662F;&#x6700;&#x5339;&#x914D;&#x7684;&#x4E86;&#x3002;&#x8FD8;&#x6709;&#x770B;&#x8D77;&#x6765;&#x8FD9;&#x4E2A;&#x771F;&#x5B9E;&#x503C;&#xFF0C;&#x6700;&#x5B8C;&#x7F8E;&#x7684;&#x8FB9;&#x754C;&#x6846;&#x751A;&#x81F3;&#x4E0D;&#x662F;&#x65B9;&#x5F62;&#xFF0C;&#x7A0D;&#x5FAE;&#x6709;&#x70B9;&#x957F;&#x65B9;&#x5F62;&#xFF08;&#x7EA2;&#x8272;&#x65B9;&#x6846;&#x6240;&#x793A;&#xFF09;&#xFF0C;&#x957F;&#x5BBD;&#x6BD4;&#x6709;&#x70B9;&#x5411;&#x6C34;&#x5E73;&#x65B9;&#x5411;&#x5EF6;&#x4F38;&#xFF0C;&#x6709;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x8BA9;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x8F93;&#x51FA;&#x66F4;&#x7CBE;&#x51C6;&#x7684;&#x8FB9;&#x754C;&#x6846;&#x5462;&#xFF1F;</p>
<p><img src="../images/e4bebc707829a1610572f43f8e0995c9.png" alt=""></p>
<p>&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x80FD;&#x5F97;&#x5230;&#x66F4;&#x7CBE;&#x51C6;&#x8FB9;&#x754C;&#x6846;&#x7684;&#x7B97;&#x6CD5;&#x662F;<strong>YOLO</strong>&#x7B97;&#x6CD5;&#xFF0C;<strong>YOLO</strong>(<strong>You only look once</strong>)&#x610F;&#x601D;&#x662F;&#x4F60;&#x53EA;&#x770B;&#x4E00;&#x6B21;&#xFF0C;&#x8FD9;&#x662F;&#x7531;<strong>Joseph Redmon</strong>&#xFF0C;<strong>Santosh Divvala</strong>&#xFF0C;<strong>Ross Girshick</strong>&#x548C;<strong>Ali Farhadi</strong>&#x63D0;&#x51FA;&#x7684;&#x7B97;&#x6CD5;&#x3002;</p>
<p>&#x662F;&#x8FD9;&#x4E48;&#x505A;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x4F60;&#x7684;&#x8F93;&#x5165;&#x56FE;&#x50CF;&#x662F;100&#xD7;100&#x7684;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x56FE;&#x50CF;&#x4E0A;&#x653E;&#x4E00;&#x4E2A;&#x7F51;&#x683C;&#x3002;&#x4E3A;&#x4E86;&#x4ECB;&#x7ECD;&#x8D77;&#x6765;&#x7B80;&#x5355;&#x4E00;&#x4E9B;&#xFF0C;&#x6211;&#x7528;3&#xD7;3&#x7F51;&#x683C;&#xFF0C;&#x5B9E;&#x9645;&#x5B9E;&#x73B0;&#x65F6;&#x4F1A;&#x7528;&#x66F4;&#x7CBE;&#x7EC6;&#x7684;&#x7F51;&#x683C;&#xFF0C;&#x53EF;&#x80FD;&#x662F;19&#xD7;19&#x3002;&#x57FA;&#x672C;&#x601D;&#x8DEF;&#x662F;&#x4F7F;&#x7528;&#x56FE;&#x50CF;&#x5206;&#x7C7B;&#x548C;&#x5B9A;&#x4F4D;&#x7B97;&#x6CD5;&#xFF0C;&#x524D;&#x51E0;&#x4E2A;&#x89C6;&#x9891;&#x4ECB;&#x7ECD;&#x8FC7;&#x7684;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x7B97;&#x6CD5;&#x5E94;&#x7528;&#x5230;9&#x4E2A;&#x683C;&#x5B50;&#x4E0A;&#x3002;&#xFF08;&#x57FA;&#x672C;&#x601D;&#x8DEF;&#x662F;&#xFF0C;&#x91C7;&#x7528;&#x56FE;&#x50CF;&#x5206;&#x7C7B;&#x548C;&#x5B9A;&#x4F4D;&#x7B97;&#x6CD5;&#xFF0C;&#x672C;&#x5468;&#x7B2C;&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#x4E2D;&#x4ECB;&#x7ECD;&#x8FC7;&#x7684;&#xFF0C;&#x9010;&#x4E00;&#x5E94;&#x7528;&#x5728;&#x56FE;&#x50CF;&#x7684;9&#x4E2A;&#x683C;&#x5B50;&#x4E2D;&#x3002;&#xFF09;&#x66F4;&#x5177;&#x4F53;&#x4E00;&#x70B9;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x8FD9;&#x6837;&#x5B9A;&#x4E49;&#x8BAD;&#x7EC3;&#x6807;&#x7B7E;&#xFF0C;&#x6240;&#x4EE5;&#x5BF9;&#x4E8E;9&#x4E2A;&#x683C;&#x5B50;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x6307;&#x5B9A;&#x4E00;&#x4E2A;&#x6807;&#x7B7E;$y$&#xFF0C;$y$&#x662F;8&#x7EF4;&#x7684;&#xFF0C;&#x548C;&#x4F60;&#x4E4B;&#x524D;&#x770B;&#x5230;&#x7684;&#x4E00;&#x6837;&#xFF0C;$y= \ \begin{bmatrix} p<em>{c} \ b</em>{x} \ b<em>{y} \ b</em>{h} \ b<em>{w} \ c</em>{1} \ c<em>{2}\ c</em>{3} \\end{bmatrix}$&#xFF0C;$p<em>{c}$&#x7B49;&#x4E8E;0&#x6216;1&#x53D6;&#x51B3;&#x4E8E;&#x8FD9;&#x4E2A;&#x7EFF;&#x8272;&#x683C;&#x5B50;&#x4E2D;&#x662F;&#x5426;&#x6709;&#x56FE;&#x50CF;&#x3002;&#x7136;&#x540E;$b</em>{x}$&#x3001;$b<em>{y}$&#x3001;$b</em>{h}$&#x548C;$b<em>{w}$&#x4F5C;&#x7528;&#x5C31;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x90A3;&#x4E2A;&#x683C;&#x5B50;&#x91CC;&#x6709;&#x5BF9;&#x8C61;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x7ED9;&#x51FA;&#x8FB9;&#x754C;&#x6846;&#x5750;&#x6807;&#x3002;&#x7136;&#x540E;$c</em>{1}$&#x3001;$c<em>{2}$&#x548C;$c</em>{3}$&#x5C31;&#x662F;&#x4F60;&#x60F3;&#x8981;&#x8BC6;&#x522B;&#x7684;&#x4E09;&#x4E2A;&#x7C7B;&#x522B;&#xFF0C;&#x80CC;&#x666F;&#x7C7B;&#x522B;&#x4E0D;&#x7B97;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x5C1D;&#x8BD5;&#x5728;&#x80CC;&#x666F;&#x7C7B;&#x522B;&#x4E2D;&#x8BC6;&#x522B;&#x884C;&#x4EBA;&#x3001;&#x6C7D;&#x8F66;&#x548C;&#x6469;&#x6258;&#x8F66;&#xFF0C;&#x90A3;&#x4E48;$c<em>{1}$&#x3001;$c</em>{2}$&#x548C;$c_{3}$&#x53EF;&#x4EE5;&#x662F;&#x884C;&#x4EBA;&#x3001;&#x6C7D;&#x8F66;&#x548C;&#x6469;&#x6258;&#x8F66;&#x7C7B;&#x522B;&#x3002;&#x8FD9;&#x5F20;&#x56FE;&#x91CC;&#x6709;9&#x4E2A;&#x683C;&#x5B50;&#xFF0C;&#x6240;&#x4EE5;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x683C;&#x5B50;&#x90FD;&#x6709;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x5411;&#x91CF;&#x3002;</p>
<p><img src="../images/fb08477cd3937f7df0deddc1de1d2920.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x770B;&#x770B;&#x5DE6;&#x4E0A;&#x65B9;&#x683C;&#x5B50;&#xFF0C;&#x8FD9;&#x91CC;&#x8FD9;&#x4E2A;&#xFF08;&#x7F16;&#x53F7;1&#xFF09;&#xFF0C;&#x91CC;&#x9762;&#x4EC0;&#x4E48;&#x4E5F;&#x6CA1;&#x6709;&#xFF0C;&#x6240;&#x4EE5;&#x5DE6;&#x4E0A;&#x683C;&#x5B50;&#x7684;&#x6807;&#x7B7E;&#x5411;&#x91CF;$y$&#x662F;$\begin{bmatrix}0 \ ? \ ? \ ? \ ? \ ? \ ? \ ? \\end{bmatrix}$&#x3002;&#x7136;&#x540E;&#x8FD9;&#x4E2A;&#x683C;&#x5B50;&#xFF08;&#x7F16;&#x53F7;2&#xFF09;&#x7684;&#x8F93;&#x51FA;&#x6807;&#x7B7E;$y$&#x4E5F;&#x662F;&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x4E2A;&#x683C;&#x5B50;&#xFF08;&#x7F16;&#x53F7;3&#xFF09;&#xFF0C;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x4EC0;&#x4E48;&#x4E5F;&#x6CA1;&#x6709;&#x7684;&#x683C;&#x5B50;&#x90FD;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x8FD9;&#x4E2A;&#x683C;&#x5B50;&#x5462;&#xFF1F;&#x8BB2;&#x7684;&#x66F4;&#x5177;&#x4F53;&#x4E00;&#x70B9;&#xFF0C;&#x8FD9;&#x5F20;&#x56FE;&#x6709;&#x4E24;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;<strong>YOLO</strong>&#x7B97;&#x6CD5;&#x505A;&#x7684;&#x5C31;&#x662F;&#xFF0C;&#x53D6;&#x4E24;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x4E2D;&#x70B9;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x5206;&#x914D;&#x7ED9;&#x5305;&#x542B;&#x5BF9;&#x8C61;&#x4E2D;&#x70B9;&#x7684;&#x683C;&#x5B50;&#x3002;&#x6240;&#x4EE5;&#x5DE6;&#x8FB9;&#x7684;&#x6C7D;&#x8F66;&#x5C31;&#x5206;&#x914D;&#x5230;&#x8FD9;&#x4E2A;&#x683C;&#x5B50;&#x4E0A;&#xFF08;&#x7F16;&#x53F7;4&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x8FD9;&#x8F86;<strong>Condor</strong>&#xFF08;&#x8F66;&#x578B;&#xFF1A;&#x795E;&#x9E70;&#xFF09;&#x4E2D;&#x70B9;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x5206;&#x914D;&#x7ED9;&#x8FD9;&#x4E2A;&#x683C;&#x5B50;&#xFF08;&#x7F16;&#x53F7;6&#xFF09;&#x3002;&#x6240;&#x4EE5;&#x5373;&#x4F7F;&#x4E2D;&#x5FC3;&#x683C;&#x5B50;&#xFF08;&#x7F16;&#x53F7;5&#xFF09;&#x540C;&#x65F6;&#x6709;&#x4E24;&#x8F86;&#x8F66;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x5047;&#x88C5;&#x4E2D;&#x5FC3;&#x683C;&#x5B50;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x6211;&#x4EEC;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x6240;&#x4EE5;&#x5BF9;&#x4E8E;&#x4E2D;&#x5FC3;&#x683C;&#x5B50;&#xFF0C;&#x5206;&#x7C7B;&#x6807;&#x7B7E;$y$&#x548C;&#x8FD9;&#x4E2A;&#x5411;&#x91CF;&#x7C7B;&#x4F3C;&#xFF0C;&#x548C;&#x8FD9;&#x4E2A;&#x6CA1;&#x6709;&#x5BF9;&#x8C61;&#x7684;&#x5411;&#x91CF;&#x7C7B;&#x4F3C;&#xFF0C;&#x5373;$y= \ \begin{bmatrix} 0 \ ? \ ? \ ? \ ? \ ? \ ? \ ? \\end{bmatrix}$&#x3002;&#x800C;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x683C;&#x5B50;&#xFF0C;&#x8FD9;&#x4E2A;&#x7528;&#x7EFF;&#x8272;&#x6846;&#x8D77;&#x6765;&#x7684;&#x683C;&#x5B50;&#xFF08;&#x7F16;&#x53F7;4&#xFF09;&#xFF0C;&#x76EE;&#x6807;&#x6807;&#x7B7E;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF0C;&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;$p<em>{c}=1$&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x5199;&#x51FA;$b</em>{x}$&#x3001;$b<em>{y}$&#x3001;$b</em>{h}$&#x548C;$b<em>{w}$&#x6765;&#x6307;&#x5B9A;&#x8FB9;&#x754C;&#x6846;&#x4F4D;&#x7F6E;&#xFF0C;&#x7136;&#x540E;&#x8FD8;&#x6709;&#x7C7B;&#x522B;1&#x662F;&#x884C;&#x4EBA;&#xFF0C;&#x90A3;&#x4E48;$c</em>{1}= 0$&#xFF0C;&#x7C7B;&#x522B;2&#x662F;&#x6C7D;&#x8F66;&#xFF0C;&#x6240;&#x4EE5;$c<em>{2} = 1$&#xFF0C;&#x7C7B;&#x522B;3&#x662F;&#x6469;&#x6258;&#x8F66;&#xFF0C;&#x5219;&#x6570;&#x503C;$c</em>{3} = 0$&#xFF0C;&#x5373;$y= \begin{bmatrix} 1 \ b<em>{x} \ b</em>{y} \ b<em>{h} \ b</em>{w} \ 0 \ 1 \0 \\end{bmatrix}$&#x3002;&#x53F3;&#x8FB9;&#x8FD9;&#x4E2A;&#x683C;&#x5B50;&#xFF08;&#x7F16;&#x53F7;6&#xFF09;&#x4E5F;&#x662F;&#x7C7B;&#x4F3C;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x91CC;&#x786E;&#x5B9E;&#x6709;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5B83;&#x7684;&#x5411;&#x91CF;&#x5E94;&#x8BE5;&#x662F;&#x8FD9;&#x4E2A;&#x6837;&#x5B50;&#x7684;&#xFF0C;$y=\begin{bmatrix} 1 \ b<em>{x} \ b</em>{y} \ b<em>{h} \ b</em>{w} \ 0 \ 1 \0 \ \end{bmatrix}$&#x4F5C;&#x4E3A;&#x76EE;&#x6807;&#x5411;&#x91CF;&#x5BF9;&#x5E94;&#x53F3;&#x8FB9;&#x7684;&#x683C;&#x5B50;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x5BF9;&#x4E8E;&#x8FD9;&#x91CC;9&#x4E2A;&#x683C;&#x5B50;&#x4E2D;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#xFF0C;&#x4F60;&#x90FD;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x4E2A;8&#x7EF4;&#x8F93;&#x51FA;&#x5411;&#x91CF;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x91CC;&#x662F;3&#xD7;3&#x7684;&#x7F51;&#x683C;&#xFF0C;&#x6240;&#x4EE5;&#x6709;9&#x4E2A;&#x683C;&#x5B50;&#xFF0C;&#x603B;&#x7684;&#x8F93;&#x51FA;&#x5C3A;&#x5BF8;&#x662F;3&#xD7;3&#xD7;8&#xFF0C;&#x6240;&#x4EE5;&#x76EE;&#x6807;&#x8F93;&#x51FA;&#x662F;3&#xD7;3&#xD7;8&#x3002;&#x56E0;&#x4E3A;&#x8FD9;&#x91CC;&#x6709;3&#xD7;3&#x683C;&#x5B50;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x683C;&#x5B50;&#xFF0C;&#x4F60;&#x90FD;&#x6709;&#x4E00;&#x4E2A;8&#x7EF4;&#x5411;&#x91CF;$y$&#xFF0C;&#x6240;&#x4EE5;&#x76EE;&#x6807;&#x8F93;&#x51FA;&#x5C3A;&#x5BF8;&#x662F;3&#xD7;3&#xD7;8&#x3002;</p>
<p><img src="../images/98633e9df22fd06cfc21af2e7d39bbb6.png" alt=""></p>
<p>&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x5DE6;&#x4E0A;&#x683C;&#x5B50;&#x662F;1&#xD7;1&#xD7;8&#xFF0C;&#x5BF9;&#x5E94;&#x7684;&#x662F;9&#x4E2A;&#x683C;&#x5B50;&#x4E2D;&#x5DE6;&#x4E0A;&#x683C;&#x5B50;&#x7684;&#x8F93;&#x51FA;&#x5411;&#x91CF;&#x3002;&#x6240;&#x4EE5;&#x5BF9;&#x4E8E;&#x8FD9;3&#xD7;3&#x4E2D;&#x6BCF;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#x800C;&#x8A00;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FD9;9&#x4E2A;&#x683C;&#x5B50;&#xFF0C;&#x6BCF;&#x4E2A;&#x90FD;&#x5BF9;&#x5E94;&#x4E00;&#x4E2A;8&#x7EF4;&#x8F93;&#x51FA;&#x76EE;&#x6807;&#x5411;&#x91CF;$y$&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x4E9B;&#x503C;&#x53EF;&#x4EE5;&#x662F;<strong>dont care-s</strong>&#xFF08;&#x5373;&#xFF1F;&#xFF09;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x91CC;&#x6CA1;&#x6709;&#x5BF9;&#x8C61;&#x7684;&#x8BDD;&#x3002;&#x6240;&#x4EE5;&#x603B;&#x7684;&#x76EE;&#x6807;&#x8F93;&#x51FA;&#xFF0C;&#x8FD9;&#x4E2A;&#x56FE;&#x7247;&#x7684;&#x8F93;&#x51FA;&#x6807;&#x7B7E;&#x5C3A;&#x5BF8;&#x5C31;&#x662F;3&#xD7;3&#xD7;8&#x3002;</p>
<p><img src="../images/404fdcba2685b830ae3718d348ab1d75.png" alt=""></p>
<p>&#x5982;&#x679C;&#x4F60;&#x73B0;&#x5728;&#x8981;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#x4E3A;100&#xD7;100&#xD7;3&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x73B0;&#x5728;&#x8FD9;&#x662F;&#x8F93;&#x5165;&#x56FE;&#x50CF;&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x6709;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x7684;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#xFF0C;&#x5377;&#x79EF;&#x5C42;&#xFF0C;&#x6700;&#x5927;&#x6C60;&#x5316;&#x5C42;&#x7B49;&#x7B49;&#xFF0C;&#x6700;&#x540E;&#x4F60;&#x4F1A;&#x6709;&#x8FD9;&#x4E2A;&#xFF0C;&#x9009;&#x62E9;&#x5377;&#x79EF;&#x5C42;&#x548C;&#x6700;&#x5927;&#x6C60;&#x5316;&#x5C42;&#xFF0C;&#x8FD9;&#x6837;&#x6700;&#x540E;&#x5C31;&#x6620;&#x5C04;&#x5230;&#x4E00;&#x4E2A;3&#xD7;3&#xD7;8&#x8F93;&#x51FA;&#x5C3A;&#x5BF8;&#x3002;&#x6240;&#x4EE5;&#x4F60;&#x8981;&#x505A;&#x7684;&#x662F;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x8F93;&#x5165;$x$&#xFF0C;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x8F93;&#x5165;&#x56FE;&#x50CF;&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x6709;&#x8FD9;&#x4E9B;3&#xD7;3&#xD7;8&#x7684;&#x76EE;&#x6807;&#x6807;&#x7B7E;$y$&#x3002;&#x5F53;&#x4F60;&#x7528;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x8BAD;&#x7EC3;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x65F6;&#xFF0C;&#x5C06;&#x4EFB;&#x610F;&#x8F93;&#x5165;$x$&#x6620;&#x5C04;&#x5230;&#x8FD9;&#x7C7B;&#x8F93;&#x51FA;&#x5411;&#x91CF;$y$&#x3002;</p>
<p><img src="../images/a6d32959543c502ee18765cf20495bc2.png" alt=""></p>
<p>&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x7684;&#x4F18;&#x70B9;&#x5728;&#x4E8E;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x53EF;&#x4EE5;&#x8F93;&#x51FA;&#x7CBE;&#x786E;&#x7684;&#x8FB9;&#x754C;&#x6846;&#xFF0C;&#x6240;&#x4EE5;&#x6D4B;&#x8BD5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x505A;&#x7684;&#x662F;&#x5582;&#x5165;&#x8F93;&#x5165;&#x56FE;&#x50CF;$x$&#xFF0C;&#x7136;&#x540E;&#x8DD1;&#x6B63;&#x5411;&#x4F20;&#x64AD;&#xFF0C;&#x76F4;&#x5230;&#x4F60;&#x5F97;&#x5230;&#x8FD9;&#x4E2A;&#x8F93;&#x51FA;$y$&#x3002;&#x7136;&#x540E;&#x5BF9;&#x4E8E;&#x8FD9;&#x91CC;3&#xD7;3&#x4F4D;&#x7F6E;&#x5BF9;&#x5E94;&#x7684;9&#x4E2A;&#x8F93;&#x51FA;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x8F93;&#x51FA;&#x4E2D;&#x5C55;&#x793A;&#x8FC7;&#x7684;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x8BFB;&#x51FA;1&#x6216;0&#xFF08;&#x7F16;&#x53F7;1&#x4F4D;&#x7F6E;&#xFF09;&#xFF0C;&#x4F60;&#x5C31;&#x77E5;&#x9053;9&#x4E2A;&#x4F4D;&#x7F6E;&#x4E4B;&#x4E00;&#x6709;&#x4E2A;&#x5BF9;&#x8C61;&#x3002;&#x5982;&#x679C;&#x90A3;&#x91CC;&#x6709;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x90A3;&#x4E2A;&#x5BF9;&#x8C61;&#x662F;&#x4EC0;&#x4E48;&#xFF08;&#x7F16;&#x53F7;3&#x4F4D;&#x7F6E;&#xFF09;&#xFF0C;&#x8FD8;&#x6709;&#x683C;&#x5B50;&#x4E2D;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x8FB9;&#x754C;&#x6846;&#x662F;&#x4EC0;&#x4E48;&#xFF08;&#x7F16;&#x53F7;2&#x4F4D;&#x7F6E;&#xFF09;&#x3002;&#x53EA;&#x8981;&#x6BCF;&#x4E2A;&#x683C;&#x5B50;&#x4E2D;&#x5BF9;&#x8C61;&#x6570;&#x76EE;&#x6CA1;&#x6709;&#x8D85;&#x8FC7;1&#x4E2A;&#xFF0C;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x5E94;&#x8BE5;&#x662F;&#x6CA1;&#x95EE;&#x9898;&#x7684;&#x3002;&#x4E00;&#x4E2A;&#x683C;&#x5B50;&#x4E2D;&#x5B58;&#x5728;&#x591A;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x7A0D;&#x540E;&#x518D;&#x8BA8;&#x8BBA;&#x3002;&#x4F46;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x7528;&#x7684;&#x662F;&#x6BD4;&#x8F83;&#x5C0F;&#x7684;3&#xD7;3&#x7F51;&#x683C;&#xFF0C;&#x5B9E;&#x8DF5;&#x4E2D;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x4F7F;&#x7528;&#x66F4;&#x7CBE;&#x7EC6;&#x7684;19&#xD7;19&#x7F51;&#x683C;&#xFF0C;&#x6240;&#x4EE5;&#x8F93;&#x51FA;&#x5C31;&#x662F;19&#xD7;19&#xD7;8&#x3002;&#x8FD9;&#x6837;&#x7684;&#x7F51;&#x683C;&#x7CBE;&#x7EC6;&#x5F97;&#x591A;&#xFF0C;&#x90A3;&#x4E48;&#x591A;&#x4E2A;&#x5BF9;&#x8C61;&#x5206;&#x914D;&#x5230;&#x540C;&#x4E00;&#x4E2A;&#x683C;&#x5B50;&#x5F97;&#x6982;&#x7387;&#x5C31;&#x5C0F;&#x5F97;&#x591A;&#x3002;</p>
<p>&#x91CD;&#x7533;&#x4E00;&#x4E0B;&#xFF0C;&#x628A;&#x5BF9;&#x8C61;&#x5206;&#x914D;&#x5230;&#x4E00;&#x4E2A;&#x683C;&#x5B50;&#x7684;&#x8FC7;&#x7A0B;&#x662F;&#xFF0C;&#x4F60;&#x89C2;&#x5BDF;&#x5BF9;&#x8C61;&#x7684;&#x4E2D;&#x70B9;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x5206;&#x914D;&#x5230;&#x5176;&#x4E2D;&#x70B9;&#x6240;&#x5728;&#x7684;&#x683C;&#x5B50;&#xFF0C;&#x6240;&#x4EE5;&#x5373;&#x4F7F;&#x5BF9;&#x8C61;&#x53EF;&#x4EE5;&#x6A2A;&#x8DE8;&#x591A;&#x4E2A;&#x683C;&#x5B50;&#xFF0C;&#x4E5F;&#x53EA;&#x4F1A;&#x88AB;&#x5206;&#x914D;&#x5230;9&#x4E2A;&#x683C;&#x5B50;&#x5176;&#x4E2D;&#x4E4B;&#x4E00;&#xFF0C;&#x5C31;&#x662F;3&#xD7;3&#x7F51;&#x7EDC;&#x7684;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x683C;&#x5B50;&#xFF0C;&#x6216;&#x8005;19&#xD7;19&#x7F51;&#x7EDC;&#x7684;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x683C;&#x5B50;&#x3002;&#x5728;19&#xD7;19&#x7F51;&#x683C;&#x4E2D;&#xFF0C;&#x4E24;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x4E2D;&#x70B9;&#xFF08;&#x56FE;&#x4E2D;&#x84DD;&#x8272;&#x70B9;&#x6240;&#x793A;&#xFF09;&#x5904;&#x4E8E;&#x540C;&#x4E00;&#x4E2A;&#x683C;&#x5B50;&#x7684;&#x6982;&#x7387;&#x5C31;&#x4F1A;&#x66F4;&#x4F4E;&#x3002;</p>
<p><img src="../images/b6b6ca6167596a180c7bab7296ea850c.png" alt=""></p>
<p>&#x6240;&#x4EE5;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x9996;&#x5148;&#x8FD9;&#x548C;&#x56FE;&#x50CF;&#x5206;&#x7C7B;&#x548C;&#x5B9A;&#x4F4D;&#x7B97;&#x6CD5;&#x975E;&#x5E38;&#x50CF;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x672C;&#x5468;&#x7B2C;&#x4E00;&#x8282;&#x8BFE;&#x8BB2;&#x8FC7;&#x7684;&#xFF0C;&#x5C31;&#x662F;&#x5B83;&#x663E;&#x5F0F;&#x5730;&#x8F93;&#x51FA;&#x8FB9;&#x754C;&#x6846;&#x5750;&#x6807;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x80FD;&#x8BA9;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8F93;&#x51FA;&#x8FB9;&#x754C;&#x6846;&#xFF0C;&#x53EF;&#x4EE5;&#x5177;&#x6709;&#x4EFB;&#x610F;&#x5BBD;&#x9AD8;&#x6BD4;&#xFF0C;&#x5E76;&#x4E14;&#x80FD;&#x8F93;&#x51FA;&#x66F4;&#x7CBE;&#x786E;&#x7684;&#x5750;&#x6807;&#xFF0C;&#x4E0D;&#x4F1A;&#x53D7;&#x5230;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x5206;&#x7C7B;&#x5668;&#x7684;&#x6B65;&#x957F;&#x5927;&#x5C0F;&#x9650;&#x5236;&#x3002;&#x5176;&#x6B21;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x5B9E;&#x73B0;&#xFF0C;&#x4F60;&#x5E76;&#x6CA1;&#x6709;&#x5728;3&#xD7;3&#x7F51;&#x683C;&#x4E0A;&#x8DD1;9&#x6B21;&#x7B97;&#x6CD5;&#xFF0C;&#x6216;&#x8005;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7528;&#x7684;&#x662F;19&#xD7;19&#x7684;&#x7F51;&#x683C;&#xFF0C;19&#x5E73;&#x65B9;&#x662F;361&#x6B21;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x4E0D;&#x9700;&#x8981;&#x8BA9;&#x540C;&#x4E00;&#x4E2A;&#x7B97;&#x6CD5;&#x8DD1;361&#x6B21;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x8FD9;&#x662F;&#x5355;&#x6B21;&#x5377;&#x79EF;&#x5B9E;&#x73B0;&#xFF0C;&#x4F46;&#x4F60;&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#xFF0C;&#x6709;&#x5F88;&#x591A;&#x5171;&#x4EAB;&#x8BA1;&#x7B97;&#x6B65;&#x9AA4;&#xFF0C;&#x5728;&#x5904;&#x7406;&#x8FD9;3&#xD7;3&#x8BA1;&#x7B97;&#x4E2D;&#x5F88;&#x591A;&#x8BA1;&#x7B97;&#x6B65;&#x9AA4;&#x662F;&#x5171;&#x4EAB;&#x7684;&#xFF0C;&#x6216;&#x8005;&#x4F60;&#x7684;19&#xD7;19&#x7684;&#x7F51;&#x683C;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x6548;&#x7387;&#x5F88;&#x9AD8;&#x3002;</p>
<p><img src="../images/395c57c64bb792a813a904b135423937.png" alt=""></p>
<p>&#x4E8B;&#x5B9E;&#x4E0A;<strong>YOLO</strong>&#x7B97;&#x6CD5;&#x6709;&#x4E00;&#x4E2A;&#x597D;&#x5904;&#xFF0C;&#x4E5F;&#x662F;&#x5B83;&#x53D7;&#x6B22;&#x8FCE;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x5B9E;&#x73B0;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x5B83;&#x7684;&#x8FD0;&#x884C;&#x901F;&#x5EA6;&#x975E;&#x5E38;&#x5FEB;&#xFF0C;&#x53EF;&#x4EE5;&#x8FBE;&#x5230;&#x5B9E;&#x65F6;&#x8BC6;&#x522B;&#x3002;&#x5728;&#x7ED3;&#x675F;&#x4E4B;&#x524D;&#x6211;&#x8FD8;&#x60F3;&#x7ED9;&#x4F60;&#x4EEC;&#x5206;&#x4EAB;&#x4E00;&#x4E2A;&#x5C0F;&#x7EC6;&#x8282;&#xFF0C;&#x5982;&#x4F55;&#x7F16;&#x7801;&#x8FD9;&#x4E9B;&#x8FB9;&#x754C;&#x6846;$b<em>{x}$&#x3001;$b</em>{y}$&#x3001;$b<em>{h}$&#x548C;$b</em>{w}$&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x4E0B;&#x4E00;&#x5F20;&#x5E7B;&#x706F;&#x7247;&#x4E0A;&#x8BA8;&#x8BBA;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x6709;&#x4E24;&#x8F86;&#x8F66;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x4E2A;3&#xD7;3&#x7F51;&#x683C;&#xFF0C;&#x6211;&#x4EEC;&#x4EE5;&#x53F3;&#x8FB9;&#x7684;&#x8F66;&#x4E3A;&#x4F8B;&#xFF08;&#x7F16;&#x53F7;1&#xFF09;&#xFF0C;&#x7EA2;&#x8272;&#x683C;&#x5B50;&#x91CC;&#x6709;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x6240;&#x4EE5;&#x76EE;&#x6807;&#x6807;&#x7B7E;$y$&#x5C31;&#x662F;&#xFF0C;$p<em>{c}= 1$&#xFF0C;&#x7136;&#x540E;$b</em>{x}$&#x3001;$b<em>{y}$&#x3001;$b</em>{h}$&#x548C;$b<em>{w}$&#xFF0C;&#x7136;&#x540E;$c</em>{1} =0$&#xFF0C;$c<em>{2} = 1$&#xFF0C;$c</em>{3} = 0$&#xFF0C;&#x5373;$y = \begin{bmatrix} 1 \ b<em>{x}\ b</em>{y} \ b<em>{h} \ b</em>{w} \ 0 \ 1 \ 0 \\end{bmatrix}$&#x3002;&#x4F60;&#x600E;&#x4E48;&#x6307;&#x5B9A;&#x8FD9;&#x4E2A;&#x8FB9;&#x754C;&#x6846;&#x5462;&#xFF1F;</p>
<p><strong>Specify the bounding boxes</strong>&#xFF1A;</p>
<p><img src="../images/0d7ee9b9f455338a8724520841223b11.png" alt=""></p>
<p>&#x5728;<strong>YOLO</strong>&#x7B97;&#x6CD5;&#x4E2D;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x65B9;&#x6846;&#xFF08;&#x7F16;&#x53F7;1&#x6240;&#x793A;&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x7EA6;&#x5B9A;&#x5DE6;&#x4E0A;&#x8FD9;&#x4E2A;&#x70B9;&#x662F;$(0,0)$&#xFF0C;&#x7136;&#x540E;&#x53F3;&#x4E0B;&#x8FD9;&#x4E2A;&#x70B9;&#x662F;$(1,1)$,&#x8981;&#x6307;&#x5B9A;&#x6A59;&#x8272;&#x4E2D;&#x70B9;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;$b<em>{x}$&#x5927;&#x6982;&#x662F;0.4&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x7684;&#x4F4D;&#x7F6E;&#x5927;&#x6982;&#x662F;&#x6C34;&#x5E73;&#x957F;&#x5EA6;&#x7684;0.4&#xFF0C;&#x7136;&#x540E;$b</em>{y}$&#x5927;&#x6982;&#x662F;0.3&#xFF0C;&#x7136;&#x540E;&#x8FB9;&#x754C;&#x6846;&#x7684;&#x9AD8;&#x5EA6;&#x7528;&#x683C;&#x5B50;&#x603B;&#x4F53;&#x5BBD;&#x5EA6;&#x7684;&#x6BD4;&#x4F8B;&#x8868;&#x793A;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x7EA2;&#x6846;&#x7684;&#x5BBD;&#x5EA6;&#x53EF;&#x80FD;&#x662F;&#x84DD;&#x7EBF;&#xFF08;&#x7F16;&#x53F7;2&#x6240;&#x793A;&#x7684;&#x84DD;&#x7EBF;&#xFF09;&#x7684;90%&#xFF0C;&#x6240;&#x4EE5;$b<em>{h}$&#x662F;0.9&#xFF0C;&#x5B83;&#x7684;&#x9AD8;&#x5EA6;&#x4E5F;&#x8BB8;&#x662F;&#x683C;&#x5B50;&#x603B;&#x4F53;&#x9AD8;&#x5EA6;&#x7684;&#x4E00;&#x534A;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x8BDD;$b</em>{w}$&#x5C31;&#x662F;0.5&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;$b<em>{x}$&#x3001;$b</em>{y}$&#x3001;$b<em>{h}$&#x548C;$b</em>{w}$&#x5355;&#x4F4D;&#x662F;&#x76F8;&#x5BF9;&#x4E8E;&#x683C;&#x5B50;&#x5C3A;&#x5BF8;&#x7684;&#x6BD4;&#x4F8B;&#xFF0C;&#x6240;&#x4EE5;$b<em>{x}$&#x548C;$b</em>{y}$&#x5FC5;&#x987B;&#x5728;0&#x548C;1&#x4E4B;&#x95F4;&#xFF0C;&#x56E0;&#x4E3A;&#x4ECE;&#x5B9A;&#x4E49;&#x4E0A;&#x770B;&#xFF0C;&#x6A59;&#x8272;&#x70B9;&#x4F4D;&#x4E8E;&#x5BF9;&#x8C61;&#x5206;&#x914D;&#x5230;&#x683C;&#x5B50;&#x7684;&#x8303;&#x56F4;&#x5185;&#xFF0C;&#x5982;&#x679C;&#x5B83;&#x4E0D;&#x5728;0&#x548C;1&#x4E4B;&#x95F4;&#xFF0C;&#x5982;&#x679C;&#x5B83;&#x5728;&#x65B9;&#x5757;&#x5916;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x5C31;&#x5E94;&#x8BE5;&#x5206;&#x914D;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x683C;&#x5B50;&#x4E0A;&#x3002;&#x8FD9;&#x4E2A;&#x503C;&#xFF08;$b<em>{h}$&#x548C;$b</em>{w}$&#xFF09;&#x53EF;&#x80FD;&#x4F1A;&#x5927;&#x4E8E;1&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5982;&#x679C;&#x6709;&#x4E00;&#x8F86;&#x6C7D;&#x8F66;&#x7684;&#x8FB9;&#x754C;&#x6846;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF08;&#x7F16;&#x53F7;3&#x6240;&#x793A;&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x8FB9;&#x754C;&#x6846;&#x7684;&#x5BBD;&#x5EA6;&#x548C;&#x9AD8;&#x5EA6;&#x6709;&#x53EF;&#x80FD;&#x5927;&#x4E8E;1&#x3002;</p>
<p>&#x6307;&#x5B9A;&#x8FB9;&#x754C;&#x6846;&#x7684;&#x65B9;&#x5F0F;&#x6709;&#x5F88;&#x591A;&#xFF0C;&#x4F46;&#x8FD9;&#x79CD;&#x7EA6;&#x5B9A;&#x662F;&#x6BD4;&#x8F83;&#x5408;&#x7406;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x53BB;&#x8BFB;<strong>YOLO</strong>&#x7684;&#x7814;&#x7A76;&#x8BBA;&#x6587;&#xFF0C;<strong>YOLO</strong>&#x7684;&#x7814;&#x7A76;&#x5DE5;&#x4F5C;&#x6709;&#x5176;&#x4ED6;&#x53C2;&#x6570;&#x5316;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x53EF;&#x80FD;&#x6548;&#x679C;&#x4F1A;&#x66F4;&#x597D;&#xFF0C;&#x6211;&#x8FD9;&#x91CC;&#x5C31;&#x53EA;&#x7ED9;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x5408;&#x7406;&#x7684;&#x7EA6;&#x5B9A;&#xFF0C;&#x7528;&#x8D77;&#x6765;&#x5E94;&#x8BE5;&#x6CA1;&#x95EE;&#x9898;&#x3002;&#x4E0D;&#x8FC7;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x66F4;&#x590D;&#x6742;&#x7684;&#x53C2;&#x6570;&#x5316;&#x65B9;&#x5F0F;&#xFF0C;&#x6D89;&#x53CA;&#x5230;<strong>sigmoid</strong>&#x51FD;&#x6570;&#xFF0C;&#x786E;&#x4FDD;&#x8FD9;&#x4E2A;&#x503C;&#xFF08;$b<em>{x}$&#x548C;$b</em>{y}$&#xFF09;&#x4ECB;&#x4E8E;0&#x548C;1&#x4E4B;&#x95F4;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x6307;&#x6570;&#x53C2;&#x6570;&#x5316;&#x6765;&#x786E;&#x4FDD;&#x8FD9;&#x4E9B;&#xFF08;$b<em>{h}$&#x548C;$b</em>{w}$&#xFF09;&#x90FD;&#x662F;&#x975E;&#x8D1F;&#x6570;&#xFF0C;&#x56E0;&#x4E3A;0.9&#x548C;0.5&#xFF0C;&#x8FD9;&#x4E2A;&#x5FC5;&#x987B;&#x5927;&#x4E8E;&#x7B49;&#x4E8E;0&#x3002;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x66F4;&#x9AD8;&#x7EA7;&#x7684;&#x53C2;&#x6570;&#x5316;&#x65B9;&#x5F0F;&#xFF0C;&#x53EF;&#x80FD;&#x6548;&#x679C;&#x8981;&#x66F4;&#x597D;&#x4E00;&#x70B9;&#xFF0C;&#x4F46;&#x6211;&#x8FD9;&#x91CC;&#x8BB2;&#x7684;&#x529E;&#x6CD5;&#x5E94;&#x8BE5;&#x662F;&#x7BA1;&#x7528;&#x7684;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;<strong>YOLO</strong>&#x7B97;&#x6CD5;&#xFF0C;&#x4F60;&#x53EA;&#x770B;&#x4E00;&#x6B21;&#x7B97;&#x6CD5;&#xFF0C;&#x5728;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x51E0;&#x4E2A;&#x89C6;&#x9891;&#x4E2D;&#xFF0C;&#x6211;&#x4F1A;&#x544A;&#x8BC9;&#x4F60;&#x4E00;&#x4E9B;&#x5176;&#x4ED6;&#x7684;&#x601D;&#x8DEF;&#x53EF;&#x4EE5;&#x8BA9;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x505A;&#x7684;&#x66F4;&#x597D;&#x3002;&#x5728;&#x6B64;&#x671F;&#x95F4;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x770B;&#x770B;<strong>YOLO</strong>&#x7684;&#x8BBA;&#x6587;&#xFF0C;&#x5728;&#x524D;&#x51E0;&#x5F20;&#x5E7B;&#x706F;&#x7247;&#x5E95;&#x90E8;&#x5F15;&#x7528;&#x7684;<strong>YOLO</strong>&#x8BBA;&#x6587;&#x3002;</p>
<p><strong>Redmon, Joseph, et al. &quot;You Only Look Once: Unified, Real-Time Object Detection.&quot; (2015):779-788.</strong></p>
<p>&#x4E0D;&#x8FC7;&#x770B;&#x8FD9;&#x4E9B;&#x8BBA;&#x6587;&#x4E4B;&#x524D;&#xFF0C;&#x5148;&#x7ED9;&#x4F60;&#x4EEC;&#x63D0;&#x4E2A;&#x9192;&#xFF0C;<strong>YOLO</strong>&#x8BBA;&#x6587;&#x662F;&#x76F8;&#x5BF9;&#x96BE;&#x5EA6;&#x8F83;&#x9AD8;&#x7684;&#x8BBA;&#x6587;&#x4E4B;&#x4E00;&#xFF0C;&#x6211;&#x8BB0;&#x5F97;&#x6211;&#x7B2C;&#x4E00;&#x6B21;&#x8BFB;&#x8FD9;&#x7BC7;&#x8BBA;&#x6587;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x771F;&#x7684;&#x5F88;&#x96BE;&#x641E;&#x6E05;&#x695A;&#x5230;&#x5E95;&#x662F;&#x600E;&#x4E48;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x6211;&#x6700;&#x540E;&#x95EE;&#x4E86;&#x4E00;&#x4E9B;&#x6211;&#x8BA4;&#x8BC6;&#x7684;&#x7814;&#x7A76;&#x5458;&#xFF0C;&#x770B;&#x770B;&#x4ED6;&#x4EEC;&#x80FD;&#x4E0D;&#x80FD;&#x7ED9;&#x6211;&#x8BB2;&#x6E05;&#x695A;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x4ED6;&#x4EEC;&#xFF0C;&#x4E5F;&#x5F88;&#x96BE;&#x7406;&#x89E3;&#x8FD9;&#x7BC7;&#x8BBA;&#x6587;&#x7684;&#x4E00;&#x4E9B;&#x7EC6;&#x8282;&#x3002;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x4F60;&#x770B;&#x8BBA;&#x6587;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53D1;&#x73B0;&#x770B;&#x4E0D;&#x61C2;&#xFF0C;&#x8FD9;&#x662F;&#x6CA1;&#x95EE;&#x9898;&#x7684;&#xFF0C;&#x6211;&#x5E0C;&#x671B;&#x8FD9;&#x79CD;&#x573A;&#x5408;&#x51FA;&#x73B0;&#x7684;&#x6982;&#x7387;&#x8981;&#x66F4;&#x4F4E;&#x624D;&#x597D;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x8D44;&#x6DF1;&#x7814;&#x7A76;&#x5458;&#x4E5F;&#x6709;&#x8BFB;&#x4E0D;&#x61C2;&#x7814;&#x7A76;&#x8BBA;&#x6587;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5FC5;&#x987B;&#x53BB;&#x8BFB;&#x6E90;&#x4EE3;&#x7801;&#xFF0C;&#x6216;&#x8005;&#x8054;&#x7CFB;&#x4F5C;&#x8005;&#x4E4B;&#x7C7B;&#x7684;&#x624D;&#x80FD;&#x5F04;&#x6E05;&#x695A;&#x8FD9;&#x4E9B;&#x7B97;&#x6CD5;&#x7684;&#x7EC6;&#x8282;&#x3002;&#x4F46;&#x4F60;&#x4EEC;&#x4E0D;&#x8981;&#x88AB;&#x6211;&#x5413;&#x5230;&#xFF0C;&#x4F60;&#x4EEC;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x770B;&#x770B;&#x8FD9;&#x4E9B;&#x8BBA;&#x6587;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4EEC;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x8BDD;&#xFF0C;&#x4F46;&#x8FD9;&#x7BC7;&#x8BBA;&#x6587;&#x76F8;&#x5BF9;&#x8F83;&#x96BE;&#x3002;&#x73B0;&#x5728;&#x4F60;&#x4EEC;&#x4E86;&#x89E3;&#x4E86;<strong>YOLO</strong>&#x7B97;&#x6CD5;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x6211;&#x4EEC;&#x7EE7;&#x7EED;&#x8BA8;&#x8BBA;&#x522B;&#x7684;&#x8BA9;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x6548;&#x679C;&#x66F4;&#x597D;&#x7684;&#x7814;&#x7A76;&#x3002;</p>
<h3 id="36-&#x4EA4;&#x5E76;&#x6BD4;&#xFF08;intersection-over-union&#xFF09;">3.6 &#x4EA4;&#x5E76;&#x6BD4;&#xFF08;Intersection over union&#xFF09;</h3>
<p>&#x4F60;&#x5982;&#x4F55;&#x5224;&#x65AD;&#x5BF9;&#x8C61;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;&#x8FD0;&#x4F5C;&#x826F;&#x597D;&#x5462;&#xFF1F;&#x5728;&#x672C;&#x89C6;&#x9891;&#x4E2D;&#xFF0C;&#x4F60;&#x5C06;&#x4E86;&#x89E3;&#x5230;&#x5E76;&#x4EA4;&#x6BD4;&#x51FD;&#x6570;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x8BC4;&#x4EF7;&#x5BF9;&#x8C61;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;&#x3002;&#x5728;&#x4E0B;&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x7528;&#x5B83;&#x6765;&#x63D2;&#x5165;&#x4E00;&#x4E2A;&#x5206;&#x91CF;&#x6765;&#x8FDB;&#x4E00;&#x6B65;&#x6539;&#x5584;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x5427;&#x3002;</p>
<p><img src="../images/38eea69baa46091d516a0b7a33e5379e.png" alt=""></p>
<p>&#x5728;&#x5BF9;&#x8C61;&#x68C0;&#x6D4B;&#x4EFB;&#x52A1;&#x4E2D;&#xFF0C;&#x4F60;&#x5E0C;&#x671B;&#x80FD;&#x591F;&#x540C;&#x65F6;&#x5B9A;&#x4F4D;&#x5BF9;&#x8C61;&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x5B9E;&#x9645;&#x8FB9;&#x754C;&#x6846;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF0C;&#x4F60;&#x7684;&#x7B97;&#x6CD5;&#x7ED9;&#x51FA;&#x8FD9;&#x4E2A;&#x7D2B;&#x8272;&#x7684;&#x8FB9;&#x754C;&#x6846;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x7ED3;&#x679C;&#x662F;&#x597D;&#x8FD8;&#x662F;&#x574F;&#xFF1F;&#x6240;&#x4EE5;&#x4EA4;&#x5E76;&#x6BD4;&#xFF08;<strong>loU</strong>&#xFF09;&#x51FD;&#x6570;&#x505A;&#x7684;&#x662F;&#x8BA1;&#x7B97;&#x4E24;&#x4E2A;&#x8FB9;&#x754C;&#x6846;&#x4EA4;&#x96C6;&#x548C;&#x5E76;&#x96C6;&#x4E4B;&#x6BD4;&#x3002;&#x4E24;&#x4E2A;&#x8FB9;&#x754C;&#x6846;&#x7684;&#x5E76;&#x96C6;&#x662F;&#x8FD9;&#x4E2A;&#x533A;&#x57DF;&#xFF0C;&#x5C31;&#x662F;&#x5C5E;&#x4E8E;&#x5305;&#x542B;&#x4E24;&#x4E2A;&#x8FB9;&#x754C;&#x6846;&#x533A;&#x57DF;&#xFF08;&#x7EFF;&#x8272;&#x9634;&#x5F71;&#x8868;&#x793A;&#x533A;&#x57DF;&#xFF09;&#xFF0C;&#x800C;&#x4EA4;&#x96C6;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x6BD4;&#x8F83;&#x5C0F;&#x7684;&#x533A;&#x57DF;&#xFF08;&#x6A59;&#x8272;&#x9634;&#x5F71;&#x8868;&#x793A;&#x533A;&#x57DF;&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x4EA4;&#x5E76;&#x6BD4;&#x5C31;&#x662F;&#x4EA4;&#x96C6;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x8FD9;&#x4E2A;&#x6A59;&#x8272;&#x9634;&#x5F71;&#x9762;&#x79EF;&#xFF0C;&#x7136;&#x540E;&#x9664;&#x4EE5;&#x7EFF;&#x8272;&#x9634;&#x5F71;&#x7684;&#x5E76;&#x96C6;&#x9762;&#x79EF;&#x3002;</p>
<p>&#x4E00;&#x822C;&#x7EA6;&#x5B9A;&#xFF0C;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x68C0;&#x6D4B;&#x4EFB;&#x52A1;&#x4E2D;&#xFF0C;&#x5982;&#x679C;$loU&#x2265;0.5$&#xFF0C;&#x5C31;&#x8BF4;&#x68C0;&#x6D4B;&#x6B63;&#x786E;&#xFF0C;&#x5982;&#x679C;&#x9884;&#x6D4B;&#x5668;&#x548C;&#x5B9E;&#x9645;&#x8FB9;&#x754C;&#x6846;&#x5B8C;&#x7F8E;&#x91CD;&#x53E0;&#xFF0C;<strong>loU</strong>&#x5C31;&#x662F;1&#xFF0C;&#x56E0;&#x4E3A;&#x4EA4;&#x96C6;&#x5C31;&#x7B49;&#x4E8E;&#x5E76;&#x96C6;&#x3002;&#x4F46;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#x53EA;&#x8981;$loU&#x2265;0.5$&#xFF0C;&#x90A3;&#x4E48;&#x7ED3;&#x679C;&#x662F;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x7684;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x8FD8;&#x53EF;&#x4EE5;&#x3002;&#x4E00;&#x822C;&#x7EA6;&#x5B9A;&#xFF0C;0.5&#x662F;&#x9608;&#x503C;&#xFF0C;&#x7528;&#x6765;&#x5224;&#x65AD;&#x9884;&#x6D4B;&#x7684;&#x8FB9;&#x754C;&#x6846;&#x662F;&#x5426;&#x6B63;&#x786E;&#x3002;&#x4E00;&#x822C;&#x662F;&#x8FD9;&#x4E48;&#x7EA6;&#x5B9A;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x4F60;&#x5E0C;&#x671B;&#x66F4;&#x4E25;&#x683C;&#x4E00;&#x70B9;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;<strong>loU</strong>&#x5B9A;&#x5F97;&#x66F4;&#x9AD8;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x5927;&#x4E8E;0.6&#x6216;&#x8005;&#x66F4;&#x5927;&#x7684;&#x6570;&#x5B57;&#xFF0C;&#x4F46;<strong>loU</strong>&#x8D8A;&#x9AD8;&#xFF0C;&#x8FB9;&#x754C;&#x6846;&#x8D8A;&#x7CBE;&#x786E;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x8FD9;&#x662F;&#x8861;&#x91CF;&#x5B9A;&#x4F4D;&#x7CBE;&#x786E;&#x5EA6;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x7EDF;&#x8BA1;&#x7B97;&#x6CD5;&#x6B63;&#x786E;&#x68C0;&#x6D4B;&#x548C;&#x5B9A;&#x4F4D;&#x5BF9;&#x8C61;&#x7684;&#x6B21;&#x6570;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x7528;&#x8FD9;&#x6837;&#x7684;&#x5B9A;&#x4E49;&#x5224;&#x65AD;&#x5BF9;&#x8C61;&#x5B9A;&#x4F4D;&#x662F;&#x5426;&#x51C6;&#x786E;&#x3002;&#x518D;&#x6B21;&#xFF0C;0.5&#x662F;&#x4EBA;&#x4E3A;&#x7EA6;&#x5B9A;&#xFF0C;&#x6CA1;&#x6709;&#x7279;&#x522B;&#x6DF1;&#x7684;&#x7406;&#x8BBA;&#x4F9D;&#x636E;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x66F4;&#x4E25;&#x683C;&#x4E00;&#x70B9;&#xFF0C;&#x53EF;&#x4EE5;&#x628A;&#x9608;&#x503C;&#x5B9A;&#x4E3A;0.6&#x3002;&#x6709;&#x65F6;&#x6211;&#x770B;&#x5230;&#x66F4;&#x4E25;&#x683C;&#x7684;&#x6807;&#x51C6;&#xFF0C;&#x6BD4;&#x5982;0.6&#x751A;&#x81F3;0.7&#xFF0C;&#x4F46;&#x5F88;&#x5C11;&#x89C1;&#x5230;&#x6709;&#x4EBA;&#x5C06;&#x9608;&#x503C;&#x964D;&#x5230;0.5&#x4EE5;&#x4E0B;&#x3002;</p>
<p>&#x4EBA;&#x4EEC;&#x5B9A;&#x4E49;<strong>loU</strong>&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x662F;&#x4E3A;&#x4E86;&#x8BC4;&#x4EF7;&#x4F60;&#x7684;&#x5BF9;&#x8C61;&#x5B9A;&#x4F4D;&#x7B97;&#x6CD5;&#x662F;&#x5426;&#x7CBE;&#x51C6;&#xFF0C;&#x4F46;&#x66F4;&#x4E00;&#x822C;&#x5730;&#x8BF4;&#xFF0C;<strong>loU</strong>&#x8861;&#x91CF;&#x4E86;&#x4E24;&#x4E2A;&#x8FB9;&#x754C;&#x6846;&#x91CD;&#x53E0;&#x5730;&#x76F8;&#x5BF9;&#x5927;&#x5C0F;&#x3002;&#x5982;&#x679C;&#x4F60;&#x6709;&#x4E24;&#x4E2A;&#x8FB9;&#x754C;&#x6846;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8BA1;&#x7B97;&#x4EA4;&#x96C6;&#xFF0C;&#x8BA1;&#x7B97;&#x5E76;&#x96C6;&#xFF0C;&#x7136;&#x540E;&#x6C42;&#x4E24;&#x4E2A;&#x6570;&#x503C;&#x7684;&#x6BD4;&#x503C;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E5F;&#x53EF;&#x4EE5;&#x5224;&#x65AD;&#x4E24;&#x4E2A;&#x8FB9;&#x754C;&#x6846;&#x662F;&#x5426;&#x76F8;&#x4F3C;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x4E0B;&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#x4E2D;&#x518D;&#x6B21;&#x7528;&#x5230;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x975E;&#x6700;&#x5927;&#x503C;&#x6291;&#x5236;&#x65F6;&#x518D;&#x6B21;&#x7528;&#x5230;&#x3002;</p>
<p><img src="../images/18cac7505a1ffa2bcb12362d0a465026.png" alt=""></p>
<p>&#x597D;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;<strong>loU</strong>&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x4EA4;&#x5E76;&#x6BD4;&#xFF0C;&#x4E0D;&#x8981;&#x548C;&#x501F;&#x636E;&#x4E2D;&#x63D0;&#x5230;&#x7684;&#x6211;&#x6B20;&#x4F60;&#x94B1;&#x7684;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x6240;&#x6DF7;&#x6DC6;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x501F;&#x94B1;&#x7ED9;&#x522B;&#x4EBA;&#xFF0C;&#x4ED6;&#x4EEC;&#x4F1A;&#x5199;&#x7ED9;&#x4F60;&#x4E00;&#x4E2A;&#x501F;&#x636E;&#xFF0C;&#x8BF4;&#xFF1A;&#x201C;&#x6211;&#x6B20;&#x4F60;&#x8FD9;&#x4E48;&#x591A;&#x94B1;&#xFF08;<strong>I own you this much money</strong>&#xFF09;&#x3002;&#x201D;&#xFF0C;&#x8FD9;&#x4E5F;&#x53EB;&#x505A;<strong>loU</strong>&#x3002;&#x8FD9;&#x662F;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x6982;&#x5FF5;&#x91CD;&#x540D;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x4ECB;&#x7ECD;&#x4E86;<strong>loU</strong>&#x4EA4;&#x5E76;&#x6BD4;&#x7684;&#x5B9A;&#x4E49;&#x4E4B;&#x540E;&#xFF0C;&#x5728;&#x4E0B;&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#x4E2D;&#xFF0C;&#x6211;&#x60F3;&#x8BA8;&#x8BBA;&#x975E;&#x6700;&#x5927;&#x503C;&#x6291;&#x5236;&#xFF0C;&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#x53EF;&#x4EE5;&#x8BA9;<strong>YOLO</strong>&#x7B97;&#x6CD5;&#x8F93;&#x51FA;&#x6548;&#x679C;&#x66F4;&#x597D;&#xFF0C;&#x6211;&#x4EEC;&#x4E0B;&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#x7EE7;&#x7EED;&#x3002;</p>
<h3 id="37-&#x975E;&#x6781;&#x5927;&#x503C;&#x6291;&#x5236;&#xFF08;non-max-suppression&#xFF09;">3.7 &#x975E;&#x6781;&#x5927;&#x503C;&#x6291;&#x5236;&#xFF08;Non-max suppression&#xFF09;</h3>
<p>&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x4F60;&#x4EEC;&#x5B66;&#x5230;&#x7684;&#x5BF9;&#x8C61;&#x68C0;&#x6D4B;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x4F60;&#x7684;&#x7B97;&#x6CD5;&#x53EF;&#x80FD;&#x5BF9;&#x540C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x505A;&#x51FA;&#x591A;&#x6B21;&#x68C0;&#x6D4B;&#xFF0C;&#x6240;&#x4EE5;&#x7B97;&#x6CD5;&#x4E0D;&#x662F;&#x5BF9;&#x67D0;&#x4E2A;&#x5BF9;&#x8C61;&#x68C0;&#x6D4B;&#x51FA;&#x4E00;&#x6B21;&#xFF0C;&#x800C;&#x662F;&#x68C0;&#x6D4B;&#x51FA;&#x591A;&#x6B21;&#x3002;&#x975E;&#x6781;&#x5927;&#x503C;&#x6291;&#x5236;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x786E;&#x4FDD;&#x4F60;&#x7684;&#x7B97;&#x6CD5;&#x5BF9;&#x6BCF;&#x4E2A;&#x5BF9;&#x8C61;&#x53EA;&#x68C0;&#x6D4B;&#x4E00;&#x6B21;&#xFF0C;&#x6211;&#x4EEC;&#x8BB2;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x3002;</p>
<p><img src="../images/03e8758ec8c15b2d83cad23ce5783dee.png" alt=""></p>
<p>&#x5047;&#x8BBE;&#x4F60;&#x9700;&#x8981;&#x5728;&#x8FD9;&#x5F20;&#x56FE;&#x7247;&#x91CC;&#x68C0;&#x6D4B;&#x884C;&#x4EBA;&#x548C;&#x6C7D;&#x8F66;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x5728;&#x4E0A;&#x9762;&#x653E;&#x4E2A;19&#xD7;19&#x7F51;&#x683C;&#xFF0C;&#x7406;&#x8BBA;&#x4E0A;&#x8FD9;&#x8F86;&#x8F66;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x4E2D;&#x70B9;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x5E94;&#x8BE5;&#x53EA;&#x88AB;&#x5206;&#x914D;&#x5230;&#x4E00;&#x4E2A;&#x683C;&#x5B50;&#x91CC;&#xFF0C;&#x5DE6;&#x8FB9;&#x7684;&#x8F66;&#x5B50;&#x4E5F;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x4E2D;&#x70B9;&#xFF0C;&#x6240;&#x4EE5;&#x7406;&#x8BBA;&#x4E0A;&#x5E94;&#x8BE5;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x683C;&#x5B50;&#x505A;&#x51FA;&#x6709;&#x8F66;&#x7684;&#x9884;&#x6D4B;&#x3002;</p>
<p><img src="../images/a86a2edbb89014e193ab613a162cff58.png" alt=""></p>
<p>&#x5B9E;&#x8DF5;&#x4E2D;&#x5F53;&#x4F60;&#x8FD0;&#x884C;&#x5BF9;&#x8C61;&#x5206;&#x7C7B;&#x548C;&#x5B9A;&#x4F4D;&#x7B97;&#x6CD5;&#x65F6;&#xFF0C;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x683C;&#x5B50;&#x90FD;&#x8FD0;&#x884C;&#x4E00;&#x6B21;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x683C;&#x5B50;&#xFF08;&#x7F16;&#x53F7;1&#xFF09;&#x53EF;&#x80FD;&#x4F1A;&#x8BA4;&#x4E3A;&#x8FD9;&#x8F86;&#x8F66;&#x4E2D;&#x70B9;&#x5E94;&#x8BE5;&#x5728;&#x683C;&#x5B50;&#x5185;&#x90E8;&#xFF0C;&#x8FD9;&#x51E0;&#x4E2A;&#x683C;&#x5B50;&#xFF08;&#x7F16;&#x53F7;2&#x3001;3&#xFF09;&#x4E5F;&#x4F1A;&#x8FD9;&#x4E48;&#x8BA4;&#x4E3A;&#x3002;&#x5BF9;&#x4E8E;&#x5DE6;&#x8FB9;&#x7684;&#x8F66;&#x5B50;&#x4E5F;&#x4E00;&#x6837;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x8FD9;&#x4E2A;&#x683C;&#x5B50;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x662F;&#x4F60;&#x4EEC;&#x4EE5;&#x524D;&#x89C1;&#x8FC7;&#x7684;&#x56FE;&#x50CF;&#xFF0C;&#x4E0D;&#x4EC5;&#x8FD9;&#x4E2A;&#x683C;&#xFF08;&#x7F16;&#x53F7;4&#xFF09;&#x5B50;&#x4F1A;&#x8BA4;&#x4E3A;&#x5B83;&#x91CC;&#x9762;&#x6709;&#x8F66;&#xFF0C;&#x4E5F;&#x8BB8;&#x8FD9;&#x4E2A;&#x683C;&#x5B50;&#xFF08;&#x7F16;&#x53F7;5&#xFF09;&#x548C;&#x8FD9;&#x4E2A;&#x683C;&#x5B50;&#xFF08;&#x7F16;&#x53F7;6&#xFF09;&#x4E5F;&#x4F1A;&#xFF0C;&#x4E5F;&#x8BB8;&#x5176;&#x4ED6;&#x683C;&#x5B50;&#x4E5F;&#x4F1A;&#x8FD9;&#x4E48;&#x8BA4;&#x4E3A;&#xFF0C;&#x89C9;&#x5F97;&#x5B83;&#x4EEC;&#x683C;&#x5B50;&#x5185;&#x6709;&#x8F66;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5206;&#x6B65;&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B;&#x975E;&#x6781;&#x5927;&#x6291;&#x5236;&#x662F;&#x600E;&#x4E48;&#x8D77;&#x6548;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x8981;&#x5728;361&#x4E2A;&#x683C;&#x5B50;&#x4E0A;&#x90FD;&#x8FD0;&#x884C;&#x4E00;&#x6B21;&#x56FE;&#x50CF;&#x68C0;&#x6D4B;&#x548C;&#x5B9A;&#x4F4D;&#x7B97;&#x6CD5;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x80FD;&#x5F88;&#x591A;&#x683C;&#x5B50;&#x90FD;&#x4F1A;&#x4E3E;&#x624B;&#x8BF4;&#x6211;&#x7684;$p_{c}$&#xFF0C;&#x6211;&#x8FD9;&#x4E2A;&#x683C;&#x5B50;&#x91CC;&#x6709;&#x8F66;&#x7684;&#x6982;&#x7387;&#x5F88;&#x9AD8;&#xFF0C;&#x800C;&#x4E0D;&#x662F;361&#x4E2A;&#x683C;&#x5B50;&#x4E2D;&#x4EC5;&#x6709;&#x4E24;&#x4E2A;&#x683C;&#x5B50;&#x4F1A;&#x62A5;&#x544A;&#x5B83;&#x4EEC;&#x68C0;&#x6D4B;&#x51FA;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x3002;&#x6240;&#x4EE5;&#x5F53;&#x4F60;&#x8FD0;&#x884C;&#x7B97;&#x6CD5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6700;&#x540E;&#x53EF;&#x80FD;&#x4F1A;&#x5BF9;&#x540C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x505A;&#x51FA;&#x591A;&#x6B21;&#x68C0;&#x6D4B;&#xFF0C;&#x6240;&#x4EE5;&#x975E;&#x6781;&#x5927;&#x503C;&#x6291;&#x5236;&#x505A;&#x7684;&#x5C31;&#x662F;&#x6E05;&#x7406;&#x8FD9;&#x4E9B;&#x68C0;&#x6D4B;&#x7ED3;&#x679C;&#x3002;&#x8FD9;&#x6837;&#x4E00;&#x8F86;&#x8F66;&#x53EA;&#x68C0;&#x6D4B;&#x4E00;&#x6B21;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6BCF;&#x8F86;&#x8F66;&#x90FD;&#x89E6;&#x53D1;&#x591A;&#x6B21;&#x68C0;&#x6D4B;&#x3002;</p>
<p><img src="../images/78f2b2a2efdbd6aebe034ce30cda440b.png" alt=""></p>
<p>&#x6240;&#x4EE5;&#x5177;&#x4F53;&#x4E0A;&#xFF0C;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x505A;&#x7684;&#x662F;&#xFF0C;&#x9996;&#x5148;&#x770B;&#x770B;&#x6BCF;&#x6B21;&#x62A5;&#x544A;&#x6BCF;&#x4E2A;&#x68C0;&#x6D4B;&#x7ED3;&#x679C;&#x76F8;&#x5173;&#x7684;&#x6982;&#x7387;$p<em>{c}$&#xFF0C;&#x5728;&#x672C;&#x5468;&#x7684;&#x7F16;&#x7A0B;&#x7EC3;&#x4E60;&#x4E2D;&#x6709;&#x66F4;&#x591A;&#x7EC6;&#x8282;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x662F;$p</em>{c}$&#x4E58;&#x4EE5;$c<em>{1}$&#x3001;$c</em>{2}$&#x6216;$c<em>{3}$&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5C31;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E2A;$p</em>{c}$&#x68C0;&#x6D4B;&#x6982;&#x7387;&#xFF0C;&#x9996;&#x5148;&#x770B;&#x6982;&#x7387;&#x6700;&#x5927;&#x7684;&#x90A3;&#x4E2A;&#xFF0C;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#xFF08;&#x53F3;&#x8FB9;&#x8F66;&#x8F86;&#xFF09;&#x4E2D;&#x662F;0.9&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x8BF4;&#x8FD9;&#x662F;&#x6700;&#x53EF;&#x9760;&#x7684;&#x68C0;&#x6D4B;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5C31;&#x7528;&#x9AD8;&#x4EAE;&#x6807;&#x8BB0;&#xFF0C;&#x5C31;&#x8BF4;&#x6211;&#x8FD9;&#x91CC;&#x627E;&#x5230;&#x4E86;&#x4E00;&#x8F86;&#x8F66;&#x3002;&#x8FD9;&#x4E48;&#x505A;&#x4E4B;&#x540E;&#xFF0C;&#x975E;&#x6781;&#x5927;&#x503C;&#x6291;&#x5236;&#x5C31;&#x4F1A;&#x9010;&#x4E00;&#x5BA1;&#x89C6;&#x5269;&#x4E0B;&#x7684;&#x77E9;&#x5F62;&#xFF0C;&#x6240;&#x6709;&#x548C;&#x8FD9;&#x4E2A;&#x6700;&#x5927;&#x7684;&#x8FB9;&#x6846;&#x6709;&#x5F88;&#x9AD8;&#x4EA4;&#x5E76;&#x6BD4;&#xFF0C;&#x9AD8;&#x5EA6;&#x91CD;&#x53E0;&#x7684;&#x5176;&#x4ED6;&#x8FB9;&#x754C;&#x6846;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E9B;&#x8F93;&#x51FA;&#x5C31;&#x4F1A;&#x88AB;&#x6291;&#x5236;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x4E24;&#x4E2A;&#x77E9;&#x5F62;$p_{c}$&#x5206;&#x522B;&#x662F;0.6&#x548C;0.7&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x77E9;&#x5F62;&#x548C;&#x6DE1;&#x84DD;&#x8272;&#x77E9;&#x5F62;&#x91CD;&#x53E0;&#x7A0B;&#x5EA6;&#x5F88;&#x9AD8;&#xFF0C;&#x6240;&#x4EE5;&#x4F1A;&#x88AB;&#x6291;&#x5236;&#xFF0C;&#x53D8;&#x6697;&#xFF0C;&#x8868;&#x793A;&#x5B83;&#x4EEC;&#x88AB;&#x6291;&#x5236;&#x4E86;&#x3002;</p>
<p><img src="../images/074beeacfd9d400fc580171b09a6f3e9.png" alt=""></p>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x9010;&#x4E00;&#x5BA1;&#x89C6;&#x5269;&#x4E0B;&#x7684;&#x77E9;&#x5F62;&#xFF0C;&#x627E;&#x51FA;&#x6982;&#x7387;&#x6700;&#x9AD8;&#xFF0C;$p_{c}$&#x6700;&#x9AD8;&#x7684;&#x4E00;&#x4E2A;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x662F;0.8&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x8BA4;&#x4E3A;&#x8FD9;&#x91CC;&#x68C0;&#x6D4B;&#x51FA;&#x4E00;&#x8F86;&#x8F66;&#xFF08;&#x5DE6;&#x8FB9;&#x8F66;&#x8F86;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x975E;&#x6781;&#x5927;&#x503C;&#x6291;&#x5236;&#x7B97;&#x6CD5;&#x5C31;&#x4F1A;&#x53BB;&#x6389;&#x5176;&#x4ED6;<strong>loU</strong>&#x503C;&#x5F88;&#x9AD8;&#x7684;&#x77E9;&#x5F62;&#x3002;&#x6240;&#x4EE5;&#x73B0;&#x5728;&#x6BCF;&#x4E2A;&#x77E9;&#x5F62;&#x90FD;&#x4F1A;&#x88AB;&#x9AD8;&#x4EAE;&#x663E;&#x793A;&#x6216;&#x8005;&#x53D8;&#x6697;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x76F4;&#x63A5;&#x629B;&#x5F03;&#x53D8;&#x6697;&#x7684;&#x77E9;&#x5F62;&#xFF0C;&#x90A3;&#x5C31;&#x5269;&#x4E0B;&#x9AD8;&#x4EAE;&#x663E;&#x793A;&#x7684;&#x90A3;&#x4E9B;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6700;&#x540E;&#x5F97;&#x5230;&#x7684;&#x4E24;&#x4E2A;&#x9884;&#x6D4B;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x8FD9;&#x5C31;&#x662F;&#x975E;&#x6781;&#x5927;&#x503C;&#x6291;&#x5236;&#xFF0C;&#x975E;&#x6700;&#x5927;&#x503C;&#x610F;&#x5473;&#x7740;&#x4F60;&#x53EA;&#x8F93;&#x51FA;&#x6982;&#x7387;&#x6700;&#x5927;&#x7684;&#x5206;&#x7C7B;&#x7ED3;&#x679C;&#xFF0C;&#x4F46;&#x6291;&#x5236;&#x5F88;&#x63A5;&#x8FD1;&#xFF0C;&#x4F46;&#x4E0D;&#x662F;&#x6700;&#x5927;&#x7684;&#x5176;&#x4ED6;&#x9884;&#x6D4B;&#x7ED3;&#x679C;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x65B9;&#x6CD5;&#x53EB;&#x505A;&#x975E;&#x6781;&#x5927;&#x503C;&#x6291;&#x5236;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;&#x7B97;&#x6CD5;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x9996;&#x5148;&#x8FD9;&#x4E2A;19&#xD7;19&#x7F51;&#x683C;&#x4E0A;&#x6267;&#x884C;&#x4E00;&#x4E0B;&#x7B97;&#x6CD5;&#xFF0C;&#x4F60;&#x4F1A;&#x5F97;&#x5230;19&#xD7;19&#xD7;8&#x7684;&#x8F93;&#x51FA;&#x5C3A;&#x5BF8;&#x3002;&#x4E0D;&#x8FC7;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x7B80;&#x5316;&#x4E00;&#x4E0B;&#xFF0C;&#x5C31;&#x8BF4;&#x4F60;&#x53EA;&#x505A;&#x6C7D;&#x8F66;&#x68C0;&#x6D4B;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53BB;&#x6389;$c<em>{1}$&#x3001;$c</em>{2}$&#x548C;$c<em>{3}$&#xFF0C;&#x7136;&#x540E;&#x5047;&#x8BBE;&#x8FD9;&#x6761;&#x7EBF;&#x5BF9;&#x4E8E;19&#xD7;19&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x8F93;&#x51FA;&#xFF0C;&#x5BF9;&#x4E8E;361&#x4E2A;&#x683C;&#x5B50;&#x7684;&#x6BCF;&#x4E2A;&#x8F93;&#x51FA;&#xFF0C;&#x4F60;&#x4F1A;&#x5F97;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x8F93;&#x51FA;&#x9884;&#x6D4B;&#xFF0C;&#x5C31;&#x662F;&#x683C;&#x5B50;&#x4E2D;&#x6709;&#x5BF9;&#x8C61;&#x7684;&#x6982;&#x7387;&#xFF08;$p</em>{c}$&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x662F;&#x8FB9;&#x754C;&#x6846;&#x53C2;&#x6570;&#xFF08;$b<em>{x}$&#x3001;$b</em>{y}$&#x3001;$b<em>{h}$&#x548C;$b</em>{w}$&#xFF09;&#x3002;&#x5982;&#x679C;&#x4F60;&#x53EA;&#x68C0;&#x6D4B;&#x4E00;&#x79CD;&#x5BF9;&#x8C61;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x6CA1;&#x6709;$c<em>{1}$&#x3001;$c</em>{2}$&#x548C;$c_{3}$&#x8FD9;&#x4E9B;&#x9884;&#x6D4B;&#x5206;&#x91CF;&#x3002;&#x591A;&#x4E2A;&#x5BF9;&#x8C61;&#x5904;&#x4E8E;&#x540C;&#x4E00;&#x4E2A;&#x683C;&#x5B50;&#x4E2D;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x6211;&#x4F1A;&#x653E;&#x5230;&#x7F16;&#x7A0B;&#x7EC3;&#x4E60;&#x4E2D;&#xFF0C;&#x4F60;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x672C;&#x5468;&#x672B;&#x4E4B;&#x524D;&#x505A;&#x505A;&#x3002;</p>
<p><img src="../images/514cfeb2d7315eba2b6a29f68eae2879.png" alt=""></p>
<p>&#x73B0;&#x5728;&#x8981;&#x5B9E;&#x73B0;&#x975E;&#x6781;&#x5927;&#x503C;&#x6291;&#x5236;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x505A;&#x7684;&#x7B2C;&#x4E00;&#x4EF6;&#x4E8B;&#x662F;&#xFF0C;&#x53BB;&#x6389;&#x6240;&#x6709;&#x8FB9;&#x754C;&#x6846;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x5C06;&#x6240;&#x6709;&#x7684;&#x9884;&#x6D4B;&#x503C;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x8FB9;&#x754C;&#x6846;$p<em>{c}$&#x5C0F;&#x4E8E;&#x6216;&#x7B49;&#x4E8E;&#x67D0;&#x4E2A;&#x9608;&#x503C;&#xFF0C;&#x6BD4;&#x5982;$p</em>{c}&#x2264;0.6$&#x7684;&#x8FB9;&#x754C;&#x6846;&#x53BB;&#x6389;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5C31;&#x8FD9;&#x6837;&#x8BF4;&#xFF0C;&#x9664;&#x975E;&#x7B97;&#x6CD5;&#x8BA4;&#x4E3A;&#x8FD9;&#x91CC;&#x5B58;&#x5728;&#x5BF9;&#x8C61;&#x7684;&#x6982;&#x7387;&#x81F3;&#x5C11;&#x6709;0.6&#xFF0C;&#x5426;&#x5219;&#x5C31;&#x629B;&#x5F03;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x5C31;&#x629B;&#x5F03;&#x4E86;&#x6240;&#x6709;&#x6982;&#x7387;&#x6BD4;&#x8F83;&#x4F4E;&#x7684;&#x8F93;&#x51FA;&#x8FB9;&#x754C;&#x6846;&#x3002;&#x6240;&#x4EE5;&#x601D;&#x8DEF;&#x662F;&#x5BF9;&#x4E8E;&#x8FD9;361&#x4E2A;&#x4F4D;&#x7F6E;&#xFF0C;&#x4F60;&#x8F93;&#x51FA;&#x4E00;&#x4E2A;&#x8FB9;&#x754C;&#x6846;&#xFF0C;&#x8FD8;&#x6709;&#x90A3;&#x4E2A;&#x6700;&#x597D;&#x8FB9;&#x754C;&#x6846;&#x6240;&#x5BF9;&#x5E94;&#x7684;&#x6982;&#x7387;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x53EA;&#x662F;&#x629B;&#x5F03;&#x6240;&#x6709;&#x4F4E;&#x6982;&#x7387;&#x7684;&#x8FB9;&#x754C;&#x6846;&#x3002;</p>
<p><img src="../images/6d0fa2073b280cd0bb111485ee1639e5.png" alt=""></p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x5269;&#x4E0B;&#x7684;&#x8FB9;&#x754C;&#x6846;&#xFF0C;&#x6CA1;&#x6709;&#x629B;&#x5F03;&#x6CA1;&#x6709;&#x5904;&#x7406;&#x8FC7;&#x7684;&#xFF0C;&#x4F60;&#x5C31;&#x4E00;&#x76F4;&#x9009;&#x62E9;&#x6982;&#x7387;$p_{c}$&#x6700;&#x9AD8;&#x7684;&#x8FB9;&#x754C;&#x6846;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x5B83;&#x8F93;&#x51FA;&#x6210;&#x9884;&#x6D4B;&#x7ED3;&#x679C;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x5C31;&#x662F;&#x4E0A;&#x4E00;&#x5F20;&#x5E7B;&#x706F;&#x7247;&#xFF0C;&#x53D6;&#x4E00;&#x4E2A;&#x8FB9;&#x754C;&#x6846;&#xFF0C;&#x8BA9;&#x5B83;&#x9AD8;&#x4EAE;&#x663E;&#x793A;&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;&#x8F93;&#x51FA;&#x505A;&#x51FA;&#x6709;&#x4E00;&#x8F86;&#x8F66;&#x7684;&#x9884;&#x6D4B;&#x3002;</p>
<p><img src="../images/549430cf442163c7f44ae648e625ca10.png" alt=""></p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x53BB;&#x6389;&#x6240;&#x6709;&#x5269;&#x4E0B;&#x7684;&#x8FB9;&#x754C;&#x6846;&#xFF0C;&#x4EFB;&#x4F55;&#x6CA1;&#x6709;&#x8FBE;&#x5230;&#x8F93;&#x51FA;&#x6807;&#x51C6;&#x7684;&#x8FB9;&#x754C;&#x6846;&#xFF0C;&#x4E4B;&#x524D;&#x6CA1;&#x6709;&#x629B;&#x5F03;&#x7684;&#x8FB9;&#x754C;&#x6846;&#xFF0C;&#x628A;&#x8FD9;&#x4E9B;&#x548C;&#x8F93;&#x51FA;&#x8FB9;&#x754C;&#x6846;&#x6709;&#x9AD8;&#x91CD;&#x53E0;&#x9762;&#x79EF;&#x548C;&#x4E0A;&#x4E00;&#x6B65;&#x8F93;&#x51FA;&#x8FB9;&#x754C;&#x6846;&#x6709;&#x5F88;&#x9AD8;&#x4EA4;&#x5E76;&#x6BD4;&#x7684;&#x8FB9;&#x754C;&#x6846;&#x5168;&#x90E8;&#x629B;&#x5F03;&#x3002;&#x6240;&#x4EE5;<strong>while</strong>&#x5FAA;&#x73AF;&#x7684;&#x7B2C;&#x4E8C;&#x6B65;&#x662F;&#x4E0A;&#x4E00;&#x5F20;&#x5E7B;&#x706F;&#x7247;&#x53D8;&#x6697;&#x7684;&#x90A3;&#x4E9B;&#x8FB9;&#x754C;&#x6846;&#xFF0C;&#x548C;&#x9AD8;&#x4EAE;&#x6807;&#x8BB0;&#x7684;&#x8FB9;&#x754C;&#x91CD;&#x53E0;&#x9762;&#x79EF;&#x5F88;&#x9AD8;&#x7684;&#x90A3;&#x4E9B;&#x8FB9;&#x754C;&#x6846;&#x629B;&#x5F03;&#x6389;&#x3002;&#x5728;&#x8FD8;&#x6709;&#x5269;&#x4E0B;&#x8FB9;&#x754C;&#x6846;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E00;&#x76F4;&#x8FD9;&#x4E48;&#x505A;&#xFF0C;&#x628A;&#x6CA1;&#x5904;&#x7406;&#x7684;&#x90FD;&#x5904;&#x7406;&#x5B8C;&#xFF0C;&#x76F4;&#x5230;&#x6BCF;&#x4E2A;&#x8FB9;&#x754C;&#x6846;&#x90FD;&#x5224;&#x65AD;&#x8FC7;&#x4E86;&#xFF0C;&#x5B83;&#x4EEC;&#x6709;&#x7684;&#x4F5C;&#x4E3A;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#xFF0C;&#x5269;&#x4E0B;&#x7684;&#x4F1A;&#x88AB;&#x629B;&#x5F03;&#xFF0C;&#x5B83;&#x4EEC;&#x548C;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x91CD;&#x53E0;&#x9762;&#x79EF;&#x592A;&#x9AD8;&#xFF0C;&#x548C;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x4EA4;&#x5E76;&#x6BD4;&#x592A;&#x9AD8;&#xFF0C;&#x548C;&#x4F60;&#x521A;&#x521A;&#x8F93;&#x51FA;&#x8FD9;&#x91CC;&#x5B58;&#x5728;&#x5BF9;&#x8C61;&#x7ED3;&#x679C;&#x7684;&#x91CD;&#x53E0;&#x7A0B;&#x5EA6;&#x8FC7;&#x9AD8;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x5F20;&#x5E7B;&#x706F;&#x7247;&#x4E2D;&#xFF0C;&#x6211;&#x53EA;&#x4ECB;&#x7ECD;&#x4E86;&#x7B97;&#x6CD5;&#x68C0;&#x6D4B;&#x5355;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5C1D;&#x8BD5;&#x540C;&#x65F6;&#x68C0;&#x6D4B;&#x4E09;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x884C;&#x4EBA;&#x3001;&#x6C7D;&#x8F66;&#x3001;&#x6469;&#x6258;&#xFF0C;&#x90A3;&#x4E48;&#x8F93;&#x51FA;&#x5411;&#x91CF;&#x5C31;&#x4F1A;&#x6709;&#x4E09;&#x4E2A;&#x989D;&#x5916;&#x7684;&#x5206;&#x91CF;&#x3002;&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#xFF0C;&#x6B63;&#x786E;&#x7684;&#x505A;&#x6CD5;&#x662F;&#x72EC;&#x7ACB;&#x8FDB;&#x884C;&#x4E09;&#x6B21;&#x975E;&#x6781;&#x5927;&#x503C;&#x6291;&#x5236;&#xFF0C;&#x5BF9;&#x6BCF;&#x4E2A;&#x8F93;&#x51FA;&#x7C7B;&#x522B;&#x90FD;&#x505A;&#x4E00;&#x6B21;&#xFF0C;&#x4F46;&#x8FD9;&#x4E2A;&#x7EC6;&#x8282;&#x5C31;&#x7559;&#x7ED9;&#x672C;&#x5468;&#x7684;&#x7F16;&#x7A0B;&#x7EC3;&#x4E60;&#x5427;&#xFF0C;&#x5176;&#x4E2D;&#x4F60;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x5C1D;&#x8BD5;&#x5B9E;&#x73B0;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x8BD5;&#x8BD5;&#x5728;&#x591A;&#x4E2A;&#x5BF9;&#x8C61;&#x7C7B;&#x522B;&#x68C0;&#x6D4B;&#x65F6;&#x505A;&#x975E;&#x6781;&#x5927;&#x503C;&#x6291;&#x5236;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x975E;&#x6781;&#x5927;&#x503C;&#x6291;&#x5236;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x80FD;&#x5B9E;&#x73B0;&#x6211;&#x4EEC;&#x8BF4;&#x8FC7;&#x7684;&#x5BF9;&#x8C61;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;&#xFF0C;&#x4F60;&#x5176;&#x5B9E;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x76F8;&#x5F53;&#x4E0D;&#x9519;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x4F46;&#x7ED3;&#x675F;&#x6211;&#x4EEC;&#x5BF9;<strong>YOLO</strong>&#x7B97;&#x6CD5;&#x7684;&#x4ECB;&#x7ECD;&#x4E4B;&#x524D;&#xFF0C;&#x6700;&#x540E;&#x6211;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x7EC6;&#x8282;&#x60F3;&#x7ED9;&#x5927;&#x5BB6;&#x5206;&#x4EAB;&#xFF0C;&#x53EF;&#x4EE5;&#x8FDB;&#x4E00;&#x6B65;&#x6539;&#x5584;&#x7B97;&#x6CD5;&#x6548;&#x679C;&#xFF0C;&#x5C31;&#x662F;anchor box&#x7684;&#x601D;&#x8DEF;&#xFF0C;&#x6211;&#x4EEC;&#x4E0B;&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#x518D;&#x4ECB;&#x7ECD;&#x3002;</p>
<h3 id="38-anchor-boxes">3.8 Anchor Boxes</h3>
<p>&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x5BF9;&#x8C61;&#x68C0;&#x6D4B;&#x4E2D;&#x5B58;&#x5728;&#x7684;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#x6BCF;&#x4E2A;&#x683C;&#x5B50;&#x53EA;&#x80FD;&#x68C0;&#x6D4B;&#x51FA;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8BA9;&#x4E00;&#x4E2A;&#x683C;&#x5B50;&#x68C0;&#x6D4B;&#x51FA;&#x591A;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8FD9;&#x4E48;&#x505A;&#xFF0C;&#x5C31;&#x662F;&#x4F7F;&#x7528;<strong>anchor box</strong>&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#xFF0C;&#x6211;&#x4EEC;&#x4ECE;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x5F00;&#x59CB;&#x8BB2;&#x5427;&#x3002;</p>
<p><img src="../images/49b7d68a17e89dd109f96efecc223f5a.png" alt=""></p>
<p>&#x5047;&#x8BBE;&#x4F60;&#x6709;&#x8FD9;&#x6837;&#x4E00;&#x5F20;&#x56FE;&#x7247;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x6211;&#x4EEC;&#x7EE7;&#x7EED;&#x4F7F;&#x7528;3&#xD7;3&#x7F51;&#x683C;&#xFF0C;&#x6CE8;&#x610F;&#x884C;&#x4EBA;&#x7684;&#x4E2D;&#x70B9;&#x548C;&#x6C7D;&#x8F66;&#x7684;&#x4E2D;&#x70B9;&#x51E0;&#x4E4E;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#xFF0C;&#x4E24;&#x8005;&#x90FD;&#x843D;&#x5165;&#x5230;&#x540C;&#x4E00;&#x4E2A;&#x683C;&#x5B50;&#x4E2D;&#x3002;&#x6240;&#x4EE5;&#x5BF9;&#x4E8E;&#x90A3;&#x4E2A;&#x683C;&#x5B50;&#xFF0C;&#x5982;&#x679C; $y$ &#x8F93;&#x51FA;&#x8FD9;&#x4E2A;&#x5411;&#x91CF;$y= \ \begin{bmatrix} p<em>{c} \ b</em>{x} \ b<em>{y} \ b</em>{h} \ b<em>{w} \ c</em>{1} \ c<em>{2}\ c</em>{3} \\end{bmatrix}$&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x68C0;&#x6D4B;&#x8FD9;&#x4E09;&#x4E2A;&#x7C7B;&#x522B;&#xFF0C;&#x884C;&#x4EBA;&#x3001;&#x6C7D;&#x8F66;&#x548C;&#x6469;&#x6258;&#x8F66;&#xFF0C;&#x5B83;&#x5C06;&#x65E0;&#x6CD5;&#x8F93;&#x51FA;&#x68C0;&#x6D4B;&#x7ED3;&#x679C;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x5FC5;&#x987B;&#x4ECE;&#x4E24;&#x4E2A;&#x68C0;&#x6D4B;&#x7ED3;&#x679C;&#x4E2D;&#x9009;&#x4E00;&#x4E2A;&#x3002; </p>
<p><img src="../images/e001f5f3d2afa76a1c3710bd60bcad00.png" alt=""></p>
<p>&#x800C;<strong>anchor box</strong>&#x7684;&#x601D;&#x8DEF;&#x662F;&#xFF0C;&#x8FD9;&#x6837;&#x5B50;&#xFF0C;&#x9884;&#x5148;&#x5B9A;&#x4E49;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x5F62;&#x72B6;&#x7684;<strong>anchor box</strong>&#xFF0C;&#x6216;&#x8005;<strong>anchor box</strong>&#x5F62;&#x72B6;&#xFF0C;&#x4F60;&#x8981;&#x505A;&#x7684;&#x662F;&#x628A;&#x9884;&#x6D4B;&#x7ED3;&#x679C;&#x548C;&#x8FD9;&#x4E24;&#x4E2A;<strong>anchor box</strong>&#x5173;&#x8054;&#x8D77;&#x6765;&#x3002;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x7528;&#x66F4;&#x591A;&#x7684;<strong>anchor box</strong>&#xFF0C;&#x53EF;&#x80FD;&#x8981;5&#x4E2A;&#x751A;&#x81F3;&#x66F4;&#x591A;&#xFF0C;&#x4F46;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x89C6;&#x9891;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x7528;&#x4E24;&#x4E2A;<strong>anchor box</strong>&#xFF0C;&#x8FD9;&#x6837;&#x4ECB;&#x7ECD;&#x8D77;&#x6765;&#x7B80;&#x5355;&#x4E00;&#x4E9B;&#x3002;</p>
<p><img src="../images/2e357b5b92122660c550dcfb0901519c.png" alt=""></p>
<p>&#x4F60;&#x8981;&#x505A;&#x7684;&#x662F;&#x5B9A;&#x4E49;&#x7C7B;&#x522B;&#x6807;&#x7B7E;&#xFF0C;&#x7528;&#x7684;&#x5411;&#x91CF;&#x4E0D;&#x518D;&#x662F;&#x4E0A;&#x9762;&#x8FD9;&#x4E2A;$\begin{bmatrix} p<em>{c} &amp; b</em>{x} &amp;b<em>{y} &amp; b</em>{h} &amp; b<em>{w} &amp; c</em>{1} &amp; c<em>{2} &amp; c</em>{3} \\end{bmatrix}^{T}$&#xFF0C;&#x800C;&#x662F;&#x91CD;&#x590D;&#x4E24;&#x6B21;&#xFF0C;$y=  \begin{bmatrix} p<em>{c} &amp; b</em>{x} &amp; b<em>{y} &amp;b</em>{h} &amp; b<em>{w} &amp; c</em>{1} &amp; c<em>{2} &amp; c</em>{3} &amp; p<em>{c} &amp; b</em>{x} &amp; b<em>{y} &amp; b</em>{h} &amp; b<em>{w} &amp;c</em>{1} &amp; c<em>{2} &amp; c</em>{3} \\end{bmatrix}^{T}$&#xFF0C;&#x524D;&#x9762;&#x7684;$p<em>{c},b</em>{x},b<em>{y},b</em>{h},b<em>{w},c</em>{1},c<em>{2},c</em>{3}$&#xFF08;&#x7EFF;&#x8272;&#x65B9;&#x6846;&#x6807;&#x8BB0;&#x7684;&#x53C2;&#x6570;&#xFF09;&#x662F;&#x548C;<strong>anchor box 1</strong>&#x5173;&#x8054;&#x7684;8&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x540E;&#x9762;&#x7684;8&#x4E2A;&#x53C2;&#x6570;&#xFF08;&#x6A59;&#x8272;&#x65B9;&#x6846;&#x6807;&#x8BB0;&#x7684;&#x5143;&#x7D20;&#xFF09;&#x662F;&#x548C;<strong>anchor box 2</strong>&#x76F8;&#x5173;&#x8054;&#x3002;&#x56E0;&#x4E3A;&#x884C;&#x4EBA;&#x7684;&#x5F62;&#x72B6;&#x66F4;&#x7C7B;&#x4F3C;&#x4E8E;<strong>anchor box 1</strong>&#x7684;&#x5F62;&#x72B6;&#xFF0C;&#x800C;&#x4E0D;&#x662F;<strong>anchor box 2</strong>&#x7684;&#x5F62;&#x72B6;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x8FD9;8&#x4E2A;&#x6570;&#x503C;&#xFF08;&#x524D;8&#x4E2A;&#x53C2;&#x6570;&#xFF09;&#xFF0C;&#x8FD9;&#x4E48;&#x7F16;&#x7801;$p<em>{c} =1$&#xFF0C;&#x662F;&#x7684;&#xFF0C;&#x4EE3;&#x8868;&#x6709;&#x4E2A;&#x884C;&#x4EBA;&#xFF0C;&#x7528;$b</em>{x},b<em>{y},b</em>{h}$&#x548C;$b<em>{w}$&#x6765;&#x7F16;&#x7801;&#x5305;&#x4F4F;&#x884C;&#x4EBA;&#x7684;&#x8FB9;&#x754C;&#x6846;&#xFF0C;&#x7136;&#x540E;&#x7528;$c</em>{1},c<em>{2},c</em>{3}$($c<em>{1}= 1,c</em>{2} = 0,c_{3} = 0$)&#x6765;&#x8BF4;&#x660E;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x662F;&#x4E2A;&#x884C;&#x4EBA;&#x3002;</p>
<p>&#x7136;&#x540E;&#x662F;&#x8F66;&#x5B50;&#xFF0C;&#x56E0;&#x4E3A;&#x8F66;&#x5B50;&#x7684;&#x8FB9;&#x754C;&#x6846;&#x6BD4;&#x8D77;<strong>anchor box 1</strong>&#x66F4;&#x50CF;<strong>anchor box 2</strong>&#x7684;&#x5F62;&#x72B6;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x8FD9;&#x4E48;&#x7F16;&#x7801;&#xFF0C;&#x8FD9;&#x91CC;&#x7B2C;&#x4E8C;&#x4E2A;&#x5BF9;&#x8C61;&#x662F;&#x6C7D;&#x8F66;&#xFF0C;&#x7136;&#x540E;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x8FB9;&#x754C;&#x6846;&#x7B49;&#x7B49;&#xFF0C;&#x8FD9;&#x91CC;&#x6240;&#x6709;&#x53C2;&#x6570;&#x90FD;&#x548C;&#x68C0;&#x6D4B;&#x6C7D;&#x8F66;&#x76F8;&#x5173;($p<em>{c}= 1,b</em>{x},b<em>{y},b</em>{h},b<em>{w},c</em>{1} = 0,c<em>{2} = 1,c</em>{3} = 0$)&#x3002;</p>
<p><img src="../images/e94aa7ea75300ea4692682b179834bb4.png" alt=""></p>
<p>&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#xFF0C;&#x7528;<strong>anchor box</strong>&#x4E4B;&#x524D;&#xFF0C;&#x4F60;&#x505A;&#x7684;&#x662F;&#x8FD9;&#x4E2A;&#xFF0C;&#x5BF9;&#x4E8E;&#x8BAD;&#x7EC3;&#x96C6;&#x56FE;&#x50CF;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x90FD;&#x6839;&#x636E;&#x90A3;&#x4E2A;&#x5BF9;&#x8C61;&#x4E2D;&#x70B9;&#x4F4D;&#x7F6E;&#x5206;&#x914D;&#x5230;&#x5BF9;&#x5E94;&#x7684;&#x683C;&#x5B50;&#x4E2D;&#xFF0C;&#x6240;&#x4EE5;&#x8F93;&#x51FA;$y$&#x5C31;&#x662F;3&#xD7;3&#xD7;8&#xFF0C;&#x56E0;&#x4E3A;&#x662F;3&#xD7;3&#x7F51;&#x683C;&#xFF0C;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x7F51;&#x683C;&#x4F4D;&#x7F6E;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x8F93;&#x51FA;&#x5411;&#x91CF;&#xFF0C;&#x5305;&#x542B;$p<em>{c}$&#xFF0C;&#x7136;&#x540E;&#x8FB9;&#x754C;&#x6846;&#x53C2;&#x6570;$b</em>{x},b<em>{y},b</em>{h}$&#x548C;$b<em>{w}$&#xFF0C;&#x7136;&#x540E;$c</em>{1},c<em>{2},c</em>{3}$&#x3002;</p>
<p>&#x73B0;&#x5728;&#x7528;&#x5230;<strong>anchor box</strong>&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#xFF0C;&#x662F;&#x8FD9;&#x4E48;&#x505A;&#x7684;&#x3002;&#x73B0;&#x5728;&#x6BCF;&#x4E2A;&#x5BF9;&#x8C61;&#x90FD;&#x548C;&#x4E4B;&#x524D;&#x4E00;&#x6837;&#x5206;&#x914D;&#x5230;&#x540C;&#x4E00;&#x4E2A;&#x683C;&#x5B50;&#x4E2D;&#xFF0C;&#x5206;&#x914D;&#x5230;&#x5BF9;&#x8C61;&#x4E2D;&#x70B9;&#x6240;&#x5728;&#x7684;&#x683C;&#x5B50;&#x4E2D;&#xFF0C;&#x4EE5;&#x53CA;&#x5206;&#x914D;&#x5230;&#x548C;&#x5BF9;&#x8C61;&#x5F62;&#x72B6;&#x4EA4;&#x5E76;&#x6BD4;&#x6700;&#x9AD8;&#x7684;<strong>anchor box</strong>&#x4E2D;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x6709;&#x4E24;&#x4E2A;<strong>anchor box</strong>&#xFF0C;&#x4F60;&#x5C31;&#x53D6;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7684;&#x5BF9;&#x8C61;&#x5F62;&#x72B6;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF08;&#x7F16;&#x53F7;1&#xFF0C;&#x7EA2;&#x8272;&#x6846;&#xFF09;&#xFF0C;&#x4F60;&#x5C31;&#x770B;&#x770B;&#x8FD9;&#x4E24;&#x4E2A;<strong>anchor box</strong>&#xFF0C;<strong>anchor box 1</strong>&#x5F62;&#x72B6;&#x662F;&#x8FD9;&#x6837;&#xFF08;&#x7F16;&#x53F7;2&#xFF0C;&#x7D2B;&#x8272;&#x6846;&#xFF09;&#xFF0C;<strong>anchor box 2</strong>&#x5F62;&#x72B6;&#x662F;&#x8FD9;&#x6837;&#xFF08;&#x7F16;&#x53F7;3&#xFF0C;&#x7D2B;&#x8272;&#x6846;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x89C2;&#x5BDF;&#x54EA;&#x4E00;&#x4E2A;<strong>anchor box</strong>&#x548C;&#x5B9E;&#x9645;&#x8FB9;&#x754C;&#x6846;&#xFF08;&#x7F16;&#x53F7;1&#xFF0C;&#x7EA2;&#x8272;&#x6846;&#xFF09;&#x7684;&#x4EA4;&#x5E76;&#x6BD4;&#x66F4;&#x9AD8;&#xFF0C;&#x4E0D;&#x7BA1;&#x9009;&#x7684;&#x662F;&#x54EA;&#x4E00;&#x4E2A;&#xFF0C;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x4E0D;&#x53EA;&#x5206;&#x914D;&#x5230;&#x4E00;&#x4E2A;&#x683C;&#x5B50;&#xFF0C;&#x800C;&#x662F;&#x5206;&#x914D;&#x5230;&#x4E00;&#x5BF9;&#xFF0C;&#x5373;&#xFF08;<strong>grid cell&#xFF0C;anchor box</strong>&#xFF09;&#x5BF9;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x5BF9;&#x8C61;&#x5728;&#x76EE;&#x6807;&#x6807;&#x7B7E;&#x4E2D;&#x7684;&#x7F16;&#x7801;&#x65B9;&#x5F0F;&#x3002;&#x6240;&#x4EE5;&#x73B0;&#x5728;&#x8F93;&#x51FA; $y$ &#x5C31;&#x662F;3&#xD7;3&#xD7;16&#xFF0C;&#x4E0A;&#x4E00;&#x5F20;&#x5E7B;&#x706F;&#x7247;&#x4E2D;&#x4F60;&#x4EEC;&#x770B;&#x5230; $y$ &#x73B0;&#x5728;&#x662F;16&#x7EF4;&#x7684;&#xFF0C;&#x6216;&#x8005;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x770B;&#x6210;&#x662F;3&#xD7;3&#xD7;2&#xD7;8&#xFF0C;&#x56E0;&#x4E3A;&#x73B0;&#x5728;&#x8FD9;&#x91CC;&#x6709;2&#x4E2A;<strong>anchor box</strong>&#xFF0C;&#x800C; $y$ &#x662F;8&#x7EF4;&#x7684;&#x3002;$y$ &#x7EF4;&#x5EA6;&#x662F;8&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x6709;3&#x4E2A;&#x5BF9;&#x8C61;&#x7C7B;&#x522B;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;&#x66F4;&#x591A;&#x5BF9;&#x8C61;&#xFF0C;&#x90A3;&#x4E48;$y$ &#x7684;&#x7EF4;&#x5EA6;&#x4F1A;&#x66F4;&#x9AD8;&#x3002;</p>
<p><img src="../images/322b15fe615c739ebd1d36b669748618.png" alt=""></p>
<p>&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x683C;&#x5B50;&#xFF08;&#x7F16;&#x53F7;2&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x4E00;&#x4E0B;$y$:</p>
<p>$y =\begin{bmatrix} p<em>{c} &amp; b</em>{x} &amp; b<em>{y} &amp; b</em>{h} &amp; b<em>{w} &amp; c</em>{1} &amp; c<em>{2} &amp; c</em>{3} &amp;p<em>{c} &amp; b</em>{x} &amp; b<em>{y} &amp; b</em>{h} &amp; b<em>{w} &amp; c</em>{1} &amp; c<em>{2} &amp; c</em>{3} \\end{bmatrix}^{T}$&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x884C;&#x4EBA;&#x66F4;&#x7C7B;&#x4F3C;&#x4E8E;<strong>anchor box 1</strong>&#x7684;&#x5F62;&#x72B6;&#xFF0C;&#x6240;&#x4EE5;&#x5BF9;&#x4E8E;&#x884C;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5979;&#x5206;&#x914D;&#x5230;&#x5411;&#x91CF;&#x7684;&#x4E0A;&#x534A;&#x90E8;&#x5206;&#x3002;&#x662F;&#x7684;&#xFF0C;&#x8FD9;&#x91CC;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5373;$p<em>{c}= 1$&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x8FB9;&#x754C;&#x6846;&#x5305;&#x4F4F;&#x884C;&#x4EBA;&#xFF0C;&#x5982;&#x679C;&#x884C;&#x4EBA;&#x662F;&#x7C7B;&#x522B;1&#xFF0C;&#x90A3;&#x4E48; $c</em>{1} = 1,c<em>{2} = 0,c</em>{3} =0$&#xFF08;&#x7F16;&#x53F7;1&#x6240;&#x793A;&#x7684;&#x6A59;&#x8272;&#x53C2;&#x6570;&#xFF09;&#x3002;&#x8F66;&#x5B50;&#x7684;&#x5F62;&#x72B6;&#x66F4;&#x50CF;<strong>anchor box 2</strong>&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x5411;&#x91CF;&#x5269;&#x4E0B;&#x7684;&#x90E8;&#x5206;&#x662F; $p<em>{c} = 1$&#xFF0C;&#x7136;&#x540E;&#x548C;&#x8F66;&#x76F8;&#x5173;&#x7684;&#x8FB9;&#x754C;&#x6846;&#xFF0C;&#x7136;&#x540E;$c</em>{1} = 0,c<em>{2} = 1,c</em>{3} =0$&#xFF08;&#x7F16;&#x53F7;1&#x6240;&#x793A;&#x7684;&#x7EFF;&#x8272;&#x53C2;&#x6570;&#xFF09;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x5C31;&#x662F;&#x5BF9;&#x5E94;&#x4E2D;&#x4E0B;&#x683C;&#x5B50;&#x7684;&#x6807;&#x7B7E; $y$&#xFF0C;&#x8FD9;&#x4E2A;&#x7BAD;&#x5934;&#x6307;&#x5411;&#x7684;&#x683C;&#x5B50;&#xFF08;&#x7F16;&#x53F7;2&#x6240;&#x793A;&#xFF09;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x683C;&#x5B50;&#x6709;&#x8F66;&#xFF0C;&#x6CA1;&#x6709;&#x884C;&#x4EBA;&#xFF0C;&#x5982;&#x679C;&#x5B83;&#x91CC;&#x9762;&#x53EA;&#x6709;&#x4E00;&#x8F86;&#x8F66;&#xFF0C;&#x90A3;&#x4E48;&#x5047;&#x8BBE;&#x8F66;&#x5B50;&#x7684;&#x8FB9;&#x754C;&#x6846;&#x5F62;&#x72B6;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x66F4;&#x50CF;<strong>anchor</strong>
<strong>box 2</strong>&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x91CC;&#x53EA;&#x6709;&#x4E00;&#x8F86;&#x8F66;&#xFF0C;&#x884C;&#x4EBA;&#x8D70;&#x5F00;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;<strong>anchor box 2</strong>&#x5206;&#x91CF;&#x8FD8;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x8981;&#x8BB0;&#x4F4F;&#x8FD9;&#x662F;&#x5411;&#x91CF;&#x5BF9;&#x5E94;<strong>anchor box 2</strong>&#x7684;&#x5206;&#x91CF;&#x548C;<strong>anchor box 1</strong>&#x5BF9;&#x5E94;&#x7684;&#x5411;&#x91CF;&#x5206;&#x91CF;&#xFF0C;&#x4F60;&#x8981;&#x586B;&#x7684;&#x5C31;&#x662F;&#xFF0C;&#x91CC;&#x9762;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5BF9;&#x8C61;&#xFF0C;&#x6240;&#x4EE5; $p_{c} =0$&#xFF0C;&#x7136;&#x540E;&#x5269;&#x4E0B;&#x7684;&#x5C31;&#x662F;<strong>don&#x2019;t care-s</strong>(&#x5373;&#xFF1F;)&#xFF08;&#x7F16;&#x53F7;3&#x6240;&#x793A;&#xFF09;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;&#x4E24;&#x4E2A;anchor box&#xFF0C;&#x4F46;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x683C;&#x5B50;&#x4E2D;&#x6709;&#x4E09;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x7B97;&#x6CD5;&#x5904;&#x7406;&#x4E0D;&#x597D;&#xFF0C;&#x4F60;&#x5E0C;&#x671B;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x771F;&#x7684;&#x53D1;&#x751F;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x5E76;&#x6CA1;&#x6709;&#x5F88;&#x597D;&#x7684;&#x5904;&#x7406;&#x529E;&#x6CD5;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x5F15;&#x5165;&#x4E00;&#x4E9B;&#x6253;&#x7834;&#x50F5;&#x5C40;&#x7684;&#x9ED8;&#x8BA4;&#x624B;&#x6BB5;&#x3002;&#x8FD8;&#x6709;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x4E24;&#x4E2A;&#x5BF9;&#x8C61;&#x90FD;&#x5206;&#x914D;&#x5230;&#x4E00;&#x4E2A;&#x683C;&#x5B50;&#x4E2D;&#xFF0C;&#x800C;&#x4E14;&#x5B83;&#x4EEC;&#x7684;<strong>anchor box</strong>&#x5F62;&#x72B6;&#x4E5F;&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x662F;&#x7B97;&#x6CD5;&#x5904;&#x7406;&#x4E0D;&#x597D;&#x7684;&#x53E6;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x5F15;&#x5165;&#x4E00;&#x4E9B;&#x6253;&#x7834;&#x50F5;&#x5C40;&#x7684;&#x9ED8;&#x8BA4;&#x624B;&#x6BB5;&#xFF0C;&#x4E13;&#x95E8;&#x5904;&#x7406;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x5E0C;&#x671B;&#x4F60;&#x7684;&#x6570;&#x636E;&#x96C6;&#x91CC;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x5176;&#x5B9E;&#x51FA;&#x73B0;&#x7684;&#x60C5;&#x51B5;&#x4E0D;&#x591A;&#xFF0C;&#x6240;&#x4EE5;&#x5BF9;&#x6027;&#x80FD;&#x7684;&#x5F71;&#x54CD;&#x5E94;&#x8BE5;&#x4E0D;&#x4F1A;&#x5F88;&#x5927;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;<strong>anchor box</strong>&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x6211;&#x4EEC;&#x5EFA;&#x7ACB;<strong>anchor box</strong>&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#xFF0C;&#x662F;&#x4E3A;&#x4E86;&#x5904;&#x7406;&#x4E24;&#x4E2A;&#x5BF9;&#x8C61;&#x51FA;&#x73B0;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x683C;&#x5B50;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5B9E;&#x8DF5;&#x4E2D;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x5F88;&#x5C11;&#x53D1;&#x751F;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5982;&#x679C;&#x4F60;&#x7528;&#x7684;&#x662F;19&#xD7;19&#x7F51;&#x683C;&#x800C;&#x4E0D;&#x662F;3&#xD7;3&#x7684;&#x7F51;&#x683C;&#xFF0C;&#x4E24;&#x4E2A;&#x5BF9;&#x8C61;&#x4E2D;&#x70B9;&#x5904;&#x4E8E;361&#x4E2A;&#x683C;&#x5B50;&#x4E2D;&#x540C;&#x4E00;&#x4E2A;&#x683C;&#x5B50;&#x7684;&#x6982;&#x7387;&#x5F88;&#x4F4E;&#xFF0C;&#x786E;&#x5B9E;&#x4F1A;&#x51FA;&#x73B0;&#xFF0C;&#x4F46;&#x51FA;&#x73B0;&#x9891;&#x7387;&#x4E0D;&#x9AD8;&#x3002;&#x4E5F;&#x8BB8;&#x8BBE;&#x7ACB;<strong>anchor box</strong>&#x7684;&#x597D;&#x5904;&#x5728;&#x4E8E;<strong>anchor box</strong>&#x80FD;&#x8BA9;&#x4F60;&#x7684;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x80FD;&#x591F;&#x66F4;&#x6709;&#x5F81;&#x5BF9;&#x6027;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5982;&#x679C;&#x4F60;&#x7684;&#x6570;&#x636E;&#x96C6;&#x6709;&#x4E00;&#x4E9B;&#x5F88;&#x9AD8;&#x5F88;&#x7626;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x884C;&#x4EBA;&#xFF0C;&#x8FD8;&#x6709;&#x50CF;&#x6C7D;&#x8F66;&#x8FD9;&#x6837;&#x5F88;&#x5BBD;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x7684;&#x7B97;&#x6CD5;&#x5C31;&#x80FD;&#x66F4;&#x6709;&#x9488;&#x5BF9;&#x6027;&#x7684;&#x5904;&#x7406;&#xFF0C;&#x8FD9;&#x6837;&#x6709;&#x4E00;&#x4E9B;&#x8F93;&#x51FA;&#x5355;&#x5143;&#x53EF;&#x4EE5;&#x9488;&#x5BF9;&#x68C0;&#x6D4B;&#x5F88;&#x5BBD;&#x5F88;&#x80D6;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x8F66;&#x5B50;&#xFF0C;&#x7136;&#x540E;&#x8F93;&#x51FA;&#x4E00;&#x4E9B;&#x5355;&#x5143;&#xFF0C;&#x53EF;&#x4EE5;&#x9488;&#x5BF9;&#x68C0;&#x6D4B;&#x5F88;&#x9AD8;&#x5F88;&#x7626;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x884C;&#x4EBA;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x600E;&#x4E48;&#x9009;&#x62E9;<strong>anchor box</strong>&#x5462;&#xFF1F;&#x4EBA;&#x4EEC;&#x4E00;&#x822C;&#x624B;&#x5DE5;&#x6307;&#x5B9A;<strong>anchor box</strong>&#x5F62;&#x72B6;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x9009;&#x62E9;5&#x5230;10&#x4E2A;<strong>anchor box</strong>&#x5F62;&#x72B6;&#xFF0C;&#x8986;&#x76D6;&#x5230;&#x591A;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x5F62;&#x72B6;&#xFF0C;&#x53EF;&#x4EE5;&#x6DB5;&#x76D6;&#x4F60;&#x60F3;&#x8981;&#x68C0;&#x6D4B;&#x7684;&#x5BF9;&#x8C61;&#x7684;&#x5404;&#x79CD;&#x5F62;&#x72B6;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x66F4;&#x9AD8;&#x7EA7;&#x7684;&#x7248;&#x672C;&#xFF0C;&#x6211;&#x5C31;&#x7B80;&#x5355;&#x8BF4;&#x4E00;&#x53E5;&#xFF0C;&#x4F60;&#x4EEC;&#x5982;&#x679C;&#x63A5;&#x89E6;&#x8FC7;&#x4E00;&#x4E9B;&#x673A;&#x5668;&#x5B66;&#x4E60;&#xFF0C;&#x53EF;&#x80FD;&#x77E5;&#x9053;&#x540E;&#x671F;<strong>YOLO</strong>&#x8BBA;&#x6587;&#x4E2D;&#x6709;&#x66F4;&#x597D;&#x7684;&#x505A;&#x6CD5;&#xFF0C;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684;<strong>k-&#x5E73;&#x5747;&#x7B97;&#x6CD5;</strong>&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x4E24;&#x7C7B;&#x5BF9;&#x8C61;&#x5F62;&#x72B6;&#x805A;&#x7C7B;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x7528;&#x5B83;&#x6765;&#x9009;&#x62E9;&#x4E00;&#x7EC4;<strong>anchor box</strong>&#xFF0C;&#x9009;&#x62E9;&#x6700;&#x5177;&#x6709;&#x4EE3;&#x8868;&#x6027;&#x7684;&#x4E00;&#x7EC4;<strong>anchor box</strong>&#xFF0C;&#x53EF;&#x4EE5;&#x4EE3;&#x8868;&#x4F60;&#x8BD5;&#x56FE;&#x68C0;&#x6D4B;&#x7684;&#x5341;&#x51E0;&#x4E2A;&#x5BF9;&#x8C61;&#x7C7B;&#x522B;&#xFF0C;&#x4F46;&#x8FD9;&#x5176;&#x5B9E;&#x662F;&#x81EA;&#x52A8;&#x9009;&#x62E9;<strong>anchor box</strong>&#x7684;&#x9AD8;&#x7EA7;&#x65B9;&#x6CD5;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5C31;&#x4EBA;&#x5DE5;&#x9009;&#x62E9;&#x4E00;&#x4E9B;&#x5F62;&#x72B6;&#xFF0C;&#x5408;&#x7406;&#x7684;&#x8003;&#x8651;&#x5230;&#x6240;&#x6709;&#x5BF9;&#x8C61;&#x7684;&#x5F62;&#x72B6;&#xFF0C;&#x4F60;&#x9884;&#x8BA1;&#x4F1A;&#x68C0;&#x6D4B;&#x7684;&#x5F88;&#x9AD8;&#x5F88;&#x7626;&#x6216;&#x8005;&#x5F88;&#x5BBD;&#x5F88;&#x80D6;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x8FD9;&#x5E94;&#x8BE5;&#x4E5F;&#x4E0D;&#x96BE;&#x505A;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x8FD9;&#x5C31;&#x662F;<strong>anchor box</strong>&#xFF0C;&#x5728;&#x4E0B;&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x5B66;&#x5230;&#x7684;&#x6240;&#x6709;&#x4E1C;&#x897F;&#x4E00;&#x8D77;&#x878D;&#x5165;&#x5230;<strong>YOLO</strong>&#x7B97;&#x6CD5;&#x4E2D;&#x3002;</p>
<h3 id="39-yolo-&#x7B97;&#x6CD5;&#xFF08;putting-it-together-yolo-algorithm&#xFF09;">3.9 YOLO &#x7B97;&#x6CD5;&#xFF08;Putting it together: YOLO algorithm&#xFF09;</h3>
<p>&#x4F60;&#x4EEC;&#x5DF2;&#x7ECF;&#x5B66;&#x5230;&#x5BF9;&#x8C61;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;&#x7684;&#x5927;&#x90E8;&#x5206;&#x7EC4;&#x4EF6;&#x4E86;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x89C6;&#x9891;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x628A;&#x6240;&#x6709;&#x7EC4;&#x4EF6;&#x7EC4;&#x88C5;&#x5728;&#x4E00;&#x8D77;&#x6784;&#x6210;<strong>YOLO</strong>&#x5BF9;&#x8C61;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;&#x3002;</p>
<p><img src="../images/f2c4c2ee9fc4c37a66310e1b6a3da4d8.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x5148;&#x770B;&#x770B;&#x5982;&#x4F55;&#x6784;&#x9020;&#x4F60;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x5047;&#x8BBE;&#x4F60;&#x8981;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x7B97;&#x6CD5;&#x53BB;&#x68C0;&#x6D4B;&#x4E09;&#x79CD;&#x5BF9;&#x8C61;&#xFF0C;&#x884C;&#x4EBA;&#x3001;&#x6C7D;&#x8F66;&#x548C;&#x6469;&#x6258;&#x8F66;&#xFF0C;&#x4F60;&#x8FD8;&#x9700;&#x8981;&#x663E;&#x5F0F;&#x6307;&#x5B9A;&#x5B8C;&#x6574;&#x7684;&#x80CC;&#x666F;&#x7C7B;&#x522B;&#x3002;&#x8FD9;&#x91CC;&#x6709;3&#x4E2A;&#x7C7B;&#x522B;&#x6807;&#x7B7E;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8981;&#x7528;&#x4E24;&#x4E2A;<strong>anchor box</strong>&#xFF0C;&#x90A3;&#x4E48;&#x8F93;&#x51FA; $y$ &#x5C31;&#x662F;3&#xD7;3&#xD7;2&#xD7;8&#xFF0C;&#x5176;&#x4E2D;3&#xD7;3&#x8868;&#x793A;3&#xD7;3&#x4E2A;&#x7F51;&#x683C;&#xFF0C;2&#x662F;<strong>anchor box</strong>&#x7684;&#x6570;&#x91CF;&#xFF0C;8&#x662F;&#x5411;&#x91CF;&#x7EF4;&#x5EA6;&#xFF0C;8&#x5B9E;&#x9645;&#x4E0A;&#x5148;&#x662F;5&#xFF08;$p<em>{c},b</em>{x},b<em>{y},b</em>{h},b<em>{w}$&#xFF09;&#x518D;&#x52A0;&#x4E0A;&#x7C7B;&#x522B;&#x7684;&#x6570;&#x91CF;&#xFF08;$c</em>{1},c<em>{2},c</em>{3}$&#xFF09;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x5B83;&#x770B;&#x6210;&#x662F;3&#xD7;3&#xD7;2&#xD7;8&#xFF0C;&#x6216;&#x8005;3&#xD7;3&#xD7;16&#x3002;&#x8981;&#x6784;&#x9020;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x904D;&#x5386;9&#x4E2A;&#x683C;&#x5B50;&#xFF0C;&#x7136;&#x540E;&#x6784;&#x6210;&#x5BF9;&#x5E94;&#x7684;&#x76EE;&#x6807;&#x5411;&#x91CF;$y$&#x3002;</p>
<p><img src="../images/36ff927836cfcd7fee9413e2d34757d8.png" alt=""></p>
<p>&#x6240;&#x4EE5;&#x5148;&#x770B;&#x770B;&#x7B2C;&#x4E00;&#x4E2A;&#x683C;&#x5B50;&#xFF08;&#x7F16;&#x53F7;1&#xFF09;&#xFF0C;&#x91CC;&#x9762;&#x6CA1;&#x4EC0;&#x4E48;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x884C;&#x4EBA;&#x3001;&#x8F66;&#x5B50;&#x548C;&#x6469;&#x6258;&#x8F66;&#xFF0C;&#x4E09;&#x4E2A;&#x7C7B;&#x522B;&#x90FD;&#x6CA1;&#x6709;&#x51FA;&#x73B0;&#x5728;&#x5DE6;&#x4E0A;&#x683C;&#x5B50;&#x4E2D;&#xFF0C;&#x6240;&#x4EE5;&#x5BF9;&#x5E94;&#x90A3;&#x4E2A;&#x683C;&#x5B50;&#x76EE;&#x6807;$y$&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF0C;$y= \begin{bmatrix} 0 &amp; ? &amp; ? &amp; ? &amp; ? &amp; ? &amp; ? &amp; ? &amp; 0 &amp; ? &amp; ? &amp; ? &amp; ? &amp; ? &amp; ? &amp; ?\ \end{bmatrix}^{T}$&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;<strong>anchor box</strong>&#x7684; $p<em>{c}$ &#x662F;0&#xFF0C;&#x56E0;&#x4E3A;&#x6CA1;&#x4EC0;&#x4E48;&#x548C;&#x7B2C;&#x4E00;&#x4E2A;<strong>anchor box</strong>&#x6709;&#x5173;&#x7684;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;<strong>anchor box</strong>&#x7684; $p</em>{c}$ &#x4E5F;&#x662F;0&#xFF0C;&#x5269;&#x4E0B;&#x8FD9;&#x4E9B;&#x503C;&#x662F;<strong>don&#x2019;t care-s</strong>&#x3002;</p>
<p>&#x73B0;&#x5728;&#x7F51;&#x683C;&#x4E2D;&#x5927;&#x591A;&#x6570;&#x683C;&#x5B50;&#x90FD;&#x662F;&#x7A7A;&#x7684;&#xFF0C;&#x4F46;&#x90A3;&#x91CC;&#x7684;&#x683C;&#x5B50;&#xFF08;&#x7F16;&#x53F7;2&#xFF09;&#x4F1A;&#x6709;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#x5411;&#x91CF;$y$&#xFF0C;$y =\begin{bmatrix} 0 &amp; ? &amp; ? &amp; ? &amp; ? &amp; ? &amp; ? &amp; ? &amp; 1 &amp; b<em>{x} &amp; b</em>{y} &amp; b<em>{h} &amp;b</em>{w} &amp; 0 &amp; 1 &amp; 0 \\end{bmatrix}^{T}$&#xFF0C;&#x6240;&#x4EE5;&#x5047;&#x8BBE;&#x4F60;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#xFF0C;&#x5BF9;&#x4E8E;&#x8F66;&#x5B50;&#x6709;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x8FB9;&#x754C;&#x6846;&#xFF08;&#x7F16;&#x53F7;3&#xFF09;&#xFF0C;&#x6C34;&#x5E73;&#x65B9;&#x5411;&#x66F4;&#x957F;&#x4E00;&#x70B9;&#x3002;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x8FD9;&#x662F;&#x4F60;&#x7684;<strong>anchor box</strong>&#xFF0C;&#x8FD9;&#x662F;<strong>anchor box 1</strong>&#xFF08;&#x7F16;&#x53F7;4&#xFF09;&#xFF0C;&#x8FD9;&#x662F;<strong>anchor box 2</strong>&#xFF08;&#x7F16;&#x53F7;5&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x7EA2;&#x6846;&#x548C;<strong>anchor box 2</strong>&#x7684;&#x4EA4;&#x5E76;&#x6BD4;&#x66F4;&#x9AD8;&#xFF0C;&#x90A3;&#x4E48;&#x8F66;&#x5B50;&#x5C31;&#x548C;&#x5411;&#x91CF;&#x7684;&#x4E0B;&#x534A;&#x90E8;&#x5206;&#x76F8;&#x5173;&#x3002;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x8FD9;&#x91CC;&#x548C;<strong>anchor box 1</strong>&#x6709;&#x5173;&#x7684; $p<em>{c}$ &#x662F;0&#xFF0C;&#x5269;&#x4E0B;&#x8FD9;&#x4E9B;&#x5206;&#x91CF;&#x90FD;&#x662F;<strong>don&#x2019;t care-s</strong>&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A; $p</em>{c} =1$&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x8981;&#x7528;&#x8FD9;&#x4E9B;&#xFF08;$b<em>{x},b</em>{y},b<em>{h},b</em>{w}$&#xFF09;&#x6765;&#x6307;&#x5B9A;&#x7EA2;&#x8FB9;&#x754C;&#x6846;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x7136;&#x540E;&#x6307;&#x5B9A;&#x5B83;&#x7684;&#x6B63;&#x786E;&#x7C7B;&#x522B;&#x662F;2($c<em>{1}= 0 ,c</em>{2} = 1,c_{3} = 0$)&#xFF0C;&#x5BF9;&#x5427;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x8F86;&#x6C7D;&#x8F66;&#x3002;</p>
<p><img src="../images/e23084f4a75246f08ea4cedef55f60ab.png" alt=""></p>
<p>&#x6240;&#x4EE5;&#x4F60;&#x8FD9;&#x6837;&#x904D;&#x5386;9&#x4E2A;&#x683C;&#x5B50;&#xFF0C;&#x904D;&#x5386;3&#xD7;3&#x7F51;&#x683C;&#x7684;&#x6240;&#x6709;&#x4F4D;&#x7F6E;&#xFF0C;&#x4F60;&#x4F1A;&#x5F97;&#x5230;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x5411;&#x91CF;&#xFF0C;&#x5F97;&#x5230;&#x4E00;&#x4E2A;16&#x7EF4;&#x5411;&#x91CF;&#xFF0C;&#x6240;&#x4EE5;&#x6700;&#x7EC8;&#x8F93;&#x51FA;&#x5C3A;&#x5BF8;&#x5C31;&#x662F;3&#xD7;3&#xD7;16&#x3002;&#x548C;&#x4E4B;&#x524D;&#x4E00;&#x6837;&#xFF0C;&#x7B80;&#x5355;&#x8D77;&#x89C1;&#xFF0C;&#x6211;&#x5728;&#x8FD9;&#x91CC;&#x7528;&#x7684;&#x662F;3&#xD7;3&#x7F51;&#x683C;&#xFF0C;&#x5B9E;&#x8DF5;&#x4E2D;&#x7528;&#x7684;&#x53EF;&#x80FD;&#x662F;19&#xD7;19&#xD7;16&#xFF0C;&#x6216;&#x8005;&#x9700;&#x8981;&#x7528;&#x5230;&#x66F4;&#x591A;&#x7684;<strong>anchor box</strong>&#xFF0C;&#x53EF;&#x80FD;&#x662F;19&#xD7;19&#xD7;5&#xD7;8&#xFF0C;&#x5373;19&#xD7;19&#xD7;40&#xFF0C;&#x7528;&#x4E86;5&#x4E2A;<strong>anchor box</strong>&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#xFF0C;&#x8F93;&#x5165;&#x662F;&#x56FE;&#x7247;&#xFF0C;&#x53EF;&#x80FD;&#x662F;100&#xD7;100&#xD7;3&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x7684;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x6700;&#x540E;&#x8F93;&#x51FA;&#x5C3A;&#x5BF8;&#x662F;&#xFF0C;&#x5728;&#x6211;&#x4EEC;&#x4F8B;&#x5B50;&#x4E2D;&#x662F;3&#xD7;3&#xD7;16&#x6216;&#x8005;3&#xD7;3&#xD7;2&#xD7;8&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x4F60;&#x7684;&#x7B97;&#x6CD5;&#x662F;&#x600E;&#x6837;&#x505A;&#x51FA;&#x9884;&#x6D4B;&#x7684;&#xFF0C;&#x8F93;&#x5165;&#x56FE;&#x50CF;&#xFF0C;&#x4F60;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x8F93;&#x51FA;&#x5C3A;&#x5BF8;&#x662F;&#x8FD9;&#x4E2A;3&#xD7;3&#xD7;2&#xD7;8&#xFF0C;&#x5BF9;&#x4E8E;9&#x4E2A;&#x683C;&#x5B50;&#xFF0C;&#x6BCF;&#x4E2A;&#x90FD;&#x6709;&#x5BF9;&#x5E94;&#x7684;&#x5411;&#x91CF;&#x3002;&#x5BF9;&#x4E8E;&#x5DE6;&#x4E0A;&#x7684;&#x683C;&#x5B50;&#xFF08;&#x7F16;&#x53F7;1&#xFF09;&#xFF0C;&#x90A3;&#x91CC;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5BF9;&#x8C61;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x4F60;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5728;&#x90A3;&#x91CC;&#xFF08;&#x7B2C;&#x4E00;&#x4E2A;$p<em>{c}$&#xFF09;&#x8F93;&#x51FA;&#x7684;&#x662F;0&#xFF0C;&#x8FD9;&#x91CC;&#xFF08;&#x7B2C;&#x4E8C;&#x4E2A;$p</em>{c}$&#xFF09;&#x662F;0&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x8F93;&#x51FA;&#x4E00;&#x4E9B;&#x503C;&#xFF0C;&#x4F60;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E0D;&#x80FD;&#x8F93;&#x51FA;&#x95EE;&#x53F7;&#xFF0C;&#x4E0D;&#x80FD;&#x8F93;&#x51FA;<strong>don&#x2019;t care-s</strong>&#xFF0C;&#x5269;&#x4E0B;&#x7684;&#x6211;&#x8F93;&#x5165;&#x4E00;&#x4E9B;&#x6570;&#x5B57;&#xFF0C;&#x4F46;&#x8FD9;&#x4E9B;&#x6570;&#x5B57;&#x57FA;&#x672C;&#x4E0A;&#x4F1A;&#x88AB;&#x5FFD;&#x7565;&#xFF0C;&#x56E0;&#x4E3A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x544A;&#x8BC9;&#x4F60;&#xFF0C;&#x90A3;&#x91CC;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#xFF0C;&#x6240;&#x4EE5;&#x8F93;&#x51FA;&#x662F;&#x4E0D;&#x662F;&#x5BF9;&#x5E94;&#x4E00;&#x4E2A;&#x7C7B;&#x522B;&#x7684;&#x8FB9;&#x754C;&#x6846;&#x65E0;&#x5173;&#x7D27;&#x8981;&#xFF0C;&#x6240;&#x4EE5;&#x57FA;&#x672C;&#x4E0A;&#x662F;&#x4E00;&#x7EC4;&#x6570;&#x5B57;&#xFF0C;&#x591A;&#x591A;&#x5C11;&#x5C11;&#x90FD;&#x662F;&#x566A;&#x97F3;&#xFF08;&#x8F93;&#x51FA; $y$ &#x5982;&#x7F16;&#x53F7;3&#x6240;&#x793A;&#xFF09;&#x3002;</p>
<p><img src="../images/140cd14e52c3f217d053ae0efa2fce81.png" alt=""></p>
<p>&#x548C;&#x8FD9;&#x91CC;&#x7684;&#x8FB9;&#x754C;&#x6846;&#x4E0D;&#x5927;&#x4E00;&#x6837;&#xFF0C;&#x5E0C;&#x671B;$y$&#x7684;&#x503C;&#xFF0C;&#x90A3;&#x4E2A;&#x5DE6;&#x4E0B;&#x683C;&#x5B50;&#xFF08;&#x7F16;&#x53F7;2&#xFF09;&#x7684;&#x8F93;&#x51FA;$y$&#xFF08;&#x7F16;&#x53F7;4&#x6240;&#x793A;&#xFF09;&#xFF0C;&#x5F62;&#x5F0F;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FB9;&#x754C;&#x6846;1&#x6765;&#x8BF4;&#xFF08;$p<em>{c}$&#xFF09;&#x662F;0&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x662F;&#x4E00;&#x7EC4;&#x6570;&#x5B57;&#xFF0C;&#x5C31;&#x662F;&#x566A;&#x97F3;&#xFF08;<strong>anchor box 1</strong>&#x5BF9;&#x5E94;&#x884C;&#x4EBA;&#xFF0C;&#x6B64;&#x683C;&#x5B50;&#x4E2D;&#x65E0;&#x884C;&#x4EBA;&#xFF0C;$p</em>{c} = 0,b<em>{x} = ?,b</em>{y} = ?,b<em>{h} = ?,b</em>{w} = ?,c<em>{1} = ?c</em>{2} = ?,c<em>{3} =?$&#xFF09;&#x3002;&#x5E0C;&#x671B;&#x4F60;&#x7684;&#x7B97;&#x6CD5;&#x80FD;&#x8F93;&#x51FA;&#x4E00;&#x4E9B;&#x6570;&#x5B57;&#xFF0C;&#x53EF;&#x4EE5;&#x5BF9;&#x8F66;&#x5B50;&#x6307;&#x5B9A;&#x4E00;&#x4E2A;&#x76F8;&#x5F53;&#x51C6;&#x786E;&#x7684;&#x8FB9;&#x754C;&#x6846;&#xFF08;<strong>anchor box 2</strong>&#x5BF9;&#x5E94;&#x6C7D;&#x8F66;&#xFF0C;&#x6B64;&#x683C;&#x5B50;&#x4E2D;&#x6709;&#x8F66;&#xFF0C;$ p</em>{c} = 1,b<em>{x},b</em>{y},b<em>{h},b</em>{w},c<em>{1} = 0,c</em>{2}= 1,c_{3} = 0$&#xFF09;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x505A;&#x51FA;&#x9884;&#x6D4B;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p>
<p><img src="../images/66f8cf8e55eadc1ac01f773515bfbc45.png" alt=""></p>
<p>&#x6700;&#x540E;&#x4F60;&#x8981;&#x8FD0;&#x884C;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;&#x975E;&#x6781;&#x5927;&#x503C;&#x6291;&#x5236;&#xFF0C;&#x4E3A;&#x4E86;&#x8BA9;&#x5185;&#x5BB9;&#x66F4;&#x6709;&#x8DA3;&#x4E00;&#x4E9B;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x4E00;&#x5F20;&#x65B0;&#x7684;&#x6D4B;&#x8BD5;&#x56FE;&#x50CF;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x8FD0;&#x884C;&#x975E;&#x6781;&#x5927;&#x503C;&#x6291;&#x5236;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;&#x4E24;&#x4E2A;<strong>anchor box</strong>&#xFF0C;&#x90A3;&#x4E48;&#x5BF9;&#x4E8E;9&#x4E2A;&#x683C;&#x5B50;&#x4E2D;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x90FD;&#x4F1A;&#x6709;&#x4E24;&#x4E2A;&#x9884;&#x6D4B;&#x7684;&#x8FB9;&#x754C;&#x6846;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x7684;&#x6982;&#x7387;$p_{c}&#x200B;$&#x5F88;&#x4F4E;&#x3002;&#x4F46;9&#x4E2A;&#x683C;&#x5B50;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x90FD;&#x6709;&#x4E24;&#x4E2A;&#x9884;&#x6D4B;&#x7684;&#x8FB9;&#x754C;&#x6846;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x6211;&#x4EEC;&#x5F97;&#x5230;&#x7684;&#x8FB9;&#x754C;&#x6846;&#x662F;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF0C;&#x6CE8;&#x610F;&#x6709;&#x4E00;&#x4E9B;&#x8FB9;&#x754C;&#x6846;&#x53EF;&#x4EE5;&#x8D85;&#x51FA;&#x6240;&#x5728;&#x683C;&#x5B50;&#x7684;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#xFF08;&#x7F16;&#x53F7;1&#x6240;&#x793A;&#xFF09;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x4F60;&#x629B;&#x5F03;&#x6982;&#x7387;&#x5F88;&#x4F4E;&#x7684;&#x9884;&#x6D4B;&#xFF0C;&#x53BB;&#x6389;&#x8FD9;&#x4E9B;&#x8FDE;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x90FD;&#x8BF4;&#xFF0C;&#x8FD9;&#x91CC;&#x5F88;&#x53EF;&#x80FD;&#x4EC0;&#x4E48;&#x90FD;&#x6CA1;&#x6709;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x9700;&#x8981;&#x629B;&#x5F03;&#x8FD9;&#x4E9B;&#xFF08;&#x7F16;&#x53F7;2&#x6240;&#x793A;&#xFF09;&#x3002;</p>
<p><img src="../images/23256c4b7b28d62d34a744f5fb5e9c3b.png" alt=""></p>
<p>&#x6700;&#x540E;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;&#x4E09;&#x4E2A;&#x5BF9;&#x8C61;&#x68C0;&#x6D4B;&#x7C7B;&#x522B;&#xFF0C;&#x4F60;&#x5E0C;&#x671B;&#x68C0;&#x6D4B;&#x884C;&#x4EBA;&#xFF0C;&#x6C7D;&#x8F66;&#x548C;&#x6469;&#x6258;&#x8F66;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x8981;&#x505A;&#x7684;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x7C7B;&#x522B;&#x5355;&#x72EC;&#x8FD0;&#x884C;&#x975E;&#x6781;&#x5927;&#x503C;&#x6291;&#x5236;&#xFF0C;&#x5904;&#x7406;&#x9884;&#x6D4B;&#x7ED3;&#x679C;&#x6240;&#x5C5E;&#x7C7B;&#x522B;&#x7684;&#x8FB9;&#x754C;&#x6846;&#xFF0C;&#x7528;&#x975E;&#x6781;&#x5927;&#x503C;&#x6291;&#x5236;&#x6765;&#x5904;&#x7406;&#x884C;&#x4EBA;&#x7C7B;&#x522B;&#xFF0C;&#x7528;&#x975E;&#x6781;&#x5927;&#x503C;&#x6291;&#x5236;&#x5904;&#x7406;&#x8F66;&#x5B50;&#x7C7B;&#x522B;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x6469;&#x6258;&#x8F66;&#x7C7B;&#x522B;&#x8FDB;&#x884C;&#x975E;&#x6781;&#x5927;&#x503C;&#x6291;&#x5236;&#xFF0C;&#x8FD0;&#x884C;&#x4E09;&#x6B21;&#x6765;&#x5F97;&#x5230;&#x6700;&#x7EC8;&#x7684;&#x9884;&#x6D4B;&#x7ED3;&#x679C;&#x3002;&#x6240;&#x4EE5;&#x7B97;&#x6CD5;&#x7684;&#x8F93;&#x51FA;&#x6700;&#x597D;&#x80FD;&#x591F;&#x68C0;&#x6D4B;&#x51FA;&#x56FE;&#x50CF;&#x91CC;&#x6240;&#x6709;&#x7684;&#x8F66;&#x5B50;&#xFF0C;&#x8FD8;&#x6709;&#x6240;&#x6709;&#x7684;&#x884C;&#x4EBA;&#xFF08;&#x7F16;&#x53F7;3&#x6240;&#x793A;&#xFF09;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;<strong>YOLO</strong>&#x5BF9;&#x8C61;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;&#xFF0C;&#x8FD9;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x6700;&#x6709;&#x6548;&#x7684;&#x5BF9;&#x8C61;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;&#x4E4B;&#x4E00;&#xFF0C;&#x5305;&#x542B;&#x4E86;&#x6574;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x5BF9;&#x8C61;&#x68C0;&#x6D4B;&#x9886;&#x57DF;&#x6587;&#x732E;&#x4E2D;&#x5F88;&#x591A;&#x6700;&#x7CBE;&#x5999;&#x7684;&#x601D;&#x8DEF;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x672C;&#x5468;&#x7684;&#x7F16;&#x7A0B;&#x4F5C;&#x4E1A;&#x4E2D;&#x5C1D;&#x8BD5;&#x73B0;&#x5B9E;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x5E0C;&#x671B;&#x4F60;&#x559C;&#x6B22;&#x672C;&#x5468;&#x7684;&#x7F16;&#x7A0B;&#x7EC3;&#x4E60;&#xFF0C;&#x8FD9;&#x91CC;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x53EF;&#x9009;&#x7684;&#x89C6;&#x9891;&#xFF0C;&#x4F60;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4E0D;&#x770B;&#xFF0C;&#x603B;&#x4E4B;&#xFF0C;&#x6211;&#x4EEC;&#x4E0B;&#x5468;&#x89C1;&#x3002;</p>
<h3 id="310-&#x5019;&#x9009;&#x533A;&#x57DF;&#xFF08;&#x9009;&#x4FEE;&#xFF09;&#xFF08;region-proposals-optional&#xFF09;">3.10 &#x5019;&#x9009;&#x533A;&#x57DF;&#xFF08;&#x9009;&#x4FEE;&#xFF09;&#xFF08;Region proposals (Optional)&#xFF09;</h3>
<p>&#x5982;&#x679C;&#x4F60;&#x4EEC;&#x9605;&#x8BFB;&#x4E00;&#x4E0B;&#x5BF9;&#x8C61;&#x68C0;&#x6D4B;&#x7684;&#x6587;&#x732E;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x770B;&#x5230;&#x4E00;&#x7EC4;&#x6982;&#x5FF5;&#xFF0C;&#x6240;&#x8C13;&#x7684;&#x5019;&#x9009;&#x533A;&#x57DF;&#xFF0C;&#x8FD9;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x9886;&#x57DF;&#x662F;&#x975E;&#x5E38;&#x6709;&#x5F71;&#x54CD;&#x529B;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x6211;&#x628A;&#x8FD9;&#x4E2A;&#x89C6;&#x9891;&#x5B9A;&#x4E3A;&#x53EF;&#x9009;&#x89C6;&#x9891;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x7528;&#x5230;&#x5019;&#x9009;&#x533A;&#x57DF;&#x8FD9;&#x4E00;&#x7CFB;&#x5217;&#x7B97;&#x6CD5;&#x7684;&#x9891;&#x7387;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x9AD8;&#xFF0C;&#x4F46;&#x5F53;&#x7136;&#x4E86;&#xFF0C;&#x8FD9;&#x4E9B;&#x5DE5;&#x4F5C;&#x662F;&#x5F88;&#x6709;&#x5F71;&#x54CD;&#x529B;&#x7684;&#xFF0C;&#x4F60;&#x4EEC;&#x5728;&#x5DE5;&#x4F5C;&#x4E2D;&#x4E5F;&#x53EF;&#x80FD;&#x4F1A;&#x78B0;&#x5230;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;&#x3002;</p>
<p><img src="../images/838a6aeb35865f9cfecac8dc593b565b.png" alt=""></p>
<p>&#x4F60;&#x4EEC;&#x8FD8;&#x8BB0;&#x5F97;&#x6ED1;&#x52A8;&#x7A97;&#x6CD5;&#x5427;&#xFF0C;&#x4F60;&#x4F7F;&#x7528;&#x8BAD;&#x7EC3;&#x8FC7;&#x7684;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x5728;&#x8FD9;&#x4E9B;&#x7A97;&#x53E3;&#x4E2D;&#x5168;&#x90E8;&#x8FD0;&#x884C;&#x4E00;&#x904D;&#xFF0C;&#x7136;&#x540E;&#x8FD0;&#x884C;&#x4E00;&#x4E2A;&#x68C0;&#x6D4B;&#x5668;&#xFF0C;&#x770B;&#x770B;&#x91CC;&#x9762;&#x662F;&#x5426;&#x6709;&#x8F66;&#x8F86;&#xFF0C;&#x884C;&#x4EBA;&#x548C;&#x6469;&#x6258;&#x8F66;&#x3002;&#x73B0;&#x5728;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x4E00;&#x4E0B;&#x5377;&#x79EF;&#x7B97;&#x6CD5;&#xFF0C;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x7684;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x7F3A;&#x70B9;&#x662F;&#xFF0C;&#x5B83;&#x5728;&#x663E;&#x7136;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5BF9;&#x8C61;&#x7684;&#x533A;&#x57DF;&#x6D6A;&#x8D39;&#x65F6;&#x95F4;&#xFF0C;&#x5BF9;&#x5427;&#x3002;</p>
<p><img src="../images/f19fe9307d3c40067693f6a344c8fdb5.png" alt=""></p>
<p>&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x8FD9;&#x4E2A;&#x77E9;&#x5F62;&#x533A;&#x57DF;&#xFF08;&#x7F16;&#x53F7;1&#xFF09;&#x57FA;&#x672C;&#x662F;&#x7A7A;&#x7684;&#xFF0C;&#x663E;&#x7136;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x9700;&#x8981;&#x5206;&#x7C7B;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x4E5F;&#x8BB8;&#x7B97;&#x6CD5;&#x4F1A;&#x5728;&#x8FD9;&#x4E2A;&#x77E9;&#x5F62;&#x4E0A;&#xFF08;&#x7F16;&#x53F7;2&#xFF09;&#x8FD0;&#x884C;&#xFF0C;&#x800C;&#x4F60;&#x77E5;&#x9053;&#x4E0A;&#x9762;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x6709;&#x8DA3;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<p>[<strong>Girshick R, Donahue J, Darrell T, et al. Rich feature hierarchies for accurate object detection and semantic segmentation[C]//Proceedings of the IEEE conference on computer vision and pattern recognition. 2014: 580-587.</strong>]</p>
<p>&#x6240;&#x4EE5;<strong>Ross Girshick</strong>&#xFF0C;<strong>Jeff Donahue</strong>&#xFF0C;<strong>Trevor Darrell</strong>&#xFF0C;<strong>Jitendra Malik</strong>&#xFF0C;&#x5728;&#x672C;&#x5E7B;&#x706F;&#x7247;&#x5E95;&#x90E8;&#x5F15;&#x7528;&#x5230;&#x7684;&#x8BBA;&#x6587;&#x4E2D;&#x63D0;&#x51FA;&#x4E00;&#x79CD;&#x53EB;&#x505A;<strong>R-CNN</strong>&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x610F;&#x601D;&#x662F;&#x5E26;&#x533A;&#x57DF;&#x7684;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x5E26;&#x533A;&#x57DF;&#x7684;<strong>CNN</strong>&#x3002;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x5C1D;&#x8BD5;&#x9009;&#x51FA;&#x4E00;&#x4E9B;&#x533A;&#x57DF;&#xFF0C;&#x5728;&#x8FD9;&#x4E9B;&#x533A;&#x57DF;&#x4E0A;&#x8FD0;&#x884C;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x5206;&#x7C7B;&#x5668;&#x662F;&#x6709;&#x610F;&#x4E49;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x4E0D;&#x518D;&#x9488;&#x5BF9;&#x6BCF;&#x4E2A;&#x6ED1;&#x52A8;&#x7A97;&#x8FD0;&#x884C;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;&#xFF0C;&#x800C;&#x662F;&#x53EA;&#x9009;&#x62E9;&#x4E00;&#x4E9B;&#x7A97;&#x53E3;&#xFF0C;&#x5728;&#x5C11;&#x6570;&#x7A97;&#x53E3;&#x4E0A;&#x8FD0;&#x884C;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x5206;&#x7C7B;&#x5668;&#x3002;</p>
<p>&#x9009;&#x51FA;&#x5019;&#x9009;&#x533A;&#x57DF;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x8FD0;&#x884C;&#x56FE;&#x50CF;&#x5206;&#x5272;&#x7B97;&#x6CD5;&#xFF0C;&#x5206;&#x5272;&#x7684;&#x7ED3;&#x679C;&#x662F;&#x4E0B;&#x8FB9;&#x7684;&#x56FE;&#x50CF;&#xFF0C;&#x4E3A;&#x4E86;&#x627E;&#x51FA;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x5BF9;&#x8C61;&#x7684;&#x533A;&#x57DF;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x5206;&#x5272;&#x7B97;&#x6CD5;&#x5728;&#x8FD9;&#x91CC;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x8272;&#x5757;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x9009;&#x62E9;&#x8FD9;&#x6837;&#x7684;&#x8FB9;&#x754C;&#x6846;&#xFF08;&#x7F16;&#x53F7;1&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x8FD9;&#x4E2A;&#x8272;&#x5757;&#x4E0A;&#x8FD0;&#x884C;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x5C31;&#x50CF;&#x8FD9;&#x4E2A;&#x7EFF;&#x8272;&#x7684;&#x4E1C;&#x897F;&#xFF08;&#x7F16;&#x53F7;2&#xFF09;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x8272;&#x5757;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x8FD8;&#x4F1A;&#x5728;&#x90A3;&#x4E2A;&#x77E9;&#x5F62;&#x4E0A;&#xFF08;&#x7F16;&#x53F7;2&#xFF09;&#x8FD0;&#x884C;&#x4E00;&#x6B21;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x770B;&#x770B;&#x6709;&#x6CA1;&#x6709;&#x4E1C;&#x897F;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x84DD;&#x8272;&#x8272;&#x5757;&#x4E0A;&#xFF08;&#x7F16;&#x53F7;3&#xFF09;&#x8FD0;&#x884C;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x5E0C;&#x671B;&#x4F60;&#x80FD;&#x68C0;&#x6D4B;&#x51FA;&#x4E00;&#x4E2A;&#x884C;&#x4EBA;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5728;&#x9752;&#x8272;&#x8272;&#x5757;(&#x7F16;&#x53F7;4)&#x4E0A;&#x8FD0;&#x884C;&#x7B97;&#x6CD5;&#xFF0C;&#x4E5F;&#x8BB8;&#x4F60;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#x4E00;&#x8F86;&#x8F66;&#xFF0C;&#x6211;&#x4E5F;&#x4E0D;&#x786E;&#x5B9A;&#x3002;</p>
<p><img src="../images/e78e4465af892d0965e2b0863263ef8c.png" alt=""></p>
<p>&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x7EC6;&#x8282;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684;&#x5206;&#x5272;&#x7B97;&#x6CD5;&#xFF0C;&#x4F60;&#x5148;&#x627E;&#x51FA;&#x53EF;&#x80FD;2000&#x591A;&#x4E2A;&#x8272;&#x5757;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x8FD9;2000&#x4E2A;&#x8272;&#x5757;&#x4E0A;&#x653E;&#x7F6E;&#x8FB9;&#x754C;&#x6846;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x8FD9;2000&#x4E2A;&#x8272;&#x5757;&#x4E0A;&#x8FD0;&#x884C;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x8FD9;&#x6837;&#x9700;&#x8981;&#x5904;&#x7406;&#x7684;&#x4F4D;&#x7F6E;&#x53EF;&#x80FD;&#x8981;&#x5C11;&#x7684;&#x591A;&#xFF0C;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x5206;&#x7C7B;&#x5668;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#xFF0C;&#x6BD4;&#x5728;&#x56FE;&#x50CF;&#x6240;&#x6709;&#x4F4D;&#x7F6E;&#x8FD0;&#x884C;&#x4E00;&#x904D;&#x5206;&#x7C7B;&#x5668;&#x8981;&#x5FEB;&#x3002;&#x7279;&#x522B;&#x662F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x73B0;&#x5728;&#x4E0D;&#x4EC5;&#x662F;&#x5728;&#x65B9;&#x5F62;&#x533A;&#x57DF;&#xFF08;&#x7F16;&#x53F7;5&#xFF09;&#x4E2D;&#x8FD0;&#x884C;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x4F1A;&#x5728;&#x9AD8;&#x9AD8;&#x7626;&#x7626;&#xFF08;&#x7F16;&#x53F7;6&#xFF09;&#x7684;&#x533A;&#x57DF;&#x8FD0;&#x884C;&#xFF0C;&#x5C1D;&#x8BD5;&#x68C0;&#x6D4B;&#x51FA;&#x884C;&#x4EBA;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x5728;&#x5F88;&#x5BBD;&#x5F88;&#x80D6;&#x7684;&#x533A;&#x57DF;&#xFF08;&#x7F16;&#x53F7;7&#xFF09;&#x8FD0;&#x884C;&#xFF0C;&#x5C1D;&#x8BD5;&#x68C0;&#x6D4B;&#x51FA;&#x8F66;&#x8F86;&#xFF0C;&#x540C;&#x65F6;&#x5728;&#x5404;&#x79CD;&#x5C3A;&#x5EA6;&#x8FD0;&#x884C;&#x5206;&#x7C7B;&#x5668;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;<strong>R-CNN</strong>&#x6216;&#x8005;<strong>&#x533A;&#x57DF;CNN</strong>&#x7684;&#x7279;&#x8272;&#x6982;&#x5FF5;&#xFF0C;&#x73B0;&#x5728;&#x770B;&#x6765;<strong>R-CNN</strong>&#x7B97;&#x6CD5;&#x8FD8;&#x662F;&#x5F88;&#x6162;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x6709;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x7814;&#x7A76;&#x5DE5;&#x4F5C;&#x53BB;&#x6539;&#x8FDB;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#xFF0C;&#x6240;&#x4EE5;&#x57FA;&#x672C;&#x7684;<strong>R-CNN</strong>&#x7B97;&#x6CD5;&#x662F;&#x4F7F;&#x7528;&#x67D0;&#x79CD;&#x7B97;&#x6CD5;&#x6C42;&#x51FA;&#x5019;&#x9009;&#x533A;&#x57DF;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x6BCF;&#x4E2A;&#x5019;&#x9009;&#x533A;&#x57DF;&#x8FD0;&#x884C;&#x4E00;&#x4E0B;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x6BCF;&#x4E2A;&#x533A;&#x57DF;&#x4F1A;&#x8F93;&#x51FA;&#x4E00;&#x4E2A;&#x6807;&#x7B7E;&#xFF0C;&#x6709;&#x6CA1;&#x6709;&#x8F66;&#x5B50;&#xFF1F;&#x6709;&#x6CA1;&#x6709;&#x884C;&#x4EBA;&#xFF1F;&#x6709;&#x6CA1;&#x6709;&#x6469;&#x6258;&#x8F66;&#xFF1F;&#x5E76;&#x8F93;&#x51FA;&#x4E00;&#x4E2A;&#x8FB9;&#x754C;&#x6846;&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x5C31;&#x80FD;&#x5728;&#x786E;&#x5B9E;&#x5B58;&#x5728;&#x5BF9;&#x8C61;&#x7684;&#x533A;&#x57DF;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x7CBE;&#x786E;&#x7684;&#x8FB9;&#x754C;&#x6846;&#x3002;</p>
<p>&#x6F84;&#x6E05;&#x4E00;&#x4E0B;&#xFF0C;<strong>R-CNN</strong>&#x7B97;&#x6CD5;&#x4E0D;&#x4F1A;&#x76F4;&#x63A5;&#x4FE1;&#x4EFB;&#x8F93;&#x5165;&#x7684;&#x8FB9;&#x754C;&#x6846;&#xFF0C;&#x5B83;&#x4E5F;&#x4F1A;&#x8F93;&#x51FA;&#x4E00;&#x4E2A;&#x8FB9;&#x754C;&#x6846;$b<em>{x}$&#xFF0C;$b</em>{y}$&#xFF0C;$b<em>{h}$&#x548C;$b</em>{w}$&#xFF0C;&#x8FD9;&#x6837;&#x5F97;&#x5230;&#x7684;&#x8FB9;&#x754C;&#x6846;&#x6BD4;&#x8F83;&#x7CBE;&#x786E;&#xFF0C;&#x6BD4;&#x5355;&#x7EAF;&#x4F7F;&#x7528;&#x56FE;&#x50CF;&#x5206;&#x5272;&#x7B97;&#x6CD5;&#x7ED9;&#x51FA;&#x7684;&#x8272;&#x5757;&#x8FB9;&#x754C;&#x8981;&#x597D;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x76F8;&#x5F53;&#x7CBE;&#x786E;&#x7684;&#x8FB9;&#x754C;&#x6846;&#x3002;</p>
<p>&#x73B0;&#x5728;<strong>R-CNN</strong>&#x7B97;&#x6CD5;&#x7684;&#x4E00;&#x4E2A;&#x7F3A;&#x70B9;&#x662F;&#x592A;&#x6162;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E9B;&#x5E74;&#x6765;&#x6709;&#x4E00;&#x4E9B;&#x5BF9;<strong>R-CNN</strong>&#x7B97;&#x6CD5;&#x7684;&#x6539;&#x8FDB;&#x5DE5;&#x4F5C;&#xFF0C;<strong>Ross Girshik</strong>&#x63D0;&#x51FA;&#x4E86;&#x5FEB;&#x901F;&#x7684;<strong>R-CNN</strong>&#x7B97;&#x6CD5;&#xFF0C;&#x5B83;&#x57FA;&#x672C;&#x4E0A;&#x662F;<strong>R-CNN</strong>&#x7B97;&#x6CD5;&#xFF0C;&#x4E0D;&#x8FC7;&#x7528;&#x5377;&#x79EF;&#x5B9E;&#x73B0;&#x4E86;&#x6ED1;&#x52A8;&#x7A97;&#x6CD5;&#x3002;&#x6700;&#x521D;&#x7684;&#x7B97;&#x6CD5;&#x662F;&#x9010;&#x4E00;&#x5BF9;&#x533A;&#x57DF;&#x5206;&#x7C7B;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5FEB;&#x901F;<strong>R-CNN</strong>&#x7528;&#x7684;&#x662F;&#x6ED1;&#x52A8;&#x7A97;&#x6CD5;&#x7684;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x5B9E;&#x73B0;&#xFF0C;&#x8FD9;&#x548C;&#x4F60;&#x5728;&#x672C;&#x5468;&#x7B2C;&#x56DB;&#x4E2A;&#x89C6;&#x9891;&#xFF08;3.4 &#x5377;&#x79EF;&#x7684;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x5B9E;&#x73B0;&#xFF09;&#x4E2D;&#x770B;&#x5230;&#x7684;&#x5927;&#x81F4;&#x76F8;&#x4F3C;&#xFF0C;&#x8FD9;&#x663E;&#x8457;&#x63D0;&#x5347;&#x4E86;<strong>R-CNN</strong>&#x7684;&#x901F;&#x5EA6;&#x3002;</p>
<p><img src="../images/e6ed1aa3263107d4e189dd75adc060b4.png" alt=""></p>
<p>&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#xFF0C;<strong>Fast R-CNN</strong>&#x7B97;&#x6CD5;&#x7684;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#x5F97;&#x5230;&#x5019;&#x9009;&#x533A;&#x57DF;&#x7684;&#x805A;&#x7C7B;&#x6B65;&#x9AA4;&#x4ECD;&#x7136;&#x975E;&#x5E38;&#x7F13;&#x6162;&#xFF0C;&#x6240;&#x4EE5;&#x53E6;&#x4E00;&#x4E2A;&#x7814;&#x7A76;&#x7EC4;&#xFF0C;<strong>&#x4EFB;&#x5C11;&#x537F;</strong>&#xFF08;<strong>Shaoqing Ren</strong>&#xFF09;&#x3001;<strong>&#x4F55;&#x51EF;&#x660E;</strong>&#xFF08;<strong>Kaiming He</strong>&#xFF09;&#x3001;<strong>Ross Girshick</strong>&#x548C;<strong>&#x5B59;&#x5251;</strong>&#xFF08;<strong>Jiangxi Sun</strong>&#xFF09;&#x63D0;&#x51FA;&#x4E86;&#x66F4;&#x5FEB;&#x7684;<strong>R-CNN</strong>&#x7B97;&#x6CD5;&#xFF08;<strong>Faster R-CNN</strong>&#xFF09;&#xFF0C;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x66F4;&#x4F20;&#x7EDF;&#x7684;&#x5206;&#x5272;&#x7B97;&#x6CD5;&#x6765;&#x83B7;&#x5F97;&#x5019;&#x9009;&#x533A;&#x57DF;&#x8272;&#x5757;&#xFF0C;&#x7ED3;&#x679C;&#x6BD4;<strong>Fast R-CNN</strong>&#x7B97;&#x6CD5;&#x5FEB;&#x5F97;&#x591A;&#x3002;&#x4E0D;&#x8FC7;&#x6211;&#x8BA4;&#x4E3A;&#x5927;&#x591A;&#x6570;&#x66F4;&#x5FEB;<strong>R-CNN</strong>&#x7684;&#x7B97;&#x6CD5;&#x5B9E;&#x73B0;&#x8FD8;&#x662F;&#x6BD4;<strong>YOLO</strong>&#x7B97;&#x6CD5;&#x6162;&#x5F88;&#x591A;&#x3002;</p>
<p>&#x5019;&#x9009;&#x533A;&#x57DF;&#x7684;&#x6982;&#x5FF5;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x9886;&#x57DF;&#x7684;&#x5F71;&#x54CD;&#x529B;&#x76F8;&#x5F53;&#x5927;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x5E0C;&#x671B;&#x4F60;&#x4EEC;&#x80FD;&#x4E86;&#x89E3;&#x4E00;&#x4E0B;&#x8FD9;&#x4E9B;&#x7B97;&#x6CD5;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x8FD8;&#x6709;&#x4EBA;&#x5728;&#x7528;&#x8FD9;&#x4E9B;&#x6982;&#x5FF5;&#x3002;&#x5BF9;&#x6211;&#x4E2A;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x7684;&#x4E2A;&#x4EBA;&#x770B;&#x6CD5;&#x800C;&#x4E0D;&#x662F;&#x6574;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x7814;&#x7A76;&#x754C;&#x7684;&#x770B;&#x6CD5;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x5019;&#x9009;&#x533A;&#x57DF;&#x662F;&#x4E00;&#x4E2A;&#x6709;&#x8DA3;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x4F46;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x9700;&#x8981;&#x4E24;&#x6B65;&#xFF0C;&#x9996;&#x5148;&#x5F97;&#x5230;&#x5019;&#x9009;&#x533A;&#x57DF;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x5206;&#x7C7B;&#xFF0C;&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x80FD;&#x591F;&#x4E00;&#x6B65;&#x505A;&#x5B8C;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;<strong>YOLO</strong>&#x6216;&#x8005;&#x4F60;&#x53EA;&#x770B;&#x4E00;&#x6B21;&#xFF08;<strong>You only look once</strong>&#xFF09;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#xFF0C;&#x5728;&#x6211;&#x770B;&#x6765;&#xFF0C;&#x662F;&#x957F;&#x8FDC;&#x800C;&#x8A00;&#x66F4;&#x6709;&#x5E0C;&#x671B;&#x7684;&#x65B9;&#x5411;&#x3002;&#x4F46;&#x8FD9;&#x662F;&#x6211;&#x7684;&#x4E2A;&#x4EBA;&#x770B;&#x6CD5;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6574;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x7814;&#x7A76;&#x754C;&#x7684;&#x770B;&#x6CD5;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x4EEC;&#x6700;&#x597D;&#x6279;&#x5224;&#x63A5;&#x53D7;&#x3002;&#x4F46;&#x6211;&#x60F3;&#x8FD9;&#x4E2A;<strong>R-CNN</strong>&#x6982;&#x5FF5;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x60F3;&#x5230;&#xFF0C;&#x6216;&#x8005;&#x78B0;&#x5230;&#x5176;&#x4ED6;&#x4EBA;&#x5728;&#x7528;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E5F;&#x662F;&#x503C;&#x5F97;&#x4E86;&#x89E3;&#x7684;&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x53EF;&#x4EE5;&#x66F4;&#x597D;&#x5730;&#x7406;&#x89E3;&#x522B;&#x4EBA;&#x7684;&#x7B97;&#x6CD5;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5C31;&#x8BB2;&#x5B8C;&#x8FD9;&#x5468;&#x5BF9;&#x8C61;&#x68C0;&#x6D4B;&#x7684;&#x6750;&#x6599;&#x4E86;&#xFF0C;&#x6211;&#x5E0C;&#x671B;&#x4F60;&#x4EEC;&#x559C;&#x6B22;&#x672C;&#x5468;&#x7684;&#x7F16;&#x7A0B;&#x7EC3;&#x4E60;&#xFF0C;&#x6211;&#x4EEC;&#x4E0B;&#x5468;&#x89C1;&#x3002;</p>
<p><strong>&#x53C2;&#x8003;&#x6587;&#x732E;&#xFF1A;</strong></p>
<ul>
<li>Joseph Redmon, Santosh Divvala, Ross Girshick, Ali Farhadi - <a href="https://arxiv.org/abs/1506.02640" target="_blank">You Only Look Once: Unified, Real-Time Object Detection</a> (2015)</li>
<li>Joseph Redmon, Ali Farhadi - <a href="https://arxiv.org/abs/1612.08242" target="_blank">YOLO9000: Better, Faster, Stronger</a> (2016)</li>
<li>Allan Zelener - <a href="https://github.com/allanzelener/YAD2K" target="_blank">YAD2K: Yet Another Darknet 2 Keras</a></li>
<li>The official YOLO website (<a href="https://pjreddie.com/darknet/yolo/" target="_blank">https://pjreddie.com/darknet/yolo/</a>)</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="lesson4-week2.html" class="navigation navigation-prev " aria-label="Previous page: 第二周 深度卷积网络：实例探究">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="lesson4-week4.html" class="navigation navigation-next " aria-label="Next page: 第四周 特殊应用：人脸识别和神经风格转换">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第三周 目标检测","level":"4.3","depth":1,"next":{"title":"第四周 特殊应用：人脸识别和神经风格转换","level":"4.4","depth":1,"path":"lesson4-week4.md","ref":"lesson4-week4.md","articles":[]},"previous":{"title":"第二周 深度卷积网络：实例探究","level":"4.2","depth":1,"path":"lesson4-week2.md","ref":"lesson4-week2.md","articles":[]},"dir":"ltr"},"config":{"plugins":["fontsettings","sharing","-lunr","-search","search-pro","highlight","livereload","back-to-top-button","cdn"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"cdn":{"url":"//cdn.jsdelivr.net/gh/zhepama/C-Sharp-Playground@gh-pages/","img_url":"//cdn.jsdelivr.net/gh/zhepama/C-Sharp-Playground@gh-pages/"},"fontsettings":{"family":"sans","size":2,"theme":"white"},"sharing":{"all":["facebook","google","twitter","weibo","instapaper"],"facebook":true,"google":false,"instapaper":false,"twitter":true,"vk":false,"weibo":false},"search-pro":{},"highlight":{},"livereload":{},"back-to-top-button":{},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"深度学习教程","language":"zh-hans","links":{"sidebar":{"编程网":"https://www.editcode.net"}},"gitbook":"*"},"file":{"path":"lesson4-week3.md","mtime":"2020-11-28T01:34:16.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-05-09T13:30:39.812Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook.js"></script>
    <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/theme.js"></script>
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    

    </body>
</html>

