
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第二周 深度卷积网络：实例探究 · 深度学习教程</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/style.css">

    
            
                
                <link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-back-to-top-button/plugin.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="lesson4-week3.html" />
    
    
    <link rel="prev" href="lesson4-week1.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://www.editcode.net" target="_blank" class="custom-link">编程网</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        <li class="header">第一门课 神经网络和深度学习</li>
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="lesson1-week1.html">
            
                <a href="lesson1-week1.html">
            
                    
                    第一周：深度学习引言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="lesson1-week2.html">
            
                <a href="lesson1-week2.html">
            
                    
                    第二周：神经网络的编程基础
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="lesson1-week3.html">
            
                <a href="lesson1-week3.html">
            
                    
                    第三周：浅层神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="lesson1-week4.html">
            
                <a href="lesson1-week4.html">
            
                    
                    第四周：深层神经网络
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第二门课 改善深层神经网络</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="lesson2-week1.html">
            
                <a href="lesson2-week1.html">
            
                    
                    第一周：深度学习的实践层面
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="lesson2-week2.html">
            
                <a href="lesson2-week2.html">
            
                    
                    第二周：优化算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="lesson2-week3.html">
            
                <a href="lesson2-week3.html">
            
                    
                    第三周超参数调试，batch正则化和程序框架
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第三门课 结构化机器学习项目</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="lesson3-week1.html">
            
                <a href="lesson3-week1.html">
            
                    
                    第一周：机器学习策略
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="lesson3-week2.html">
            
                <a href="lesson3-week2.html">
            
                    
                    第二周：机器学习策略
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第四门课 卷积神经网络</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="lesson4-week1.html">
            
                <a href="lesson4-week1.html">
            
                    
                    第一周 卷积神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="4.2" data-path="lesson4-week2.html">
            
                <a href="lesson4-week2.html">
            
                    
                    第二周 深度卷积网络：实例探究
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.3" data-path="lesson4-week3.html">
            
                <a href="lesson4-week3.html">
            
                    
                    第三周 目标检测
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.4" data-path="lesson4-week4.html">
            
                <a href="lesson4-week4.html">
            
                    
                    第四周 特殊应用：人脸识别和神经风格转换
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第五门课 序列模型</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="lesson5-week1.html">
            
                <a href="lesson5-week1.html">
            
                    
                    第一周 循环序列模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.2" data-path="lesson5-week2.html">
            
                <a href="lesson5-week2.html">
            
                    
                    第二周 自然语言处理与词嵌入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.3" data-path="lesson5-week3.html">
            
                <a href="lesson5-week3.html">
            
                    
                    第三周 序列模型和注意力机制
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">附件</li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="interview.html">
            
                <a href="interview.html">
            
                    
                    人工智能大师访谈
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.2" data-path="notation.html">
            
                <a href="notation.html">
            
                    
                    深度学习符号指南（原课程翻译）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.3" data-path="notation.html">
            
                <a href="notation.html">
            
                    
                    机器学习的数学基础
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第二周 深度卷积网络：实例探究</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x7B2C;&#x4E8C;&#x5468;-&#x6DF1;&#x5EA6;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#xFF1A;&#x5B9E;&#x4F8B;&#x63A2;&#x7A76;&#xFF08;deep-convolutional-models-case-studies&#xFF09;">&#x7B2C;&#x4E8C;&#x5468; &#x6DF1;&#x5EA6;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#xFF1A;&#x5B9E;&#x4F8B;&#x63A2;&#x7A76;&#xFF08;Deep convolutional models: case studies&#xFF09;</h2>
<p>[TOC]</p>
<h3 id="21-&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x8FDB;&#x884C;&#x5B9E;&#x4F8B;&#x63A2;&#x7A76;&#xFF1F;&#xFF08;why-look-at-case-studies&#xFF09;">2.1 &#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x8FDB;&#x884C;&#x5B9E;&#x4F8B;&#x63A2;&#x7A76;&#xFF1F;&#xFF08;Why look at case studies?&#xFF09;</h3>
<p>&#x8FD9;&#x5468;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x6765;&#x770B;&#x770B;&#x4E00;&#x4E9B;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x5B9E;&#x4F8B;&#x5206;&#x6790;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x770B;&#x8FD9;&#x4E9B;&#x5B9E;&#x4F8B;&#x5206;&#x6790;&#x5462;&#xFF1F;&#x4E0A;&#x5468;&#x6211;&#x4EEC;&#x8BB2;&#x4E86;&#x57FA;&#x672C;&#x6784;&#x5EFA;&#xFF0C;&#x6BD4;&#x5982;&#x5377;&#x79EF;&#x5C42;&#x3001;&#x6C60;&#x5316;&#x5C42;&#x4EE5;&#x53CA;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x8FD9;&#x4E9B;&#x7EC4;&#x4EF6;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x8FC7;&#x53BB;&#x51E0;&#x5E74;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x7814;&#x7A76;&#x4E2D;&#x7684;&#x5927;&#x91CF;&#x7814;&#x7A76;&#x90FD;&#x96C6;&#x4E2D;&#x5728;&#x5982;&#x4F55;&#x628A;&#x8FD9;&#x4E9B;&#x57FA;&#x672C;&#x6784;&#x4EF6;&#x7EC4;&#x5408;&#x8D77;&#x6765;&#xFF0C;&#x5F62;&#x6210;&#x6709;&#x6548;&#x7684;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;&#x6700;&#x76F4;&#x89C2;&#x7684;&#x65B9;&#x5F0F;&#x4E4B;&#x4E00;&#x5C31;&#x662F;&#x53BB;&#x770B;&#x4E00;&#x4E9B;&#x6848;&#x4F8B;&#xFF0C;&#x5C31;&#x50CF;&#x5F88;&#x591A;&#x4EBA;&#x901A;&#x8FC7;&#x770B;&#x522B;&#x4EBA;&#x7684;&#x4EE3;&#x7801;&#x6765;&#x5B66;&#x4E60;&#x7F16;&#x7A0B;&#x4E00;&#x6837;&#xFF0C;&#x901A;&#x8FC7;&#x7814;&#x7A76;&#x522B;&#x4EBA;&#x6784;&#x5EFA;&#x6709;&#x6548;&#x7EC4;&#x4EF6;&#x7684;&#x6848;&#x4F8B;&#x662F;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x529E;&#x6CD5;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x4EFB;&#x52A1;&#x4E2D;&#x8868;&#x73B0;&#x826F;&#x597D;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6846;&#x67B6;&#x5F80;&#x5F80;&#x4E5F;&#x9002;&#x7528;&#x4E8E;&#x5176;&#x5B83;&#x4EFB;&#x52A1;&#xFF0C;&#x4E5F;&#x8BB8;&#x4F60;&#x7684;&#x4EFB;&#x52A1;&#x4E5F;&#x4E0D;&#x4F8B;&#x5916;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x4EBA;&#x5DF2;&#x7ECF;&#x8BAD;&#x7EC3;&#x6216;&#x8005;&#x8BA1;&#x7B97;&#x51FA;&#x64C5;&#x957F;&#x8BC6;&#x522B;&#x732B;&#x3001;&#x72D7;&#x3001;&#x4EBA;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6216;&#x8005;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6846;&#x67B6;&#xFF0C;&#x800C;&#x4F60;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x8BC6;&#x522B;&#x4EFB;&#x52A1;&#x662F;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x6C7D;&#x8F66;&#xFF0C;&#x4F60;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x501F;&#x9274;&#x522B;&#x4EBA;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6846;&#x67B6;&#x6765;&#x89E3;&#x51B3;&#x81EA;&#x5DF1;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x5B66;&#x5B8C;&#x8FD9;&#x51E0;&#x8282;&#x8BFE;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x53EF;&#x4EE5;&#x8BFB;&#x4E00;&#x4E9B;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x65B9;&#x9762;&#x7684;&#x7814;&#x7A76;&#x8BBA;&#x6587;&#x4E86;&#xFF0C;&#x6211;&#x5E0C;&#x671B;&#x8FD9;&#x4E5F;&#x662F;&#x4F60;&#x5B66;&#x4E60;&#x672C;&#x8BFE;&#x7A0B;&#x7684;&#x6536;&#x83B7;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x8BFB;&#x8BBA;&#x6587;&#x5E76;&#x4E0D;&#x662F;&#x5FC5;&#x987B;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x5E0C;&#x671B;&#x5F53;&#x4F60;&#x53D1;&#x73B0;&#x4F60;&#x53EF;&#x4EE5;&#x8BFB;&#x61C2;&#x4E00;&#x4E9B;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x65B9;&#x9762;&#x7684;&#x7814;&#x7A76;&#x8BBA;&#x6587;&#x6216;&#x7814;&#x8BA8;&#x4F1A;&#x5185;&#x5BB9;&#x65F6;&#x4F1A;&#x6709;&#x4E00;&#x79CD;&#x6EE1;&#x8DB3;&#x611F;&#x3002;&#x8A00;&#x5F52;&#x6B63;&#x4F20;&#xFF0C;&#x6211;&#x4EEC;&#x8FDB;&#x5165;&#x4E3B;&#x9898;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x540E;&#x9762;&#x51E0;&#x8282;&#x8BFE;&#x7684;&#x63D0;&#x7EB2;&#xFF0C;&#x9996;&#x5148;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x51E0;&#x4E2A;&#x7ECF;&#x5178;&#x7684;&#x7F51;&#x7EDC;&#x3002;</p>
<p><img src="../images/7fb4f4ae7f3dcd200fcaacd5a3188d51.png" alt=""></p>
<p><strong>LeNet-5</strong>&#x7F51;&#x7EDC;&#xFF0C;&#x6211;&#x8BB0;&#x5F97;&#x5E94;&#x8BE5;&#x662F;1980&#x5E74;&#x4EE3;&#x7684;&#xFF0C;&#x7ECF;&#x5E38;&#x88AB;&#x5F15;&#x7528;&#x7684;<strong>AlexNet</strong>&#xFF0C;&#x8FD8;&#x6709;<strong>VGG</strong>&#x7F51;&#x7EDC;&#x3002;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x975E;&#x5E38;&#x6709;&#x6548;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8303;&#x4F8B;&#xFF0C;&#x5F53;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x601D;&#x8DEF;&#x4E3A;&#x73B0;&#x4EE3;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x6280;&#x672F;&#x7684;&#x53D1;&#x5C55;&#x5960;&#x5B9A;&#x4E86;&#x57FA;&#x7840;&#x3002;&#x8BBA;&#x6587;&#x4E2D;&#x7684;&#x8FD9;&#x4E9B;&#x60F3;&#x6CD5;&#x53EF;&#x80FD;&#x5BF9;&#x4F60;&#x5927;&#x6709;&#x88E8;&#x76CA;&#xFF0C;&#x5BF9;&#x4F60;&#x7684;&#x5DE5;&#x4F5C;&#x4E5F;&#x53EF;&#x80FD;&#x6709;&#x6240;&#x5E2E;&#x52A9;&#x3002;</p>
<p>&#x7136;&#x540E;&#x662F;<strong>ResNet</strong>&#xFF0C;&#x53C8;&#x79F0;&#x6B8B;&#x5DEE;&#x7F51;&#x7EDC;&#x3002;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6B63;&#x5728;&#x4E0D;&#x65AD;&#x52A0;&#x6DF1;&#xFF0C;&#x5BF9;&#x6B64;&#x4F60;&#x53EF;&#x80FD;&#x6709;&#x6240;&#x4E86;&#x89E3;&#x3002;<strong>ResNet</strong>&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8BAD;&#x7EC3;&#x4E86;&#x4E00;&#x4E2A;&#x6DF1;&#x8FBE;152&#x5C42;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x5982;&#x4F55;&#x6709;&#x6548;&#x8BAD;&#x7EC3;&#x65B9;&#x9762;&#xFF0C;&#x603B;&#x7ED3;&#x51FA;&#x4E86;&#x4E00;&#x4E9B;&#x6709;&#x8DA3;&#x7684;&#x60F3;&#x6CD5;&#x548C;&#x7A8D;&#x95E8;&#x3002;&#x8BFE;&#x7A0B;&#x6700;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x4F1A;&#x8BB2;&#x4E00;&#x4E2A;<strong>Inception</strong>&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x5B9E;&#x4F8B;&#x5206;&#x6790;&#x3002;</p>
<p>&#x4E86;&#x89E3;&#x4E86;&#x8FD9;&#x4E9B;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x6211;&#x76F8;&#x4FE1;&#x4F60;&#x4F1A;&#x5BF9;&#x5982;&#x4F55;&#x6784;&#x5EFA;&#x6709;&#x6548;&#x7684;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x66F4;&#x6709;&#x611F;&#x89C9;&#x3002;&#x5373;&#x4F7F;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x5E76;&#x4E0D;&#x662F;&#x4F60;&#x7684;&#x4E3B;&#x8981;&#x65B9;&#x5411;&#xFF0C;&#x4F46;&#x6211;&#x76F8;&#x4FE1;&#x4F60;&#x4F1A;&#x4ECE;<strong>ResNet</strong>&#x548C;<strong>Inception</strong>&#x7F51;&#x7EDC;&#x8FD9;&#x6837;&#x7684;&#x5B9E;&#x4F8B;&#x4E2D;&#x627E;&#x5230;&#x4E00;&#x4E9B;&#x4E0D;&#x9519;&#x7684;&#x60F3;&#x6CD5;&#x3002;&#x8FD9;&#x91CC;&#x9762;&#x6709;&#x5F88;&#x591A;&#x601D;&#x8DEF;&#x90FD;&#x662F;&#x591A;&#x5B66;&#x79D1;&#x878D;&#x5408;&#x7684;&#x4EA7;&#x7269;&#x3002;&#x603B;&#x4E4B;&#xFF0C;&#x5373;&#x4FBF;&#x4F60;&#x4E0D;&#x6253;&#x7B97;&#x6784;&#x5EFA;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x8BD5;&#x7740;&#x4ECE;&#x4E2D;&#x53D1;&#x73B0;&#x4E00;&#x4E9B;&#x6709;&#x8DA3;&#x7684;&#x601D;&#x8DEF;&#xFF0C;&#x5BF9;&#x4F60;&#x7684;&#x5DE5;&#x4F5C;&#x4E5F;&#x4F1A;&#x6709;&#x6240;&#x5E2E;&#x52A9;&#x3002;</p>
<h3 id="22-&#x7ECF;&#x5178;&#x7F51;&#x7EDC;&#xFF08;classic-networks&#xFF09;">2.2 &#x7ECF;&#x5178;&#x7F51;&#x7EDC;&#xFF08;Classic networks&#xFF09;</h3>
<p>&#x8FD9;&#x8282;&#x8BFE;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x5B66;&#x4E60;&#x51E0;&#x4E2A;&#x7ECF;&#x5178;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7ED3;&#x6784;&#xFF0C;&#x5206;&#x522B;&#x662F;<strong>LeNet-5</strong>&#x3001;<strong>AlexNet</strong>&#x548C;<strong>VGGNet</strong>&#xFF0C;&#x5F00;&#x59CB;&#x5427;&#x3002;</p>
<p>&#x9996;&#x5148;&#x770B;&#x770B;<strong>LeNet-5</strong>&#x7684;&#x7F51;&#x7EDC;&#x7ED3;&#x6784;&#xFF0C;&#x5047;&#x8BBE;&#x4F60;&#x6709;&#x4E00;&#x5F20;32&#xD7;32&#xD7;1&#x7684;&#x56FE;&#x7247;&#xFF0C;<strong>LeNet-5</strong>&#x53EF;&#x4EE5;&#x8BC6;&#x522B;&#x56FE;&#x4E2D;&#x7684;&#x624B;&#x5199;&#x6570;&#x5B57;&#xFF0C;&#x6BD4;&#x5982;&#x50CF;&#x8FD9;&#x6837;&#x624B;&#x5199;&#x6570;&#x5B57;7&#x3002;<strong>LeNet-5</strong>&#x662F;&#x9488;&#x5BF9;&#x7070;&#x5EA6;&#x56FE;&#x7247;&#x8BAD;&#x7EC3;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x56FE;&#x7247;&#x7684;&#x5927;&#x5C0F;&#x53EA;&#x6709;32&#xD7;32&#xD7;1&#x3002;&#x5B9E;&#x9645;&#x4E0A;<strong>LeNet-5</strong>&#x7684;&#x7ED3;&#x6784;&#x548C;&#x6211;&#x4EEC;&#x4E0A;&#x5468;&#x8BB2;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x8303;&#x4F8B;&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#xFF0C;&#x4F7F;&#x7528;6&#x4E2A;5&#xD7;5&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x6B65;&#x5E45;&#x4E3A;1&#x3002;&#x7531;&#x4E8E;&#x4F7F;&#x7528;&#x4E86;6&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x6B65;&#x5E45;&#x4E3A;1&#xFF0C;<strong>padding</strong>&#x4E3A;0&#xFF0C;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x4E3A;28&#xD7;28&#xD7;6&#xFF0C;&#x56FE;&#x50CF;&#x5C3A;&#x5BF8;&#x4ECE;32&#xD7;32&#x7F29;&#x5C0F;&#x5230;28&#xD7;28&#x3002;&#x7136;&#x540E;&#x8FDB;&#x884C;&#x6C60;&#x5316;&#x64CD;&#x4F5C;&#xFF0C;&#x5728;&#x8FD9;&#x7BC7;&#x8BBA;&#x6587;&#x5199;&#x6210;&#x7684;&#x90A3;&#x4E2A;&#x5E74;&#x4EE3;&#xFF0C;&#x4EBA;&#x4EEC;&#x66F4;&#x559C;&#x6B22;&#x4F7F;&#x7528;&#x5E73;&#x5747;&#x6C60;&#x5316;&#xFF0C;&#x800C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x7528;&#x6700;&#x5927;&#x6C60;&#x5316;&#x66F4;&#x591A;&#x4E00;&#x4E9B;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8FDB;&#x884C;&#x5E73;&#x5747;&#x6C60;&#x5316;&#xFF0C;&#x8FC7;&#x6EE4;&#x5668;&#x7684;&#x5BBD;&#x5EA6;&#x4E3A;2&#xFF0C;&#x6B65;&#x5E45;&#x4E3A;2&#xFF0C;&#x56FE;&#x50CF;&#x7684;&#x5C3A;&#x5BF8;&#xFF0C;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#x90FD;&#x7F29;&#x5C0F;&#x4E86;2&#x500D;&#xFF0C;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x662F;&#x4E00;&#x4E2A;14&#xD7;14&#xD7;6&#x7684;&#x56FE;&#x50CF;&#x3002;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x5F20;&#x56FE;&#x7247;&#x5E94;&#x8BE5;&#x4E0D;&#x662F;&#x5B8C;&#x5168;&#x6309;&#x7167;&#x6BD4;&#x4F8B;&#x7ED8;&#x5236;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4E25;&#x683C;&#x6309;&#x7167;&#x6BD4;&#x4F8B;&#x7ED8;&#x5236;&#xFF0C;&#x65B0;&#x56FE;&#x50CF;&#x7684;&#x5C3A;&#x5BF8;&#x5E94;&#x8BE5;&#x521A;&#x597D;&#x662F;&#x539F;&#x56FE;&#x50CF;&#x7684;&#x4E00;&#x534A;&#x3002;</p>
<p><img src="../images/a3931d10222ebaf43490935d391eeceb.png" alt=""></p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x662F;&#x5377;&#x79EF;&#x5C42;&#xFF0C;&#x6211;&#x4EEC;&#x7528;&#x4E00;&#x7EC4;16&#x4E2A;5&#xD7;5&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x65B0;&#x7684;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x6709;16&#x4E2A;&#x901A;&#x9053;&#x3002;<strong>LeNet-5</strong>&#x7684;&#x8BBA;&#x6587;&#x662F;&#x5728;1998&#x5E74;&#x64B0;&#x5199;&#x7684;&#xFF0C;&#x5F53;&#x65F6;&#x4EBA;&#x4EEC;&#x5E76;&#x4E0D;&#x4F7F;&#x7528;<strong>padding</strong>&#xFF0C;&#x6216;&#x8005;&#x603B;&#x662F;&#x4F7F;&#x7528;<strong>valid</strong>&#x5377;&#x79EF;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x6BCF;&#x8FDB;&#x884C;&#x4E00;&#x6B21;&#x5377;&#x79EF;&#xFF0C;&#x56FE;&#x50CF;&#x7684;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#x90FD;&#x4F1A;&#x7F29;&#x5C0F;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x56FE;&#x50CF;&#x4ECE;14&#x5230;14&#x7F29;&#x5C0F;&#x5230;&#x4E86;10&#xD7;10&#x3002;&#x7136;&#x540E;&#x53C8;&#x662F;&#x6C60;&#x5316;&#x5C42;&#xFF0C;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#x518D;&#x7F29;&#x5C0F;&#x4E00;&#x534A;&#xFF0C;&#x8F93;&#x51FA;&#x4E00;&#x4E2A;5&#xD7;5&#xD7;16&#x7684;&#x56FE;&#x50CF;&#x3002;&#x5C06;&#x6240;&#x6709;&#x6570;&#x5B57;&#x76F8;&#x4E58;&#xFF0C;&#x4E58;&#x79EF;&#x662F;400&#x3002;</p>
<p>&#x4E0B;&#x4E00;&#x5C42;&#x662F;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#xFF0C;&#x5728;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x4E2D;&#xFF0C;&#x6709;400&#x4E2A;&#x8282;&#x70B9;&#xFF0C;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x6709;120&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#xFF0C;&#x8FD9;&#x91CC;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x3002;&#x4F46;&#x6709;&#x65F6;&#x8FD8;&#x4F1A;&#x4ECE;&#x8FD9;400&#x4E2A;&#x8282;&#x70B9;&#x4E2D;&#x62BD;&#x53D6;&#x4E00;&#x90E8;&#x5206;&#x8282;&#x70B9;&#x6784;&#x5EFA;&#x53E6;&#x4E00;&#x4E2A;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#xFF0C;&#x5C31;&#x50CF;&#x8FD9;&#x6837;&#xFF0C;&#x6709;2&#x4E2A;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x3002;</p>
<p>&#x6700;&#x540E;&#x4E00;&#x6B65;&#x5C31;&#x662F;&#x5229;&#x7528;&#x8FD9;84&#x4E2A;&#x7279;&#x5F81;&#x5F97;&#x5230;&#x6700;&#x540E;&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x53EF;&#x4EE5;&#x5728;&#x8FD9;&#x91CC;&#x518D;&#x52A0;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x7528;&#x6765;&#x9884;&#x6D4B;$\hat{y}$&#x7684;&#x503C;&#xFF0C;$\hat{y}$&#x6709;10&#x4E2A;&#x53EF;&#x80FD;&#x7684;&#x503C;&#xFF0C;&#x5BF9;&#x5E94;&#x8BC6;&#x522B;0-9&#x8FD9;10&#x4E2A;&#x6570;&#x5B57;&#x3002;&#x5728;&#x73B0;&#x5728;&#x7684;&#x7248;&#x672C;&#x4E2D;&#x5219;&#x4F7F;&#x7528;<strong>softmax</strong>&#x51FD;&#x6570;&#x8F93;&#x51FA;&#x5341;&#x79CD;&#x5206;&#x7C7B;&#x7ED3;&#x679C;&#xFF0C;&#x800C;&#x5728;&#x5F53;&#x65F6;&#xFF0C;<strong>LeNet-5</strong>&#x7F51;&#x7EDC;&#x5728;&#x8F93;&#x51FA;&#x5C42;&#x4F7F;&#x7528;&#x4E86;&#x53E6;&#x5916;&#x4E00;&#x79CD;&#xFF0C;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x5F88;&#x5C11;&#x7528;&#x5230;&#x7684;&#x5206;&#x7C7B;&#x5668;&#x3002;</p>
<p>&#x76F8;&#x6BD4;&#x73B0;&#x4EE3;&#x7248;&#x672C;&#xFF0C;&#x8FD9;&#x91CC;&#x5F97;&#x5230;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4F1A;&#x5C0F;&#x4E00;&#x4E9B;&#xFF0C;&#x53EA;&#x6709;&#x7EA6;6&#x4E07;&#x4E2A;&#x53C2;&#x6570;&#x3002;&#x800C;&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x770B;&#x5230;&#x542B;&#x6709;&#x4E00;&#x5343;&#x4E07;&#x5230;&#x4E00;&#x4EBF;&#x4E2A;&#x53C2;&#x6570;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x6BD4;&#x8FD9;&#x5927;1000&#x500D;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E5F;&#x4E0D;&#x5728;&#x5C11;&#x6570;&#x3002;</p>
<p>&#x4E0D;&#x7BA1;&#x600E;&#x6837;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4ECE;&#x5DE6;&#x5F80;&#x53F3;&#x770B;&#xFF0C;&#x968F;&#x7740;&#x7F51;&#x7EDC;&#x8D8A;&#x6765;&#x8D8A;&#x6DF1;&#xFF0C;&#x56FE;&#x50CF;&#x7684;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#x5728;&#x7F29;&#x5C0F;&#xFF0C;&#x4ECE;&#x6700;&#x521D;&#x7684;32&#xD7;32&#x7F29;&#x5C0F;&#x5230;28&#xD7;28&#xFF0C;&#x518D;&#x5230;14&#xD7;14&#x3001;10&#xD7;10&#xFF0C;&#x6700;&#x540E;&#x53EA;&#x6709;5&#xD7;5&#x3002;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#xFF0C;&#x968F;&#x7740;&#x7F51;&#x7EDC;&#x5C42;&#x6B21;&#x7684;&#x52A0;&#x6DF1;&#xFF0C;&#x901A;&#x9053;&#x6570;&#x91CF;&#x4E00;&#x76F4;&#x5728;&#x589E;&#x52A0;&#xFF0C;&#x4ECE;1&#x589E;&#x52A0;&#x5230;6&#x4E2A;&#xFF0C;&#x518D;&#x5230;16&#x4E2A;&#x3002;</p>
<p><img src="../images/5e59b38c9b2942a407b49da84677dae9.png" alt=""></p>
<p>&#x8FD9;&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x6A21;&#x5F0F;&#x81F3;&#x4ECA;&#x4ECD;&#x7136;&#x7ECF;&#x5E38;&#x7528;&#x5230;&#xFF0C;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x540E;&#x9762;&#x8DDF;&#x7740;&#x4E00;&#x4E2A;&#x6C60;&#x5316;&#x5C42;&#xFF0C;&#x7136;&#x540E;&#x53C8;&#x662F;&#x82E5;&#x5E72;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x518D;&#x63A5;&#x4E00;&#x4E2A;&#x6C60;&#x5316;&#x5C42;&#xFF0C;&#x7136;&#x540E;&#x662F;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#xFF0C;&#x6700;&#x540E;&#x662F;&#x8F93;&#x51FA;&#xFF0C;&#x8FD9;&#x79CD;&#x6392;&#x5217;&#x65B9;&#x5F0F;&#x5F88;&#x5E38;&#x7528;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x90A3;&#x4E9B;&#x60F3;&#x5C1D;&#x8BD5;&#x9605;&#x8BFB;&#x8BBA;&#x6587;&#x7684;&#x540C;&#x5B66;&#xFF0C;&#x6211;&#x518D;&#x8865;&#x5145;&#x51E0;&#x70B9;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x90E8;&#x5206;&#x4E3B;&#x8981;&#x9488;&#x5BF9;&#x90A3;&#x4E9B;&#x6253;&#x7B97;&#x9605;&#x8BFB;&#x7ECF;&#x5178;&#x8BBA;&#x6587;&#x7684;&#x540C;&#x5B66;&#xFF0C;&#x6240;&#x4EE5;&#x4F1A;&#x66F4;&#x52A0;&#x6DF1;&#x5165;&#x3002;&#x8FD9;&#x4E9B;&#x5185;&#x5BB9;&#x4F60;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x8DF3;&#x8FC7;&#xFF0C;&#x7B97;&#x662F;&#x5BF9;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5386;&#x53F2;&#x7684;&#x4E00;&#x79CD;&#x56DE;&#x987E;&#x5427;&#xFF0C;&#x542C;&#x4E0D;&#x61C2;&#x4E5F;&#x4E0D;&#x8981;&#x7D27;&#x3002;</p>
<p>&#x8BFB;&#x5230;&#x8FD9;&#x7BC7;&#x7ECF;&#x5178;&#x8BBA;&#x6587;&#x65F6;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x8FC7;&#x53BB;&#xFF0C;&#x4EBA;&#x4EEC;&#x4F7F;&#x7528;<strong>sigmod</strong>&#x51FD;&#x6570;&#x548C;<strong>tanh</strong>&#x51FD;&#x6570;&#xFF0C;&#x800C;&#x4E0D;&#x662F;<strong>ReLu</strong>&#x51FD;&#x6570;&#xFF0C;&#x8FD9;&#x7BC7;&#x8BBA;&#x6587;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x6B63;&#x662F;<strong>sigmod</strong>&#x51FD;&#x6570;&#x548C;<strong>tanh</strong>&#x51FD;&#x6570;&#x3002;&#x8FD9;&#x79CD;&#x7F51;&#x7EDC;&#x7ED3;&#x6784;&#x7684;&#x7279;&#x522B;&#x4E4B;&#x5904;&#x8FD8;&#x5728;&#x4E8E;&#xFF0C;&#x5404;&#x7F51;&#x7EDC;&#x5C42;&#x4E4B;&#x95F4;&#x662F;&#x6709;&#x5173;&#x8054;&#x7684;&#xFF0C;&#x8FD9;&#x5728;&#x4ECA;&#x5929;&#x770B;&#x6765;&#x663E;&#x5F97;&#x5F88;&#x6709;&#x8DA3;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x4F60;&#x6709;&#x4E00;&#x4E2A;$n<em>{H} \times n</em>{W} \times n<em>{C}$&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x6709;$n</em>{C}$&#x4E2A;&#x901A;&#x9053;&#xFF0C;&#x4F7F;&#x7528;&#x5C3A;&#x5BF8;&#x4E3A;$f&#xD7;f&#xD7;n_{C}$&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x6BCF;&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#x7684;&#x901A;&#x9053;&#x6570;&#x548C;&#x5B83;&#x4E0A;&#x4E00;&#x5C42;&#x7684;&#x901A;&#x9053;&#x6570;&#x76F8;&#x540C;&#x3002;&#x8FD9;&#x662F;&#x7531;&#x4E8E;&#x5728;&#x5F53;&#x65F6;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x8FD0;&#x884C;&#x901F;&#x5EA6;&#x975E;&#x5E38;&#x6162;&#xFF0C;&#x4E3A;&#x4E86;&#x51CF;&#x5C11;&#x8BA1;&#x7B97;&#x91CF;&#x548C;&#x53C2;&#x6570;&#xFF0C;&#x7ECF;&#x5178;&#x7684;<strong>LeNet-5</strong>&#x7F51;&#x7EDC;&#x4F7F;&#x7528;&#x4E86;&#x975E;&#x5E38;&#x590D;&#x6742;&#x7684;&#x8BA1;&#x7B97;&#x65B9;&#x5F0F;&#xFF0C;&#x6BCF;&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#x90FD;&#x91C7;&#x7528;&#x548C;&#x8F93;&#x5165;&#x6A21;&#x5757;&#x4E00;&#x6837;&#x7684;&#x901A;&#x9053;&#x6570;&#x91CF;&#x3002;&#x8BBA;&#x6587;&#x4E2D;&#x63D0;&#x5230;&#x7684;&#x8FD9;&#x4E9B;&#x590D;&#x6742;&#x7EC6;&#x8282;&#xFF0C;&#x73B0;&#x5728;&#x4E00;&#x822C;&#x90FD;&#x4E0D;&#x7528;&#x4E86;&#x3002;</p>
<p>&#x6211;&#x8BA4;&#x4E3A;&#x5F53;&#x65F6;&#x6240;&#x8FDB;&#x884C;&#x7684;&#x6700;&#x540E;&#x4E00;&#x6B65;&#x5176;&#x5B9E;&#x5230;&#x73B0;&#x5728;&#x4E5F;&#x8FD8;&#x6CA1;&#x6709;&#x771F;&#x6B63;&#x5B8C;&#x6210;&#xFF0C;&#x5C31;&#x662F;&#x7ECF;&#x5178;&#x7684;<strong>LeNet-5</strong>&#x7F51;&#x7EDC;&#x5728;&#x6C60;&#x5316;&#x540E;&#x8FDB;&#x884C;&#x4E86;&#x975E;&#x7EBF;&#x6027;&#x51FD;&#x6570;&#x5904;&#x7406;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6C60;&#x5316;&#x5C42;&#x4E4B;&#x540E;&#x4F7F;&#x7528;&#x4E86;<strong>sigmod</strong>&#x51FD;&#x6570;&#x3002;&#x5982;&#x679C;&#x4F60;&#x771F;&#x7684;&#x53BB;&#x8BFB;&#x8FD9;&#x7BC7;&#x8BBA;&#x6587;&#xFF0C;&#x8FD9;&#x4F1A;&#x662F;&#x6700;&#x96BE;&#x7406;&#x89E3;&#x7684;&#x90E8;&#x5206;&#x4E4B;&#x4E00;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x5728;&#x540E;&#x9762;&#x7684;&#x8BFE;&#x7A0B;&#x4E2D;&#x8BB2;&#x5230;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x8981;&#x8BB2;&#x7684;&#x7F51;&#x7EDC;&#x7ED3;&#x6784;&#x7B80;&#x5355;&#x4E00;&#x4E9B;&#xFF0C;&#x5E7B;&#x706F;&#x7247;&#x7684;&#x5927;&#x90E8;&#x5206;&#x7C7B;&#x5BB9;&#x6765;&#x81EA;&#x4E8E;&#x539F;&#x6587;&#x7684;&#x7B2C;&#x4E8C;&#x6BB5;&#x548C;&#x7B2C;&#x4E09;&#x6BB5;&#xFF0C;&#x539F;&#x6587;&#x7684;&#x540E;&#x51E0;&#x6BB5;&#x4ECB;&#x7ECD;&#x4E86;&#x53E6;&#x5916;&#x4E00;&#x79CD;&#x601D;&#x8DEF;&#x3002;&#x6587;&#x4E2D;&#x63D0;&#x5230;&#x7684;&#x8FD9;&#x79CD;&#x56FE;&#x5F62;&#x53D8;&#x5F62;&#x7F51;&#x7EDC;&#x5982;&#x4ECA;&#x5E76;&#x6CA1;&#x6709;&#x5F97;&#x5230;&#x5E7F;&#x6CDB;&#x5E94;&#x7528;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x8BFB;&#x8FD9;&#x7BC7;&#x8BBA;&#x6587;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x5EFA;&#x8BAE;&#x7CBE;&#x8BFB;&#x7B2C;&#x4E8C;&#x6BB5;&#xFF0C;&#x8FD9;&#x6BB5;&#x91CD;&#x70B9;&#x4ECB;&#x7ECD;&#x4E86;&#x8FD9;&#x79CD;&#x7F51;&#x7EDC;&#x7ED3;&#x6784;&#x3002;&#x6CDB;&#x8BFB;&#x7B2C;&#x4E09;&#x6BB5;&#xFF0C;&#x8FD9;&#x91CC;&#x9762;&#x4E3B;&#x8981;&#x662F;&#x4E00;&#x4E9B;&#x6709;&#x8DA3;&#x7684;&#x5B9E;&#x9A8C;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x6211;&#x8981;&#x4E3E;&#x4F8B;&#x8BF4;&#x660E;&#x7684;&#x7B2C;&#x4E8C;&#x79CD;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x662F;<strong>AlexNet</strong>&#xFF0C;&#x662F;&#x4EE5;&#x8BBA;&#x6587;&#x7684;&#x7B2C;&#x4E00;&#x4F5C;&#x8005;<strong>Alex Krizhevsky</strong>&#x7684;&#x540D;&#x5B57;&#x547D;&#x540D;&#x7684;&#xFF0C;&#x53E6;&#x5916;&#x4E24;&#x4F4D;&#x5408;&#x8457;&#x8005;&#x662F;<strong>ilya Sutskever</strong>&#x548C;<strong>Geoffery Hinton</strong>&#x3002;</p>
<p><img src="../images/6a9d80274dc6315d9d8c0c27b81548b4.png" alt=""></p>
<p><strong>AlexNet</strong>&#x9996;&#x5148;&#x7528;&#x4E00;&#x5F20;227&#xD7;227&#xD7;3&#x7684;&#x56FE;&#x7247;&#x4F5C;&#x4E3A;&#x8F93;&#x5165;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x539F;&#x6587;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x56FE;&#x50CF;&#x662F;224&#xD7;224&#xD7;3&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x4F60;&#x5C1D;&#x8BD5;&#x53BB;&#x63A8;&#x5BFC;&#x4E00;&#x4E0B;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;227&#xD7;227&#x8FD9;&#x4E2A;&#x5C3A;&#x5BF8;&#x66F4;&#x597D;&#x4E00;&#x4E9B;&#x3002;&#x7B2C;&#x4E00;&#x5C42;&#x6211;&#x4EEC;&#x4F7F;&#x7528;96&#x4E2A;11&#xD7;11&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x6B65;&#x5E45;&#x4E3A;4&#xFF0C;&#x7531;&#x4E8E;&#x6B65;&#x5E45;&#x662F;4&#xFF0C;&#x56E0;&#x6B64;&#x5C3A;&#x5BF8;&#x7F29;&#x5C0F;&#x5230;55&#xD7;55&#xFF0C;&#x7F29;&#x5C0F;&#x4E86;4&#x500D;&#x5DE6;&#x53F3;&#x3002;&#x7136;&#x540E;&#x7528;&#x4E00;&#x4E2A;3&#xD7;3&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x6784;&#x5EFA;&#x6700;&#x5927;&#x6C60;&#x5316;&#x5C42;&#xFF0C;$f=3$&#xFF0C;&#x6B65;&#x5E45;$s$&#x4E3A;2&#xFF0C;&#x5377;&#x79EF;&#x5C42;&#x5C3A;&#x5BF8;&#x7F29;&#x5C0F;&#x4E3A;27&#xD7;27&#xD7;96&#x3002;&#x63A5;&#x7740;&#x518D;&#x6267;&#x884C;&#x4E00;&#x4E2A;5&#xD7;5&#x7684;&#x5377;&#x79EF;&#xFF0C;<strong>padding</strong>&#x4E4B;&#x540E;&#xFF0C;&#x8F93;&#x51FA;&#x662F;27&#xD7;27&#xD7;276&#x3002;&#x7136;&#x540E;&#x518D;&#x6B21;&#x8FDB;&#x884C;&#x6700;&#x5927;&#x6C60;&#x5316;&#xFF0C;&#x5C3A;&#x5BF8;&#x7F29;&#x5C0F;&#x5230;13&#xD7;13&#x3002;&#x518D;&#x6267;&#x884C;&#x4E00;&#x6B21;<strong>same</strong>&#x5377;&#x79EF;&#xFF0C;&#x76F8;&#x540C;&#x7684;<strong>padding</strong>&#xFF0C;&#x5F97;&#x5230;&#x7684;&#x7ED3;&#x679C;&#x662F;13&#xD7;13&#xD7;384&#xFF0C;384&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#x3002;&#x518D;&#x505A;&#x4E00;&#x6B21;<strong>same</strong>&#x5377;&#x79EF;&#xFF0C;&#x5C31;&#x50CF;&#x8FD9;&#x6837;&#x3002;&#x518D;&#x505A;&#x4E00;&#x6B21;&#x540C;&#x6837;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x6700;&#x540E;&#x518D;&#x8FDB;&#x884C;&#x4E00;&#x6B21;&#x6700;&#x5927;&#x6C60;&#x5316;&#xFF0C;&#x5C3A;&#x5BF8;&#x7F29;&#x5C0F;&#x5230;6&#xD7;6&#xD7;256&#x3002;6&#xD7;6&#xD7;256&#x7B49;&#x4E8E;9216&#xFF0C;&#x5C06;&#x5176;&#x5C55;&#x5F00;&#x4E3A;9216&#x4E2A;&#x5355;&#x5143;&#xFF0C;&#x7136;&#x540E;&#x662F;&#x4E00;&#x4E9B;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x3002;&#x6700;&#x540E;&#x4F7F;&#x7528;<strong>softmax</strong>&#x51FD;&#x6570;&#x8F93;&#x51FA;&#x8BC6;&#x522B;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x770B;&#x5B83;&#x7A76;&#x7ADF;&#x662F;1000&#x4E2A;&#x53EF;&#x80FD;&#x7684;&#x5BF9;&#x8C61;&#x4E2D;&#x7684;&#x54EA;&#x4E00;&#x4E2A;&#x3002;</p>
<p>&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x8FD9;&#x79CD;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E0E;<strong>LeNet</strong>&#x6709;&#x5F88;&#x591A;&#x76F8;&#x4F3C;&#x4E4B;&#x5904;&#xFF0C;&#x4E0D;&#x8FC7;<strong>AlexNet</strong>&#x8981;&#x5927;&#x5F97;&#x591A;&#x3002;&#x6B63;&#x5982;&#x524D;&#x9762;&#x8BB2;&#x5230;&#x7684;<strong>LeNet</strong>&#x6216;<strong>LeNet-5</strong>&#x5927;&#x7EA6;&#x6709;6&#x4E07;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x800C;<strong>AlexNet</strong>&#x5305;&#x542B;&#x7EA6;6000&#x4E07;&#x4E2A;&#x53C2;&#x6570;&#x3002;&#x5F53;&#x7528;&#x4E8E;&#x8BAD;&#x7EC3;&#x56FE;&#x50CF;&#x548C;&#x6570;&#x636E;&#x96C6;&#x65F6;&#xFF0C;<strong>AlexNet</strong>&#x80FD;&#x591F;&#x5904;&#x7406;&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#x7684;&#x57FA;&#x672C;&#x6784;&#x9020;&#x6A21;&#x5757;&#xFF0C;&#x8FD9;&#x4E9B;&#x6A21;&#x5757;&#x5F80;&#x5F80;&#x5305;&#x542B;&#x7740;&#x5927;&#x91CF;&#x7684;&#x9690;&#x85CF;&#x5355;&#x5143;&#x6216;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;<strong>AlexNet</strong>&#x8868;&#x73B0;&#x51FA;&#x8272;&#x3002;<strong>AlexNet</strong>&#x6BD4;<strong>LeNet</strong>&#x8868;&#x73B0;&#x66F4;&#x4E3A;&#x51FA;&#x8272;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#x662F;&#x5B83;&#x4F7F;&#x7528;&#x4E86;<strong>ReLu</strong>&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x3002;</p>
<p><img src="../images/92575493ecd20003b0b76ac51de0efbb.png" alt=""></p>
<p>&#x540C;&#x6837;&#x7684;&#xFF0C;&#x6211;&#x8FD8;&#x4F1A;&#x8BB2;&#x4E00;&#x4E9B;&#x6BD4;&#x8F83;&#x6DF1;&#x5965;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5E76;&#x4E0D;&#x6253;&#x7B97;&#x9605;&#x8BFB;&#x8BBA;&#x6587;&#xFF0C;&#x4E0D;&#x542C;&#x4E5F;&#x6CA1;&#x6709;&#x5173;&#x7CFB;&#x3002;&#x7B2C;&#x4E00;&#x70B9;&#xFF0C;&#x5728;&#x5199;&#x8FD9;&#x7BC7;&#x8BBA;&#x6587;&#x7684;&#x65F6;&#x5019;&#xFF0C;<strong>GPU</strong>&#x7684;&#x5904;&#x7406;&#x901F;&#x5EA6;&#x8FD8;&#x6BD4;&#x8F83;&#x6162;&#xFF0C;&#x6240;&#x4EE5;<strong>AlexNet</strong>&#x91C7;&#x7528;&#x4E86;&#x975E;&#x5E38;&#x590D;&#x6742;&#x7684;&#x65B9;&#x6CD5;&#x5728;&#x4E24;&#x4E2A;<strong>GPU</strong>&#x4E0A;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#x3002;&#x5927;&#x81F4;&#x539F;&#x7406;&#x662F;&#xFF0C;&#x8FD9;&#x4E9B;&#x5C42;&#x5206;&#x522B;&#x62C6;&#x5206;&#x5230;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;<strong>GPU</strong>&#x4E0A;&#xFF0C;&#x540C;&#x65F6;&#x8FD8;&#x4E13;&#x95E8;&#x6709;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x7528;&#x4E8E;&#x4E24;&#x4E2A;<strong>GPU</strong>&#x8FDB;&#x884C;&#x4EA4;&#x6D41;&#x3002;</p>
<p><img src="../images/1c258ebaf8c400984a0bc777232fe1d6.png" alt=""></p>
<p>&#x8BBA;&#x6587;&#x8FD8;&#x63D0;&#x5230;&#xFF0C;&#x7ECF;&#x5178;&#x7684;<strong>AlexNet</strong>&#x7ED3;&#x6784;&#x8FD8;&#x6709;&#x53E6;&#x4E00;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x5C42;&#xFF0C;&#x53EB;&#x4F5C;&#x201C;&#x5C40;&#x90E8;&#x54CD;&#x5E94;&#x5F52;&#x4E00;&#x5316;&#x5C42;&#x201D;&#xFF08;<strong>Local Response Normalization</strong>&#xFF09;&#xFF0C;&#x5373;<strong>LRN</strong>&#x5C42;&#xFF0C;&#x8FD9;&#x7C7B;&#x5C42;&#x5E94;&#x7528;&#x5F97;&#x5E76;&#x4E0D;&#x591A;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x5E76;&#x6CA1;&#x6709;&#x4E13;&#x95E8;&#x8BB2;&#x3002;&#x5C40;&#x90E8;&#x54CD;&#x5E94;&#x5F52;&#x4E00;&#x5C42;&#x7684;&#x57FA;&#x672C;&#x601D;&#x8DEF;&#x662F;&#xFF0C;&#x5047;&#x5982;&#x8FD9;&#x662F;&#x7F51;&#x7EDC;&#x7684;&#x4E00;&#x5757;&#xFF0C;&#x6BD4;&#x5982;&#x662F;13&#xD7;13&#xD7;256&#xFF0C;<strong>LRN</strong>&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x9009;&#x53D6;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#xFF0C;&#x4ECE;&#x8FD9;&#x4E2A;&#x4F4D;&#x7F6E;&#x7A7F;&#x8FC7;&#x6574;&#x4E2A;&#x901A;&#x9053;&#xFF0C;&#x80FD;&#x5F97;&#x5230;256&#x4E2A;&#x6570;&#x5B57;&#xFF0C;&#x5E76;&#x8FDB;&#x884C;&#x5F52;&#x4E00;&#x5316;&#x3002;&#x8FDB;&#x884C;&#x5C40;&#x90E8;&#x54CD;&#x5E94;&#x5F52;&#x4E00;&#x5316;&#x7684;&#x52A8;&#x673A;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FD9;&#x5F20;13&#xD7;13&#x7684;&#x56FE;&#x50CF;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x4F4D;&#x7F6E;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x592A;&#x591A;&#x7684;&#x9AD8;&#x6FC0;&#x6D3B;&#x795E;&#x7ECF;&#x5143;&#x3002;&#x4F46;&#x662F;&#x540E;&#x6765;&#xFF0C;&#x5F88;&#x591A;&#x7814;&#x7A76;&#x8005;&#x53D1;&#x73B0;<strong>LRN</strong>&#x8D77;&#x4E0D;&#x5230;&#x592A;&#x5927;&#x4F5C;&#x7528;&#xFF0C;&#x8FD9;&#x5E94;&#x8BE5;&#x662F;&#x88AB;&#x6211;&#x5212;&#x6389;&#x7684;&#x5185;&#x5BB9;&#x4E4B;&#x4E00;&#xFF0C;&#x56E0;&#x4E3A;&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x800C;&#x4E14;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x5E76;&#x4E0D;&#x7528;<strong>LRN</strong>&#x6765;&#x8BAD;&#x7EC3;&#x7F51;&#x7EDC;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x5386;&#x53F2;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x5728;<strong>AlexNet</strong>&#x4E4B;&#x524D;&#xFF0C;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x5DF2;&#x7ECF;&#x5728;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#x548C;&#x5176;&#x5B83;&#x51E0;&#x4E2A;&#x9886;&#x57DF;&#x83B7;&#x5F97;&#x4E86;&#x4E00;&#x4E9B;&#x5173;&#x6CE8;&#xFF0C;&#x4F46;&#x6B63;&#x662F;&#x901A;&#x8FC7;&#x8FD9;&#x7BC7;&#x8BBA;&#x6587;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x7FA4;&#x4F53;&#x5F00;&#x59CB;&#x91CD;&#x89C6;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#xFF0C;&#x5E76;&#x786E;&#x4FE1;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x53EF;&#x4EE5;&#x5E94;&#x7528;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x9886;&#x57DF;&#x3002;&#x6B64;&#x540E;&#xFF0C;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x53CA;&#x5176;&#x5B83;&#x9886;&#x57DF;&#x7684;&#x5F71;&#x54CD;&#x529B;&#x4E0E;&#x65E5;&#x4FF1;&#x589E;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5E76;&#x4E0D;&#x6253;&#x7B97;&#x9605;&#x8BFB;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x8BBA;&#x6587;&#xFF0C;&#x5176;&#x5B9E;&#x53EF;&#x4EE5;&#x4E0D;&#x7528;&#x5B66;&#x4E60;&#x8FD9;&#x8282;&#x8BFE;&#x3002;&#x4F46;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8BFB;&#x61C2;&#x4E00;&#x4E9B;&#x76F8;&#x5173;&#x7684;&#x8BBA;&#x6587;&#xFF0C;&#x8FD9;&#x662F;&#x6BD4;&#x8F83;&#x597D;&#x7406;&#x89E3;&#x7684;&#x4E00;&#x7BC7;&#xFF0C;&#x5B66;&#x8D77;&#x6765;&#x4F1A;&#x5BB9;&#x6613;&#x4E00;&#x4E9B;&#x3002;</p>
<p><strong>AlexNet</strong>&#x7F51;&#x7EDC;&#x7ED3;&#x6784;&#x770B;&#x8D77;&#x6765;&#x76F8;&#x5BF9;&#x590D;&#x6742;&#xFF0C;&#x5305;&#x542B;&#x5927;&#x91CF;&#x8D85;&#x53C2;&#x6570;&#xFF0C;&#x8FD9;&#x4E9B;&#x6570;&#x5B57;&#xFF08;55&#xD7;55&#xD7;96&#x3001;27&#xD7;27&#xD7;96&#x3001;27&#xD7;27&#xD7;256&#x2026;&#x2026;&#xFF09;&#x90FD;&#x662F;<strong>Alex Krizhevsky</strong>&#x53CA;&#x5176;&#x5408;&#x8457;&#x8005;&#x4E0D;&#x5F97;&#x4E0D;&#x7ED9;&#x51FA;&#x7684;&#x3002;</p>
<p><img src="../images/a645bff2623ba6f30f01fbc6e3149484.png" alt=""></p>
<p>&#x8FD9;&#x8282;&#x8BFE;&#x8981;&#x8BB2;&#x7684;&#x7B2C;&#x4E09;&#x4E2A;&#xFF0C;&#x4E5F;&#x662F;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x8303;&#x4F8B;&#x662F;<strong>VGG</strong>&#xFF0C;&#x4E5F;&#x53EB;&#x4F5C;<strong>VGG-16</strong>&#x7F51;&#x7EDC;&#x3002;&#x503C;&#x5F97;&#x6CE8;&#x610F;&#x7684;&#x4E00;&#x70B9;&#x662F;&#xFF0C;<strong>VGG-16</strong>&#x7F51;&#x7EDC;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x591A;&#x8D85;&#x53C2;&#x6570;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x53EA;&#x9700;&#x8981;&#x4E13;&#x6CE8;&#x4E8E;&#x6784;&#x5EFA;&#x5377;&#x79EF;&#x5C42;&#x7684;&#x7B80;&#x5355;&#x7F51;&#x7EDC;&#x3002;&#x9996;&#x5148;&#x7528;3&#xD7;3&#xFF0C;&#x6B65;&#x5E45;&#x4E3A;1&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x6784;&#x5EFA;&#x5377;&#x79EF;&#x5C42;&#xFF0C;<strong>padding</strong>&#x53C2;&#x6570;&#x4E3A;<strong>same</strong>&#x5377;&#x79EF;&#x4E2D;&#x7684;&#x53C2;&#x6570;&#x3002;&#x7136;&#x540E;&#x7528;&#x4E00;&#x4E2A;2&#xD7;2&#xFF0C;&#x6B65;&#x5E45;&#x4E3A;2&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x6784;&#x5EFA;&#x6700;&#x5927;&#x6C60;&#x5316;&#x5C42;&#x3002;&#x56E0;&#x6B64;<strong>VGG</strong>&#x7F51;&#x7EDC;&#x7684;&#x4E00;&#x5927;&#x4F18;&#x70B9;&#x662F;&#x5B83;&#x786E;&#x5B9E;&#x7B80;&#x5316;&#x4E86;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7ED3;&#x6784;&#xFF0C;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x5177;&#x4F53;&#x8BB2;&#x8BB2;&#x8FD9;&#x79CD;&#x7F51;&#x7EDC;&#x7ED3;&#x6784;&#x3002;</p>
<p><img src="../images/781ddc74bcc8da430c99b196d0c4c6d4.png" alt=""></p>
<p>&#x5047;&#x8BBE;&#x8981;&#x8BC6;&#x522B;&#x8FD9;&#x4E2A;&#x56FE;&#x50CF;&#xFF0C;&#x5728;&#x6700;&#x5F00;&#x59CB;&#x7684;&#x4E24;&#x5C42;&#x7528;64&#x4E2A;3&#xD7;3&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x5BF9;&#x8F93;&#x5165;&#x56FE;&#x50CF;&#x8FDB;&#x884C;&#x5377;&#x79EF;&#xFF0C;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x662F;224&#xD7;224&#xD7;64&#xFF0C;&#x56E0;&#x4E3A;&#x4F7F;&#x7528;&#x4E86;<strong>same</strong>&#x5377;&#x79EF;&#xFF0C;&#x901A;&#x9053;&#x6570;&#x91CF;&#x4E5F;&#x4E00;&#x6837;&#x3002;<strong>VGG-16</strong>&#x5176;&#x5B9E;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x6DF1;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x5E76;&#x6CA1;&#x6709;&#x628A;&#x6240;&#x6709;&#x5377;&#x79EF;&#x5C42;&#x90FD;&#x753B;&#x51FA;&#x6765;&#x3002;</p>
<p><img src="../images/349bbded493496f45cf06e0941e6f049.png" alt=""></p>
<p>&#x5047;&#x8BBE;&#x8FD9;&#x4E2A;&#x5C0F;&#x56FE;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x8F93;&#x5165;&#x56FE;&#x50CF;&#xFF0C;&#x5C3A;&#x5BF8;&#x662F;224&#xD7;224&#xD7;3&#xFF0C;&#x8FDB;&#x884C;&#x7B2C;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x4E4B;&#x540E;&#x5F97;&#x5230;224&#xD7;224&#xD7;64&#x7684;&#x7279;&#x5F81;&#x56FE;&#xFF0C;&#x63A5;&#x7740;&#x8FD8;&#x6709;&#x4E00;&#x5C42;224&#xD7;224&#xD7;64&#xFF0C;&#x5F97;&#x5230;&#x8FD9;&#x6837;2&#x4E2A;&#x539A;&#x5EA6;&#x4E3A;64&#x7684;&#x5377;&#x79EF;&#x5C42;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x6211;&#x4EEC;&#x7528;64&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#x8FDB;&#x884C;&#x4E86;&#x4E24;&#x6B21;&#x5377;&#x79EF;&#x3002;&#x6B63;&#x5982;&#x6211;&#x5728;&#x524D;&#x9762;&#x63D0;&#x5230;&#x7684;&#xFF0C;&#x8FD9;&#x91CC;&#x91C7;&#x7528;&#x7684;&#x90FD;&#x662F;&#x5927;&#x5C0F;&#x4E3A;3&#xD7;3&#xFF0C;&#x6B65;&#x5E45;&#x4E3A;1&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x5E76;&#x4E14;&#x90FD;&#x662F;&#x91C7;&#x7528;<strong>same</strong>&#x5377;&#x79EF;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x5C31;&#x4E0D;&#x518D;&#x628A;&#x6240;&#x6709;&#x7684;&#x5C42;&#x90FD;&#x753B;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x53EA;&#x7528;&#x4E00;&#x4E32;&#x6570;&#x5B57;&#x4EE3;&#x8868;&#x8FD9;&#x4E9B;&#x7F51;&#x7EDC;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6C60;&#x5316;&#x5C42;&#xFF0C;&#x6C60;&#x5316;&#x5C42;&#x5C06;&#x8F93;&#x5165;&#x56FE;&#x50CF;&#x8FDB;&#x884C;&#x538B;&#x7F29;&#xFF0C;&#x4ECE;224&#xD7;224&#xD7;64&#x7F29;&#x5C0F;&#x5230;&#x591A;&#x5C11;&#x5462;&#xFF1F;&#x6CA1;&#x9519;&#xFF0C;&#x51CF;&#x5C11;&#x5230;112&#xD7;112&#xD7;64&#x3002;&#x7136;&#x540E;&#x53C8;&#x662F;&#x82E5;&#x5E72;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#xFF0C;&#x4F7F;&#x7528;129&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x4EE5;&#x53CA;&#x4E00;&#x4E9B;<strong>same</strong>&#x5377;&#x79EF;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x8F93;&#x51FA;&#x4EC0;&#x4E48;&#x7ED3;&#x679C;&#xFF0C;112&#xD7;112&#xD7;128.&#x7136;&#x540E;&#x8FDB;&#x884C;&#x6C60;&#x5316;&#xFF0C;&#x53EF;&#x4EE5;&#x63A8;&#x5BFC;&#x51FA;&#x6C60;&#x5316;&#x540E;&#x7684;&#x7ED3;&#x679C;&#x662F;&#x8FD9;&#x6837;&#xFF08;56&#xD7;56&#xD7;128&#xFF09;&#x3002;&#x63A5;&#x7740;&#x518D;&#x7528;256&#x4E2A;&#x76F8;&#x540C;&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x8FDB;&#x884C;&#x4E09;&#x6B21;&#x5377;&#x79EF;&#x64CD;&#x4F5C;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x6C60;&#x5316;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x5377;&#x79EF;&#x4E09;&#x6B21;&#xFF0C;&#x518D;&#x6C60;&#x5316;&#x3002;&#x5982;&#x6B64;&#x8FDB;&#x884C;&#x51E0;&#x8F6E;&#x64CD;&#x4F5C;&#x540E;&#xFF0C;&#x5C06;&#x6700;&#x540E;&#x5F97;&#x5230;&#x7684;7&#xD7;7&#xD7;512&#x7684;&#x7279;&#x5F81;&#x56FE;&#x8FDB;&#x884C;&#x5168;&#x8FDE;&#x63A5;&#x64CD;&#x4F5C;&#xFF0C;&#x5F97;&#x5230;4096&#x4E2A;&#x5355;&#x5143;&#xFF0C;&#x7136;&#x540E;&#x8FDB;&#x884C;<strong>softmax</strong>&#x6FC0;&#x6D3B;&#xFF0C;&#x8F93;&#x51FA;&#x4ECE;1000&#x4E2A;&#x5BF9;&#x8C61;&#x4E2D;&#x8BC6;&#x522B;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p><img src="../images/4a5b3f4c8b34eb8cdca6c36b46af142d.png" alt=""></p>
<p>&#x987A;&#x4FBF;&#x8BF4;&#x4E00;&#x4E0B;&#xFF0C;<strong>VGG-16</strong>&#x7684;&#x8FD9;&#x4E2A;&#x6570;&#x5B57;16&#xFF0C;&#x5C31;&#x662F;&#x6307;&#x5728;&#x8FD9;&#x4E2A;&#x7F51;&#x7EDC;&#x4E2D;&#x5305;&#x542B;16&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x548C;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x3002;&#x786E;&#x5B9E;&#x662F;&#x4E2A;&#x5F88;&#x5927;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x603B;&#x5171;&#x5305;&#x542B;&#x7EA6;1.38&#x4EBF;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x5373;&#x4FBF;&#x4EE5;&#x73B0;&#x5728;&#x7684;&#x6807;&#x51C6;&#x6765;&#x770B;&#x90FD;&#x7B97;&#x662F;&#x975E;&#x5E38;&#x5927;&#x7684;&#x7F51;&#x7EDC;&#x3002;&#x4F46;<strong>VGG-16</strong>&#x7684;&#x7ED3;&#x6784;&#x5E76;&#x4E0D;&#x590D;&#x6742;&#xFF0C;&#x8FD9;&#x70B9;&#x975E;&#x5E38;&#x5438;&#x5F15;&#x4EBA;&#xFF0C;&#x800C;&#x4E14;&#x8FD9;&#x79CD;&#x7F51;&#x7EDC;&#x7ED3;&#x6784;&#x5F88;&#x89C4;&#x6574;&#xFF0C;&#x90FD;&#x662F;&#x51E0;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x540E;&#x9762;&#x8DDF;&#x7740;&#x53EF;&#x4EE5;&#x538B;&#x7F29;&#x56FE;&#x50CF;&#x5927;&#x5C0F;&#x7684;&#x6C60;&#x5316;&#x5C42;&#xFF0C;&#x6C60;&#x5316;&#x5C42;&#x7F29;&#x5C0F;&#x56FE;&#x50CF;&#x7684;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x5377;&#x79EF;&#x5C42;&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x6570;&#x91CF;&#x53D8;&#x5316;&#x5B58;&#x5728;&#x4E00;&#x5B9A;&#x7684;&#x89C4;&#x5F8B;&#xFF0C;&#x7531;64&#x7FFB;&#x500D;&#x53D8;&#x6210;128&#xFF0C;&#x518D;&#x5230;256&#x548C;512&#x3002;&#x4F5C;&#x8005;&#x53EF;&#x80FD;&#x8BA4;&#x4E3A;512&#x5DF2;&#x7ECF;&#x8DB3;&#x591F;&#x5927;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x540E;&#x9762;&#x7684;&#x5C42;&#x5C31;&#x4E0D;&#x518D;&#x7FFB;&#x500D;&#x4E86;&#x3002;&#x65E0;&#x8BBA;&#x5982;&#x4F55;&#xFF0C;&#x6BCF;&#x4E00;&#x6B65;&#x90FD;&#x8FDB;&#x884C;&#x7FFB;&#x500D;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x5728;&#x6BCF;&#x4E00;&#x7EC4;&#x5377;&#x79EF;&#x5C42;&#x8FDB;&#x884C;&#x8FC7;&#x6EE4;&#x5668;&#x7FFB;&#x500D;&#x64CD;&#x4F5C;&#xFF0C;&#x6B63;&#x662F;&#x8BBE;&#x8BA1;&#x6B64;&#x79CD;&#x7F51;&#x7EDC;&#x7ED3;&#x6784;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x539F;&#x5219;&#x3002;&#x8FD9;&#x79CD;&#x76F8;&#x5BF9;&#x4E00;&#x81F4;&#x7684;&#x7F51;&#x7EDC;&#x7ED3;&#x6784;&#x5BF9;&#x7814;&#x7A76;&#x8005;&#x5F88;&#x6709;&#x5438;&#x5F15;&#x529B;&#xFF0C;&#x800C;&#x5B83;&#x7684;&#x4E3B;&#x8981;&#x7F3A;&#x70B9;&#x662F;&#x9700;&#x8981;&#x8BAD;&#x7EC3;&#x7684;&#x7279;&#x5F81;&#x6570;&#x91CF;&#x975E;&#x5E38;&#x5DE8;&#x5927;&#x3002;</p>
<p><img src="../images/0a29aeae65a311c56675ad8f1fec2824.png" alt=""></p>
<p>&#x6709;&#x4E9B;&#x6587;&#x7AE0;&#x8FD8;&#x4ECB;&#x7ECD;&#x4E86;<strong>VGG-19</strong>&#x7F51;&#x7EDC;&#xFF0C;&#x5B83;&#x751A;&#x81F3;&#x6BD4;<strong>VGG-16</strong>&#x8FD8;&#x8981;&#x5927;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x4E86;&#x89E3;&#x66F4;&#x591A;&#x7EC6;&#x8282;&#xFF0C;&#x8BF7;&#x53C2;&#x8003;&#x5E7B;&#x706F;&#x7247;&#x4E0B;&#x65B9;&#x7684;&#x6CE8;&#x6587;&#xFF0C;&#x9605;&#x8BFB;&#x7531;<strong>Karen Simonyan</strong>&#x548C;<strong>Andrew Zisserman</strong>&#x64B0;&#x5199;&#x7684;&#x8BBA;&#x6587;&#x3002;&#x7531;&#x4E8E;<strong>VGG-16</strong>&#x7684;&#x8868;&#x73B0;&#x51E0;&#x4E4E;&#x548C;<strong>VGG-19</strong>&#x4E0D;&#x5206;&#x9AD8;&#x4E0B;&#xFF0C;&#x6240;&#x4EE5;&#x5F88;&#x591A;&#x4EBA;&#x8FD8;&#x662F;&#x4F1A;&#x4F7F;&#x7528;<strong>VGG-16</strong>&#x3002;&#x6211;&#x6700;&#x559C;&#x6B22;&#x5B83;&#x7684;&#x4E00;&#x70B9;&#x662F;&#xFF0C;&#x6587;&#x4E2D;&#x63ED;&#x793A;&#x4E86;&#xFF0C;&#x968F;&#x7740;&#x7F51;&#x7EDC;&#x7684;&#x52A0;&#x6DF1;&#xFF0C;&#x56FE;&#x50CF;&#x7684;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#x90FD;&#x5728;&#x4EE5;&#x4E00;&#x5B9A;&#x7684;&#x89C4;&#x5F8B;&#x4E0D;&#x65AD;&#x7F29;&#x5C0F;&#xFF0C;&#x6BCF;&#x6B21;&#x6C60;&#x5316;&#x540E;&#x521A;&#x597D;&#x7F29;&#x5C0F;&#x4E00;&#x534A;&#xFF0C;&#x800C;&#x901A;&#x9053;&#x6570;&#x91CF;&#x5728;&#x4E0D;&#x65AD;&#x589E;&#x52A0;&#xFF0C;&#x800C;&#x4E14;&#x521A;&#x597D;&#x4E5F;&#x662F;&#x5728;&#x6BCF;&#x7EC4;&#x5377;&#x79EF;&#x64CD;&#x4F5C;&#x540E;&#x589E;&#x52A0;&#x4E00;&#x500D;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x56FE;&#x50CF;&#x7F29;&#x5C0F;&#x7684;&#x6BD4;&#x4F8B;&#x548C;&#x901A;&#x9053;&#x6570;&#x589E;&#x52A0;&#x7684;&#x6BD4;&#x4F8B;&#x662F;&#x6709;&#x89C4;&#x5F8B;&#x7684;&#x3002;&#x4ECE;&#x8FD9;&#x4E2A;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x8FD9;&#x7BC7;&#x8BBA;&#x6587;&#x5F88;&#x5438;&#x5F15;&#x4EBA;&#x3002;</p>
<p>&#x4EE5;&#x4E0A;&#x5C31;&#x662F;&#x4E09;&#x79CD;&#x7ECF;&#x5178;&#x7684;&#x7F51;&#x7EDC;&#x7ED3;&#x6784;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x8FD9;&#x4E9B;&#x8BBA;&#x6587;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x6211;&#x5EFA;&#x8BAE;&#x4ECE;&#x4ECB;&#x7ECD;<strong>AlexNet</strong>&#x7684;&#x8BBA;&#x6587;&#x5F00;&#x59CB;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x662F;<strong>VGG</strong>&#x7684;&#x8BBA;&#x6587;&#xFF0C;&#x6700;&#x540E;&#x662F;<strong>LeNet</strong>&#x7684;&#x8BBA;&#x6587;&#x3002;&#x867D;&#x7136;&#x6709;&#x4E9B;&#x6666;&#x6DA9;&#x96BE;&#x61C2;&#xFF0C;&#x4F46;&#x5BF9;&#x4E8E;&#x4E86;&#x89E3;&#x8FD9;&#x4E9B;&#x7F51;&#x7EDC;&#x7ED3;&#x6784;&#x5F88;&#x6709;&#x5E2E;&#x52A9;&#x3002;</p>
<p>&#x5B66;&#x8FC7;&#x8FD9;&#x4E9B;&#x7ECF;&#x5178;&#x7684;&#x7F51;&#x7EDC;&#x4E4B;&#x540E;&#xFF0C;&#x4E0B;&#x8282;&#x8BFE;&#x6211;&#x4EEC;&#x4F1A;&#x5B66;&#x4E60;&#x4E00;&#x4E9B;&#x66F4;&#x5148;&#x9AD8;&#x7EA7;&#x66F4;&#x5F3A;&#x5927;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7ED3;&#x6784;&#xFF0C;&#x4E0B;&#x8282;&#x8BFE;&#x89C1;&#x3002;</p>
<h3 id="23-&#x6B8B;&#x5DEE;&#x7F51;&#x7EDC;resnets&#xFF08;residual-networks-resnets&#xFF09;">2.3 &#x6B8B;&#x5DEE;&#x7F51;&#x7EDC;(ResNets)&#xFF08;Residual Networks (ResNets)&#xFF09;</h3>
<p>&#x975E;&#x5E38;&#x975E;&#x5E38;&#x6DF1;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x662F;&#x5F88;&#x96BE;&#x8BAD;&#x7EC3;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B58;&#x5728;&#x68AF;&#x5EA6;&#x6D88;&#x5931;&#x548C;&#x68AF;&#x5EA6;&#x7206;&#x70B8;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x8282;&#x8BFE;&#x6211;&#x4EEC;&#x5B66;&#x4E60;&#x8DF3;&#x8DC3;&#x8FDE;&#x63A5;&#xFF08;<strong>Skip connection</strong>&#xFF09;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x4ECE;&#x67D0;&#x4E00;&#x5C42;&#x7F51;&#x7EDC;&#x5C42;&#x83B7;&#x53D6;&#x6FC0;&#x6D3B;&#xFF0C;&#x7136;&#x540E;&#x8FC5;&#x901F;&#x53CD;&#x9988;&#x7ED9;&#x53E6;&#x5916;&#x4E00;&#x5C42;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x66F4;&#x6DF1;&#x5C42;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x8DF3;&#x8DC3;&#x8FDE;&#x63A5;&#x6784;&#x5EFA;&#x80FD;&#x591F;&#x8BAD;&#x7EC3;&#x6DF1;&#x5EA6;&#x7F51;&#x7EDC;&#x7684;<strong>ResNets</strong>&#xFF0C;&#x6709;&#x65F6;&#x6DF1;&#x5EA6;&#x80FD;&#x591F;&#x8D85;&#x8FC7;100&#x5C42;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x5427;&#x3002;</p>
<p><strong>ResNets</strong>&#x662F;&#x7531;&#x6B8B;&#x5DEE;&#x5757;&#xFF08;<strong>Residual block</strong>&#xFF09;&#x6784;&#x5EFA;&#x7684;&#xFF0C;&#x9996;&#x5148;&#x6211;&#x89E3;&#x91CA;&#x4E00;&#x4E0B;&#x4EC0;&#x4E48;&#x662F;&#x6B8B;&#x5DEE;&#x5757;&#x3002;</p>
<p><img src="../images/4486bc7028169ae755a01af9c77204f6.png" alt=""></p>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x4E24;&#x5C42;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x5728;$L$&#x5C42;&#x8FDB;&#x884C;&#x6FC0;&#x6D3B;&#xFF0C;&#x5F97;&#x5230;$a^{\left\lbrack l + 1 \right\rbrack}$&#xFF0C;&#x518D;&#x6B21;&#x8FDB;&#x884C;&#x6FC0;&#x6D3B;&#xFF0C;&#x4E24;&#x5C42;&#x4E4B;&#x540E;&#x5F97;&#x5230;$a^{\left\lbrack l + 2 \right\rbrack}$&#x3002;&#x8BA1;&#x7B97;&#x8FC7;&#x7A0B;&#x662F;&#x4ECE;$a^{[l]}$&#x5F00;&#x59CB;&#xFF0C;&#x9996;&#x5148;&#x8FDB;&#x884C;&#x7EBF;&#x6027;&#x6FC0;&#x6D3B;&#xFF0C;&#x6839;&#x636E;&#x8FD9;&#x4E2A;&#x516C;&#x5F0F;&#xFF1A;$z^{\left\lbrack l + 1 \right\rbrack} = W^{\left\lbrack l + 1 \right\rbrack}a^{[l]} + b^{\left\lbrack l + 1 \right\rbrack}$&#xFF0C;&#x901A;&#x8FC7;$a^{[l]}$&#x7B97;&#x51FA;$z^{\left\lbrack l + 1 \right\rbrack}$&#xFF0C;&#x5373;$a^{[l]}$&#x4E58;&#x4EE5;&#x6743;&#x91CD;&#x77E9;&#x9635;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;&#x504F;&#x5DEE;&#x56E0;&#x5B50;&#x3002;&#x7136;&#x540E;&#x901A;&#x8FC7;<strong>ReLU</strong>&#x975E;&#x7EBF;&#x6027;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x5F97;&#x5230;$a^{\left\lbrack l + 1 \right\rbrack}$&#xFF0C;$a^{\left\lbrack l + 1 \right\rbrack} =g(z^{\left\lbrack l + 1 \right\rbrack})$&#x8BA1;&#x7B97;&#x5F97;&#x51FA;&#x3002;&#x63A5;&#x7740;&#x518D;&#x6B21;&#x8FDB;&#x884C;&#x7EBF;&#x6027;&#x6FC0;&#x6D3B;&#xFF0C;&#x4F9D;&#x636E;&#x7B49;&#x5F0F;$z^{\left\lbrack l + 2 \right\rbrack} = W^{\left\lbrack 2 + 1 \right\rbrack}a^{\left\lbrack l + 1 \right\rbrack} + b^{\left\lbrack l + 2 \right\rbrack}$&#xFF0C;&#x6700;&#x540E;&#x6839;&#x636E;&#x8FD9;&#x4E2A;&#x7B49;&#x5F0F;&#x518D;&#x6B21;&#x8FDB;&#x884C;<strong>ReLu</strong>&#x975E;&#x7EBF;&#x6027;&#x6FC0;&#x6D3B;&#xFF0C;&#x5373;$a^{\left\lbrack l + 2 \right\rbrack} = g(z^{\left\lbrack l + 2   \right\rbrack})$&#xFF0C;&#x8FD9;&#x91CC;&#x7684;$g$&#x662F;&#x6307;<strong>ReLU</strong>&#x975E;&#x7EBF;&#x6027;&#x51FD;&#x6570;&#xFF0C;&#x5F97;&#x5230;&#x7684;&#x7ED3;&#x679C;&#x5C31;&#x662F;$a^{\left\lbrack l + 2 \right\rbrack}$&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x4FE1;&#x606F;&#x6D41;&#x4ECE;$a^{\left\lbrack l   \right\rbrack}$&#x5230;$a^{\left\lbrack l + 2  \right\rbrack}$&#x9700;&#x8981;&#x7ECF;&#x8FC7;&#x4EE5;&#x4E0A;&#x6240;&#x6709;&#x6B65;&#x9AA4;&#xFF0C;&#x5373;&#x8FD9;&#x7EC4;&#x7F51;&#x7EDC;&#x5C42;&#x7684;&#x4E3B;&#x8DEF;&#x5F84;&#x3002;</p>
<p><img src="../images/f0a8471f869d8062ba59598c418da7fb.png" alt=""></p>
<p>&#x5728;&#x6B8B;&#x5DEE;&#x7F51;&#x7EDC;&#x4E2D;&#x6709;&#x4E00;&#x70B9;&#x53D8;&#x5316;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;$a^{[l]}$&#x76F4;&#x63A5;&#x5411;&#x540E;&#xFF0C;&#x62F7;&#x8D1D;&#x5230;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x6DF1;&#x5C42;&#xFF0C;&#x5728;<strong>ReLU</strong>&#x975E;&#x7EBF;&#x6027;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x524D;&#x52A0;&#x4E0A;$a^{[l]}$&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x6761;&#x6377;&#x5F84;&#x3002;$a^{[l]}$&#x7684;&#x4FE1;&#x606F;&#x76F4;&#x63A5;&#x5230;&#x8FBE;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x6DF1;&#x5C42;&#xFF0C;&#x4E0D;&#x518D;&#x6CBF;&#x7740;&#x4E3B;&#x8DEF;&#x5F84;&#x4F20;&#x9012;&#xFF0C;&#x8FD9;&#x5C31;&#x610F;&#x5473;&#x7740;&#x6700;&#x540E;&#x8FD9;&#x4E2A;&#x7B49;&#x5F0F;($a^{\left\lbrack l + 2 \right\rbrack} = g(z^{\left\lbrack l + 2 \right\rbrack})$)&#x53BB;&#x6389;&#x4E86;&#xFF0C;&#x53D6;&#x800C;&#x4EE3;&#x4E4B;&#x7684;&#x662F;&#x53E6;&#x4E00;&#x4E2A;<strong>ReLU</strong>&#x975E;&#x7EBF;&#x6027;&#x51FD;&#x6570;&#xFF0C;&#x4ECD;&#x7136;&#x5BF9;$z^{\left\lbrack l + 2 \right\rbrack}$&#x8FDB;&#x884C;$g$&#x51FD;&#x6570;&#x5904;&#x7406;&#xFF0C;&#x4F46;&#x8FD9;&#x6B21;&#x8981;&#x52A0;&#x4E0A;$a^{[l]}$&#xFF0C;&#x5373;&#xFF1A;$\ a^{\left\lbrack l + 2 \right\rbrack} = g\left(z^{\left\lbrack l + 2 \right\rbrack} + a^{[l]}\right)$&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x52A0;&#x4E0A;&#x7684;&#x8FD9;&#x4E2A;$a^{[l]}$&#x4EA7;&#x751F;&#x4E86;&#x4E00;&#x4E2A;&#x6B8B;&#x5DEE;&#x5757;&#x3002;</p>
<p><img src="../images/f0a8471f869d8062ba59598c418da7fb.png" alt=""></p>
<p>&#x5728;&#x4E0A;&#x9762;&#x8FD9;&#x4E2A;&#x56FE;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x753B;&#x4E00;&#x6761;&#x6377;&#x5F84;&#xFF0C;&#x76F4;&#x8FBE;&#x7B2C;&#x4E8C;&#x5C42;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#x8FD9;&#x6761;&#x6377;&#x5F84;&#x662F;&#x5728;&#x8FDB;&#x884C;<strong>ReLU</strong>&#x975E;&#x7EBF;&#x6027;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x4E4B;&#x524D;&#x52A0;&#x4E0A;&#x7684;&#xFF0C;&#x800C;&#x8FD9;&#x91CC;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x90FD;&#x6267;&#x884C;&#x4E86;&#x7EBF;&#x6027;&#x51FD;&#x6570;&#x548C;<strong>ReLU</strong>&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x3002;&#x6240;&#x4EE5;$a^{[l]}$&#x63D2;&#x5165;&#x7684;&#x65F6;&#x673A;&#x662F;&#x5728;&#x7EBF;&#x6027;&#x6FC0;&#x6D3B;&#x4E4B;&#x540E;&#xFF0C;<strong>ReLU</strong>&#x6FC0;&#x6D3B;&#x4E4B;&#x524D;&#x3002;&#x9664;&#x4E86;&#x6377;&#x5F84;&#xFF0C;&#x4F60;&#x8FD8;&#x4F1A;&#x542C;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x672F;&#x8BED;&#x201C;&#x8DF3;&#x8DC3;&#x8FDE;&#x63A5;&#x201D;&#xFF0C;&#x5C31;&#x662F;&#x6307;$a^{[l]}$&#x8DF3;&#x8FC7;&#x4E00;&#x5C42;&#x6216;&#x8005;&#x597D;&#x51E0;&#x5C42;&#xFF0C;&#x4ECE;&#x800C;&#x5C06;&#x4FE1;&#x606F;&#x4F20;&#x9012;&#x5230;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x66F4;&#x6DF1;&#x5C42;&#x3002;</p>
<p><strong>ResNet</strong>&#x7684;&#x53D1;&#x660E;&#x8005;&#x662F;<strong>&#x4F55;&#x51EF;&#x660E;</strong>&#xFF08;<strong>Kaiming He</strong>&#xFF09;&#x3001;<strong>&#x5F20;&#x7FD4;&#x5B87;</strong>&#xFF08;<strong>Xiangyu Zhang</strong>&#xFF09;&#x3001;<strong>&#x4EFB;&#x5C11;&#x537F;</strong>&#xFF08;<strong>Shaoqing Ren</strong>&#xFF09;&#x548C;<strong>&#x5B59;&#x5251;</strong>&#xFF08;<strong>Jiangxi Sun</strong>&#xFF09;&#xFF0C;&#x4ED6;&#x4EEC;&#x53D1;&#x73B0;&#x4F7F;&#x7528;&#x6B8B;&#x5DEE;&#x5757;&#x80FD;&#x591F;&#x8BAD;&#x7EC3;&#x66F4;&#x6DF1;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;&#x6240;&#x4EE5;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;<strong>ResNet</strong>&#x7F51;&#x7EDC;&#x5C31;&#x662F;&#x901A;&#x8FC7;&#x5C06;&#x5F88;&#x591A;&#x8FD9;&#x6837;&#x7684;&#x6B8B;&#x5DEE;&#x5757;&#x5806;&#x79EF;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x5F62;&#x6210;&#x4E00;&#x4E2A;&#x5F88;&#x6DF1;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;&#x8FD9;&#x4E2A;&#x7F51;&#x7EDC;&#x3002;</p>
<p><img src="../images/48bded15cca17581084e3fe0853673b5.png" alt=""></p>
<p>&#x8FD9;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x6B8B;&#x5DEE;&#x7F51;&#x7EDC;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x7F51;&#x7EDC;&#xFF08;<strong>Plain network</strong>&#xFF09;&#xFF0C;&#x8FD9;&#x4E2A;&#x672F;&#x8BED;&#x6765;&#x81EA;<strong>ResNet</strong>&#x8BBA;&#x6587;&#x3002;</p>
<p><img src="../images/131e538bb527859430280becd65b049b.png" alt=""></p>
<p>&#x628A;&#x5B83;&#x53D8;&#x6210;<strong>ResNet</strong>&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x52A0;&#x4E0A;&#x6240;&#x6709;&#x8DF3;&#x8DC3;&#x8FDE;&#x63A5;&#xFF0C;&#x6B63;&#x5982;&#x524D;&#x4E00;&#x5F20;&#x5E7B;&#x706F;&#x7247;&#x4E2D;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x6BCF;&#x4E24;&#x5C42;&#x589E;&#x52A0;&#x4E00;&#x4E2A;&#x6377;&#x5F84;&#xFF0C;&#x6784;&#x6210;&#x4E00;&#x4E2A;&#x6B8B;&#x5DEE;&#x5757;&#x3002;&#x5982;&#x56FE;&#x6240;&#x793A;&#xFF0C;5&#x4E2A;&#x6B8B;&#x5DEE;&#x5757;&#x8FDE;&#x63A5;&#x5728;&#x4E00;&#x8D77;&#x6784;&#x6210;&#x4E00;&#x4E2A;&#x6B8B;&#x5DEE;&#x7F51;&#x7EDC;&#x3002;</p>
<p><img src="../images/6077958a616425d76284cecb43c2f458.png" alt=""></p>
<p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x6807;&#x51C6;&#x4F18;&#x5316;&#x7B97;&#x6CD5;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x7F51;&#x7EDC;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x6CD5;&#xFF0C;&#x6216;&#x8005;&#x5176;&#x5B83;&#x70ED;&#x95E8;&#x7684;&#x4F18;&#x5316;&#x7B97;&#x6CD5;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x6B8B;&#x5DEE;&#xFF0C;&#x6CA1;&#x6709;&#x8FD9;&#x4E9B;&#x6377;&#x5F84;&#x6216;&#x8005;&#x8DF3;&#x8DC3;&#x8FDE;&#x63A5;&#xFF0C;&#x51ED;&#x7ECF;&#x9A8C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x968F;&#x7740;&#x7F51;&#x7EDC;&#x6DF1;&#x5EA6;&#x7684;&#x52A0;&#x6DF1;&#xFF0C;&#x8BAD;&#x7EC3;&#x9519;&#x8BEF;&#x4F1A;&#x5148;&#x51CF;&#x5C11;&#xFF0C;&#x7136;&#x540E;&#x589E;&#x591A;&#x3002;&#x800C;&#x7406;&#x8BBA;&#x4E0A;&#xFF0C;&#x968F;&#x7740;&#x7F51;&#x7EDC;&#x6DF1;&#x5EA6;&#x7684;&#x52A0;&#x6DF1;&#xFF0C;&#x5E94;&#x8BE5;&#x8BAD;&#x7EC3;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x597D;&#x624D;&#x5BF9;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x7406;&#x8BBA;&#x4E0A;&#x7F51;&#x7EDC;&#x6DF1;&#x5EA6;&#x8D8A;&#x6DF1;&#x8D8A;&#x597D;&#x3002;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x6B8B;&#x5DEE;&#x7F51;&#x7EDC;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x7F51;&#x7EDC;&#x6765;&#x8BF4;&#xFF0C;&#x6DF1;&#x5EA6;&#x8D8A;&#x6DF1;&#x610F;&#x5473;&#x7740;&#x7528;&#x4F18;&#x5316;&#x7B97;&#x6CD5;&#x8D8A;&#x96BE;&#x8BAD;&#x7EC3;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x968F;&#x7740;&#x7F51;&#x7EDC;&#x6DF1;&#x5EA6;&#x7684;&#x52A0;&#x6DF1;&#xFF0C;&#x8BAD;&#x7EC3;&#x9519;&#x8BEF;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x3002;</p>
<p>&#x4F46;&#x6709;&#x4E86;<strong>ResNets</strong>&#x5C31;&#x4E0D;&#x4E00;&#x6837;&#x4E86;&#xFF0C;&#x5373;&#x4F7F;&#x7F51;&#x7EDC;&#x518D;&#x6DF1;&#xFF0C;&#x8BAD;&#x7EC3;&#x7684;&#x8868;&#x73B0;&#x5374;&#x4E0D;&#x9519;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x8BAD;&#x7EC3;&#x8BEF;&#x5DEE;&#x51CF;&#x5C11;&#xFF0C;&#x5C31;&#x7B97;&#x662F;&#x8BAD;&#x7EC3;&#x6DF1;&#x8FBE;100&#x5C42;&#x7684;&#x7F51;&#x7EDC;&#x4E5F;&#x4E0D;&#x4F8B;&#x5916;&#x3002;&#x6709;&#x4EBA;&#x751A;&#x81F3;&#x5728;1000&#x591A;&#x5C42;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x505A;&#x8FC7;&#x5B9E;&#x9A8C;&#xFF0C;&#x5C3D;&#x7BA1;&#x76EE;&#x524D;&#x6211;&#x8FD8;&#x6CA1;&#x6709;&#x770B;&#x5230;&#x592A;&#x591A;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x3002;&#x4F46;&#x662F;&#x5BF9;$x$&#x7684;&#x6FC0;&#x6D3B;&#xFF0C;&#x6216;&#x8005;&#x8FD9;&#x4E9B;&#x4E2D;&#x95F4;&#x7684;&#x6FC0;&#x6D3B;&#x80FD;&#x591F;&#x5230;&#x8FBE;&#x7F51;&#x7EDC;&#x7684;&#x66F4;&#x6DF1;&#x5C42;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x786E;&#x5B9E;&#x6709;&#x52A9;&#x4E8E;&#x89E3;&#x51B3;&#x68AF;&#x5EA6;&#x6D88;&#x5931;&#x548C;&#x68AF;&#x5EA6;&#x7206;&#x70B8;&#x95EE;&#x9898;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x5728;&#x8BAD;&#x7EC3;&#x66F4;&#x6DF1;&#x7F51;&#x7EDC;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x53C8;&#x80FD;&#x4FDD;&#x8BC1;&#x826F;&#x597D;&#x7684;&#x6027;&#x80FD;&#x3002;&#x4E5F;&#x8BB8;&#x4ECE;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x968F;&#x7740;&#x7F51;&#x7EDC;&#x8D8A;&#x6765;&#x6DF1;&#xFF0C;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x4F1A;&#x53D8;&#x5F97;&#x81C3;&#x80BF;&#xFF0C;&#x4F46;&#x662F;<strong>ResNet</strong>&#x786E;&#x5B9E;&#x5728;&#x8BAD;&#x7EC3;&#x6DF1;&#x5EA6;&#x7F51;&#x7EDC;&#x65B9;&#x9762;&#x975E;&#x5E38;&#x6709;&#x6548;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x5927;&#x5BB6;&#x5BF9;<strong>ResNet</strong>&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x5927;&#x81F4;&#x7684;&#x4E86;&#x89E3;&#xFF0C;&#x901A;&#x8FC7;&#x672C;&#x5468;&#x7684;&#x7F16;&#x7A0B;&#x7EC3;&#x4E60;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x4EB2;&#x81EA;&#x5B9E;&#x73B0;&#x4E00;&#x4E0B;&#x8FD9;&#x4E9B;&#x60F3;&#x6CD5;&#x3002;&#x81F3;&#x4E8E;&#x4E3A;&#x4EC0;&#x4E48;<strong>ResNets</strong>&#x80FD;&#x6709;&#x5982;&#x6B64;&#x597D;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4F1A;&#x6709;&#x66F4;&#x591A;&#x66F4;&#x68D2;&#x7684;&#x5185;&#x5BB9;&#x5206;&#x4EAB;&#x7ED9;&#x5927;&#x5BB6;&#xFF0C;&#x6211;&#x4EEC;&#x4E0B;&#x4E2A;&#x89C6;&#x9891;&#x89C1;&#x3002;</p>
<h3 id="24-&#x6B8B;&#x5DEE;&#x7F51;&#x7EDC;&#x4E3A;&#x4EC0;&#x4E48;&#x6709;&#x7528;&#xFF1F;&#xFF08;why-resnets-work&#xFF09;">2.4 &#x6B8B;&#x5DEE;&#x7F51;&#x7EDC;&#x4E3A;&#x4EC0;&#x4E48;&#x6709;&#x7528;&#xFF1F;&#xFF08;Why ResNets work?&#xFF09;</h3>
<p>&#x4E3A;&#x4EC0;&#x4E48;<strong>ResNets</strong>&#x80FD;&#x6709;&#x5982;&#x6B64;&#x597D;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5B83;&#x89E3;&#x91CA;&#x4E86;&#x5176;&#x4E2D;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x81F3;&#x5C11;&#x53EF;&#x4EE5;&#x8BF4;&#x660E;&#xFF0C;&#x5982;&#x4F55;&#x6784;&#x5EFA;&#x66F4;&#x6DF1;&#x5C42;&#x6B21;&#x7684;<strong>ResNets</strong>&#x7F51;&#x7EDC;&#x7684;&#x540C;&#x65F6;&#x8FD8;&#x4E0D;&#x964D;&#x4F4E;&#x5B83;&#x4EEC;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x7684;&#x6548;&#x7387;&#x3002;&#x5E0C;&#x671B;&#x4F60;&#x5DF2;&#x7ECF;&#x901A;&#x8FC7;&#x7B2C;&#x4E09;&#x95E8;&#x8BFE;&#x4E86;&#x89E3;&#x5230;&#xFF0C;&#x901A;&#x5E38;&#x6765;&#x8BB2;&#xFF0C;&#x7F51;&#x7EDC;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x8868;&#x73B0;&#x597D;&#xFF0C;&#x624D;&#x80FD;&#x5728;<strong>Hold-Out</strong>&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x96C6;&#x6216;<strong>dev</strong>&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x4E0A;&#x6709;&#x597D;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x6240;&#x4EE5;&#x81F3;&#x5C11;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x8BAD;&#x7EC3;&#x597D;<strong>ResNets</strong>&#x662F;&#x7B2C;&#x4E00;&#x6B65;&#x3002;</p>
<p>&#x5148;&#x6765;&#x770B;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x4E0A;&#x8282;&#x8BFE;&#x6211;&#x4EEC;&#x4E86;&#x89E3;&#x5230;&#xFF0C;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x6DF1;&#x5EA6;&#x8D8A;&#x6DF1;&#xFF0C;&#x5B83;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x8BAD;&#x7EC3;&#x7684;&#x6548;&#x7387;&#x5C31;&#x4F1A;&#x6709;&#x6240;&#x51CF;&#x5F31;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x6709;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x4E0D;&#x5E0C;&#x671B;&#x52A0;&#x6DF1;&#x7F51;&#x7EDC;&#x7684;&#x539F;&#x56E0;&#x3002;&#x800C;&#x4E8B;&#x5B9E;&#x5E76;&#x975E;&#x5982;&#x6B64;&#xFF0C;&#x81F3;&#x5C11;&#x5728;&#x8BAD;&#x7EC3;<strong>ResNets</strong>&#x7F51;&#x7EDC;&#x65F6;&#xFF0C;&#x5E76;&#x975E;&#x5B8C;&#x5168;&#x5982;&#x6B64;&#xFF0C;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#x3002;</p>
<p><img src="../images/e1106db40c78c2e384305d6474c40d69.png" alt=""></p>
<p>&#x5047;&#x8BBE;&#x6709;&#x4E00;&#x4E2A;&#x5927;&#x578B;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x5176;&#x8F93;&#x5165;&#x4E3A;$X$&#xFF0C;&#x8F93;&#x51FA;&#x6FC0;&#x6D3B;&#x503C;$a^{[l]}$&#x3002;&#x5047;&#x5982;&#x4F60;&#x60F3;&#x589E;&#x52A0;&#x8FD9;&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x6DF1;&#x5EA6;&#xFF0C;&#x90A3;&#x4E48;&#x7528;<strong>Big NN</strong>&#x8868;&#x793A;&#xFF0C;&#x8F93;&#x51FA;&#x4E3A;$ a^{\left\lbrack l\right\rbrack}$&#x3002;&#x518D;&#x7ED9;&#x8FD9;&#x4E2A;&#x7F51;&#x7EDC;&#x989D;&#x5916;&#x6DFB;&#x52A0;&#x4E24;&#x5C42;&#xFF0C;&#x4F9D;&#x6B21;&#x6DFB;&#x52A0;&#x4E24;&#x5C42;&#xFF0C;&#x6700;&#x540E;&#x8F93;&#x51FA;&#x4E3A;$a^{\left\lbrack l + 2 \right\rbrack}$&#xFF0C;&#x53EF;&#x4EE5;&#x628A;&#x8FD9;&#x4E24;&#x5C42;&#x770B;&#x4F5C;&#x4E00;&#x4E2A;<strong>ResNets</strong>&#x5757;&#xFF0C;&#x5373;&#x5177;&#x6709;&#x6377;&#x5F84;&#x8FDE;&#x63A5;&#x7684;&#x6B8B;&#x5DEE;&#x5757;&#x3002;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x8BF4;&#x660E;&#xFF0C;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x5728;&#x6574;&#x4E2A;&#x7F51;&#x7EDC;&#x4E2D;&#x4F7F;&#x7528;<strong>ReLU</strong>&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF0C;&#x6240;&#x4EE5;&#x6FC0;&#x6D3B;&#x503C;&#x90FD;&#x5927;&#x4E8E;&#x7B49;&#x4E8E;0&#xFF0C;&#x5305;&#x62EC;&#x8F93;&#x5165;$X$&#x7684;&#x975E;&#x96F6;&#x5F02;&#x5E38;&#x503C;&#x3002;&#x56E0;&#x4E3A;<strong>ReLU</strong>&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x8F93;&#x51FA;&#x7684;&#x6570;&#x5B57;&#x8981;&#x4E48;&#x662F;0&#xFF0C;&#x8981;&#x4E48;&#x662F;&#x6B63;&#x6570;&#x3002;</p>
<p><img src="../images/f60f5ca514d4bad1288fc7cbd666dd99.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x770B;&#x4E00;&#x4E0B;$a^{\left\lbrack l + 2\right\rbrack}$&#x7684;&#x503C;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4E0A;&#x8282;&#x8BFE;&#x8BB2;&#x8FC7;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x5373;$a^{\left\lbrack l + 2\right\rbrack} = g(z^{\left\lbrack l + 2 \right\rbrack} + a^{\left\lbrack l\right\rbrack})$&#xFF0C;&#x6DFB;&#x52A0;&#x9879;$a^{\left\lbrack l\right\rbrack}$&#x662F;&#x521A;&#x6DFB;&#x52A0;&#x7684;&#x8DF3;&#x8DC3;&#x8FDE;&#x63A5;&#x7684;&#x8F93;&#x5165;&#x3002;&#x5C55;&#x5F00;&#x8FD9;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;$a^{\left\lbrack l + 2 \right\rbrack} = g(W^{\left\lbrack l + 2 \right\rbrack}a^{\left\lbrack l + 1 \right\rbrack} + b^{\left\lbrack l + 2 \right\rbrack} + a^{\left\lbrack l\right\rbrack})$&#xFF0C;&#x5176;&#x4E2D;$z^{\left\lbrack l + 2 \right\rbrack} = W^{\left\lbrack l + 2 \right\rbrack}a^{\left\lbrack l + 1 \right\rbrack} + b^{\left\lbrack l + 2\right\rbrack}$&#x3002;&#x6CE8;&#x610F;&#x4E00;&#x70B9;&#xFF0C;&#x5982;&#x679C;&#x4F7F;&#x7528;<strong>L2</strong>&#x6B63;&#x5219;&#x5316;&#x6216;&#x6743;&#x91CD;&#x8870;&#x51CF;&#xFF0C;&#x5B83;&#x4F1A;&#x538B;&#x7F29;$W^{\left\lbrack l + 2\right\rbrack}$&#x7684;&#x503C;&#x3002;&#x5982;&#x679C;&#x5BF9;$b$&#x5E94;&#x7528;&#x6743;&#x91CD;&#x8870;&#x51CF;&#x4E5F;&#x53EF;&#x8FBE;&#x5230;&#x540C;&#x6837;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x5C3D;&#x7BA1;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x4E2D;&#xFF0C;&#x4F60;&#x6709;&#x65F6;&#x4F1A;&#x5BF9;$b$&#x5E94;&#x7528;&#x6743;&#x91CD;&#x8870;&#x51CF;&#xFF0C;&#x6709;&#x65F6;&#x4E0D;&#x4F1A;&#x3002;&#x8FD9;&#x91CC;&#x7684;$W$&#x662F;&#x5173;&#x952E;&#x9879;&#xFF0C;&#x5982;&#x679C;$W^{\left\lbrack l + 2 \right\rbrack} = 0$&#xFF0C;&#x4E3A;&#x65B9;&#x4FBF;&#x8D77;&#x89C1;&#xFF0C;&#x5047;&#x8BBE;$b^{\left\lbrack l + 2 \right\rbrack} = 0$&#xFF0C;&#x8FD9;&#x51E0;&#x9879;&#x5C31;&#x6CA1;&#x6709;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#xFF08;$W^{\left\lbrack l + 2 \right\rbrack}a^{\left\lbrack l + 1 \right\rbrack} + b^{\left\lbrack l + 2\right\rbrack}$&#xFF09;&#x7684;&#x503C;&#x4E3A;0&#x3002;&#x6700;&#x540E;$ a^{\left\lbrack l + 2 \right\rbrack} = \ g\left( a^{[l]} \right) = a^{\left\lbrack l\right\rbrack}$&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5047;&#x5B9A;&#x4F7F;&#x7528;<strong>ReLU</strong>&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF0C;&#x5E76;&#x4E14;&#x6240;&#x6709;&#x6FC0;&#x6D3B;&#x503C;&#x90FD;&#x662F;&#x975E;&#x8D1F;&#x7684;&#xFF0C;$g\left(a^{[l]} \right)$&#x662F;&#x5E94;&#x7528;&#x4E8E;&#x975E;&#x8D1F;&#x6570;&#x7684;<strong>ReLU</strong>&#x51FD;&#x6570;&#xFF0C;&#x6240;&#x4EE5;$a^{[l+2]} =a^{[l]}$&#x3002;</p>
<p><img src="../images/2af8c71686dc45ced8d66c011714343f.png" alt=""></p>
<p><img src="../images/skip_connection_kiank.png" alt="img"></p>
<p>&#x7ED3;&#x679C;&#x8868;&#x660E;&#xFF0C;&#x6B8B;&#x5DEE;&#x5757;&#x5B66;&#x4E60;&#x8FD9;&#x4E2A;&#x6052;&#x7B49;&#x5F0F;&#x51FD;&#x6570;&#x5E76;&#x4E0D;&#x96BE;&#xFF0C;&#x8DF3;&#x8DC3;&#x8FDE;&#x63A5;&#x4F7F;&#x6211;&#x4EEC;&#x5F88;&#x5BB9;&#x6613;&#x5F97;&#x51FA;$ a^{\left\lbrack l + 2 \right\rbrack} = a^{\left\lbrack l\right\rbrack}$&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x5373;&#x4F7F;&#x7ED9;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x589E;&#x52A0;&#x4E86;&#x8FD9;&#x4E24;&#x5C42;&#xFF0C;&#x5B83;&#x7684;&#x6548;&#x7387;&#x4E5F;&#x5E76;&#x4E0D;&#x900A;&#x8272;&#x4E8E;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x56E0;&#x4E3A;&#x5B66;&#x4E60;&#x6052;&#x7B49;&#x51FD;&#x6570;&#x5BF9;&#x5B83;&#x6765;&#x8BF4;&#x5F88;&#x7B80;&#x5355;&#x3002;&#x5C3D;&#x7BA1;&#x5B83;&#x591A;&#x4E86;&#x4E24;&#x5C42;&#xFF0C;&#x4E5F;&#x53EA;&#x628A;$a^{[l]}$&#x7684;&#x503C;&#x8D4B;&#x503C;&#x7ED9;$a^{\left\lbrack l + 2 \right\rbrack}$&#x3002;&#x6240;&#x4EE5;&#x7ED9;&#x5927;&#x578B;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x589E;&#x52A0;&#x4E24;&#x5C42;&#xFF0C;&#x4E0D;&#x8BBA;&#x662F;&#x628A;&#x6B8B;&#x5DEE;&#x5757;&#x6DFB;&#x52A0;&#x5230;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x4E2D;&#x95F4;&#x8FD8;&#x662F;&#x672B;&#x7AEF;&#x4F4D;&#x7F6E;&#xFF0C;&#x90FD;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x7F51;&#x7EDC;&#x7684;&#x8868;&#x73B0;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x4FDD;&#x6301;&#x7F51;&#x7EDC;&#x7684;&#x6548;&#x7387;&#xFF0C;&#x8FD8;&#x8981;&#x63D0;&#x5347;&#x5B83;&#x7684;&#x6548;&#x7387;&#x3002;&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x4E9B;&#x9690;&#x85CF;&#x5C42;&#x5355;&#x5143;&#x5B66;&#x5230;&#x4E00;&#x4E9B;&#x6709;&#x7528;&#x4FE1;&#x606F;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x53EF;&#x80FD;&#x6BD4;&#x5B66;&#x4E60;&#x6052;&#x7B49;&#x51FD;&#x6570;&#x8868;&#x73B0;&#x5F97;&#x66F4;&#x597D;&#x3002;&#x800C;&#x8FD9;&#x4E9B;&#x4E0D;&#x542B;&#x6709;&#x6B8B;&#x5DEE;&#x5757;&#x6216;&#x8DF3;&#x8DC3;&#x8FDE;&#x63A5;&#x7684;&#x6DF1;&#x5EA6;&#x666E;&#x901A;&#x7F51;&#x7EDC;&#x60C5;&#x51B5;&#x5C31;&#x4E0D;&#x4E00;&#x6837;&#x4E86;&#xFF0C;&#x5F53;&#x7F51;&#x7EDC;&#x4E0D;&#x65AD;&#x52A0;&#x6DF1;&#x65F6;&#xFF0C;&#x5C31;&#x7B97;&#x662F;&#x9009;&#x7528;&#x5B66;&#x4E60;&#x6052;&#x7B49;&#x51FD;&#x6570;&#x7684;&#x53C2;&#x6570;&#x90FD;&#x5F88;&#x56F0;&#x96BE;&#xFF0C;&#x6240;&#x4EE5;&#x5F88;&#x591A;&#x5C42;&#x6700;&#x540E;&#x7684;&#x8868;&#x73B0;&#x4E0D;&#x4F46;&#x6CA1;&#x6709;&#x66F4;&#x597D;&#xFF0C;&#x53CD;&#x800C;&#x66F4;&#x7CDF;&#x3002;</p>
<p>&#x6211;&#x8BA4;&#x4E3A;&#x6B8B;&#x5DEE;&#x7F51;&#x7EDC;&#x8D77;&#x4F5C;&#x7528;&#x7684;&#x4E3B;&#x8981;&#x539F;&#x56E0;&#x5C31;&#x662F;&#x8FD9;&#x4E9B;&#x6B8B;&#x5DEE;&#x5757;&#x5B66;&#x4E60;&#x6052;&#x7B49;&#x51FD;&#x6570;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#xFF0C;&#x4F60;&#x80FD;&#x786E;&#x5B9A;&#x7F51;&#x7EDC;&#x6027;&#x80FD;&#x4E0D;&#x4F1A;&#x53D7;&#x5230;&#x5F71;&#x54CD;&#xFF0C;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x6548;&#x7387;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x81F3;&#x5C11;&#x4E0D;&#x4F1A;&#x964D;&#x4F4E;&#x7F51;&#x7EDC;&#x7684;&#x6548;&#x7387;&#xFF0C;&#x56E0;&#x6B64;&#x521B;&#x5EFA;&#x7C7B;&#x4F3C;&#x6B8B;&#x5DEE;&#x7F51;&#x7EDC;&#x53EF;&#x4EE5;&#x63D0;&#x5347;&#x7F51;&#x7EDC;&#x6027;&#x80FD;&#x3002;</p>
<p><img src="../images/cefcaece17927e14eb488cb52d99aaef.png" alt=""></p>
<p>&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x5173;&#x4E8E;&#x6B8B;&#x5DEE;&#x7F51;&#x7EDC;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x503C;&#x5F97;&#x63A2;&#x8BA8;&#x7684;&#x7EC6;&#x8282;&#x662F;&#xFF0C;&#x5047;&#x8BBE;$ z^{\left\lbrack l + 2\right\rbrack}$&#x4E0E;$a^{[l]}$&#x5177;&#x6709;&#x76F8;&#x540C;&#x7EF4;&#x5EA6;&#xFF0C;&#x6240;&#x4EE5;<strong>ResNets</strong>&#x4F7F;&#x7528;&#x4E86;&#x8BB8;&#x591A;<strong>same</strong>&#x5377;&#x79EF;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;$a^{\left\lbrack l\right\rbrack}$&#x7684;&#x7EF4;&#x5EA6;&#x7B49;&#x4E8E;&#x8FD9;&#x4E2A;&#x8F93;&#x51FA;&#x5C42;&#x7684;&#x7EF4;&#x5EA6;&#x3002;&#x4E4B;&#x6240;&#x4EE5;&#x80FD;&#x5B9E;&#x73B0;&#x8DF3;&#x8DC3;&#x8FDE;&#x63A5;&#x662F;&#x56E0;&#x4E3A;<strong>same</strong>&#x5377;&#x79EF;&#x4FDD;&#x7559;&#x4E86;&#x7EF4;&#x5EA6;&#xFF0C;&#x6240;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5F97;&#x51FA;&#x8FD9;&#x4E2A;&#x6377;&#x5F84;&#x8FDE;&#x63A5;&#xFF0C;&#x5E76;&#x8F93;&#x51FA;&#x8FD9;&#x4E24;&#x4E2A;&#x76F8;&#x540C;&#x7EF4;&#x5EA6;&#x7684;&#x5411;&#x91CF;&#x3002;</p>
<p>&#x5982;&#x679C;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x6709;&#x4E0D;&#x540C;&#x7EF4;&#x5EA6;&#xFF0C;&#x6BD4;&#x5982;&#x8F93;&#x5165;&#x7684;&#x7EF4;&#x5EA6;&#x662F;128&#xFF0C;$ a^{\left\lbrack l + 2\right\rbrack}$&#x7684;&#x7EF4;&#x5EA6;&#x662F;256&#xFF0C;&#x518D;&#x589E;&#x52A0;&#x4E00;&#x4E2A;&#x77E9;&#x9635;&#xFF0C;&#x8FD9;&#x91CC;&#x6807;&#x8BB0;&#x4E3A;$W<em>{s}$&#xFF0C;$W</em>{s}$&#x662F;&#x4E00;&#x4E2A;256&#xD7;128&#x7EF4;&#x5EA6;&#x7684;&#x77E9;&#x9635;&#xFF0C;&#x6240;&#x4EE5;$W<em>{s}a^{\left\lbrack l\right\rbrack}$&#x7684;&#x7EF4;&#x5EA6;&#x662F;256&#xFF0C;&#x8FD9;&#x4E2A;&#x65B0;&#x589E;&#x9879;&#x662F;256&#x7EF4;&#x5EA6;&#x7684;&#x5411;&#x91CF;&#x3002;&#x4F60;&#x4E0D;&#x9700;&#x8981;&#x5BF9;$W</em>{s}$&#x505A;&#x4EFB;&#x4F55;&#x64CD;&#x4F5C;&#xFF0C;&#x5B83;&#x662F;&#x7F51;&#x7EDC;&#x901A;&#x8FC7;&#x5B66;&#x4E60;&#x5F97;&#x5230;&#x7684;&#x77E9;&#x9635;&#x6216;&#x53C2;&#x6570;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x77E9;&#x9635;&#xFF0C;<strong>padding</strong>&#x503C;&#x4E3A;0&#xFF0C;&#x7528;0&#x586B;&#x5145;$a^{[l]}$&#xFF0C;&#x5176;&#x7EF4;&#x5EA6;&#x4E3A;256&#xFF0C;&#x6240;&#x4EE5;&#x8005;&#x51E0;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x90FD;&#x53EF;&#x4EE5;&#x3002;</p>
<p><img src="../images/033b59baaa5632368152f5164d17945a.png" alt=""></p>
<p>&#x6700;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;<strong>ResNets</strong>&#x7684;&#x56FE;&#x7247;&#x8BC6;&#x522B;&#x3002;&#x8FD9;&#x4E9B;&#x56FE;&#x7247;&#x662F;&#x6211;&#x4ECE;&#x4F55;&#x51EF;&#x660E;&#x7B49;&#x4EBA;&#x8BBA;&#x6587;&#x4E2D;&#x622A;&#x53D6;&#x7684;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x7F51;&#x7EDC;&#xFF0C;&#x6211;&#x4EEC;&#x7ED9;&#x5B83;&#x8F93;&#x5165;&#x4E00;&#x5F20;&#x56FE;&#x7247;&#xFF0C;&#x5B83;&#x6709;&#x591A;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#xFF0C;&#x6700;&#x540E;&#x8F93;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;<strong>Softmax</strong>&#x3002;</p>
<p><img src="../images/216be29ad1287b177b62fb26909bdaeb.png" alt=""></p>
<p>&#x5982;&#x4F55;&#x628A;&#x5B83;&#x8F6C;&#x5316;&#x4E3A;<strong>ResNets</strong>&#x5462;&#xFF1F;&#x53EA;&#x9700;&#x8981;&#x6DFB;&#x52A0;&#x8DF3;&#x8DC3;&#x8FDE;&#x63A5;&#x3002;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x53EA;&#x8BA8;&#x8BBA;&#x51E0;&#x4E2A;&#x7EC6;&#x8282;&#xFF0C;&#x8FD9;&#x4E2A;&#x7F51;&#x7EDC;&#x6709;&#x5F88;&#x591A;&#x5C42;3&#xD7;3&#x5377;&#x79EF;&#xFF0C;&#x800C;&#x4E14;&#x5B83;&#x4EEC;&#x5927;&#x591A;&#x90FD;&#x662F;<strong>same</strong>&#x5377;&#x79EF;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6DFB;&#x52A0;&#x7B49;&#x7EF4;&#x7279;&#x5F81;&#x5411;&#x91CF;&#x7684;&#x539F;&#x56E0;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x5377;&#x79EF;&#x5C42;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x662F;<strong>same</strong>&#x5377;&#x79EF;&#xFF0C;&#x7EF4;&#x5EA6;&#x5F97;&#x4EE5;&#x4FDD;&#x7559;&#xFF0C;&#x8FD9;&#x4E5F;&#x89E3;&#x91CA;&#x4E86;&#x6DFB;&#x52A0;&#x9879;$ z^{\left\lbrack l + 2 \right\rbrack} + a^{\left\lbrack l\right\rbrack}$&#xFF08;&#x7EF4;&#x5EA6;&#x76F8;&#x540C;&#x6240;&#x4EE5;&#x80FD;&#x591F;&#x76F8;&#x52A0;&#xFF09;&#x3002;</p>
<p><img src="../images/70062fa97916ab79c7ad37282ba1a5f4.png" alt=""></p>
<p><strong>ResNets</strong>&#x7C7B;&#x4F3C;&#x4E8E;&#x5176;&#x5B83;&#x5F88;&#x591A;&#x7F51;&#x7EDC;&#xFF0C;&#x4E5F;&#x4F1A;&#x6709;&#x5F88;&#x591A;&#x5377;&#x79EF;&#x5C42;&#xFF0C;&#x5176;&#x4E2D;&#x5076;&#x5C14;&#x4F1A;&#x6709;&#x6C60;&#x5316;&#x5C42;&#x6216;&#x7C7B;&#x6C60;&#x5316;&#x5C42;&#x7684;&#x5C42;&#x3002;&#x4E0D;&#x8BBA;&#x8FD9;&#x4E9B;&#x5C42;&#x662F;&#x4EC0;&#x4E48;&#x7C7B;&#x578B;&#xFF0C;&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x5728;&#x4E0A;&#x4E00;&#x5F20;&#x5E7B;&#x706F;&#x7247;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x4F60;&#x90FD;&#x9700;&#x8981;&#x8C03;&#x6574;&#x77E9;&#x9635;$W_{s}$&#x7684;&#x7EF4;&#x5EA6;&#x3002;&#x666E;&#x901A;&#x7F51;&#x7EDC;&#x548C;<strong>ResNets</strong>&#x7F51;&#x7EDC;&#x5E38;&#x7528;&#x7684;&#x7ED3;&#x6784;&#x662F;&#xFF1A;&#x5377;&#x79EF;&#x5C42;-&#x5377;&#x79EF;&#x5C42;-&#x5377;&#x79EF;&#x5C42;-&#x6C60;&#x5316;&#x5C42;-&#x5377;&#x79EF;&#x5C42;-&#x5377;&#x79EF;&#x5C42;-&#x5377;&#x79EF;&#x5C42;-&#x6C60;&#x5316;&#x5C42;&#x2026;&#x2026;&#x4F9D;&#x6B64;&#x91CD;&#x590D;&#x3002;&#x76F4;&#x5230;&#x6700;&#x540E;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x901A;&#x8FC7;<strong>softmax</strong>&#x8FDB;&#x884C;&#x9884;&#x6D4B;&#x7684;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x3002;</p>
<p>&#x4EE5;&#x4E0A;&#x5C31;&#x662F;<strong>ResNets</strong>&#x7684;&#x5185;&#x5BB9;&#x3002;&#x4F7F;&#x7528;1&#xD7;1&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x5373;1&#xD7;1&#x5377;&#x79EF;&#xFF0C;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x5F88;&#x6709;&#x610F;&#x601D;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x4E0B;&#x8282;&#x8BFE;&#x518D;&#x8BB2;&#x3002;</p>
<h3 id="25-&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x7F51;&#x7EDC;&#x4EE5;&#x53CA;-1&#xD7;1-&#x5377;&#x79EF;&#xFF08;network-in-network-and-1&#xD7;1-convolutions&#xFF09;">2.5 &#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x7F51;&#x7EDC;&#x4EE5;&#x53CA; 1&#xD7;1 &#x5377;&#x79EF;&#xFF08;Network in Network and 1&#xD7;1 convolutions&#xFF09;</h3>
<p>&#x5728;&#x67B6;&#x6784;&#x5185;&#x5BB9;&#x8BBE;&#x8BA1;&#x65B9;&#x9762;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x6709;&#x5E2E;&#x52A9;&#x7684;&#x60F3;&#x6CD5;&#x662F;&#x4F7F;&#x7528;1&#xD7;1&#x5377;&#x79EF;&#x3002;&#x4E5F;&#x8BB8;&#x4F60;&#x4F1A;&#x597D;&#x5947;&#xFF0C;1&#xD7;1&#x7684;&#x5377;&#x79EF;&#x80FD;&#x505A;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x4E0D;&#x5C31;&#x662F;&#x4E58;&#x4EE5;&#x6570;&#x5B57;&#x4E48;&#xFF1F;&#x542C;&#x4E0A;&#x53BB;&#x633A;&#x597D;&#x7B11;&#x7684;&#xFF0C;&#x7ED3;&#x679C;&#x5E76;&#x975E;&#x5982;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x5177;&#x4F53;&#x770B;&#x770B;&#x3002;</p>
<p>&#x8FC7;&#x6EE4;&#x5668;&#x4E3A;1&#xD7;1&#xFF0C;&#x8FD9;&#x91CC;&#x662F;&#x6570;&#x5B57;2&#xFF0C;&#x8F93;&#x5165;&#x4E00;&#x5F20;6&#xD7;6&#xD7;1&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x5B83;&#x505A;&#x5377;&#x79EF;&#xFF0C;&#x8D77;&#x8FC7;&#x6EE4;&#x5668;&#x5927;&#x5C0F;&#x4E3A;1&#xD7;1&#xD7;1&#xFF0C;&#x7ED3;&#x679C;&#x76F8;&#x5F53;&#x4E8E;&#x628A;&#x8FD9;&#x4E2A;&#x56FE;&#x7247;&#x4E58;&#x4EE5;&#x6570;&#x5B57;2&#xFF0C;&#x6240;&#x4EE5;&#x524D;&#x4E09;&#x4E2A;&#x5355;&#x5143;&#x683C;&#x5206;&#x522B;&#x662F;2&#x3001;4&#x3001;6&#x7B49;&#x7B49;&#x3002;&#x7528;1&#xD7;1&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x8FDB;&#x884C;&#x5377;&#x79EF;&#xFF0C;&#x4F3C;&#x4E4E;&#x7528;&#x5904;&#x4E0D;&#x5927;&#xFF0C;&#x53EA;&#x662F;&#x5BF9;&#x8F93;&#x5165;&#x77E9;&#x9635;&#x4E58;&#x4EE5;&#x67D0;&#x4E2A;&#x6570;&#x5B57;&#x3002;&#x4F46;&#x8FD9;&#x4EC5;&#x4EC5;&#x662F;&#x5BF9;&#x4E8E;6&#xD7;6&#xD7;1&#x7684;&#x4E00;&#x4E2A;&#x901A;&#x9053;&#x56FE;&#x7247;&#x6765;&#x8BF4;&#xFF0C;1&#xD7;1&#x5377;&#x79EF;&#x6548;&#x679C;&#x4E0D;&#x4F73;&#x3002;</p>
<p><img src="../images/84c62c1d9bdf0a14f20cbeb02e1cec1a.png" alt=""></p>
<p>&#x5982;&#x679C;&#x662F;&#x4E00;&#x5F20;6&#xD7;6&#xD7;32&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x90A3;&#x4E48;&#x4F7F;&#x7528;1&#xD7;1&#x8FC7;&#x6EE4;&#x5668;&#x8FDB;&#x884C;&#x5377;&#x79EF;&#x6548;&#x679C;&#x66F4;&#x597D;&#x3002;&#x5177;&#x4F53;&#x6765;&#x8BF4;&#xFF0C;1&#xD7;1&#x5377;&#x79EF;&#x6240;&#x5B9E;&#x73B0;&#x7684;&#x529F;&#x80FD;&#x662F;&#x904D;&#x5386;&#x8FD9;36&#x4E2A;&#x5355;&#x5143;&#x683C;&#xFF0C;&#x8BA1;&#x7B97;&#x5DE6;&#x56FE;&#x4E2D;32&#x4E2A;&#x6570;&#x5B57;&#x548C;&#x8FC7;&#x6EE4;&#x5668;&#x4E2D;32&#x4E2A;&#x6570;&#x5B57;&#x7684;&#x5143;&#x7D20;&#x79EF;&#x4E4B;&#x548C;&#xFF0C;&#x7136;&#x540E;&#x5E94;&#x7528;<strong>ReLU</strong>&#x975E;&#x7EBF;&#x6027;&#x51FD;&#x6570;&#x3002;</p>
<p><img src="../images/7522d4cbc42b7db1c5a05bc461106590.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x4EE5;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x5355;&#x5143;&#x4E3A;&#x4F8B;&#xFF0C;&#x5B83;&#x662F;&#x8FD9;&#x4E2A;&#x8F93;&#x5165;&#x5C42;&#x4E0A;&#x7684;&#x67D0;&#x4E2A;&#x5207;&#x7247;&#xFF0C;&#x7528;&#x8FD9;36&#x4E2A;&#x6570;&#x5B57;&#x4E58;&#x4EE5;&#x8FD9;&#x4E2A;&#x8F93;&#x5165;&#x5C42;&#x4E0A;1&#xD7;1&#x5207;&#x7247;&#xFF0C;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x5B9E;&#x6570;&#xFF0C;&#x50CF;&#x8FD9;&#x6837;&#x628A;&#x5B83;&#x753B;&#x5728;&#x8F93;&#x51FA;&#x4E2D;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;1&#xD7;1&#xD7;32&#x8FC7;&#x6EE4;&#x5668;&#x4E2D;&#x7684;32&#x4E2A;&#x6570;&#x5B57;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x7406;&#x89E3;&#xFF0C;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x8F93;&#x5165;&#x662F;32&#x4E2A;&#x6570;&#x5B57;&#xFF08;&#x8F93;&#x5165;&#x56FE;&#x7247;&#x4E2D;&#x5DE6;&#x4E0B;&#x89D2;&#x4F4D;&#x7F6E;32&#x4E2A;&#x901A;&#x9053;&#x4E2D;&#x7684;&#x6570;&#x5B57;&#xFF09;&#xFF0C;&#x5373;&#x76F8;&#x540C;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#x4E0A;&#x67D0;&#x4E00;&#x5207;&#x7247;&#x4E0A;&#x7684;32&#x4E2A;&#x6570;&#x5B57;&#xFF0C;&#x8FD9;32&#x4E2A;&#x6570;&#x5B57;&#x5177;&#x6709;&#x4E0D;&#x540C;&#x901A;&#x9053;&#xFF0C;&#x4E58;&#x4EE5;32&#x4E2A;&#x6743;&#x91CD;&#xFF08;&#x5C06;&#x8FC7;&#x6EE4;&#x5668;&#x4E2D;&#x7684;32&#x4E2A;&#x6570;&#x7406;&#x89E3;&#x4E3A;&#x6743;&#x91CD;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x5E94;&#x7528;<strong>ReLU</strong>&#x975E;&#x7EBF;&#x6027;&#x51FD;&#x6570;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x8F93;&#x51FA;&#x76F8;&#x5E94;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p><img src="../images/f97e6c31c2b27a2d4ef9610b8f32b335.png" alt=""></p>
<p>&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x8FC7;&#x6EE4;&#x5668;&#x4E0D;&#x6B62;&#x4E00;&#x4E2A;&#xFF0C;&#x800C;&#x662F;&#x591A;&#x4E2A;&#xFF0C;&#x5C31;&#x597D;&#x50CF;&#x6709;&#x591A;&#x4E2A;&#x8F93;&#x5165;&#x5355;&#x5143;&#xFF0C;&#x5176;&#x8F93;&#x5165;&#x5185;&#x5BB9;&#x4E3A;&#x4E00;&#x4E2A;&#x5207;&#x7247;&#x4E0A;&#x6240;&#x6709;&#x6570;&#x5B57;&#xFF0C;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x662F;6&#xD7;6&#x8FC7;&#x6EE4;&#x5668;&#x6570;&#x91CF;&#x3002;</p>
<p><img src="../images/70eba35d0705dc681c40f09a0926061a.png" alt=""></p>
<p>&#x6240;&#x4EE5;1&#xD7;1&#x5377;&#x79EF;&#x53EF;&#x4EE5;&#x4ECE;&#x6839;&#x672C;&#x4E0A;&#x7406;&#x89E3;&#x4E3A;&#x5BF9;&#x8FD9;32&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x4F4D;&#x7F6E;&#x90FD;&#x5E94;&#x7528;&#x4E00;&#x4E2A;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#xFF0C;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x8F93;&#x5165;32&#x4E2A;&#x6570;&#x5B57;&#xFF08;&#x8FC7;&#x6EE4;&#x5668;&#x6570;&#x91CF;&#x6807;&#x8BB0;&#x4E3A;$n_{C}^{\left\lbrack l + 1\right\rbrack}$&#xFF0C;&#x5728;&#x8FD9;36&#x4E2A;&#x5355;&#x5143;&#x4E0A;&#x91CD;&#x590D;&#x6B64;&#x8FC7;&#x7A0B;&#xFF09;,&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x662F;6&#xD7;6&#xD7;#filters&#xFF08;&#x8FC7;&#x6EE4;&#x5668;&#x6570;&#x91CF;&#xFF09;&#xFF0C;&#x4EE5;&#x4FBF;&#x5728;&#x8F93;&#x5165;&#x5C42;&#x4E0A;&#x5B9E;&#x65BD;&#x4E00;&#x4E2A;&#x975E;&#x5E73;&#x51E1;&#xFF08;<strong>non-trivial</strong>&#xFF09;&#x8BA1;&#x7B97;&#x3002;</p>
<p><img src="../images/46698c486da9ae184532d773716c77e9.png" alt=""></p>
<p>&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x901A;&#x5E38;&#x79F0;&#x4E3A;1&#xD7;1&#x5377;&#x79EF;&#xFF0C;&#x6709;&#x65F6;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;<strong>Network in Network</strong>&#xFF0C;&#x5728;&#x6797;&#x654F;&#x3001;&#x9648;&#x5F3A;&#x548C;&#x6768;&#x5B66;&#x6210;&#x7684;&#x8BBA;&#x6587;&#x4E2D;&#x6709;&#x8BE6;&#x7EC6;&#x63CF;&#x8FF0;&#x3002;&#x867D;&#x7136;&#x8BBA;&#x6587;&#x4E2D;&#x5173;&#x4E8E;&#x67B6;&#x6784;&#x7684;&#x8BE6;&#x7EC6;&#x5185;&#x5BB9;&#x5E76;&#x6CA1;&#x6709;&#x5F97;&#x5230;&#x5E7F;&#x6CDB;&#x5E94;&#x7528;&#xFF0C;&#x4F46;&#x662F;1&#xD7;1&#x5377;&#x79EF;&#x6216;<strong>Network in Network</strong>&#x8FD9;&#x79CD;&#x7406;&#x5FF5;&#x5374;&#x5F88;&#x6709;&#x5F71;&#x54CD;&#x529B;&#xFF0C;&#x5F88;&#x591A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x67B6;&#x6784;&#x90FD;&#x53D7;&#x5230;&#x5B83;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x5305;&#x62EC;&#x4E0B;&#x8282;&#x8BFE;&#x8981;&#x8BB2;&#x7684;<strong>Inception</strong>&#x7F51;&#x7EDC;&#x3002;</p>
<p>&#x4E3E;&#x4E2A;1&#xD7;1&#x5377;&#x79EF;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x76F8;&#x4FE1;&#x5BF9;&#x5927;&#x5BB6;&#x6709;&#x6240;&#x5E2E;&#x52A9;&#xFF0C;&#x8FD9;&#x662F;&#x5B83;&#x7684;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x3002;</p>
<p>&#x5047;&#x8BBE;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;28&#xD7;28&#xD7;192&#x7684;&#x8F93;&#x5165;&#x5C42;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6C60;&#x5316;&#x5C42;&#x538B;&#x7F29;&#x5B83;&#x7684;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x6211;&#x4EEC;&#x5F88;&#x6E05;&#x695A;&#x3002;&#x4F46;&#x5982;&#x679C;&#x901A;&#x9053;&#x6570;&#x91CF;&#x5F88;&#x5927;&#xFF0C;&#x8BE5;&#x5982;&#x4F55;&#x628A;&#x5B83;&#x538B;&#x7F29;&#x4E3A;28&#xD7;28&#xD7;32&#x7EF4;&#x5EA6;&#x7684;&#x5C42;&#x5462;&#xFF1F;&#x4F60;&#x53EF;&#x4EE5;&#x7528;32&#x4E2A;&#x5927;&#x5C0F;&#x4E3A;1&#xD7;1&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x4E25;&#x683C;&#x6765;&#x8BB2;&#x6BCF;&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#x5927;&#x5C0F;&#x90FD;&#x662F;1&#xD7;1&#xD7;192&#x7EF4;&#xFF0C;&#x56E0;&#x4E3A;&#x8FC7;&#x6EE4;&#x5668;&#x4E2D;&#x901A;&#x9053;&#x6570;&#x91CF;&#x5FC5;&#x987B;&#x4E0E;&#x8F93;&#x5165;&#x5C42;&#x4E2D;&#x901A;&#x9053;&#x7684;&#x6570;&#x91CF;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x3002;&#x4F46;&#x662F;&#x4F60;&#x4F7F;&#x7528;&#x4E86;32&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x8F93;&#x51FA;&#x5C42;&#x4E3A;28&#xD7;28&#xD7;32&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x538B;&#x7F29;&#x901A;&#x9053;&#x6570;&#xFF08;$n_{c}$&#xFF09;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5BF9;&#x4E8E;&#x6C60;&#x5316;&#x5C42;&#x6211;&#x53EA;&#x662F;&#x538B;&#x7F29;&#x4E86;&#x8FD9;&#x4E9B;&#x5C42;&#x7684;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#x3002;</p>
<p><img src="../images/49a16fdc10769a86355911f9e324c728.png" alt=""></p>
<p>&#x5728;&#x4E4B;&#x540E;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x5728;&#x67D0;&#x4E9B;&#x7F51;&#x7EDC;&#x4E2D;1&#xD7;1&#x5377;&#x79EF;&#x662F;&#x5982;&#x4F55;&#x538B;&#x7F29;&#x901A;&#x9053;&#x6570;&#x91CF;&#x5E76;&#x51CF;&#x5C11;&#x8BA1;&#x7B97;&#x7684;&#x3002;&#x5F53;&#x7136;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x4FDD;&#x6301;&#x901A;&#x9053;&#x6570;192&#x4E0D;&#x53D8;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x53EF;&#x884C;&#x7684;&#xFF0C;1&#xD7;1&#x5377;&#x79EF;&#x53EA;&#x662F;&#x6DFB;&#x52A0;&#x4E86;&#x975E;&#x7EBF;&#x6027;&#x51FD;&#x6570;&#xFF0C;&#x5F53;&#x7136;&#x4E5F;&#x53EF;&#x4EE5;&#x8BA9;&#x7F51;&#x7EDC;&#x5B66;&#x4E60;&#x66F4;&#x590D;&#x6742;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x6211;&#x4EEC;&#x518D;&#x6DFB;&#x52A0;&#x4E00;&#x5C42;&#xFF0C;&#x5176;&#x8F93;&#x5165;&#x4E3A;28&#xD7;28&#xD7;192&#xFF0C;&#x8F93;&#x51FA;&#x4E3A;28&#xD7;28&#xD7;192&#x3002;</p>
<p><img src="../images/70f3b26fe86c3ec2507b8bb85be8d30c.png" alt=""></p>
<p>1&#xD7;1&#x5377;&#x79EF;&#x5C42;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x5B9E;&#x73B0;&#x4E86;&#x4E00;&#x4E9B;&#x91CD;&#x8981;&#x529F;&#x80FD;&#x7684;&#xFF08;<strong>doing something pretty non-trivial</strong>&#xFF09;&#xFF0C;&#x5B83;&#x7ED9;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6DFB;&#x52A0;&#x4E86;&#x4E00;&#x4E2A;&#x975E;&#x7EBF;&#x6027;&#x51FD;&#x6570;&#xFF0C;&#x4ECE;&#x800C;&#x51CF;&#x5C11;&#x6216;&#x4FDD;&#x6301;&#x8F93;&#x5165;&#x5C42;&#x4E2D;&#x7684;&#x901A;&#x9053;&#x6570;&#x91CF;&#x4E0D;&#x53D8;&#xFF0C;&#x5F53;&#x7136;&#x5982;&#x679C;&#x4F60;&#x613F;&#x610F;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x589E;&#x52A0;&#x901A;&#x9053;&#x6570;&#x91CF;&#x3002;&#x540E;&#x9762;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x8FD9;&#x5BF9;&#x6784;&#x5EFA;<strong>Inception</strong>&#x7F51;&#x7EDC;&#x5F88;&#x6709;&#x5E2E;&#x52A9;&#xFF0C;&#x6211;&#x4EEC;&#x653E;&#x5728;&#x4E0B;&#x8282;&#x8BFE;&#x8BB2;&#x3002;</p>
<p>&#x8FD9;&#x8282;&#x8BFE;&#x6211;&#x4EEC;&#x6F14;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x610F;&#x613F;&#x901A;&#x8FC7;1&#xD7;1&#x5377;&#x79EF;&#x7684;&#x7B80;&#x5355;&#x64CD;&#x4F5C;&#x6765;&#x538B;&#x7F29;&#x6216;&#x4FDD;&#x6301;&#x8F93;&#x5165;&#x5C42;&#x4E2D;&#x7684;&#x901A;&#x9053;&#x6570;&#x91CF;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x589E;&#x52A0;&#x901A;&#x9053;&#x6570;&#x91CF;&#x3002;&#x4E0B;&#x8282;&#x8BFE;&#xFF0C;&#x6211;&#x4EEC;&#x518D;&#x8BB2;&#x8BB2;1&#xD7;1&#x5377;&#x79EF;&#x662F;&#x5982;&#x4F55;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x6784;&#x5EFA;<strong>Inception</strong>&#x7F51;&#x7EDC;&#x7684;&#xFF0C;&#x4E0B;&#x8282;&#x8BFE;&#x89C1;&#x3002;</p>
<h3 id="26-&#x8C37;&#x6B4C;-inception-&#x7F51;&#x7EDC;&#x7B80;&#x4ECB;&#xFF08;inception-network-motivation&#xFF09;">2.6 &#x8C37;&#x6B4C; Inception &#x7F51;&#x7EDC;&#x7B80;&#x4ECB;&#xFF08;Inception network motivation&#xFF09;</h3>
<p>&#x6784;&#x5EFA;&#x5377;&#x79EF;&#x5C42;&#x65F6;&#xFF0C;&#x4F60;&#x8981;&#x51B3;&#x5B9A;&#x8FC7;&#x6EE4;&#x5668;&#x7684;&#x5927;&#x5C0F;&#x7A76;&#x7ADF;&#x662F;1&#xD7;1&#xFF08;&#x539F;&#x6765;&#x662F;1&#xD7;3&#xFF0C;&#x731C;&#x6D4B;&#x4E3A;&#x53E3;&#x8BEF;&#xFF09;&#xFF0C;3&#xD7;3&#x8FD8;&#x662F;5&#xD7;5&#xFF0C;&#x6216;&#x8005;&#x8981;&#x4E0D;&#x8981;&#x6DFB;&#x52A0;&#x6C60;&#x5316;&#x5C42;&#x3002;&#x800C;<strong>Inception</strong>&#x7F51;&#x7EDC;&#x7684;&#x4F5C;&#x7528;&#x5C31;&#x662F;&#x4EE3;&#x66FF;&#x4F60;&#x6765;&#x51B3;&#x5B9A;&#xFF0C;&#x867D;&#x7136;&#x7F51;&#x7EDC;&#x67B6;&#x6784;&#x56E0;&#x6B64;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x590D;&#x6742;&#xFF0C;&#x4F46;&#x7F51;&#x7EDC;&#x8868;&#x73B0;&#x5374;&#x975E;&#x5E38;&#x597D;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x4E86;&#x89E3;&#x4E00;&#x4E0B;&#x5176;&#x4E2D;&#x7684;&#x539F;&#x7406;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x8FD9;&#x662F;&#x4F60;28&#xD7;28&#xD7;192&#x7EF4;&#x5EA6;&#x7684;&#x8F93;&#x5165;&#x5C42;&#xFF0C;<strong>Inception</strong>&#x7F51;&#x7EDC;&#x6216;<strong>Inception</strong>&#x5C42;&#x7684;&#x4F5C;&#x7528;&#x5C31;&#x662F;&#x4EE3;&#x66FF;&#x4EBA;&#x5DE5;&#x6765;&#x786E;&#x5B9A;&#x5377;&#x79EF;&#x5C42;&#x4E2D;&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x7C7B;&#x578B;&#xFF0C;&#x6216;&#x8005;&#x786E;&#x5B9A;&#x662F;&#x5426;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x5377;&#x79EF;&#x5C42;&#x6216;&#x6C60;&#x5316;&#x5C42;&#xFF0C;&#x6211;&#x4EEC;&#x6F14;&#x793A;&#x4E00;&#x4E0B;&#x3002;</p>
<p><img src="../images/4a9d28e64e503ca97ae54236d9d67c93.png" alt=""></p>
<p>&#x5982;&#x679C;&#x4F7F;&#x7528;1&#xD7;1&#x5377;&#x79EF;&#xFF0C;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x4F1A;&#x662F;28&#xD7;28&#xD7;#&#xFF08;&#x67D0;&#x4E2A;&#x503C;&#xFF09;&#xFF0C;&#x5047;&#x8BBE;&#x8F93;&#x51FA;&#x4E3A;28&#xD7;28&#xD7;64&#xFF0C;&#x5E76;&#x4E14;&#x8FD9;&#x91CC;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5C42;&#x3002;</p>
<p><img src="../images/f582106ffc2c9e1cf4b07768c7708020.png" alt=""></p>
<p>&#x5982;&#x679C;&#x4F7F;&#x7528;3&#xD7;3&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x90A3;&#x4E48;&#x8F93;&#x51FA;&#x662F;28&#xD7;28&#xD7;128&#x3002;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x628A;&#x7B2C;&#x4E8C;&#x4E2A;&#x503C;&#x5806;&#x79EF;&#x5230;&#x7B2C;&#x4E00;&#x4E2A;&#x503C;&#x4E0A;&#xFF0C;&#x4E3A;&#x4E86;&#x5339;&#x914D;&#x7EF4;&#x5EA6;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x7528;<strong>same</strong>&#x5377;&#x79EF;&#xFF0C;&#x8F93;&#x51FA;&#x7EF4;&#x5EA6;&#x4F9D;&#x7136;&#x662F;28&#xD7;28&#xFF0C;&#x548C;&#x8F93;&#x5165;&#x7EF4;&#x5EA6;&#x76F8;&#x540C;&#xFF0C;&#x5373;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#x76F8;&#x540C;&#x3002;</p>
<p><img src="../images/61a9e2eacff92380df9ea0149cc25e90.png" alt=""></p>
<p>&#x6216;&#x8BB8;&#x4F60;&#x4F1A;&#x8BF4;&#xFF0C;&#x6211;&#x5E0C;&#x671B;&#x63D0;&#x5347;&#x7F51;&#x7EDC;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x7528;5&#xD7;5&#x8FC7;&#x6EE4;&#x5668;&#x6216;&#x8BB8;&#x4F1A;&#x66F4;&#x597D;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x59A8;&#x8BD5;&#x4E00;&#x4E0B;&#xFF0C;&#x8F93;&#x51FA;&#x53D8;&#x6210;28&#xD7;28&#xD7;32&#xFF0C;&#x6211;&#x4EEC;&#x518D;&#x6B21;&#x4F7F;&#x7528;<strong>same</strong>&#x5377;&#x79EF;&#xFF0C;&#x4FDD;&#x6301;&#x7EF4;&#x5EA6;&#x4E0D;&#x53D8;&#x3002;</p>
<p><img src="../images/46cf8f4fe80f47de754d0e0f13945941.png" alt=""></p>
<p>&#x6216;&#x8BB8;&#x4F60;&#x4E0D;&#x60F3;&#x8981;&#x5377;&#x79EF;&#x5C42;&#xFF0C;&#x90A3;&#x5C31;&#x7528;&#x6C60;&#x5316;&#x64CD;&#x4F5C;&#xFF0C;&#x5F97;&#x5230;&#x4E00;&#x4E9B;&#x4E0D;&#x540C;&#x7684;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x5B83;&#x4E5F;&#x5806;&#x79EF;&#x8D77;&#x6765;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x6C60;&#x5316;&#x8F93;&#x51FA;&#x662F;28&#xD7;28&#xD7;32&#x3002;&#x4E3A;&#x4E86;&#x5339;&#x914D;&#x6240;&#x6709;&#x7EF4;&#x5EA6;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5BF9;&#x6700;&#x5927;&#x6C60;&#x5316;&#x4F7F;&#x7528;<strong>padding</strong>&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x7684;&#x6C60;&#x5316;&#x5F62;&#x5F0F;&#xFF0C;&#x56E0;&#x4E3A;&#x5982;&#x679C;&#x8F93;&#x5165;&#x7684;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#x4E3A;28&#xD7;28&#xFF0C;&#x5219;&#x8F93;&#x51FA;&#x7684;&#x76F8;&#x5E94;&#x7EF4;&#x5EA6;&#x4E5F;&#x662F;28&#xD7;28&#x3002;&#x7136;&#x540E;&#x518D;&#x8FDB;&#x884C;&#x6C60;&#x5316;&#xFF0C;<strong>padding</strong>&#x4E0D;&#x53D8;&#xFF0C;&#x6B65;&#x5E45;&#x4E3A;1&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x64CD;&#x4F5C;&#x975E;&#x5E38;&#x6709;&#x610F;&#x601D;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x8981;&#x7EE7;&#x7EED;&#x5B66;&#x4E60;&#x540E;&#x9762;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x4E00;&#x4F1A;&#x518D;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x6C60;&#x5316;&#x8FC7;&#x7A0B;&#x3002;</p>
<p><img src="../images/99f8fc7dbe7cd0726f5271aae11b9872.png" alt=""></p>
<p>&#x6709;&#x4E86;&#x8FD9;&#x6837;&#x7684;<strong>Inception</strong>&#x6A21;&#x5757;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x8F93;&#x5165;&#x67D0;&#x4E2A;&#x91CF;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x7D2F;&#x52A0;&#x4E86;&#x6240;&#x6709;&#x6570;&#x5B57;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x6700;&#x7EC8;&#x8F93;&#x51FA;&#x4E3A;32+32+128+64=256&#x3002;<strong>Inception</strong>&#x6A21;&#x5757;&#x7684;&#x8F93;&#x5165;&#x4E3A;28&#xD7;28&#xD7;192&#xFF0C;&#x8F93;&#x51FA;&#x4E3A;28&#xD7;28&#xD7;256&#x3002;&#x8FD9;&#x5C31;&#x662F;<strong>Inception</strong>&#x7F51;&#x7EDC;&#x7684;&#x6838;&#x5FC3;&#x5185;&#x5BB9;&#xFF0C;&#x63D0;&#x51FA;&#x8005;&#x5305;&#x62EC;<strong>Christian Szegedy&#x3001;&#x5218;&#x4F1F;&#x3001;&#x8D3E;&#x9633;&#x9752;&#x3001;Pierre Sermanet&#x3001;Scott Reed&#x3001;Dragomir Anguelov&#x3001;Dumitru Erhan&#x3001;Vincent Vanhoucke</strong>&#x548C;<strong>Andrew Rabinovich</strong>&#x3002;&#x57FA;&#x672C;&#x601D;&#x60F3;&#x662F;<strong>Inception</strong>&#x7F51;&#x7EDC;&#x4E0D;&#x9700;&#x8981;&#x4EBA;&#x4E3A;&#x51B3;&#x5B9A;&#x4F7F;&#x7528;&#x54EA;&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#x6216;&#x8005;&#x662F;&#x5426;&#x9700;&#x8981;&#x6C60;&#x5316;&#xFF0C;&#x800C;&#x662F;&#x7531;&#x7F51;&#x7EDC;&#x81EA;&#x884C;&#x786E;&#x5B9A;&#x8FD9;&#x4E9B;&#x53C2;&#x6570;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x7ED9;&#x7F51;&#x7EDC;&#x6DFB;&#x52A0;&#x8FD9;&#x4E9B;&#x53C2;&#x6570;&#x7684;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x503C;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x8FD9;&#x4E9B;&#x8F93;&#x51FA;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#xFF0C;&#x8BA9;&#x7F51;&#x7EDC;&#x81EA;&#x5DF1;&#x5B66;&#x4E60;&#x5B83;&#x9700;&#x8981;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x91C7;&#x7528;&#x54EA;&#x4E9B;&#x8FC7;&#x6EE4;&#x5668;&#x7EC4;&#x5408;&#x3002;</p>
<p>&#x4E0D;&#x96BE;&#x53D1;&#x73B0;&#xFF0C;&#x6211;&#x6240;&#x63CF;&#x8FF0;&#x7684;<strong>Inception</strong>&#x5C42;&#x6709;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x662F;&#x8BA1;&#x7B97;&#x6210;&#x672C;&#xFF0C;&#x4E0B;&#x4E00;&#x5F20;&#x5E7B;&#x706F;&#x7247;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x6765;&#x8BA1;&#x7B97;&#x8FD9;&#x4E2A;5&#xD7;5&#x8FC7;&#x6EE4;&#x5668;&#x5728;&#x8BE5;&#x6A21;&#x5757;&#x4E2D;&#x7684;&#x8BA1;&#x7B97;&#x6210;&#x672C;&#x3002;</p>
<p><img src="../images/27894eae037f4fd859d33ebdda1cac9a.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x628A;&#x91CD;&#x70B9;&#x96C6;&#x4E2D;&#x5728;&#x524D;&#x4E00;&#x5F20;&#x5E7B;&#x706F;&#x7247;&#x4E2D;&#x7684;5&#xD7;5&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;28&#xD7;28&#xD7;192&#x7684;&#x8F93;&#x5165;&#x5757;&#xFF0C;&#x6267;&#x884C;&#x4E00;&#x4E2A;5&#xD7;5&#x5377;&#x79EF;&#xFF0C;&#x5B83;&#x6709;32&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x8F93;&#x51FA;&#x4E3A;28&#xD7;28&#xD7;32&#x3002;&#x524D;&#x4E00;&#x5F20;&#x5E7B;&#x706F;&#x7247;&#x4E2D;&#xFF0C;&#x6211;&#x7528;&#x4E00;&#x4E2A;&#x7D2B;&#x8272;&#x7684;&#x7EC6;&#x957F;&#x5757;&#x8868;&#x793A;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x7528;&#x4E00;&#x4E2A;&#x770B;&#x8D77;&#x6765;&#x66F4;&#x666E;&#x901A;&#x7684;&#x84DD;&#x8272;&#x5757;&#x8868;&#x793A;&#x3002;&#x6211;&#x4EEC;&#x6765;&#x8BA1;&#x7B97;&#x8FD9;&#x4E2A;28&#xD7;28&#xD7;32&#x8F93;&#x51FA;&#x7684;&#x8BA1;&#x7B97;&#x6210;&#x672C;&#xFF0C;&#x5B83;&#x6709;32&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x56E0;&#x4E3A;&#x8F93;&#x51FA;&#x6709;32&#x4E2A;&#x901A;&#x9053;&#xFF0C;&#x6BCF;&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#x5927;&#x5C0F;&#x4E3A;5&#xD7;5&#xD7;192&#xFF0C;&#x8F93;&#x51FA;&#x5927;&#x5C0F;&#x4E3A;28&#xD7;28&#xD7;32&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x8981;&#x8BA1;&#x7B97;28&#xD7;28&#xD7;32&#x4E2A;&#x6570;&#x5B57;&#x3002;&#x5BF9;&#x4E8E;&#x8F93;&#x51FA;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x6570;&#x5B57;&#x6765;&#x8BF4;&#xFF0C;&#x4F60;&#x90FD;&#x9700;&#x8981;&#x6267;&#x884C;5&#xD7;5&#xD7;192&#x6B21;&#x4E58;&#x6CD5;&#x8FD0;&#x7B97;&#xFF0C;&#x6240;&#x4EE5;&#x4E58;&#x6CD5;&#x8FD0;&#x7B97;&#x7684;&#x603B;&#x6B21;&#x6570;&#x4E3A;&#x6BCF;&#x4E2A;&#x8F93;&#x51FA;&#x503C;&#x6240;&#x9700;&#x8981;&#x6267;&#x884C;&#x7684;&#x4E58;&#x6CD5;&#x8FD0;&#x7B97;&#x6B21;&#x6570;&#xFF08;5&#xD7;5&#xD7;192&#xFF09;&#x4E58;&#x4EE5;&#x8F93;&#x51FA;&#x503C;&#x4E2A;&#x6570;&#xFF08;28&#xD7;28&#xD7;32&#xFF09;&#xFF0C;&#x628A;&#x8FD9;&#x4E9B;&#x6570;&#x76F8;&#x4E58;&#x7ED3;&#x679C;&#x7B49;&#x4E8E;1.2&#x4EBF;(120422400)&#x3002;&#x5373;&#x4F7F;&#x5728;&#x73B0;&#x5728;&#xFF0C;&#x7528;&#x8BA1;&#x7B97;&#x673A;&#x6267;&#x884C;1.2&#x4EBF;&#x6B21;&#x4E58;&#x6CD5;&#x8FD0;&#x7B97;&#xFF0C;&#x6210;&#x672C;&#x4E5F;&#x662F;&#x76F8;&#x5F53;&#x9AD8;&#x7684;&#x3002;&#x4E0B;&#x4E00;&#x5F20;&#x5E7B;&#x706F;&#x7247;&#x4F1A;&#x4ECB;&#x7ECD;1&#xD7;1&#x5377;&#x79EF;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x4E0A;&#x8282;&#x8BFE;&#x6240;&#x5B66;&#x7684;&#x3002;&#x4E3A;&#x4E86;&#x964D;&#x4F4E;&#x8BA1;&#x7B97;&#x6210;&#x672C;&#xFF0C;&#x6211;&#x4EEC;&#x7528;&#x8BA1;&#x7B97;&#x6210;&#x672C;&#x9664;&#x4EE5;&#x56E0;&#x5B50;10&#xFF0C;&#x7ED3;&#x679C;&#x5B83;&#x4ECE;1.2&#x4EBF;&#x51CF;&#x5C0F;&#x5230;&#x539F;&#x6765;&#x7684;&#x5341;&#x5206;&#x4E4B;&#x4E00;&#x3002;&#x8BF7;&#x8BB0;&#x4F4F;120&#x8FD9;&#x4E2A;&#x6570;&#x5B57;&#xFF0C;&#x4E00;&#x4F1A;&#x8FD8;&#x8981;&#x548C;&#x4E0B;&#x4E00;&#x9875;&#x770B;&#x5230;&#x7684;&#x6570;&#x5B57;&#x505A;&#x5BF9;&#x6BD4;&#x3002;</p>
<p><img src="../images/5b3df2904b9d8dc51bd99ccb45ac9f5b.png" alt=""></p>
<p>&#x8FD9;&#x91CC;&#x8FD8;&#x6709;&#x53E6;&#x5916;&#x4E00;&#x79CD;&#x67B6;&#x6784;&#xFF0C;&#x5176;&#x8F93;&#x5165;&#x4E3A;28&#xD7;28&#xD7;192&#xFF0C;&#x8F93;&#x51FA;&#x4E3A;28&#xD7;28&#xD7;32&#x3002;&#x5176;&#x7ED3;&#x679C;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF0C;&#x5BF9;&#x4E8E;&#x8F93;&#x5165;&#x5C42;&#xFF0C;&#x4F7F;&#x7528;1&#xD7;1&#x5377;&#x79EF;&#x628A;&#x8F93;&#x5165;&#x503C;&#x4ECE;192&#x4E2A;&#x901A;&#x9053;&#x51CF;&#x5C11;&#x5230;16&#x4E2A;&#x901A;&#x9053;&#x3002;&#x7136;&#x540E;&#x5BF9;&#x8FD9;&#x4E2A;&#x8F83;&#x5C0F;&#x5C42;&#x8FD0;&#x884C;5&#xD7;5&#x5377;&#x79EF;&#xFF0C;&#x5F97;&#x5230;&#x6700;&#x7EC8;&#x8F93;&#x51FA;&#x3002;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x7684;&#x7EF4;&#x5EA6;&#x4F9D;&#x7136;&#x76F8;&#x540C;&#xFF0C;&#x8F93;&#x5165;&#x662F;28&#xD7;28&#xD7;192&#xFF0C;&#x8F93;&#x51FA;&#x662F;28&#xD7;28&#xD7;32&#xFF0C;&#x548C;&#x4E0A;&#x4E00;&#x9875;&#x7684;&#x76F8;&#x540C;&#x3002;&#x4F46;&#x6211;&#x4EEC;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x628A;&#x5DE6;&#x8FB9;&#x8FD9;&#x4E2A;&#x5927;&#x7684;&#x8F93;&#x5165;&#x5C42;&#x538B;&#x7F29;&#x6210;&#x8FD9;&#x4E2A;&#x8F83;&#x5C0F;&#x7684;&#x7684;&#x4E2D;&#x95F4;&#x5C42;&#xFF0C;&#x5B83;&#x53EA;&#x6709;16&#x4E2A;&#x901A;&#x9053;&#xFF0C;&#x800C;&#x4E0D;&#x662F;192&#x4E2A;&#x3002;</p>
<p><img src="../images/1fec66d984a3c8c47ff459775d411e71.png" alt=""></p>
<p>&#x6709;&#x65F6;&#x5019;&#x8FD9;&#x88AB;&#x79F0;&#x4E3A;&#x74F6;&#x9888;&#x5C42;&#xFF0C;&#x74F6;&#x9888;&#x901A;&#x5E38;&#x662F;&#x67D0;&#x4E2A;&#x5BF9;&#x8C61;&#x6700;&#x5C0F;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x5047;&#x5982;&#x4F60;&#x6709;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x73BB;&#x7483;&#x74F6;&#xFF0C;&#x8FD9;&#x662F;&#x74F6;&#x585E;&#x4F4D;&#x7F6E;&#xFF0C;&#x74F6;&#x9888;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x74F6;&#x5B50;&#x6700;&#x5C0F;&#x7684;&#x90E8;&#x5206;&#x3002;</p>
<p><img src="../images/ad873273846297c7cf926ed782e42f9d.png" alt=""></p>
<p>&#x540C;&#x7406;&#xFF0C;&#x74F6;&#x9888;&#x5C42;&#x4E5F;&#x662F;&#x7F51;&#x7EDC;&#x4E2D;&#x6700;&#x5C0F;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x7F29;&#x5C0F;&#x7F51;&#x7EDC;&#x8868;&#x793A;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x6269;&#x5927;&#x5B83;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x8FD9;&#x4E2A;&#x8BA1;&#x7B97;&#x6210;&#x672C;&#xFF0C;&#x5E94;&#x7528;1&#xD7;1&#x5377;&#x79EF;&#xFF0C;&#x8FC7;&#x6EE4;&#x5668;&#x4E2A;&#x6570;&#x4E3A;16&#xFF0C;&#x6BCF;&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#x5927;&#x5C0F;&#x4E3A;1&#xD7;1&#xD7;192&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x7EF4;&#x5EA6;&#x76F8;&#x5339;&#x914D;&#xFF08;&#x8F93;&#x5165;&#x901A;&#x9053;&#x6570;&#x4E0E;&#x8FC7;&#x6EE4;&#x5668;&#x901A;&#x9053;&#x6570;&#xFF09;&#xFF0C;28&#xD7;28&#xD7;16&#x8FD9;&#x4E2A;&#x5C42;&#x7684;&#x8BA1;&#x7B97;&#x6210;&#x672C;&#x662F;&#xFF0C;&#x8F93;&#x51FA;28&#xD7;28&#xD7;192&#x4E2D;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x90FD;&#x505A;192&#x6B21;&#x4E58;&#x6CD5;&#xFF0C;&#x7528;1&#xD7;1&#xD7;192&#x6765;&#x8868;&#x793A;&#xFF0C;&#x76F8;&#x4E58;&#x7ED3;&#x679C;&#x7EA6;&#x7B49;&#x4E8E;240&#x4E07;&#x3002;</p>
<p><img src="../images/7d160f6eab22e4b9544b28b44da686a6.png" alt=""></p>
<p>&#x90A3;&#x7B2C;&#x4E8C;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x5462;&#xFF1F;240&#x4E07;&#x53EA;&#x662F;&#x7B2C;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x7684;&#x8BA1;&#x7B97;&#x6210;&#x672C;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x7684;&#x8BA1;&#x7B97;&#x6210;&#x672C;&#x53C8;&#x662F;&#x591A;&#x5C11;&#x5462;&#xFF1F;&#x8FD9;&#x662F;&#x5B83;&#x7684;&#x8F93;&#x51FA;&#xFF0C;28&#xD7;28&#xD7;32&#xFF0C;&#x5BF9;&#x6BCF;&#x4E2A;&#x8F93;&#x51FA;&#x503C;&#x5E94;&#x7528;&#x4E00;&#x4E2A;5&#xD7;5&#xD7;16&#x7EF4;&#x5EA6;&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x4E3A;1000&#x4E07;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x6240;&#x9700;&#x8981;&#x4E58;&#x6CD5;&#x8FD0;&#x7B97;&#x7684;&#x603B;&#x6B21;&#x6570;&#x662F;&#x8FD9;&#x4E24;&#x5C42;&#x7684;&#x8BA1;&#x7B97;&#x6210;&#x672C;&#x4E4B;&#x548C;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;1204&#x4E07;&#xFF0C;&#x4E0E;&#x4E0A;&#x4E00;&#x5F20;&#x5E7B;&#x706F;&#x7247;&#x4E2D;&#x7684;&#x503C;&#x505A;&#x6BD4;&#x8F83;&#xFF0C;&#x8BA1;&#x7B97;&#x6210;&#x672C;&#x4ECE;1.2&#x4EBF;&#x4E0B;&#x964D;&#x5230;&#x4E86;&#x539F;&#x6765;&#x7684;&#x5341;&#x5206;&#x4E4B;&#x4E00;&#xFF0C;&#x5373;1204&#x4E07;&#x3002;&#x6240;&#x9700;&#x8981;&#x7684;&#x52A0;&#x6CD5;&#x8FD0;&#x7B97;&#x4E0E;&#x4E58;&#x6CD5;&#x8FD0;&#x7B97;&#x7684;&#x6B21;&#x6570;&#x8FD1;&#x4F3C;&#x76F8;&#x7B49;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x53EA;&#x7EDF;&#x8BA1;&#x4E86;&#x4E58;&#x6CD5;&#x8FD0;&#x7B97;&#x7684;&#x6B21;&#x6570;&#x3002;</p>
<p>&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5728;&#x6784;&#x5EFA;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5C42;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E0D;&#x60F3;&#x51B3;&#x5B9A;&#x6C60;&#x5316;&#x5C42;&#x662F;&#x4F7F;&#x7528;1&#xD7;1&#xFF0C;3&#xD7;3&#x8FD8;&#x662F;5&#xD7;5&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x90A3;&#x4E48;<strong>Inception</strong>&#x6A21;&#x5757;&#x5C31;&#x662F;&#x6700;&#x597D;&#x7684;&#x9009;&#x62E9;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5E94;&#x7528;&#x5404;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x628A;&#x8F93;&#x51FA;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#x3002;&#x4E4B;&#x540E;&#x6211;&#x4EEC;&#x8BB2;&#x5230;&#x8BA1;&#x7B97;&#x6210;&#x672C;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x5B66;&#x4E60;&#x4E86;&#x5982;&#x4F55;&#x901A;&#x8FC7;&#x4F7F;&#x7528;1&#xD7;1&#x5377;&#x79EF;&#x6765;&#x6784;&#x5EFA;&#x74F6;&#x9888;&#x5C42;&#xFF0C;&#x4ECE;&#x800C;&#x5927;&#x5927;&#x964D;&#x4F4E;&#x8BA1;&#x7B97;&#x6210;&#x672C;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x95EE;&#xFF0C;&#x4EC5;&#x4EC5;&#x5927;&#x5E45;&#x7F29;&#x5C0F;&#x8868;&#x793A;&#x5C42;&#x89C4;&#x6A21;&#x4F1A;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x6027;&#x80FD;&#xFF1F;&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#xFF0C;&#x53EA;&#x8981;&#x5408;&#x7406;&#x6784;&#x5EFA;&#x74F6;&#x9888;&#x5C42;&#xFF0C;&#x4F60;&#x65E2;&#x53EF;&#x4EE5;&#x663E;&#x8457;&#x7F29;&#x5C0F;&#x8868;&#x793A;&#x5C42;&#x89C4;&#x6A21;&#xFF0C;&#x53C8;&#x4E0D;&#x4F1A;&#x964D;&#x4F4E;&#x7F51;&#x7EDC;&#x6027;&#x80FD;&#xFF0C;&#x4ECE;&#x800C;&#x8282;&#x7701;&#x4E86;&#x8BA1;&#x7B97;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;<strong>Inception</strong>&#x6A21;&#x5757;&#x7684;&#x4E3B;&#x8981;&#x601D;&#x60F3;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x8FD9;&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#x3002;&#x4E0B;&#x8282;&#x8BFE;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x6F14;&#x793A;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;<strong>Inception</strong>&#x7F51;&#x7EDC;&#x3002;</p>
<h3 id="27-inception-&#x7F51;&#x7EDC;&#xFF08;inception-network&#xFF09;">2.7 Inception &#x7F51;&#x7EDC;&#xFF08;Inception network&#xFF09;</h3>
<p>&#x5728;&#x4E0A;&#x8282;&#x89C6;&#x9891;&#x4E2D;&#xFF0C;&#x4F60;&#x5DF2;&#x7ECF;&#x89C1;&#x5230;&#x4E86;&#x6240;&#x6709;&#x7684;<strong>Inception</strong>&#x7F51;&#x7EDC;&#x57FA;&#x7840;&#x6A21;&#x5757;&#x3002;&#x5728;&#x672C;&#x89C6;&#x9891;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x5C06;&#x8FD9;&#x4E9B;&#x6A21;&#x5757;&#x7EC4;&#x5408;&#x8D77;&#x6765;&#xFF0C;&#x6784;&#x7B51;&#x4F60;&#x81EA;&#x5DF1;&#x7684;<strong>Inception</strong>&#x7F51;&#x7EDC;&#x3002;</p>
<p><img src="../images/75b55231aa2a969b9db92b8282f653f8.png" alt=""></p>
<p><strong>Inception</strong>&#x6A21;&#x5757;&#x4F1A;&#x5C06;&#x4E4B;&#x524D;&#x5C42;&#x7684;&#x6FC0;&#x6D3B;&#x6216;&#x8005;&#x8F93;&#x51FA;&#x4F5C;&#x4E3A;&#x5B83;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x4F5C;&#x4E3A;&#x524D;&#x63D0;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;28&#xD7;28&#xD7;192&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x548C;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x89C6;&#x9891;&#x4E2D;&#x7684;&#x4E00;&#x6837;&#x3002;&#x6211;&#x4EEC;&#x8BE6;&#x7EC6;&#x5206;&#x6790;&#x8FC7;&#x7684;&#x4F8B;&#x5B50;&#x662F;&#xFF0C;&#x5148;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;1&#xD7;1&#x7684;&#x5C42;&#xFF0C;&#x518D;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;5&#xD7;5&#x7684;&#x5C42;&#xFF0C;1&#xD7;1&#x7684;&#x5C42;&#x53EF;&#x80FD;&#x6709;16&#x4E2A;&#x901A;&#x9053;&#xFF0C;&#x800C;5&#xD7;5&#x7684;&#x5C42;&#x8F93;&#x51FA;&#x4E3A;28&#xD7;28&#xD7;32&#xFF0C;&#x5171;32&#x4E2A;&#x901A;&#x9053;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4E0A;&#x4E2A;&#x89C6;&#x9891;&#x6700;&#x540E;&#x8BB2;&#x5230;&#x7684;&#x6211;&#x4EEC;&#x5904;&#x7406;&#x7684;&#x4F8B;&#x5B50;&#x3002;</p>
<p><img src="../images/f14bd4e49d0b019d6e59eadfb9bcb829.png" alt=""></p>
<p>&#x4E3A;&#x4E86;&#x5728;&#x8FD9;&#x4E2A;3&#xD7;3&#x7684;&#x5377;&#x79EF;&#x5C42;&#x4E2D;&#x8282;&#x7701;&#x8FD0;&#x7B97;&#x91CF;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x505A;&#x76F8;&#x540C;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x8BDD;3&#xD7;3&#x7684;&#x5C42;&#x5C06;&#x4F1A;&#x8F93;&#x51FA;28&#xD7;28&#xD7;128&#x3002;</p>
<p><img src="../images/02778a10ddba7091729ee207686b0773.png" alt=""></p>
<p>&#x6216;&#x8BB8;&#x4F60;&#x8FD8;&#x60F3;&#x5C06;&#x5176;&#x76F4;&#x63A5;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;1&#xD7;1&#x7684;&#x5377;&#x79EF;&#x5C42;&#xFF0C;&#x8FD9;&#x65F6;&#x5C31;&#x4E0D;&#x5FC5;&#x5728;&#x540E;&#x9762;&#x518D;&#x8DDF;&#x4E00;&#x4E2A;1&#xD7;1&#x7684;&#x5C42;&#x4E86;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#x8FC7;&#x7A0B;&#x5C31;&#x53EA;&#x6709;&#x4E00;&#x6B65;&#xFF0C;&#x5047;&#x8BBE;&#x8FD9;&#x4E2A;&#x5C42;&#x7684;&#x8F93;&#x51FA;&#x662F;28&#xD7;28&#xD7;64&#x3002;</p>
<p><img src="../images/5e7e7894e7ecf646d878df6108b5eb7b.png" alt=""></p>
<p>&#x6700;&#x540E;&#x662F;&#x6C60;&#x5316;&#x5C42;&#x3002;</p>
<p><img src="../images/e0a54ae3bb0a99ce45f6f1d524c100d1.png" alt=""></p>
<p>&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x8981;&#x505A;&#x4E9B;&#x6709;&#x8DA3;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4E3A;&#x4E86;&#x80FD;&#x5728;&#x6700;&#x540E;&#x5C06;&#x8FD9;&#x4E9B;&#x8F93;&#x51FA;&#x90FD;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x4F7F;&#x7528;<strong>same</strong>&#x7C7B;&#x578B;&#x7684;<strong>padding</strong>&#x6765;&#x6C60;&#x5316;&#xFF0C;&#x4F7F;&#x5F97;&#x8F93;&#x51FA;&#x7684;&#x9AD8;&#x548C;&#x5BBD;&#x4F9D;&#x7136;&#x662F;28&#xD7;28&#xFF0C;&#x8FD9;&#x6837;&#x624D;&#x80FD;&#x5C06;&#x5B83;&#x4E0E;&#x5176;&#x4ED6;&#x8F93;&#x51FA;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#x3002;&#x4F46;&#x6CE8;&#x610F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8FDB;&#x884C;&#x4E86;&#x6700;&#x5927;&#x6C60;&#x5316;&#xFF0C;&#x5373;&#x4FBF;&#x7528;&#x4E86;<strong>same padding</strong>&#xFF0C;3&#xD7;3&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;<strong>stride</strong>&#x4E3A;1&#xFF0C;&#x5176;&#x8F93;&#x51FA;&#x5C06;&#x4F1A;&#x662F;28&#xD7;28&#xD7;192&#xFF0C;&#x5176;&#x901A;&#x9053;&#x6570;&#x6216;&#x8005;&#x8BF4;&#x6DF1;&#x5EA6;&#x4E0E;&#x8FD9;&#x91CC;&#x7684;&#x8F93;&#x5165;&#xFF08;&#x901A;&#x9053;&#x6570;&#xFF09;&#x76F8;&#x540C;&#x3002;&#x6240;&#x4EE5;&#x770B;&#x8D77;&#x6765;&#x5B83;&#x4F1A;&#x6709;&#x5F88;&#x591A;&#x901A;&#x9053;&#xFF0C;&#x6211;&#x4EEC;&#x5B9E;&#x9645;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x518D;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;1&#xD7;1&#x7684;&#x5377;&#x79EF;&#x5C42;&#xFF0C;&#x53BB;&#x8FDB;&#x884C;&#x6211;&#x4EEC;&#x5728;1&#xD7;1&#x5377;&#x79EF;&#x5C42;&#x7684;&#x89C6;&#x9891;&#x91CC;&#x6240;&#x4ECB;&#x7ECD;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x5C06;&#x901A;&#x9053;&#x7684;&#x6570;&#x91CF;&#x7F29;&#x5C0F;&#xFF0C;&#x7F29;&#x5C0F;&#x5230;28&#xD7;28&#xD7;32&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x4F7F;&#x7528;32&#x4E2A;&#x7EF4;&#x5EA6;&#x4E3A;1&#xD7;1&#xD7;192&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x6240;&#x4EE5;&#x8F93;&#x51FA;&#x7684;&#x7EF4;&#x5EA6;&#x5176;&#x901A;&#x9053;&#x6570;&#x7F29;&#x5C0F;&#x4E3A;32&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x907F;&#x514D;&#x4E86;&#x6700;&#x540E;&#x8F93;&#x51FA;&#x65F6;&#xFF0C;&#x6C60;&#x5316;&#x5C42;&#x5360;&#x636E;&#x6240;&#x6709;&#x7684;&#x901A;&#x9053;&#x3002;</p>
<p><img src="../images/16a042a0f2d3866909533d409ff2ce3b.png" alt=""></p>
<p>&#x6700;&#x540E;&#xFF0C;&#x5C06;&#x8FD9;&#x4E9B;&#x65B9;&#x5757;&#x5168;&#x90FD;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#x3002;&#x5728;&#x8FD9;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x628A;&#x5F97;&#x5230;&#x7684;&#x5404;&#x4E2A;&#x5C42;&#x7684;&#x901A;&#x9053;&#x90FD;&#x52A0;&#x8D77;&#x6765;&#xFF0C;&#x6700;&#x540E;&#x5F97;&#x5230;&#x4E00;&#x4E2A;28&#xD7;28&#xD7;256&#x7684;&#x8F93;&#x51FA;&#x3002;&#x901A;&#x9053;&#x8FDE;&#x63A5;&#x5B9E;&#x9645;&#x5C31;&#x662F;&#x4E4B;&#x524D;&#x89C6;&#x9891;&#x4E2D;&#x770B;&#x5230;&#x8FC7;&#x7684;&#xFF0C;&#x628A;&#x6240;&#x6709;&#x65B9;&#x5757;&#x8FDE;&#x63A5;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x4E00;&#x4E2A;<strong>Inception</strong>&#x6A21;&#x5757;&#xFF0C;&#x800C;<strong>Inception</strong>&#x7F51;&#x7EDC;&#x6240;&#x505A;&#x7684;&#x5C31;&#x662F;&#x5C06;&#x8FD9;&#x4E9B;&#x6A21;&#x5757;&#x90FD;&#x7EC4;&#x5408;&#x5230;&#x4E00;&#x8D77;&#x3002;</p>
<p><img src="../images/1f2a024a28f664aa704be53cea7ca6f8.png" alt=""></p>
<p>&#x8FD9;&#x662F;&#x4E00;&#x5F20;&#x53D6;&#x81EA;<strong>Szegety et al</strong>&#x7684;&#x8BBA;&#x6587;&#x4E2D;&#x5173;&#x4E8E;<strong>Inception</strong>&#x7F51;&#x7EDC;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x56FE;&#x4E2D;&#x6709;&#x8BB8;&#x591A;&#x91CD;&#x590D;&#x7684;&#x6A21;&#x5757;&#xFF0C;&#x53EF;&#x80FD;&#x6574;&#x5F20;&#x56FE;&#x770B;&#x4E0A;&#x53BB;&#x5F88;&#x590D;&#x6742;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x4F60;&#x53EA;&#x622A;&#x53D6;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x73AF;&#x8282;&#xFF08;&#x7F16;&#x53F7;1&#xFF09;&#xFF0C;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;&#x8FD9;&#x662F;&#x5728;&#x524D;&#x4E00;&#x9875;<strong>ppt</strong>&#x4E2D;&#x6240;&#x89C1;&#x7684;<strong>Inception</strong>&#x6A21;&#x5757;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6DF1;&#x5165;&#x770B;&#x770B;&#x91CC;&#x8FB9;&#x7684;&#x4E00;&#x4E9B;&#x7EC6;&#x8282;&#xFF0C;&#x8FD9;&#x662F;&#x53E6;&#x4E00;&#x4E2A;<strong>Inception</strong>&#x6A21;&#x5757;&#xFF08;&#x7F16;&#x53F7;2&#xFF09;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;<strong>Inception</strong>&#x6A21;&#x5757;&#xFF08;&#x7F16;&#x53F7;3&#xFF09;&#x3002;&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x6700;&#x5927;&#x6C60;&#x5316;&#x5C42;&#xFF08;&#x7F16;&#x53F7;6&#xFF09;&#x6765;&#x4FEE;&#x6539;&#x9AD8;&#x548C;&#x5BBD;&#x7684;&#x7EF4;&#x5EA6;&#x3002;&#x8FD9;&#x662F;&#x53E6;&#x5916;&#x4E00;&#x4E2A;<strong>Inception</strong>&#x6A21;&#x5757;&#xFF08;&#x7F16;&#x53F7;4&#xFF09;&#xFF0C;&#x8FD9;&#x662F;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x6700;&#x5927;&#x6C60;&#x5316;&#x5C42;&#xFF08;&#x7F16;&#x53F7;7&#xFF09;&#xFF0C;&#x5B83;&#x6539;&#x53D8;&#x4E86;&#x9AD8;&#x548C;&#x5BBD;&#x3002;&#x800C;&#x8FD9;&#x91CC;&#x53C8;&#x662F;&#x53E6;&#x4E00;&#x4E2A;<strong>Inception</strong>&#x6A21;&#x5757;&#xFF08;&#x7F16;&#x53F7;5&#xFF09;&#x3002;</p>
<p>&#x6240;&#x4EE5;<strong>Inception</strong>&#x7F51;&#x7EDC;&#x53EA;&#x662F;&#x5F88;&#x591A;&#x8FD9;&#x4E9B;&#x4F60;&#x5B66;&#x8FC7;&#x7684;&#x6A21;&#x5757;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x4F4D;&#x7F6E;&#x91CD;&#x590D;&#x7EC4;&#x6210;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x4F60;&#x7406;&#x89E3;&#x4E86;&#x4E4B;&#x524D;&#x6240;&#x5B66;&#x7684;<strong>Inception</strong>&#x6A21;&#x5757;&#xFF0C;&#x4F60;&#x5C31;&#x4E5F;&#x80FD;&#x7406;&#x89E3;<strong>Inception</strong>&#x7F51;&#x7EDC;&#x3002;</p>
<p><img src="../images/5315d2dbcc3053b0146cabd79304ef1d.png" alt=""></p>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8BFB;&#x8FC7;&#x8BBA;&#x6587;&#x7684;&#x539F;&#x6587;&#xFF0C;&#x4F60;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x8FD9;&#x91CC;&#x5176;&#x5B9E;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x5206;&#x652F;&#xFF0C;&#x6211;&#x73B0;&#x5728;&#x628A;&#x5B83;&#x4EEC;&#x52A0;&#x4E0A;&#x53BB;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x4E9B;&#x5206;&#x652F;&#x6709;&#x4EC0;&#x4E48;&#x7528;&#x5462;&#xFF1F;&#x5728;&#x7F51;&#x7EDC;&#x7684;&#x6700;&#x540E;&#x51E0;&#x5C42;&#xFF0C;&#x901A;&#x5E38;&#x79F0;&#x4E3A;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#xFF0C;&#x5728;&#x5B83;&#x4E4B;&#x540E;&#x662F;&#x4E00;&#x4E2A;<strong>softmax</strong>&#x5C42;&#xFF08;&#x7F16;&#x53F7;1&#xFF09;&#x6765;&#x505A;&#x51FA;&#x9884;&#x6D4B;&#xFF0C;&#x8FD9;&#x4E9B;&#x5206;&#x652F;&#xFF08;&#x7F16;&#x53F7;2&#xFF09;&#x6240;&#x505A;&#x7684;&#x5C31;&#x662F;&#x901A;&#x8FC7;&#x9690;&#x85CF;&#x5C42;&#xFF08;&#x7F16;&#x53F7;3&#xFF09;&#x6765;&#x505A;&#x51FA;&#x9884;&#x6D4B;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x5176;&#x5B9E;&#x662F;&#x4E00;&#x4E2A;<strong>softmax</strong>&#x8F93;&#x51FA;&#xFF08;&#x7F16;&#x53F7;2&#xFF09;&#xFF0C;&#x8FD9;&#xFF08;&#x7F16;&#x53F7;1&#xFF09;&#x4E5F;&#x662F;&#x3002;&#x8FD9;&#x662F;&#x53E6;&#x4E00;&#x6761;&#x5206;&#x652F;&#xFF08;&#x7F16;&#x53F7;4&#xFF09;&#xFF0C;&#x5B83;&#x4E5F;&#x5305;&#x542B;&#x4E86;&#x4E00;&#x4E2A;&#x9690;&#x85CF;&#x5C42;&#xFF0C;&#x901A;&#x8FC7;&#x4E00;&#x4E9B;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#xFF0C;&#x7136;&#x540E;&#x6709;&#x4E00;&#x4E2A;<strong>softmax</strong>&#x6765;&#x9884;&#x6D4B;&#xFF0C;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x7684;&#x6807;&#x7B7E;&#x3002;</p>
<p>&#x4F60;&#x5E94;&#x8BE5;&#x628A;&#x5B83;&#x770B;&#x505A;<strong>Inception</strong>&#x7F51;&#x7EDC;&#x7684;&#x4E00;&#x4E2A;&#x7EC6;&#x8282;&#xFF0C;&#x5B83;&#x786E;&#x4FDD;&#x4E86;&#x5373;&#x4FBF;&#x662F;&#x9690;&#x85CF;&#x5355;&#x5143;&#x548C;&#x4E2D;&#x95F4;&#x5C42;&#xFF08;&#x7F16;&#x53F7;5&#xFF09;&#x4E5F;&#x53C2;&#x4E0E;&#x4E86;&#x7279;&#x5F81;&#x8BA1;&#x7B97;&#xFF0C;&#x5B83;&#x4EEC;&#x4E5F;&#x80FD;&#x9884;&#x6D4B;&#x56FE;&#x7247;&#x7684;&#x5206;&#x7C7B;&#x3002;&#x5B83;&#x5728;<strong>Inception</strong>&#x7F51;&#x7EDC;&#x4E2D;&#xFF0C;&#x8D77;&#x5230;&#x4E00;&#x79CD;&#x8C03;&#x6574;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x5E76;&#x4E14;&#x80FD;&#x9632;&#x6B62;&#x7F51;&#x7EDC;&#x53D1;&#x751F;&#x8FC7;&#x62DF;&#x5408;&#x3002;</p>
<p>&#x8FD8;&#x6709;&#x8FD9;&#x4E2A;&#x7279;&#x522B;&#x7684;<strong>Inception</strong>&#x7F51;&#x7EDC;&#x662F;&#x7531;<strong>Google</strong>&#x516C;&#x53F8;&#x7684;&#x4F5C;&#x8005;&#x6240;&#x7814;&#x53D1;&#x7684;&#xFF0C;&#x5B83;&#x88AB;&#x53EB;&#x505A;<strong>GoogleLeNet</strong>&#xFF0C;&#x8FD9;&#x4E2A;&#x540D;&#x5B57;&#x662F;&#x4E3A;&#x4E86;&#x5411;<strong>LeNet</strong>&#x7F51;&#x7EDC;&#x81F4;&#x656C;&#x3002;&#x5728;&#x4E4B;&#x524D;&#x7684;&#x89C6;&#x9891;&#x4E2D;&#x4F60;&#x5E94;&#x8BE5;&#x4E86;&#x89E3;&#x4E86;<strong>LeNet</strong>&#x7F51;&#x7EDC;&#x3002;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x6837;&#x975E;&#x5E38;&#x597D;&#xFF0C;&#x56E0;&#x4E3A;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x662F;&#x5982;&#x6B64;&#x91CD;&#x89C6;&#x534F;&#x4F5C;&#xFF0C;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x5DE5;&#x4F5C;&#x8005;&#x5BF9;&#x5F7C;&#x6B64;&#x7684;&#x5DE5;&#x4F5C;&#x6210;&#x679C;&#x6709;&#x4E00;&#x79CD;&#x5F3A;&#x70C8;&#x7684;&#x656C;&#x610F;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x6709;&#x4E2A;&#x6709;&#x8DA3;&#x7684;&#x4E8B;&#x5B9E;&#xFF0C;<strong>Inception</strong>&#x7F51;&#x7EDC;&#x8FD9;&#x4E2A;&#x540D;&#x5B57;&#x53C8;&#x662F;&#x7F18;&#x4F55;&#x800C;&#x6765;&#x5462;&#xFF1F;<strong>Inception</strong>&#x7684;&#x8BBA;&#x6587;&#x7279;&#x5730;&#x63D0;&#x5230;&#x4E86;&#x8FD9;&#x4E2A;&#x6A21;&#x56E0;&#xFF08;<strong>meme</strong>&#xFF0C;&#x7F51;&#x7EDC;&#x7528;&#x8BED;&#x5373;&#x201C;&#x6897;&#x201D;&#xFF09;&#xFF0C;&#x5C31;&#x662F;&#x201C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x8D70;&#x7684;&#x66F4;&#x6DF1;&#x201D;&#xFF08;<strong>We need to go deeper</strong>&#xFF09;&#xFF0C;&#x8BBA;&#x6587;&#x8FD8;&#x5F15;&#x7528;&#x4E86;&#x8FD9;&#x4E2A;&#x7F51;&#x5740;&#xFF08;<a href="http://knowyourmeme.com/memes/we-need-to-go-deeper" target="_blank">http://knowyourmeme.com/memes/we-need-to-go-deeper</a>&#xFF09;&#xFF0C;&#x8FDE;&#x63A5;&#x5230;&#x8FD9;&#x5E45;&#x56FE;&#x7247;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x770B;&#x8FC7;<strong>Inception</strong>&#xFF08;<strong>&#x76D7;&#x68A6;&#x7A7A;&#x95F4;</strong>&#xFF09;&#x8FD9;&#x4E2A;&#x7535;&#x5F71;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x80FD;&#x770B;&#x61C2;&#x8FD9;&#x4E2A;&#x7531;&#x6765;&#x3002;&#x4F5C;&#x8005;&#x5176;&#x5B9E;&#x662F;&#x901A;&#x8FC7;&#x5B83;&#x6765;&#x8868;&#x660E;&#x4E86;&#x5EFA;&#x7ACB;&#x66F4;&#x6DF1;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x51B3;&#x5FC3;&#xFF0C;&#x4ED6;&#x4EEC;&#x6B63;&#x662F;&#x8FD9;&#x6837;&#x6784;&#x5EFA;&#x4E86;<strong>Inception</strong>&#x3002;&#x6211;&#x60F3;&#x4E00;&#x822C;&#x7814;&#x7A76;&#x8BBA;&#x6587;&#xFF0C;&#x901A;&#x5E38;&#x4E0D;&#x4F1A;&#x5F15;&#x7528;&#x7F51;&#x7EDC;&#x6D41;&#x884C;&#x6A21;&#x56E0;&#xFF08;&#x6897;&#xFF09;&#xFF0C;&#x4F46;&#x8FD9;&#x91CC;&#x663E;&#x7136;&#x5F88;&#x5408;&#x9002;&#x3002;</p>
<p><img src="../images/50125f732e2cac3d80d8b5bb33a9026c.png" alt=""></p>
<p>&#x6700;&#x540E;&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7406;&#x89E3;&#x4E86;<strong>Inception</strong>&#x6A21;&#x5757;&#xFF0C;&#x4F60;&#x5C31;&#x80FD;&#x7406;&#x89E3;<strong>Inception</strong>&#x7F51;&#x7EDC;&#xFF0C;&#x65E0;&#x975E;&#x662F;&#x5F88;&#x591A;&#x4E2A;<strong>Inception</strong>&#x6A21;&#x5757;&#x4E00;&#x73AF;&#x63A5;&#x4E00;&#x73AF;&#xFF0C;&#x6700;&#x540E;&#x7EC4;&#x6210;&#x4E86;&#x7F51;&#x7EDC;&#x3002;&#x81EA;&#x4ECE;<strong>Inception</strong>&#x6A21;&#x5757;&#x8BDE;&#x751F;&#x4EE5;&#x6765;&#xFF0C;&#x7ECF;&#x8FC7;&#x7814;&#x7A76;&#x8005;&#x4EEC;&#x7684;&#x4E0D;&#x65AD;&#x53D1;&#x5C55;&#xFF0C;&#x884D;&#x751F;&#x4E86;&#x8BB8;&#x591A;&#x65B0;&#x7684;&#x7248;&#x672C;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x4F60;&#x4EEC;&#x770B;&#x4E00;&#x4E9B;&#x6BD4;&#x8F83;&#x65B0;&#x7684;<strong>Inception</strong>&#x7B97;&#x6CD5;&#x7684;&#x8BBA;&#x6587;&#x65F6;&#xFF0C;&#x4F1A;&#x53D1;&#x73B0;&#x4EBA;&#x4EEC;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x65B0;&#x7248;&#x672C;&#x7684;&#x7B97;&#x6CD5;&#x6548;&#x679C;&#x4E5F;&#x4E00;&#x6837;&#x5F88;&#x597D;&#xFF0C;&#x6BD4;&#x5982;<strong>Inception V2</strong>&#x3001;<strong>V3</strong>&#x4EE5;&#x53CA;<strong>V4</strong>&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#x5F15;&#x5165;&#x4E86;&#x8DF3;&#x8DC3;&#x8FDE;&#x63A5;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x6709;&#x65F6;&#x4E5F;&#x4F1A;&#x6709;&#x7279;&#x522B;&#x597D;&#x7684;&#x6548;&#x679C;&#x3002;&#x4F46;&#x6240;&#x6709;&#x7684;&#x8FD9;&#x4E9B;&#x53D8;&#x4F53;&#x90FD;&#x5EFA;&#x7ACB;&#x5728;&#x540C;&#x4E00;&#x79CD;&#x57FA;&#x7840;&#x7684;&#x601D;&#x60F3;&#x4E0A;&#xFF0C;&#x5728;&#x4E4B;&#x524D;&#x7684;&#x89C6;&#x9891;&#x4E2D;&#x4F60;&#x5C31;&#x5DF2;&#x7ECF;&#x5B66;&#x5230;&#x8FC7;&#xFF0C;&#x5C31;&#x662F;&#x628A;&#x8BB8;&#x591A;<strong>Inception</strong>&#x6A21;&#x5757;&#x901A;&#x8FC7;&#x67D0;&#x79CD;&#x65B9;&#x5F0F;&#x8FDE;&#x63A5;&#x5230;&#x4E00;&#x8D77;&#x3002;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x89C6;&#x9891;&#xFF0C;&#x6211;&#x60F3;&#x4F60;&#x5E94;&#x8BE5;&#x80FD;&#x53BB;&#x9605;&#x8BFB;&#x548C;&#x7406;&#x89E3;&#x8FD9;&#x4E9B;<strong>Inception</strong>&#x7684;&#x8BBA;&#x6587;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x4E00;&#x4E9B;&#x65B0;&#x7248;&#x672C;&#x7684;&#x8BBA;&#x6587;&#x3002;</p>
<p>&#x76F4;&#x5230;&#x73B0;&#x5728;&#xFF0C;&#x4F60;&#x5DF2;&#x7ECF;&#x4E86;&#x89E3;&#x4E86;&#x8BB8;&#x591A;&#x4E13;&#x7528;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7ED3;&#x6784;&#x3002;&#x5728;&#x4E0B;&#x8282;&#x89C6;&#x9891;&#x4E2D;&#xFF0C;&#x6211;&#x5C06;&#x4F1A;&#x544A;&#x8BC9;&#x4F60;&#x4EEC;&#x5982;&#x4F55;&#x771F;&#x6B63;&#x53BB;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x7B97;&#x6CD5;&#x6765;&#x6784;&#x5EFA;&#x81EA;&#x5DF1;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x7CFB;&#x7EDF;&#xFF0C;&#x6211;&#x4EEC;&#x4E0B;&#x8282;&#x89C6;&#x9891;&#x518D;&#x89C1;&#x3002;</p>
<h3 id="28-&#x4F7F;&#x7528;&#x5F00;&#x6E90;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x6848;&#xFF08;using-open-source-implementations&#xFF09;">2.8 &#x4F7F;&#x7528;&#x5F00;&#x6E90;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x6848;&#xFF08;Using open-source implementations&#xFF09;</h3>
<p>&#x4F60;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x5B66;&#x8FC7;&#x51E0;&#x4E2A;&#x975E;&#x5E38;&#x6709;&#x6548;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x548C;<strong>ConvNet</strong>&#x67B6;&#x6784;&#xFF0C;&#x5728;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x51E0;&#x6BB5;&#x89C6;&#x9891;&#x4E2D;&#x6211;&#x60F3;&#x4E0E;&#x4F60;&#x5206;&#x4EAB;&#x51E0;&#x6761;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x7684;&#x5B9E;&#x7528;&#x6027;&#x5EFA;&#x8BAE;&#xFF0C;&#x9996;&#x5148;&#x4ECE;&#x4F7F;&#x7528;&#x5F00;&#x653E;&#x6E90;&#x7801;&#x7684;&#x5B9E;&#x73B0;&#x5F00;&#x59CB;&#x3002;</p>
<p>&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#x5F88;&#x591A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x590D;&#x6742;&#x7EC6;&#x81F4;&#xFF0C;&#x56E0;&#x800C;&#x96BE;&#x4EE5;&#x590D;&#x5236;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x4E9B;&#x53C2;&#x6570;&#x8C03;&#x6574;&#x7684;&#x7EC6;&#x8282;&#x95EE;&#x9898;&#xFF0C;&#x4F8B;&#x5982;&#x5B66;&#x4E60;&#x7387;&#x8870;&#x51CF;&#x7B49;&#x7B49;&#xFF0C;&#x4F1A;&#x5F71;&#x54CD;&#x6027;&#x80FD;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x53D1;&#x73B0;&#x6709;&#x4E9B;&#x65F6;&#x5019;&#xFF0C;&#x751A;&#x81F3;&#x5728;&#x9876;&#x5C16;&#x5927;&#x5B66;&#x5B66;&#x4E60;AI&#x6216;&#x8005;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x535A;&#x58EB;&#x751F;&#x4E5F;&#x5F88;&#x96BE;&#x901A;&#x8FC7;&#x9605;&#x8BFB;&#x522B;&#x4EBA;&#x7684;&#x7814;&#x7A76;&#x8BBA;&#x6587;&#x6765;&#x590D;&#x5236;&#x4ED6;&#x4EBA;&#x7684;&#x6210;&#x679C;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#x6709;&#x5F88;&#x591A;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x7814;&#x7A76;&#x8005;&#x90FD;&#x4E60;&#x60EF;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x6210;&#x679C;&#x4F5C;&#x4E3A;&#x5F00;&#x53D1;&#x8D44;&#x6E90;&#xFF0C;&#x653E;&#x5728;&#x50CF;<strong>GitHub</strong>&#x4E4B;&#x7C7B;&#x7684;&#x7F51;&#x7AD9;&#x4E0A;&#x3002;&#x5F53;&#x4F60;&#x81EA;&#x5DF1;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x6211;&#x9F13;&#x52B1;&#x4F60;&#x8003;&#x8651;&#x4E00;&#x4E0B;&#x5C06;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x8D21;&#x732E;&#x7ED9;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x3002;&#x5982;&#x679C;&#x4F60;&#x770B;&#x5230;&#x4E00;&#x7BC7;&#x7814;&#x7A76;&#x8BBA;&#x6587;&#x60F3;&#x5E94;&#x7528;&#x5B83;&#x7684;&#x6210;&#x679C;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x8003;&#x8651;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;&#xFF0C;&#x6211;&#x7ECF;&#x5E38;&#x505A;&#x7684;&#x5C31;&#x662F;&#x5728;&#x7F51;&#x7EDC;&#x4E0A;&#x5BFB;&#x627E;&#x4E00;&#x4E2A;&#x5F00;&#x6E90;&#x7684;&#x5B9E;&#x73B0;&#x3002;&#x56E0;&#x4E3A;&#x4F60;&#x5982;&#x679C;&#x80FD;&#x5F97;&#x5230;&#x4F5C;&#x8005;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x901A;&#x5E38;&#x8981;&#x6BD4;&#x4F60;&#x4ECE;&#x5934;&#x5F00;&#x59CB;&#x5B9E;&#x73B0;&#x8981;&#x5FEB;&#x5F97;&#x591A;&#xFF0C;&#x867D;&#x7136;&#x4ECE;&#x96F6;&#x5F00;&#x59CB;&#x5B9E;&#x73B0;&#x80AF;&#x5B9A;&#x53EF;&#x4EE5;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x953B;&#x70BC;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x5DF2;&#x7ECF;&#x719F;&#x6089;&#x5982;&#x4F55;&#x4F7F;&#x7528;<strong>GitHub</strong>&#xFF0C;&#x8FD9;&#x6BB5;&#x89C6;&#x9891;&#x5BF9;&#x4F60;&#x6765;&#x8BF4;&#x53EF;&#x80FD;&#x6CA1;&#x4EC0;&#x4E48;&#x5FC5;&#x8981;&#x6216;&#x8005;&#x6CA1;&#x90A3;&#x4E48;&#x91CD;&#x8981;&#x3002;&#x4F46;&#x662F;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x4E60;&#x60EF;&#x4ECE;<strong>GitHub</strong>&#x4E0B;&#x8F7D;&#x5F00;&#x6E90;&#x4EE3;&#x7801;&#xFF0C;&#x8BA9;&#x6211;&#x6765;&#x6F14;&#x793A;&#x4E00;&#x4E0B;&#x3002;</p>
<p>&#xFF08;&#x6574;&#x7406;&#x8005;&#x6CE8;&#xFF1A;<strong>ResNets</strong>&#x5B9E;&#x73B0;&#x7684;<strong>GitHub</strong>&#x5730;&#x5740;<a href="https://github.com/KaimingHe/deep-residual-networks" target="_blank">https://github.com/KaimingHe/deep-residual-networks</a>&#xFF09;</p>
<p><img src="../images/07e7bff2d57987e09f35609928ab2f1e.png" alt=""></p>
<p>&#x5047;&#x8BBE;&#x4F60;&#x5BF9;&#x6B8B;&#x5DEE;&#x7F51;&#x7EDC;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x90A3;&#x5C31;&#x8BA9;&#x6211;&#x4EEC;&#x641C;&#x7D22;<strong>GitHub</strong>&#x4E0A;&#x7684;<strong>ResNets</strong>&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x53EF;&#x4EE5;&#x5728;<strong>GitHub</strong>&#x770B;&#x5230;&#x5F88;&#x591A;&#x4E0D;&#x540C;&#x7684;ResNet&#x7684;&#x5B9E;&#x73B0;&#x3002;&#x6211;&#x5C31;&#x6253;&#x5F00;&#x8FD9;&#x91CC;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x7F51;&#x5740;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;<strong>ResNets</strong>&#x5B9E;&#x73B0;&#x7684;<strong>GitHub</strong>&#x8D44;&#x6E90;&#x5E93;&#x3002;&#x5728;&#x5F88;&#x591A;<strong>GitHub</strong>&#x7684;&#x7F51;&#x9875;&#x4E0A;&#x5F80;&#x4E0B;&#x7FFB;&#xFF0C;&#x4F60;&#x4F1A;&#x770B;&#x5230;&#x4E00;&#x4E9B;&#x63CF;&#x8FF0;&#xFF0C;&#x8FD9;&#x4E2A;&#x5B9E;&#x73B0;&#x7684;&#x6587;&#x5B57;&#x8BF4;&#x660E;&#x3002;&#x8FD9;&#x4E2A;<strong>GitHub</strong>&#x8D44;&#x6E90;&#x5E93;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x7531;<strong>ResNet</strong>&#x8BBA;&#x6587;&#x539F;&#x4F5C;&#x8005;&#x4E0A;&#x4F20;&#x7684;&#x3002;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#xFF0C;&#x8FD9;&#x91CC;&#x6709;&#x9EBB;&#x7701;&#x7406;&#x5DE5;&#x5B66;&#x9662;&#x7684;&#x8BB8;&#x53EF;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x70B9;&#x51FB;&#x67E5;&#x770B;&#x6B64;&#x8BB8;&#x53EF;&#x7684;&#x542B;&#x4E49;&#xFF0C;<strong>MIT</strong>&#x8BB8;&#x53EF;&#x662F;&#x6BD4;&#x8F83;&#x5F00;&#x653E;&#x7684;&#x5F00;&#x6E90;&#x8BB8;&#x53EF;&#x4E4B;&#x4E00;&#x3002;&#x6211;&#x5C06;&#x4E0B;&#x8F7D;&#x4EE3;&#x7801;&#xFF0C;&#x70B9;&#x51FB;&#x8FD9;&#x91CC;&#x7684;&#x94FE;&#x63A5;&#xFF0C;&#x5B83;&#x4F1A;&#x7ED9;&#x4F60;&#x4E00;&#x4E2A;<strong>URL</strong>&#xFF0C;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x4F60;&#x53EF;&#x4EE5;&#x4E0B;&#x8F7D;&#x8FD9;&#x4E2A;&#x4EE3;&#x7801;&#x3002;</p>
<p><img src="../images/ae18beb80a7e47765f97fb51e3a0caf3.png" alt=""></p>
<p>&#x6211;&#x70B9;&#x51FB;&#x8FD9;&#x91CC;&#x7684;&#x6309;&#x94AE;&#xFF08;<strong>Clone or download</strong>&#xFF09;&#xFF0C;&#x5C06;&#x8FD9;&#x4E2A;<strong>URL</strong>&#x590D;&#x5236;&#x5230;&#x6211;&#x7684;&#x526A;&#x5207;&#x677F;&#x91CC;&#x3002;</p>
<p><img src="../images/aff8fec987aec0390d760e3a956649e4.png" alt=""></p>
<p>&#xFF08;&#x6574;&#x7406;&#x8005;&#x6CE8;&#xFF1A;<strong>NG</strong>&#x6B64;&#x5904;&#x4F7F;&#x7528;&#x7684;&#x662F;<strong>linux</strong>&#x7CFB;&#x7EDF;&#x7684;<strong>bash</strong>&#x547D;&#x4EE4;&#x884C;&#xFF0C;&#x5BF9;&#x4E8E;<strong>win10</strong>&#x7CFB;&#x7EDF;&#xFF0C;&#x53EF;&#x4EE5;&#x5F00;&#x542F;<strong>linux</strong>&#x5B50;&#x7CFB;&#x7EDF;&#x529F;&#x80FD;&#xFF0C;&#x7136;&#x540E;&#x5728;<strong>win10</strong>&#x5E94;&#x7528;&#x5546;&#x5E97;&#x4E0B;&#x8F7D;<strong>ubuntu</strong>&#x5B89;&#x88C5;&#xFF0C;&#x8FD0;&#x884C;<strong>CMD</strong>&#xFF0C;&#x8F93;&#x5165;&#x547D;&#x4EE4;<strong>bash</strong>&#x5373;&#x53EF;&#x8FDB;&#x5165;<strong>linux</strong>&#x7684;<strong>bash</strong>&#x547D;&#x4EE4;&#x884C;&#xFF09;</p>
<p><img src="../images/1a35107490859ee66487ace54af44fb9.png" alt=""></p>
<p>&#x63A5;&#x7740;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x4F60;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x8F93;&#x5165;<strong>git clone</strong>&#xFF0C;&#x63A5;&#x7740;&#x7C98;&#x8D34;<strong>URL</strong>&#xFF0C;&#x6309;&#x4E0B;&#x56DE;&#x8F66;&#xFF0C;&#x51E0;&#x79D2;&#x4E4B;&#x5185;&#x5C31;&#x5C06;&#x8FD9;&#x4E2A;&#x8D44;&#x6E90;&#x5E93;&#x7684;&#x526F;&#x672C;&#x4E0B;&#x8F7D;&#x5230;&#x6211;&#x7684;&#x672C;&#x5730;&#x786C;&#x76D8;&#x91CC;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x8FDB;&#x5165;&#x76EE;&#x5F55;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x4E00;&#x4E0B;&#xFF0C;&#x6BD4;&#x8D77;<strong>Windows</strong>&#xFF0C;&#x6211;&#x66F4;&#x4E60;&#x60EF;&#x7528;<strong>Mac</strong>&#xFF0C;&#x4E0D;&#x8FC7;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x8BD5;&#x4E00;&#x4E0B;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x8FDB;&#x5165;<strong>prototxt</strong>&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x8FD9;&#x5C31;&#x662F;&#x5B58;&#x653E;&#x8FD9;&#x4E9B;&#x7F51;&#x7EDC;&#x6587;&#x4EF6;&#x7684;&#x5730;&#x65B9;&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x3002;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x5F88;&#x957F;&#xFF0C;&#x5305;&#x542B;&#x4E86;<strong>ResNet</strong>&#x91CC;101&#x5C42;&#x7684;&#x8BE6;&#x7EC6;&#x914D;&#x7F6E;&#x3002;&#x6211;&#x8BB0;&#x5F97;&#xFF0C;&#x4ECE;&#x8FD9;&#x4E2A;&#x7F51;&#x9875;&#x4E0A;&#x770B;&#x5230;&#x8FD9;&#x4E2A;&#x7279;&#x6B8A;&#x5B9E;&#x73B0;&#x4F7F;&#x7528;&#x4E86;<strong>Caffe</strong>&#x6846;&#x67B6;&#x3002;&#x4F46;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x901A;&#x8FC7;&#x5176;&#x5B83;&#x7F16;&#x7A0B;&#x6846;&#x67B6;&#x6765;&#x5B9E;&#x73B0;&#x8FD9;&#x4E00;&#x4EE3;&#x7801;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x5BFB;&#x627E;&#x4E00;&#x4E0B;&#x3002;</p>
<p><img src="../images/5bf9647890cd27e98be91a43509e59bf.png" alt=""></p>
<p><img src="../images/5e50b9408dee3cb785e02fcd31ff6ee5.png" alt=""></p>
<p><img src="../images/76d2f6cc4c350b44cbbc9e01fb125f69.png" alt=""></p>
<p><img src="../images/d5759a8b1879ccb1a1caaf35345e885f.png" alt=""></p>
<p>&#x5982;&#x679C;&#x4F60;&#x5728;&#x5F00;&#x53D1;&#x4E00;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x5E94;&#x7528;&#xFF0C;&#x4E00;&#x4E2A;&#x5E38;&#x89C1;&#x7684;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#x662F;&#xFF0C;&#x5148;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x4F60;&#x559C;&#x6B22;&#x7684;&#x67B6;&#x6784;&#xFF0C;&#x6216;&#x8BB8;&#x662F;&#x4F60;&#x5728;&#x8FD9;&#x95E8;&#x8BFE;&#x4E2D;&#x5B66;&#x4E60;&#x5230;&#x7684;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x4F60;&#x4ECE;&#x670B;&#x53CB;&#x90A3;&#x542C;&#x8BF4;&#x7684;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x4ECE;&#x6587;&#x732E;&#x4E2D;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x63A5;&#x7740;&#x5BFB;&#x627E;&#x4E00;&#x4E2A;&#x5F00;&#x6E90;&#x5B9E;&#x73B0;&#xFF0C;&#x4ECE;<strong>GitHub</strong>&#x4E0B;&#x8F7D;&#x4E0B;&#x6765;&#xFF0C;&#x4EE5;&#x6B64;&#x57FA;&#x7840;&#x5F00;&#x59CB;&#x6784;&#x5EFA;&#x3002;&#x8FD9;&#x6837;&#x505A;&#x7684;&#x4F18;&#x70B9;&#x5728;&#x4E8E;&#xFF0C;&#x8FD9;&#x4E9B;&#x7F51;&#x7EDC;&#x901A;&#x5E38;&#x90FD;&#x9700;&#x8981;&#x5F88;&#x957F;&#x7684;&#x65F6;&#x95F4;&#x6765;&#x8BAD;&#x7EC3;&#xFF0C;&#x800C;&#x6216;&#x8BB8;&#x6709;&#x4EBA;&#x5DF2;&#x7ECF;&#x4F7F;&#x7528;&#x591A;&#x4E2A;<strong>GPU</strong>&#xFF0C;&#x901A;&#x8FC7;&#x5E9E;&#x5927;&#x7684;&#x6570;&#x636E;&#x96C6;&#x9884;&#x5148;&#x8BAD;&#x7EC3;&#x4E86;&#x8FD9;&#x4E9B;&#x7F51;&#x7EDC;&#xFF0C;&#x8FD9;&#x6837;&#x4E00;&#x6765;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x7F51;&#x7EDC;&#x8FDB;&#x884C;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x4E0B;&#x4E00;&#x8282;&#x8BFE;&#x8BA8;&#x8BBA;&#x8FD9;&#x4E9B;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x662F;&#x4E00;&#x540D;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x7814;&#x7A76;&#x5458;&#xFF0C;&#x4ECE;&#x96F6;&#x6765;&#x5B9E;&#x73B0;&#x8FD9;&#x4E9B;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x7684;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#x5C06;&#x4F1A;&#x4E0D;&#x540C;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x81EA;&#x5DF1;&#x6784;&#x5EFA;&#xFF0C;&#x90A3;&#x4E48;&#x5E0C;&#x671B;&#x4F60;&#x5C06;&#x5DE5;&#x4F5C;&#x6210;&#x679C;&#x8D21;&#x732E;&#x51FA;&#x6765;&#xFF0C;&#x653E;&#x5230;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x3002;&#x56E0;&#x4E3A;&#x5DF2;&#x7ECF;&#x6709;&#x5982;&#x6B64;&#x591A;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x7814;&#x7A76;&#x8005;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x8FD9;&#x4E9B;&#x67B6;&#x6784;&#x505A;&#x4E86;&#x5982;&#x6B64;&#x4E4B;&#x591A;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x6211;&#x53D1;&#x73B0;&#x4ECE;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x4E0A;&#x5F00;&#x59CB;&#x662F;&#x4E00;&#x4E2A;&#x66F4;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5B83;&#x4E5F;&#x786E;&#x5B9E;&#x662F;&#x4E00;&#x4E2A;&#x66F4;&#x5FEB;&#x5F00;&#x5C55;&#x65B0;&#x9879;&#x76EE;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<h3 id="29-&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#xFF08;transfer-learning&#xFF09;">2.9 &#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#xFF08;Transfer Learning&#xFF09;</h3>
<p>&#x5982;&#x679C;&#x4F60;&#x8981;&#x505A;&#x4E00;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x76F8;&#x6BD4;&#x4E8E;&#x4ECE;&#x5934;&#x8BAD;&#x7EC3;&#x6743;&#x91CD;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x4ECE;&#x968F;&#x673A;&#x521D;&#x59CB;&#x5316;&#x6743;&#x91CD;&#x5F00;&#x59CB;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E0B;&#x8F7D;&#x522B;&#x4EBA;&#x5DF2;&#x7ECF;&#x8BAD;&#x7EC3;&#x597D;&#x7F51;&#x7EDC;&#x7ED3;&#x6784;&#x7684;&#x6743;&#x91CD;&#xFF0C;&#x4F60;&#x901A;&#x5E38;&#x80FD;&#x591F;&#x8FDB;&#x5C55;&#x7684;&#x76F8;&#x5F53;&#x5FEB;&#xFF0C;&#x7528;&#x8FD9;&#x4E2A;&#x4F5C;&#x4E3A;&#x9884;&#x8BAD;&#x7EC3;&#xFF0C;&#x7136;&#x540E;&#x8F6C;&#x6362;&#x5230;&#x4F60;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x4EFB;&#x52A1;&#x4E0A;&#x3002;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x7684;&#x7814;&#x7A76;&#x793E;&#x533A;&#x975E;&#x5E38;&#x559C;&#x6B22;&#x628A;&#x8BB8;&#x591A;&#x6570;&#x636E;&#x96C6;&#x4E0A;&#x4F20;&#x5230;&#x7F51;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x542C;&#x8BF4;&#x8FC7;&#xFF0C;&#x6BD4;&#x5982;<strong>ImageNet</strong>&#xFF0C;&#x6216;&#x8005;<strong>MS COCO</strong>&#xFF0C;&#x6216;&#x8005;<strong>Pascal</strong>&#x7C7B;&#x578B;&#x7684;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x4E0D;&#x540C;&#x6570;&#x636E;&#x96C6;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x662F;&#x7531;&#x5927;&#x5BB6;&#x4E0A;&#x4F20;&#x5230;&#x7F51;&#x7EDC;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x6709;&#x5927;&#x91CF;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x7814;&#x7A76;&#x8005;&#x5DF2;&#x7ECF;&#x7528;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x96C6;&#x8BAD;&#x7EC3;&#x8FC7;&#x4ED6;&#x4EEC;&#x7684;&#x7B97;&#x6CD5;&#x4E86;&#x3002;&#x6709;&#x65F6;&#x5019;&#x8FD9;&#x4E9B;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#x9700;&#x8981;&#x82B1;&#x8D39;&#x597D;&#x51E0;&#x5468;&#xFF0C;&#x5E76;&#x4E14;&#x9700;&#x8981;&#x5F88;&#x591A;&#x7684;<strong>GPU</strong>&#xFF0C;&#x5176;&#x5B83;&#x4EBA;&#x5DF2;&#x7ECF;&#x505A;&#x8FC7;&#x4E86;&#xFF0C;&#x5E76;&#x4E14;&#x7ECF;&#x5386;&#x4E86;&#x975E;&#x5E38;&#x75DB;&#x82E6;&#x7684;&#x5BFB;&#x6700;&#x4F18;&#x8FC7;&#x7A0B;&#xFF0C;&#x8FD9;&#x5C31;&#x610F;&#x5473;&#x7740;&#x4F60;&#x53EF;&#x4EE5;&#x4E0B;&#x8F7D;&#x82B1;&#x8D39;&#x4E86;&#x522B;&#x4EBA;&#x597D;&#x51E0;&#x5468;&#x751A;&#x81F3;&#x51E0;&#x4E2A;&#x6708;&#x800C;&#x505A;&#x51FA;&#x6765;&#x7684;&#x5F00;&#x6E90;&#x7684;&#x6743;&#x91CD;&#x53C2;&#x6570;&#xFF0C;&#x628A;&#x5B83;&#x5F53;&#x4F5C;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x521D;&#x59CB;&#x5316;&#x7528;&#x5728;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E0A;&#x3002;&#x7528;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x628A;&#x516C;&#x5171;&#x7684;&#x6570;&#x636E;&#x96C6;&#x7684;&#x77E5;&#x8BC6;&#x8FC1;&#x79FB;&#x5230;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x95EE;&#x9898;&#x4E0A;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x4E00;&#x4E0B;&#x600E;&#x4E48;&#x505A;&#x3002;</p>
<p><img src="../images/c7e9aa44471aa98de824013e659921c1.png" alt=""></p>
<p>&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5047;&#x5982;&#x8BF4;&#x4F60;&#x8981;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x732B;&#x54AA;&#x68C0;&#x6D4B;&#x5668;&#xFF0C;&#x7528;&#x6765;&#x68C0;&#x6D4B;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x5BA0;&#x7269;&#x732B;&#x3002;&#x6BD4;&#x5982;&#x7F51;&#x7EDC;&#x4E0A;&#x7684;<strong>Tigger</strong>&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x5E38;&#x89C1;&#x7684;&#x732B;&#x7684;&#x540D;&#x5B57;&#xFF0C;<strong>Misty</strong>&#x4E5F;&#x662F;&#x6BD4;&#x8F83;&#x5E38;&#x89C1;&#x7684;&#x732B;&#x540D;&#x5B57;&#x3002;&#x5047;&#x5982;&#x4F60;&#x7684;&#x4E24;&#x53EA;&#x732B;&#x53EB;<strong>Tigger</strong>&#x548C;<strong>Misty</strong>&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#x662F;&#xFF0C;&#x4E24;&#x8005;&#x90FD;&#x4E0D;&#x662F;&#x3002;&#x6240;&#x4EE5;&#x4F60;&#x73B0;&#x5728;&#x6709;&#x4E00;&#x4E2A;&#x4E09;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#xFF0C;&#x56FE;&#x7247;&#x91CC;&#x662F;<strong>Tigger</strong>&#x8FD8;&#x662F;<strong>Misty</strong>&#xFF0C;&#x6216;&#x8005;&#x90FD;&#x4E0D;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x5FFD;&#x7565;&#x4E24;&#x53EA;&#x732B;&#x540C;&#x65F6;&#x51FA;&#x73B0;&#x5728;&#x4E00;&#x5F20;&#x56FE;&#x7247;&#x91CC;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x73B0;&#x5728;&#x4F60;&#x53EF;&#x80FD;&#x6CA1;&#x6709;<strong>Tigger</strong>&#x6216;&#x8005;<strong>Misty</strong>&#x7684;&#x5927;&#x91CF;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#x4F1A;&#x5F88;&#x5C0F;&#xFF0C;&#x4F60;&#x8BE5;&#x600E;&#x4E48;&#x529E;&#x5462;&#xFF1F;</p>
<p><img src="../images/1a0e35cf6dd1892b057554c83f60b1ae.png" alt=""></p>
<p>&#x6211;&#x5EFA;&#x8BAE;&#x4F60;&#x4ECE;&#x7F51;&#x4E0A;&#x4E0B;&#x8F7D;&#x4E00;&#x4E9B;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5F00;&#x6E90;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x4E0D;&#x4EC5;&#x628A;&#x4EE3;&#x7801;&#x4E0B;&#x8F7D;&#x4E0B;&#x6765;&#xFF0C;&#x4E5F;&#x628A;&#x6743;&#x91CD;&#x4E0B;&#x8F7D;&#x4E0B;&#x6765;&#x3002;&#x6709;&#x8BB8;&#x591A;&#x8BAD;&#x7EC3;&#x597D;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x4F60;&#x90FD;&#x53EF;&#x4EE5;&#x4E0B;&#x8F7D;&#x3002;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;<strong>ImageNet</strong>&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x5B83;&#x6709;1000&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x7C7B;&#x522B;&#xFF0C;&#x56E0;&#x6B64;&#x8FD9;&#x4E2A;&#x7F51;&#x7EDC;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;<strong>Softmax</strong>&#x5355;&#x5143;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x8F93;&#x51FA;1000&#x4E2A;&#x53EF;&#x80FD;&#x7C7B;&#x522B;&#x4E4B;&#x4E00;&#x3002;</p>
<p><img src="../images/8f0e69f085991cfc74726983418f6569.png" alt=""></p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x53BB;&#x6389;&#x8FD9;&#x4E2A;<strong>Softmax</strong>&#x5C42;&#xFF0C;&#x521B;&#x5EFA;&#x4F60;&#x81EA;&#x5DF1;&#x7684;<strong>Softmax</strong>&#x5355;&#x5143;&#xFF0C;&#x7528;&#x6765;&#x8F93;&#x51FA;<strong>Tigger</strong>&#x3001;<strong>Misty</strong>&#x548C;<strong>neither</strong>&#x4E09;&#x4E2A;&#x7C7B;&#x522B;&#x3002;&#x5C31;&#x7F51;&#x7EDC;&#x800C;&#x8A00;&#xFF0C;&#x6211;&#x5EFA;&#x8BAE;&#x4F60;&#x628A;&#x6240;&#x6709;&#x7684;&#x5C42;&#x770B;&#x4F5C;&#x662F;&#x51BB;&#x7ED3;&#x7684;&#xFF0C;&#x4F60;&#x51BB;&#x7ED3;&#x7F51;&#x7EDC;&#x4E2D;&#x6240;&#x6709;&#x5C42;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x8BAD;&#x7EC3;&#x548C;&#x4F60;&#x7684;<strong>Softmax</strong>&#x5C42;&#x6709;&#x5173;&#x7684;&#x53C2;&#x6570;&#x3002;&#x8FD9;&#x4E2A;<strong>Softmax</strong>&#x5C42;&#x6709;&#x4E09;&#x79CD;&#x53EF;&#x80FD;&#x7684;&#x8F93;&#x51FA;&#xFF0C;<strong>Tigger</strong>&#x3001;<strong>Misty</strong>&#x6216;&#x8005;&#x90FD;&#x4E0D;&#x662F;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x4EBA;&#x9884;&#x8BAD;&#x7EC3;&#x7684;&#x6743;&#x91CD;&#xFF0C;&#x4F60;&#x5F88;&#x53EF;&#x80FD;&#x5F97;&#x5230;&#x5F88;&#x597D;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x5373;&#x4F7F;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5C0F;&#x7684;&#x6570;&#x636E;&#x96C6;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x6846;&#x67B6;&#x90FD;&#x652F;&#x6301;&#x8FD9;&#x79CD;&#x64CD;&#x4F5C;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x53D6;&#x51B3;&#x4E8E;&#x7528;&#x7684;&#x6846;&#x67B6;&#xFF0C;&#x5B83;&#x4E5F;&#x8BB8;&#x4F1A;&#x6709;<code>trainableParameter=0</code>&#x8FD9;&#x6837;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E9B;&#x524D;&#x9762;&#x7684;&#x5C42;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x8BBE;&#x7F6E;&#x8FD9;&#x4E2A;&#x53C2;&#x6570;&#x3002;&#x4E3A;&#x4E86;&#x4E0D;&#x8BAD;&#x7EC3;&#x8FD9;&#x4E9B;&#x6743;&#x91CD;&#xFF0C;&#x6709;&#x65F6;&#x4E5F;&#x4F1A;&#x6709;<code>freeze=1</code>&#x8FD9;&#x6837;&#x7684;&#x53C2;&#x6570;&#x3002;&#x4E0D;&#x540C;&#x7684;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7F16;&#x7A0B;&#x6846;&#x67B6;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5141;&#x8BB8;&#x4F60;&#x6307;&#x5B9A;&#x662F;&#x5426;&#x8BAD;&#x7EC3;&#x7279;&#x5B9A;&#x5C42;&#x7684;&#x6743;&#x91CD;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x8BAD;&#x7EC3;<strong>softmax</strong>&#x5C42;&#x7684;&#x6743;&#x91CD;&#xFF0C;&#x628A;&#x524D;&#x9762;&#x8FD9;&#x4E9B;&#x5C42;&#x7684;&#x6743;&#x91CD;&#x90FD;&#x51BB;&#x7ED3;&#x3002;</p>
<p><img src="../images/ac520bf9e9facfc026db46b187b513bd.png" alt=""></p>
<p>&#x53E6;&#x4E00;&#x4E2A;&#x6280;&#x5DE7;&#xFF0C;&#x4E5F;&#x8BB8;&#x5BF9;&#x4E00;&#x4E9B;&#x60C5;&#x51B5;&#x6709;&#x7528;&#xFF0C;&#x7531;&#x4E8E;&#x524D;&#x9762;&#x7684;&#x5C42;&#x90FD;&#x51BB;&#x7ED3;&#x4E86;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x6539;&#x53D8;&#x3002;&#x56E0;&#x4E3A;&#x4F60;&#x4E0D;&#x9700;&#x8981;&#x6539;&#x53D8;&#x5B83;&#xFF0C;&#x4E5F;&#x4E0D;&#x8BAD;&#x7EC3;&#x5B83;&#xFF0C;&#x53D6;&#x8F93;&#x5165;&#x56FE;&#x50CF;$X$&#xFF0C;&#x7136;&#x540E;&#x628A;&#x5B83;&#x6620;&#x5C04;&#x5230;&#x8FD9;&#x5C42;&#xFF08;<strong>softmax</strong>&#x7684;&#x524D;&#x4E00;&#x5C42;&#xFF09;&#x7684;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x80FD;&#x52A0;&#x901F;&#x8BAD;&#x7EC3;&#x7684;&#x6280;&#x5DE7;&#x5C31;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5148;&#x8BA1;&#x7B97;&#x8FD9;&#x4E00;&#x5C42;&#xFF08;&#x7D2B;&#x8272;&#x7BAD;&#x5934;&#x6807;&#x8BB0;&#xFF09;&#xFF0C;&#x8BA1;&#x7B97;&#x7279;&#x5F81;&#x6216;&#x8005;&#x6FC0;&#x6D3B;&#x503C;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x5B83;&#x4EEC;&#x5B58;&#x5230;&#x786C;&#x76D8;&#x91CC;&#x3002;&#x4F60;&#x6240;&#x505A;&#x7684;&#x5C31;&#x662F;&#x7528;&#x8FD9;&#x4E2A;&#x56FA;&#x5B9A;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x524D;&#x534A;&#x90E8;&#x5206;&#xFF08;<strong>softmax</strong>&#x5C42;&#x4E4B;&#x524D;&#x7684;&#x6240;&#x6709;&#x5C42;&#x89C6;&#x4E3A;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x6620;&#x5C04;&#xFF09;&#xFF0C;&#x53D6;&#x4EFB;&#x610F;&#x8F93;&#x5165;&#x56FE;&#x50CF;$X$&#xFF0C;&#x7136;&#x540E;&#x8BA1;&#x7B97;&#x5B83;&#x7684;&#x67D0;&#x4E2A;&#x7279;&#x5F81;&#x5411;&#x91CF;&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x8BAD;&#x7EC3;&#x7684;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x6D45;&#x7684;<strong>softmax</strong>&#x6A21;&#x578B;&#xFF0C;&#x7528;&#x8FD9;&#x4E2A;&#x7279;&#x5F81;&#x5411;&#x91CF;&#x6765;&#x505A;&#x9884;&#x6D4B;&#x3002;&#x5BF9;&#x4F60;&#x7684;&#x8BA1;&#x7B97;&#x6709;&#x7528;&#x7684;&#x4E00;&#x6B65;&#x5C31;&#x662F;&#x5BF9;&#x4F60;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#x6240;&#x6709;&#x6837;&#x672C;&#x7684;&#x8FD9;&#x4E00;&#x5C42;&#x7684;&#x6FC0;&#x6D3B;&#x503C;&#x8FDB;&#x884C;&#x9884;&#x8BA1;&#x7B97;&#xFF0C;&#x7136;&#x540E;&#x5B58;&#x50A8;&#x5230;&#x786C;&#x76D8;&#x91CC;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x6B64;&#x4E4B;&#x4E0A;&#x8BAD;&#x7EC3;<strong>softmax</strong>&#x5206;&#x7C7B;&#x5668;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5B58;&#x50A8;&#x5230;&#x786C;&#x76D8;&#x6216;&#x8005;&#x8BF4;&#x9884;&#x8BA1;&#x7B97;&#x65B9;&#x6CD5;&#x7684;&#x4F18;&#x70B9;&#x5C31;&#x662F;&#xFF0C;&#x4F60;&#x4E0D;&#x9700;&#x8981;&#x6BCF;&#x6B21;&#x904D;&#x5386;&#x8BAD;&#x7EC3;&#x96C6;&#x518D;&#x91CD;&#x65B0;&#x8BA1;&#x7B97;&#x8FD9;&#x4E2A;&#x6FC0;&#x6D3B;&#x503C;&#x4E86;&#x3002;</p>
<p><img src="../images/fbd11f5ad8ff668b8d0ff09882efdeba.png" alt=""></p>
<p>&#x56E0;&#x6B64;&#x5982;&#x679C;&#x4F60;&#x7684;&#x4EFB;&#x52A1;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x5C0F;&#x7684;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x505A;&#x3002;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#x600E;&#x4E48;&#x529E;&#x5462;&#xFF1F;&#x6839;&#x636E;&#x7ECF;&#x9A8C;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;&#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x7684;&#x6807;&#x5B9A;&#x7684;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x4E5F;&#x8BB8;&#x4F60;&#x6709;&#x5927;&#x91CF;&#x7684;<strong>Tigger</strong>&#x548C;<strong>Misty</strong>&#x7684;&#x7167;&#x7247;&#xFF0C;&#x8FD8;&#x6709;&#x4E24;&#x8005;&#x90FD;&#x4E0D;&#x662F;&#x7684;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x51BB;&#x7ED3;&#x66F4;&#x5C11;&#x7684;&#x5C42;&#xFF0C;&#x6BD4;&#x5982;&#x53EA;&#x628A;&#x8FD9;&#x4E9B;&#x5C42;&#x51BB;&#x7ED3;&#xFF0C;&#x7136;&#x540E;&#x8BAD;&#x7EC3;&#x540E;&#x9762;&#x7684;&#x5C42;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7684;&#x8F93;&#x51FA;&#x5C42;&#x7684;&#x7C7B;&#x522B;&#x4E0D;&#x540C;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x9700;&#x8981;&#x6784;&#x5EFA;&#x81EA;&#x5DF1;&#x7684;&#x8F93;&#x51FA;&#x5355;&#x5143;&#xFF0C;<strong>Tigger</strong>&#x3001;<strong>Misty</strong>&#x6216;&#x8005;&#x4E24;&#x8005;&#x90FD;&#x4E0D;&#x662F;&#x4E09;&#x4E2A;&#x7C7B;&#x522B;&#x3002;&#x6709;&#x5F88;&#x591A;&#x65B9;&#x5F0F;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x53D6;&#x540E;&#x9762;&#x51E0;&#x5C42;&#x7684;&#x6743;&#x91CD;&#xFF0C;&#x7528;&#x4F5C;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x7136;&#x540E;&#x4ECE;&#x8FD9;&#x91CC;&#x5F00;&#x59CB;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x3002;</p>
<p><img src="../images/e7079af956d884d6184c4bde62271175.png" alt=""></p>
<p>&#x6216;&#x8005;&#x4F60;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x53BB;&#x6389;&#x8FD9;&#x51E0;&#x5C42;&#xFF0C;&#x6362;&#x6210;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x9690;&#x85CF;&#x5355;&#x5143;&#x548C;&#x4F60;&#x81EA;&#x5DF1;&#x7684;<strong>softmax</strong>&#x8F93;&#x51FA;&#x5C42;&#xFF0C;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x503C;&#x5F97;&#x4E00;&#x8BD5;&#x3002;&#x4F46;&#x662F;&#x6709;&#x4E00;&#x4E2A;&#x89C4;&#x5F8B;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x51BB;&#x7ED3;&#x7684;&#x5C42;&#x6570;&#x8D8A;&#x5C11;&#xFF0C;&#x4F60;&#x80FD;&#x591F;&#x8BAD;&#x7EC3;&#x7684;&#x5C42;&#x6570;&#x5C31;&#x8D8A;&#x591A;&#x3002;&#x8FD9;&#x4E2A;&#x7406;&#x5FF5;&#x5C31;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;&#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x7684;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x4E5F;&#x8BB8;&#x6709;&#x8DB3;&#x591F;&#x591A;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x90A3;&#x4E48;&#x4E0D;&#x8981;&#x5355;&#x5355;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;<strong>softmax</strong>&#x5355;&#x5143;&#xFF0C;&#x800C;&#x662F;&#x8003;&#x8651;&#x8BAD;&#x7EC3;&#x4E2D;&#x7B49;&#x5927;&#x5C0F;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x5305;&#x542B;&#x4F60;&#x6700;&#x7EC8;&#x8981;&#x7528;&#x7684;&#x7F51;&#x7EDC;&#x7684;&#x540E;&#x9762;&#x51E0;&#x5C42;&#x3002;</p>
<p><img src="../images/7cf0e18b739684106548cbbf0c1dd500.png" alt=""></p>
<p>&#x6700;&#x540E;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;&#x5927;&#x91CF;&#x6570;&#x636E;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x505A;&#x7684;&#x5C31;&#x662F;&#x7528;&#x5F00;&#x6E90;&#x7684;&#x7F51;&#x7EDC;&#x548C;&#x5B83;&#x7684;&#x6743;&#x91CD;&#xFF0C;&#x628A;&#x8FD9;&#x3001;&#x6240;&#x6709;&#x7684;&#x6743;&#x91CD;&#x5F53;&#x4F5C;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x7136;&#x540E;&#x8BAD;&#x7EC3;&#x6574;&#x4E2A;&#x7F51;&#x7EDC;&#x3002;&#x518D;&#x6B21;&#x6CE8;&#x610F;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;1000&#x8282;&#x70B9;&#x7684;<strong>softmax</strong>&#xFF0C;&#x800C;&#x4F60;&#x53EA;&#x6709;&#x4E09;&#x4E2A;&#x8F93;&#x51FA;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4F60;&#x81EA;&#x5DF1;&#x7684;<strong>softmax</strong>&#x8F93;&#x51FA;&#x5C42;&#x6765;&#x8F93;&#x51FA;&#x4F60;&#x8981;&#x7684;&#x6807;&#x7B7E;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x6709;&#x8D8A;&#x591A;&#x7684;&#x6807;&#x5B9A;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6216;&#x8005;&#x8D8A;&#x591A;&#x7684;<strong>Tigger</strong>&#x3001;<strong>Misty</strong>&#x6216;&#x8005;&#x4E24;&#x8005;&#x90FD;&#x4E0D;&#x662F;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8BAD;&#x7EC3;&#x8D8A;&#x591A;&#x7684;&#x5C42;&#x3002;&#x6781;&#x7AEF;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x4E0B;&#x8F7D;&#x7684;&#x6743;&#x91CD;&#x53EA;&#x4F5C;&#x4E3A;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x7528;&#x5B83;&#x4EEC;&#x6765;&#x4EE3;&#x66FF;&#x968F;&#x673A;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x63A5;&#x7740;&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x8BAD;&#x7EC3;&#xFF0C;&#x66F4;&#x65B0;&#x7F51;&#x7EDC;&#x6240;&#x6709;&#x5C42;&#x7684;&#x6240;&#x6709;&#x6743;&#x91CD;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x8BAD;&#x7EC3;&#x4E2D;&#x7684;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x7F51;&#x4E0A;&#x7684;&#x516C;&#x5F00;&#x6570;&#x636E;&#x96C6;&#x975E;&#x5E38;&#x5E9E;&#x5927;&#xFF0C;&#x5E76;&#x4E14;&#x4F60;&#x4E0B;&#x8F7D;&#x7684;&#x5176;&#x4ED6;&#x4EBA;&#x5DF2;&#x7ECF;&#x8BAD;&#x7EC3;&#x597D;&#x51E0;&#x5468;&#x7684;&#x6743;&#x91CD;&#xFF0C;&#x5DF2;&#x7ECF;&#x4ECE;&#x6570;&#x636E;&#x4E2D;&#x5B66;&#x4E60;&#x4E86;&#x5F88;&#x591A;&#x4E86;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x5BF9;&#x4E8E;&#x5F88;&#x591A;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E0B;&#x8F7D;&#x5176;&#x4ED6;&#x4EBA;&#x7684;&#x5F00;&#x6E90;&#x7684;&#x6743;&#x91CD;&#xFF0C;&#x5E76;&#x7528;&#x4F5C;&#x4F60;&#x95EE;&#x9898;&#x7684;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x4F60;&#x4F1A;&#x505A;&#x7684;&#x66F4;&#x597D;&#x3002;&#x5728;&#x6240;&#x6709;&#x4E0D;&#x540C;&#x5B66;&#x79D1;&#x4E2D;&#xFF0C;&#x5728;&#x6240;&#x6709;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x4E0D;&#x540C;&#x7684;&#x5E94;&#x7528;&#x4E2D;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x662F;&#x4E00;&#x4E2A;&#x4F60;&#x7ECF;&#x5E38;&#x7528;&#x5230;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x7684;&#x9886;&#x57DF;&#xFF0C;&#x9664;&#x975E;&#x4F60;&#x6709;&#x975E;&#x5E38;&#x975E;&#x5E38;&#x5927;&#x7684;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4ECE;&#x5934;&#x5F00;&#x59CB;&#x8BAD;&#x7EC3;&#x6240;&#x6709;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x603B;&#x4E4B;&#xFF0C;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x662F;&#x975E;&#x5E38;&#x503C;&#x5F97;&#x4F60;&#x8003;&#x8651;&#x7684;&#xFF0C;&#x9664;&#x975E;&#x4F60;&#x6709;&#x4E00;&#x4E2A;&#x6781;&#x5176;&#x5927;&#x7684;&#x6570;&#x636E;&#x96C6;&#x548C;&#x975E;&#x5E38;&#x5927;&#x7684;&#x8BA1;&#x7B97;&#x91CF;&#x9884;&#x7B97;&#x6765;&#x4ECE;&#x5934;&#x8BAD;&#x7EC3;&#x4F60;&#x7684;&#x7F51;&#x7EDC;&#x3002;</p>
<h3 id="210-&#x6570;&#x636E;&#x589E;&#x5F3A;&#xFF08;data-augmentation&#xFF09;">2.10 &#x6570;&#x636E;&#x589E;&#x5F3A;&#xFF08;Data augmentation&#xFF09;</h3>
<p>&#x5927;&#x90E8;&#x5206;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x4EFB;&#x52A1;&#x4F7F;&#x7528;&#x5F88;&#x591A;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6240;&#x4EE5;&#x6570;&#x636E;&#x6269;&#x5145;&#x662F;&#x7ECF;&#x5E38;&#x4F7F;&#x7528;&#x7684;&#x4E00;&#x79CD;&#x6280;&#x5DE7;&#x6765;&#x63D0;&#x9AD8;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x7CFB;&#x7EDF;&#x7684;&#x8868;&#x73B0;&#x3002;&#x6211;&#x8BA4;&#x4E3A;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x662F;&#x4E00;&#x4E2A;&#x76F8;&#x5F53;&#x590D;&#x6742;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x8F93;&#x5165;&#x56FE;&#x50CF;&#x7684;&#x50CF;&#x7D20;&#x503C;&#xFF0C;&#x7136;&#x540E;&#x5F04;&#x6E05;&#x695A;&#x56FE;&#x7247;&#x4E2D;&#x6709;&#x4EC0;&#x4E48;&#xFF0C;&#x4F3C;&#x4E4E;&#x4F60;&#x9700;&#x8981;&#x5B66;&#x4E60;&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x65B9;&#x7A0B;&#x6765;&#x505A;&#x8FD9;&#x4EF6;&#x4E8B;&#x3002;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x66F4;&#x591A;&#x7684;&#x6570;&#x636E;&#x5BF9;&#x5927;&#x591A;&#x6570;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x4EFB;&#x52A1;&#x90FD;&#x6709;&#x6240;&#x5E2E;&#x52A9;&#xFF0C;&#x4E0D;&#x50CF;&#x5176;&#x4ED6;&#x9886;&#x57DF;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x5F97;&#x5230;&#x5145;&#x8DB3;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4F46;&#x662F;&#x6548;&#x679C;&#x5E76;&#x4E0D;&#x600E;&#x4E48;&#x6837;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5F53;&#x4E0B;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x65B9;&#x9762;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x7684;&#x4E3B;&#x8981;&#x95EE;&#x9898;&#x662F;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x5F97;&#x5230;&#x5145;&#x8DB3;&#x7684;&#x6570;&#x636E;&#x3002;&#x5BF9;&#x5927;&#x591A;&#x6570;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5E94;&#x7528;&#xFF0C;&#x8FD9;&#x4E0D;&#x662F;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#xFF0C;&#x6570;&#x636E;&#x5C31;&#x8FDC;&#x8FDC;&#x4E0D;&#x591F;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x5C31;&#x610F;&#x5473;&#x7740;&#x5F53;&#x4F60;&#x8BAD;&#x7EC3;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x6A21;&#x578B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6570;&#x636E;&#x6269;&#x5145;&#x4F1A;&#x6709;&#x6240;&#x5E2E;&#x52A9;&#xFF0C;&#x8FD9;&#x662F;&#x53EF;&#x884C;&#x7684;&#xFF0C;&#x65E0;&#x8BBA;&#x4F60;&#x662F;&#x4F7F;&#x7528;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#xFF0C;&#x4F7F;&#x7528;&#x522B;&#x4EBA;&#x7684;&#x9884;&#x8BAD;&#x7EC3;&#x6A21;&#x578B;&#x5F00;&#x59CB;&#xFF0C;&#x6216;&#x8005;&#x4ECE;&#x6E90;&#x4EE3;&#x7801;&#x5F00;&#x59CB;&#x8BAD;&#x7EC3;&#x6A21;&#x578B;&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E0B;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x4E2D;&#x5E38;&#x89C1;&#x7684;&#x6570;&#x636E;&#x6269;&#x5145;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p><img src="../images/f92337ae2e50a0896d42d45cc7951e43.png" alt=""></p>
<p>&#x6216;&#x8BB8;&#x6700;&#x7B80;&#x5355;&#x7684;&#x6570;&#x636E;&#x6269;&#x5145;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x5782;&#x76F4;&#x955C;&#x50CF;&#x5BF9;&#x79F0;&#xFF0C;&#x5047;&#x5982;&#xFF0C;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#x6709;&#x8FD9;&#x5F20;&#x56FE;&#x7247;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x5176;&#x7FFB;&#x8F6C;&#x5F97;&#x5230;&#x53F3;&#x8FB9;&#x7684;&#x56FE;&#x50CF;&#x3002;&#x5BF9;&#x5927;&#x591A;&#x6570;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x4EFB;&#x52A1;&#xFF0C;&#x5DE6;&#x8FB9;&#x7684;&#x56FE;&#x7247;&#x662F;&#x732B;&#xFF0C;&#x7136;&#x540E;&#x955C;&#x50CF;&#x5BF9;&#x79F0;&#x4ECD;&#x7136;&#x662F;&#x732B;&#xFF0C;&#x5982;&#x679C;&#x955C;&#x50CF;&#x64CD;&#x4F5C;&#x4FDD;&#x7559;&#x4E86;&#x56FE;&#x50CF;&#x4E2D;&#x60F3;&#x8BC6;&#x522B;&#x7684;&#x7269;&#x4F53;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x8FD9;&#x662F;&#x4E2A;&#x5F88;&#x5B9E;&#x7528;&#x7684;&#x6570;&#x636E;&#x6269;&#x5145;&#x6280;&#x5DE7;&#x3002;</p>
<p><img src="../images/709aa552b6a5f4715620047bacf64753.png" alt=""></p>
<p>&#x53E6;&#x4E00;&#x4E2A;&#x7ECF;&#x5E38;&#x4F7F;&#x7528;&#x7684;&#x6280;&#x5DE7;&#x662F;&#x968F;&#x673A;&#x88C1;&#x526A;&#xFF0C;&#x7ED9;&#x5B9A;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x7136;&#x540E;&#x5F00;&#x59CB;&#x968F;&#x673A;&#x88C1;&#x526A;&#xFF0C;&#x53EF;&#x80FD;&#x4FEE;&#x526A;&#x8FD9;&#x4E2A;&#xFF08;&#x7F16;&#x53F7;1&#xFF09;&#xFF0C;&#x9009;&#x62E9;&#x88C1;&#x526A;&#x8FD9;&#x4E2A;&#xFF08;&#x7F16;&#x53F7;2&#xFF09;&#xFF0C;&#x8FD9;&#x4E2A;&#xFF08;&#x7F16;&#x53F7;3&#xFF09;&#xFF0C;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x56FE;&#x7247;&#x653E;&#x5728;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#xFF0C;&#x4F60;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x88C1;&#x526A;&#x3002;&#x968F;&#x673A;&#x88C1;&#x526A;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5B8C;&#x7F8E;&#x7684;&#x6570;&#x636E;&#x6269;&#x5145;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x968F;&#x673A;&#x88C1;&#x526A;&#x7684;&#x90A3;&#x4E00;&#x90E8;&#x5206;&#xFF08;&#x7EA2;&#x8272;&#x65B9;&#x6846;&#x6807;&#x8BB0;&#x90E8;&#x5206;&#xFF0C;&#x7F16;&#x53F7;4&#xFF09;&#xFF0C;&#x8FD9;&#x90E8;&#x5206;&#x770B;&#x8D77;&#x6765;&#x4E0D;&#x50CF;&#x732B;&#x3002;&#x4F46;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x8FD8;&#x662F;&#x5F88;&#x5B9E;&#x7528;&#x7684;&#xFF0C;&#x968F;&#x673A;&#x88C1;&#x526A;&#x6784;&#x6210;&#x4E86;&#x5F88;&#x5927;&#x4E00;&#x90E8;&#x5206;&#x7684;&#x771F;&#x5B9E;&#x56FE;&#x7247;&#x3002;</p>
<p><img src="../images/e7e2d497b751f798e77e1b040ebbf358.png" alt=""></p>
<p>&#x955C;&#x50CF;&#x5BF9;&#x79F0;&#x548C;&#x968F;&#x673A;&#x88C1;&#x526A;&#x662F;&#x7ECF;&#x5E38;&#x88AB;&#x4F7F;&#x7528;&#x7684;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x7406;&#x8BBA;&#x4E0A;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x65CB;&#x8F6C;&#xFF0C;&#x526A;&#x5207;&#xFF08;<strong>shearing</strong>&#xFF1A;&#x6B64;&#x5904;&#x5E76;&#x975E;&#x88C1;&#x526A;&#x7684;&#x542B;&#x4E49;&#xFF0C;&#x56FE;&#x50CF;&#x4EC5;&#x6C34;&#x5E73;&#x6216;&#x5782;&#x76F4;&#x5750;&#x6807;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF09;&#x56FE;&#x50CF;&#xFF0C;&#x53EF;&#x4EE5;&#x5BF9;&#x56FE;&#x50CF;&#x8FDB;&#x884C;&#x8FD9;&#x6837;&#x7684;&#x626D;&#x66F2;&#x53D8;&#x5F62;&#xFF0C;&#x5F15;&#x5165;&#x5F88;&#x591A;&#x5F62;&#x5F0F;&#x7684;&#x5C40;&#x90E8;&#x5F2F;&#x66F2;&#x7B49;&#x7B49;&#x3002;&#x5F53;&#x7136;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x5E76;&#x6CA1;&#x6709;&#x574F;&#x5904;&#xFF0C;&#x5C3D;&#x7BA1;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x56E0;&#x4E3A;&#x592A;&#x590D;&#x6742;&#x4E86;&#x6240;&#x4EE5;&#x4F7F;&#x7528;&#x7684;&#x5F88;&#x5C11;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x79CD;&#x7ECF;&#x5E38;&#x4F7F;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x5F69;&#x8272;&#x8F6C;&#x6362;&#xFF0C;&#x6709;&#x8FD9;&#x6837;&#x4E00;&#x5F20;&#x56FE;&#x7247;&#xFF0C;&#x7136;&#x540E;&#x7ED9;<strong>R</strong>&#x3001;<strong>G</strong>&#x548C;<strong>B</strong>&#x4E09;&#x4E2A;&#x901A;&#x9053;&#x4E0A;&#x52A0;&#x4E0A;&#x4E0D;&#x540C;&#x7684;&#x5931;&#x771F;&#x503C;&#x3002;</p>
<p><img src="../images/a5bcde6f0d2c2326be700c0ca441c934.png" alt=""></p>
<p>&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF08;&#x7F16;&#x53F7;1&#xFF09;&#xFF0C;&#x8981;&#x7ED9;&#x7EA2;&#x8272;&#x3001;&#x84DD;&#x8272;&#x901A;&#x9053;&#x52A0;&#x503C;&#xFF0C;&#x7ED9;&#x7EFF;&#x8272;&#x901A;&#x9053;&#x51CF;&#x503C;&#x3002;&#x7EA2;&#x8272;&#x548C;&#x84DD;&#x8272;&#x4F1A;&#x4EA7;&#x751F;&#x7D2B;&#x8272;&#xFF0C;&#x4F7F;&#x6574;&#x5F20;&#x56FE;&#x7247;&#x770B;&#x8D77;&#x6765;&#x504F;&#x7D2B;&#xFF0C;&#x8FD9;&#x6837;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#x5C31;&#x6709;&#x5931;&#x771F;&#x7684;&#x56FE;&#x7247;&#x3002;&#x4E3A;&#x4E86;&#x6F14;&#x793A;&#x6548;&#x679C;&#xFF0C;&#x6211;&#x5BF9;&#x56FE;&#x7247;&#x7684;&#x989C;&#x8272;&#x8FDB;&#x884C;&#x6539;&#x53D8;&#x6BD4;&#x8F83;&#x5938;&#x5F20;&#x3002;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x5BF9;<strong>R</strong>&#x3001;<strong>G</strong>&#x548C;<strong>B</strong>&#x7684;&#x53D8;&#x5316;&#x662F;&#x57FA;&#x4E8E;&#x67D0;&#x4E9B;&#x5206;&#x5E03;&#x7684;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x6539;&#x53D8;&#x4E5F;&#x53EF;&#x80FD;&#x5F88;&#x5C0F;&#x3002;</p>
<p>&#x8FD9;&#x4E48;&#x505A;&#x7684;&#x76EE;&#x7684;&#x5C31;&#x662F;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;<strong>R</strong>&#x3001;<strong>G</strong>&#x548C;<strong>B</strong>&#x7684;&#x503C;&#xFF0C;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x503C;&#x6765;&#x6539;&#x53D8;&#x989C;&#x8272;&#x3002;&#x5728;&#x7B2C;&#x4E8C;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF08;&#x7F16;&#x53F7;2&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x5C11;&#x7528;&#x4E86;&#x4E00;&#x70B9;&#x7EA2;&#x8272;&#xFF0C;&#x66F4;&#x591A;&#x7684;&#x7EFF;&#x8272;&#x548C;&#x84DD;&#x8272;&#x8272;&#x8C03;&#xFF0C;&#x8FD9;&#x5C31;&#x4F7F;&#x5F97;&#x56FE;&#x7247;&#x504F;&#x9EC4;&#x4E00;&#x70B9;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#xFF08;&#x7F16;&#x53F7;3&#xFF09;&#x4F7F;&#x7528;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x84DD;&#x8272;&#xFF0C;&#x4EC5;&#x4EC5;&#x591A;&#x4E86;&#x70B9;&#x7EA2;&#x8272;&#x3002;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;<strong>R</strong>&#x3001;<strong>G</strong>&#x548C;<strong>B</strong>&#x7684;&#x503C;&#x662F;&#x6839;&#x636E;&#x67D0;&#x79CD;&#x6982;&#x7387;&#x5206;&#x5E03;&#x6765;&#x51B3;&#x5B9A;&#x7684;&#x3002;&#x8FD9;&#x4E48;&#x505A;&#x7684;&#x7406;&#x7531;&#x662F;&#xFF0C;&#x53EF;&#x80FD;&#x9633;&#x5149;&#x4F1A;&#x6709;&#x4E00;&#x70B9;&#x504F;&#x9EC4;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x706F;&#x5149;&#x7167;&#x660E;&#x6709;&#x4E00;&#x70B9;&#x504F;&#x9EC4;&#xFF0C;&#x8FD9;&#x4E9B;&#x53EF;&#x4EE5;&#x8F7B;&#x6613;&#x7684;&#x6539;&#x53D8;&#x56FE;&#x50CF;&#x7684;&#x989C;&#x8272;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x732B;&#x7684;&#x8BC6;&#x522B;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x5185;&#x5BB9;&#x7684;&#x8BC6;&#x522B;&#xFF0C;&#x4EE5;&#x53CA;&#x6807;&#x7B7E;$y$&#xFF0C;&#x8FD8;&#x662F;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x4ECB;&#x7ECD;&#x8FD9;&#x4E9B;&#xFF0C;&#x989C;&#x8272;&#x5931;&#x771F;&#x6216;&#x8005;&#x662F;&#x989C;&#x8272;&#x53D8;&#x6362;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x6837;&#x4F1A;&#x4F7F;&#x5F97;&#x4F60;&#x7684;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x5BF9;&#x7167;&#x7247;&#x7684;&#x989C;&#x8272;&#x66F4;&#x6539;&#x66F4;&#x5177;&#x9C81;&#x68D2;&#x6027;&#x3002;</p>
<p><img src="../images/d69cfc9648f3a37eede074bd28c74c0d.png" alt=""></p>
<p>&#x8FD9;&#x662F;&#x5BF9;&#x66F4;&#x9AD8;&#x7EA7;&#x7684;&#x5B66;&#x4E60;&#x8005;&#x7684;&#x4E00;&#x4E9B;&#x6CE8;&#x610F;&#x63D0;&#x9192;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4E0D;&#x7406;&#x89E3;&#x6211;&#x7528;&#x7EA2;&#x8272;&#x6807;&#x51FA;&#x6765;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x5BF9;<strong>R&#x3001;G&#x548C;B</strong>&#x6709;&#x4E0D;&#x540C;&#x7684;&#x91C7;&#x6837;&#x65B9;&#x5F0F;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x79CD;&#x5F71;&#x54CD;&#x989C;&#x8272;&#x5931;&#x771F;&#x7684;&#x7B97;&#x6CD5;&#x662F;<strong>PCA</strong>&#xFF0C;&#x5373;&#x4E3B;&#x6210;&#x5206;&#x5206;&#x6790;&#xFF0C;&#x6211;&#x5728;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;<strong>mooc</strong>&#x4E2D;&#x8BB2;&#x8FC7;&#xFF0C;&#x5728;<strong>Coursera ml-class.Org</strong>&#x673A;&#x5668;&#x5B66;&#x4E60;&#x8FD9;&#x95E8;&#x8BFE;&#x4E2D;&#x3002;&#x4F46;&#x5177;&#x4F53;&#x989C;&#x8272;&#x6539;&#x53D8;&#x7684;&#x7EC6;&#x8282;&#x5728;<strong>AlexNet</strong>&#x7684;&#x8BBA;&#x6587;&#x4E2D;&#x6709;&#x65F6;&#x5019;&#x88AB;&#x79F0;&#x4F5C;<strong>PCA</strong>&#x989C;&#x8272;&#x589E;&#x5F3A;&#xFF0C;<strong>PCA</strong>&#x989C;&#x8272;&#x589E;&#x5F3A;&#x7684;&#x5927;&#x6982;&#x542B;&#x4E49;&#x662F;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7684;&#x56FE;&#x7247;&#x5448;&#x73B0;&#x7D2B;&#x8272;&#xFF0C;&#x5373;&#x4E3B;&#x8981;&#x542B;&#x6709;&#x7EA2;&#x8272;&#x548C;&#x84DD;&#x8272;&#xFF0C;&#x7EFF;&#x8272;&#x5F88;&#x5C11;&#xFF0C;&#x7136;&#x540E;<strong>PCA</strong>&#x989C;&#x8272;&#x589E;&#x5F3A;&#x7B97;&#x6CD5;&#x5C31;&#x4F1A;&#x5BF9;&#x7EA2;&#x8272;&#x548C;&#x84DD;&#x8272;&#x589E;&#x51CF;&#x5F88;&#x591A;&#xFF0C;&#x7EFF;&#x8272;&#x53D8;&#x5316;&#x76F8;&#x5BF9;&#x5C11;&#x4E00;&#x70B9;&#xFF0C;&#x6240;&#x4EE5;&#x4F7F;&#x603B;&#x4F53;&#x7684;&#x989C;&#x8272;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E9B;&#x4F60;&#x90FD;&#x4E0D;&#x61C2;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x62C5;&#x5FC3;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x7F51;&#x4E0A;&#x641C;&#x7D22;&#x4F60;&#x60F3;&#x8981;&#x4E86;&#x89E3;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x613F;&#x610F;&#x7684;&#x8BDD;&#x53EF;&#x4EE5;&#x9605;&#x8BFB;<strong>AlexNet</strong>&#x8BBA;&#x6587;&#x4E2D;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x4F60;&#x4E5F;&#x80FD;&#x627E;&#x5230;<strong>PCA</strong>&#x989C;&#x8272;&#x589E;&#x5F3A;&#x7684;&#x5F00;&#x6E90;&#x5B9E;&#x73B0;&#x65B9;&#x6CD5;&#xFF0C;&#x7136;&#x540E;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x5B83;&#x3002;</p>
<p><img src="../images/4ad2dc170b17e7a16be8177453382e40.png" alt=""></p>
<p>&#x4F60;&#x53EF;&#x80FD;&#x6709;&#x5B58;&#x50A8;&#x597D;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4F60;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x5B58;&#x5728;&#x786C;&#x76D8;&#x4E0A;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x7B26;&#x53F7;&#xFF0C;&#x8FD9;&#x4E2A;&#x5706;&#x6876;&#x6765;&#x8868;&#x793A;&#x4F60;&#x7684;&#x786C;&#x76D8;&#x3002;&#x5982;&#x679C;&#x4F60;&#x6709;&#x4E00;&#x4E2A;&#x5C0F;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x505A;&#x4EFB;&#x4F55;&#x4E8B;&#x60C5;&#xFF0C;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x96C6;&#x5C31;&#x591F;&#x4E86;&#x3002;</p>
<p><img src="../images/a07a48c4a98c820824e85f6c364a0024.png" alt=""></p>
<p>&#x4F46;&#x662F;&#x4F60;&#x6709;&#x7279;&#x522B;&#x5927;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x8FD9;&#x4E9B;&#x5C31;&#x662F;&#x4EBA;&#x4E48;&#x7ECF;&#x5E38;&#x4F7F;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x4F7F;&#x7528;<strong>CPU</strong>&#x7EBF;&#x7A0B;&#xFF0C;&#x7136;&#x540E;&#x5B83;&#x4E0D;&#x505C;&#x7684;&#x4ECE;&#x786C;&#x76D8;&#x4E2D;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x6709;&#x4E00;&#x4E2A;&#x4ECE;&#x786C;&#x76D8;&#x8FC7;&#x6765;&#x7684;&#x56FE;&#x7247;&#x6570;&#x636E;&#x6D41;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x7528;<strong>CPU</strong>&#x7EBF;&#x7A0B;&#x6765;&#x5B9E;&#x73B0;&#x8FD9;&#x4E9B;&#x5931;&#x771F;&#x53D8;&#x5F62;&#xFF0C;&#x53EF;&#x4EE5;&#x662F;&#x968F;&#x673A;&#x88C1;&#x526A;&#x3001;&#x989C;&#x8272;&#x53D8;&#x5316;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x955C;&#x50CF;&#x3002;&#x4F46;&#x662F;&#x5BF9;&#x6BCF;&#x5F20;&#x56FE;&#x7247;&#x5F97;&#x5230;&#x5BF9;&#x5E94;&#x7684;&#x67D0;&#x4E00;&#x79CD;&#x53D8;&#x5F62;&#x5931;&#x771F;&#x5F62;&#x5F0F;&#xFF0C;&#x770B;&#x8FD9;&#x5F20;&#x56FE;&#x7247;&#xFF08;&#x7F16;&#x53F7;1&#xFF09;&#xFF0C;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x955C;&#x50CF;&#x53D8;&#x6362;&#xFF0C;&#x4EE5;&#x53CA;&#x4F7F;&#x7528;&#x989C;&#x8272;&#x5931;&#x771F;&#xFF0C;&#x8FD9;&#x5F20;&#x56FE;&#x6700;&#x540E;&#x4F1A;&#x989C;&#x8272;&#x53D8;&#x5316;&#xFF08;&#x7F16;&#x53F7;2&#xFF09;&#xFF0C;&#x4ECE;&#x800C;&#x5F97;&#x5230;&#x4E0D;&#x540C;&#x989C;&#x8272;&#x7684;&#x732B;&#x3002;</p>
<p><img src="../images/2d9b9ca15ce25598d229470494d796ee.png" alt=""></p>
<p>&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#xFF0C;<strong>CPU</strong>&#x7EBF;&#x7A0B;&#x6301;&#x7EED;&#x52A0;&#x8F7D;&#x6570;&#x636E;&#xFF0C;&#x7136;&#x540E;&#x5B9E;&#x73B0;&#x4EFB;&#x610F;&#x5931;&#x771F;&#x53D8;&#x5F62;&#xFF0C;&#x4ECE;&#x800C;&#x6784;&#x6210;&#x6279;&#x6570;&#x636E;&#x6216;&#x8005;&#x6700;&#x5C0F;&#x6279;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x6301;&#x7EED;&#x7684;&#x4F20;&#x8F93;&#x7ED9;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x7136;&#x540E;&#x5F00;&#x59CB;&#x8BAD;&#x7EC3;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;<strong>CPU</strong>&#x6216;&#x8005;<strong>GPU</strong>&#x4E0A;&#x5B9E;&#x73B0;&#x8BAD;&#x4E00;&#x4E2A;&#x5927;&#x578B;&#x7F51;&#x7EDC;&#x7684;&#x8BAD;&#x7EC3;&#x3002;</p>
<p><img src="../images/5ee17d350497cb8cf52881f14cb0d9e8.png" alt=""></p>
<p>&#x5E38;&#x7528;&#x7684;&#x5B9E;&#x73B0;&#x6570;&#x636E;&#x6269;&#x5145;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x6216;&#x8005;&#x662F;&#x591A;&#x7EBF;&#x7A0B;&#xFF0C;&#x8FD9;&#x4E9B;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x52A0;&#x8F7D;&#x6570;&#x636E;&#xFF0C;&#x5B9E;&#x73B0;&#x53D8;&#x5F62;&#x5931;&#x771F;&#xFF0C;&#x7136;&#x540E;&#x4F20;&#x7ED9;&#x5176;&#x4ED6;&#x7684;&#x7EBF;&#x7A0B;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x8FDB;&#x7A0B;&#xFF0C;&#x6765;&#x8BAD;&#x7EC3;&#x8FD9;&#x4E2A;&#xFF08;&#x7F16;&#x53F7;2&#xFF09;&#x548C;&#x8FD9;&#x4E2A;&#xFF08;&#x7F16;&#x53F7;1&#xFF09;&#xFF0C;&#x53EF;&#x4EE5;&#x5E76;&#x884C;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x6570;&#x636E;&#x6269;&#x5145;&#xFF0C;&#x4E0E;&#x8BAD;&#x7EC3;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x5176;&#x4ED6;&#x90E8;&#x5206;&#x7C7B;&#x4F3C;&#xFF0C;&#x5728;&#x6570;&#x636E;&#x6269;&#x5145;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E5F;&#x6709;&#x4E00;&#x4E9B;&#x8D85;&#x53C2;&#x6570;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x989C;&#x8272;&#x53D8;&#x5316;&#x4E86;&#x591A;&#x5C11;&#xFF0C;&#x4EE5;&#x53CA;&#x968F;&#x673A;&#x88C1;&#x526A;&#x7684;&#x65F6;&#x5019;&#x4F7F;&#x7528;&#x7684;&#x53C2;&#x6570;&#x3002;&#x4E0E;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x5176;&#x4ED6;&#x90E8;&#x5206;&#x7C7B;&#x4F3C;&#xFF0C;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x5F00;&#x59CB;&#x53EF;&#x80FD;&#x662F;&#x4F7F;&#x7528;&#x522B;&#x4EBA;&#x7684;&#x5F00;&#x6E90;&#x5B9E;&#x73B0;&#xFF0C;&#x4E86;&#x89E3;&#x4ED6;&#x4EEC;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x6570;&#x636E;&#x6269;&#x5145;&#x3002;&#x5F53;&#x7136;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x83B7;&#x5F97;&#x66F4;&#x591A;&#x7684;&#x4E0D;&#x53D8;&#x7279;&#x6027;&#xFF0C;&#x800C;&#x5176;&#x4ED6;&#x4EBA;&#x7684;&#x5F00;&#x6E90;&#x5B9E;&#x73B0;&#x5E76;&#x6CA1;&#x6709;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x53BB;&#x8C03;&#x6574;&#x8FD9;&#x4E9B;&#x53C2;&#x6570;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x5E0C;&#x671B;&#x4F60;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x6269;&#x5145;&#x4F7F;&#x4F60;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x5E94;&#x7528;&#x6548;&#x679C;&#x66F4;&#x597D;&#x3002;</p>
<h3 id="211-&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x73B0;&#x72B6;&#xFF08;the-state-of-computer-vision&#xFF09;">2.11 &#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x73B0;&#x72B6;&#xFF08;The state of computer vision&#xFF09;</h3>
<p>&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x5DF2;&#x7ECF;&#x6210;&#x529F;&#x5730;&#x5E94;&#x7528;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x3001;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x5904;&#x7406;&#x3001;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#x3001;&#x5728;&#x7EBF;&#x5E7F;&#x544A;&#x3001;&#x7269;&#x6D41;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x8BB8;&#x591A;&#x95EE;&#x9898;&#x3002;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x7684;&#x73B0;&#x72B6;&#x4E0B;&#xFF0C;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x5E94;&#x7528;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x5E94;&#x7528;&#x6709;&#x4E00;&#x4E9B;&#x72EC;&#x7279;&#x4E4B;&#x5904;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x89C6;&#x9891;&#x4E2D;&#xFF0C;&#x6211;&#x5C06;&#x548C;&#x4F60;&#x4EEC;&#x5206;&#x4EAB;&#x4E00;&#x4E9B;&#x6211;&#x5BF9;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x65B9;&#x9762;&#x5E94;&#x7528;&#x7684;&#x8BA4;&#x8BC6;&#xFF0C;&#x5E0C;&#x671B;&#x80FD;&#x5E2E;&#x52A9;&#x4F60;&#x4EEC;&#x66F4;&#x597D;&#x5730;&#x7406;&#x89E3;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x4F5C;&#x54C1;&#xFF08;&#x6B64;&#x5904;&#x6307;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x6216;&#x8005;&#x6570;&#x636E;&#x7ADE;&#x8D5B;&#x4E2D;&#x7684;&#x6A21;&#x578B;&#xFF09;&#x4EE5;&#x53CA;&#x5176;&#x4E2D;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x81EA;&#x5DF1;&#x6784;&#x5EFA;&#x8FD9;&#x4E9B;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x7CFB;&#x7EDF;&#x3002;</p>
<p><img src="../images/c34d9a9d4ee4ae6a180783d3a135765c.png" alt=""></p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x5927;&#x90E8;&#x5206;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x95EE;&#x9898;&#x662F;&#x4ECB;&#x4E8E;&#x5C11;&#x91CF;&#x6570;&#x636E;&#x548C;&#x5927;&#x91CF;&#x6570;&#x636E;&#x8303;&#x56F4;&#x4E4B;&#x95F4;&#x7684;&#x3002;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x4ECA;&#x5929;&#x6211;&#x4EEC;&#x6709;&#x76F8;&#x5F53;&#x6570;&#x91CF;&#x7684;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#x6570;&#x636E;&#xFF0C;&#x81F3;&#x5C11;&#x76F8;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x590D;&#x6742;&#x6027;&#x800C;&#x8A00;&#x3002;&#x867D;&#x7136;&#x73B0;&#x5728;&#x56FE;&#x50CF;&#x8BC6;&#x522B;&#x6216;&#x56FE;&#x50CF;&#x5206;&#x7C7B;&#x65B9;&#x9762;&#x6709;&#x76F8;&#x5F53;&#x5927;&#x7684;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x56E0;&#x4E3A;&#x56FE;&#x50CF;&#x8BC6;&#x522B;&#x662F;&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x901A;&#x8FC7;&#x5206;&#x6790;&#x50CF;&#x7D20;&#x5E76;&#x8BC6;&#x522B;&#x51FA;&#x5B83;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x611F;&#x89C9;&#x5373;&#x4F7F;&#x5728;&#x7EBF;&#x6570;&#x636E;&#x96C6;&#x975E;&#x5E38;&#x5927;&#xFF0C;&#x5982;&#x8D85;&#x8FC7;&#x4E00;&#x767E;&#x4E07;&#x5F20;&#x56FE;&#x7247;&#xFF0C;&#x6211;&#x4EEC;&#x4ECD;&#x7136;&#x5E0C;&#x671B;&#x6211;&#x4EEC;&#x80FD;&#x6709;&#x66F4;&#x591A;&#x7684;&#x6570;&#x636E;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#x7269;&#x4F53;&#x68C0;&#x6D4B;&#xFF0C;&#x6211;&#x4EEC;&#x62E5;&#x6709;&#x7684;&#x6570;&#x636E;&#x66F4;&#x5C11;&#x3002;&#x63D0;&#x9192;&#x4E00;&#x4E0B;&#xFF0C;&#x56FE;&#x50CF;&#x8BC6;&#x522B;&#x5176;&#x5B9E;&#x662F;&#x5982;&#x4F55;&#x770B;&#x56FE;&#x7247;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x4E14;&#x544A;&#x8BC9;&#x4F60;&#x8FD9;&#x5F20;&#x56FE;&#x662F;&#x4E0D;&#x662F;&#x732B;&#xFF0C;&#x800C;&#x5BF9;&#x8C61;&#x68C0;&#x6D4B;&#x5219;&#x662F;&#x770B;&#x4E00;&#x5E45;&#x56FE;&#xFF0C;&#x4F60;&#x753B;&#x4E00;&#x4E2A;&#x6846;&#xFF0C;&#x544A;&#x8BC9;&#x4F60;&#x56FE;&#x7247;&#x91CC;&#x7684;&#x7269;&#x4F53;&#xFF0C;&#x6BD4;&#x5982;&#x6C7D;&#x8F66;&#x7B49;&#x7B49;&#x3002;&#x56E0;&#x4E3A;&#x83B7;&#x53D6;&#x8FB9;&#x6846;&#x7684;&#x6210;&#x672C;&#x6BD4;&#x6807;&#x8BB0;&#x5BF9;&#x8C61;&#x7684;&#x6210;&#x672C;&#x66F4;&#x9AD8;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x8FDB;&#x884C;&#x5BF9;&#x8C61;&#x68C0;&#x6D4B;&#x7684;&#x6570;&#x636E;&#x5F80;&#x5F80;&#x6BD4;&#x56FE;&#x50CF;&#x8BC6;&#x522B;&#x6570;&#x636E;&#x8981;&#x5C11;&#xFF0C;&#x5BF9;&#x8C61;&#x68C0;&#x6D4B;&#x662F;&#x6211;&#x4EEC;&#x4E0B;&#x5468;&#x8981;&#x8BA8;&#x8BBA;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
<p><img src="../images/e6701cf4129576648941bfd593a13c77.png" alt=""></p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x89C2;&#x5BDF;&#x4E00;&#x4E0B;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6570;&#x636E;&#x8303;&#x56F4;&#x56FE;&#x8C31;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x5F53;&#x4F60;&#x6709;&#x5F88;&#x591A;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x4EBA;&#x4EEC;&#x503E;&#x5411;&#x4E8E;&#x4F7F;&#x7528;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x7B97;&#x6CD5;&#x548C;&#x66F4;&#x5C11;&#x7684;&#x624B;&#x5DE5;&#x5DE5;&#x7A0B;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x4E3A;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7CBE;&#x5FC3;&#x8BBE;&#x8BA1;&#x7279;&#x5F81;&#x3002;&#x5F53;&#x4F60;&#x6709;&#x5927;&#x91CF;&#x7684;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x53EA;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x5927;&#x578B;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x751A;&#x81F3;&#x4E00;&#x4E2A;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x67B6;&#x6784;&#xFF0C;&#x53EF;&#x4EE5;&#x662F;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x53BB;&#x5B66;&#x4E60;&#x5B83;&#x60F3;&#x5B66;&#x4E60;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<p>&#x76F8;&#x53CD;&#x5F53;&#x4F60;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x591A;&#x7684;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x90A3;&#x65F6;&#x4F60;&#x4F1A;&#x770B;&#x5230;&#x4EBA;&#x4EEC;&#x4ECE;&#x4E8B;&#x66F4;&#x591A;&#x7684;&#x662F;&#x624B;&#x5DE5;&#x5DE5;&#x7A0B;&#xFF0C;&#x4F4E;&#x8C03;&#x70B9;&#x8BF4;&#x5C31;&#x662F;&#x4F60;&#x6709;&#x5F88;&#x591A;&#x5C0F;&#x6280;&#x5DE7;&#x53EF;&#x7528;&#xFF08;&#x6574;&#x7406;&#x8005;&#x6CE8;&#xFF1A;&#x5728;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6216;&#x8005;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x4E2D;&#xFF0C;&#x4E00;&#x822C;&#x66F4;&#x5D07;&#x5C1A;&#x66F4;&#x5C11;&#x7684;&#x4EBA;&#x5DE5;&#x5904;&#x7406;&#xFF0C;&#x800C;&#x624B;&#x5DE5;&#x5DE5;&#x7A0B;&#x66F4;&#x591A;&#x4F9D;&#x8D56;&#x4EBA;&#x5DE5;&#x5904;&#x7406;&#xFF0C;&#x6CE8;&#x610F;&#x9886;&#x4F1A;Andrew NG&#x7684;&#x610F;&#x601D;&#xFF09;&#x3002;&#x4F46;&#x6211;&#x8BA4;&#x4E3A;&#x6BCF;&#x4F60;&#x6CA1;&#x6709;&#x592A;&#x591A;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x624B;&#x5DE5;&#x5DE5;&#x7A0B;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x83B7;&#x5F97;&#x826F;&#x597D;&#x8868;&#x73B0;&#x7684;&#x6700;&#x4F73;&#x65B9;&#x5F0F;&#x3002;</p>
<p><img src="../images/c87f6cc9ec9c45ad57a049b6baf0b86d.png" alt=""></p>
<p>&#x6240;&#x4EE5;&#x5F53;&#x6211;&#x770B;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5E94;&#x7528;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x901A;&#x5E38;&#x6211;&#x4EEC;&#x7684;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x6709;&#x4E24;&#x79CD;&#x77E5;&#x8BC6;&#x6765;&#x6E90;&#xFF0C;&#x4E00;&#x4E2A;&#x6765;&#x6E90;&#x662F;&#x88AB;&#x6807;&#x8BB0;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5C31;&#x50CF;$(x&#xFF0C;y)$&#x5E94;&#x7528;&#x5728;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x77E5;&#x8BC6;&#x6765;&#x6E90;&#x662F;&#x624B;&#x5DE5;&#x5DE5;&#x7A0B;&#xFF0C;&#x6709;&#x5F88;&#x591A;&#x65B9;&#x6CD5;&#x53BB;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x624B;&#x5DE5;&#x5DE5;&#x7A0B;&#x7CFB;&#x7EDF;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x662F;&#x6E90;&#x4E8E;&#x7CBE;&#x5FC3;&#x8BBE;&#x8BA1;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x624B;&#x5DE5;&#x7CBE;&#x5FC3;&#x8BBE;&#x8BA1;&#x7684;&#x7F51;&#x7EDC;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x6216;&#x8005;&#x662F;&#x7CFB;&#x7EDF;&#x7684;&#x5176;&#x4ED6;&#x7EC4;&#x4EF6;&#x3002;&#x6240;&#x4EE5;&#x5F53;&#x4F60;&#x6CA1;&#x6709;&#x592A;&#x591A;&#x6807;&#x7B7E;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x66F4;&#x591A;&#x5730;&#x8003;&#x8651;&#x624B;&#x5DE5;&#x5DE5;&#x7A0B;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x6211;&#x8BA4;&#x4E3A;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x662F;&#x5728;&#x8BD5;&#x56FE;&#x5B66;&#x4E60;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x590D;&#x6742;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x611F;&#x89C9;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5373;&#x4F7F;&#x83B7;&#x5F97;&#x4E86;&#x66F4;&#x591A;&#x6570;&#x636E;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x662F;&#x7ECF;&#x5E38;&#x89C9;&#x5F97;&#x8FD8;&#x662F;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x6570;&#x636E;&#x6765;&#x6EE1;&#x8DB3;&#x9700;&#x6C42;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#xFF0C;&#x4ECE;&#x8FC7;&#x53BB;&#x751A;&#x81F3;&#x5230;&#x73B0;&#x5728;&#x90FD;&#x66F4;&#x591A;&#x5730;&#x4F9D;&#x8D56;&#x4E8E;&#x624B;&#x5DE5;&#x5DE5;&#x7A0B;&#x3002;&#x6211;&#x8BA4;&#x4E3A;&#x8FD9;&#x4E5F;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x9886;&#x57DF;&#x53D1;&#x5C55;&#x76F8;&#x5F53;&#x590D;&#x6742;&#x7F51;&#x7EDC;&#x67B6;&#x6784;&#x5730;&#x539F;&#x56E0;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x7F3A;&#x4E4F;&#x66F4;&#x591A;&#x6570;&#x636E;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x83B7;&#x5F97;&#x826F;&#x597D;&#x8868;&#x73B0;&#x7684;&#x65B9;&#x5F0F;&#x8FD8;&#x662F;&#x82B1;&#x66F4;&#x591A;&#x65F6;&#x95F4;&#x8FDB;&#x884C;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x5728;&#x7F51;&#x7EDC;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x4E0A;&#x6D6A;&#x8D39;&#xFF08;&#x8D2C;&#x4E49;&#x8912;&#x7528;&#xFF0C;&#x5373;&#x9700;&#x8981;&#x82B1;&#x8D39;&#x66F4;&#x591A;&#x65F6;&#x95F4;&#x7684;&#x610F;&#x601D;&#xFF09;&#x66F4;&#x591A;&#x65F6;&#x95F4;&#x3002;</p>
<p><img src="../images/7e51335f705120b35fa4ed5444ec5cda.png" alt=""></p>
<p>&#x5982;&#x679C;&#x4F60;&#x8BA4;&#x4E3A;&#x6211;&#x662F;&#x5728;&#x8D2C;&#x4F4E;&#x624B;&#x5DE5;&#x5DE5;&#x7A0B;&#xFF0C;&#x90A3;&#x5E76;&#x4E0D;&#x662F;&#x6211;&#x7684;&#x610F;&#x601D;&#xFF0C;&#x5F53;&#x4F60;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x624B;&#x5DE5;&#x5DE5;&#x7A0B;&#x662F;&#x4E00;&#x9879;&#x975E;&#x5E38;&#x56F0;&#x96BE;&#xFF0C;&#x975E;&#x5E38;&#x9700;&#x8981;&#x6280;&#x5DE7;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x5B83;&#x9700;&#x8981;&#x5F88;&#x597D;&#x7684;&#x6D1E;&#x5BDF;&#x529B;&#xFF0C;&#x90A3;&#x4E9B;&#x5BF9;&#x624B;&#x5DE5;&#x5DE5;&#x7A0B;&#x6709;&#x6DF1;&#x523B;&#x89C1;&#x89E3;&#x7684;&#x4EBA;&#x5C06;&#x4F1A;&#x5F97;&#x5230;&#x66F4;&#x597D;&#x7684;&#x8868;&#x73B0;&#x3002;&#x5F53;&#x4F60;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x624B;&#x5DE5;&#x5DE5;&#x7A0B;&#x5BF9;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x6765;&#x8BF4;&#x8D21;&#x732E;&#x5C31;&#x5F88;&#x5927;&#x3002;&#x5F53;&#x4F60;&#x6709;&#x5F88;&#x591A;&#x6570;&#x636E;&#x7684;&#x65F6;&#x5019;&#x6211;&#x5C31;&#x4E0D;&#x4F1A;&#x82B1;&#x65F6;&#x95F4;&#x53BB;&#x505A;&#x624B;&#x5DE5;&#x5DE5;&#x7A0B;&#xFF0C;&#x6211;&#x4F1A;&#x82B1;&#x65F6;&#x95F4;&#x53BB;&#x5EFA;&#x7ACB;&#x5B66;&#x4E60;&#x7CFB;&#x7EDF;&#x3002;&#x4F46;&#x6211;&#x8BA4;&#x4E3A;&#x4ECE;&#x5386;&#x53F2;&#x800C;&#x8A00;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x9886;&#x57DF;&#x8FD8;&#x53EA;&#x662F;&#x4F7F;&#x7528;&#x4E86;&#x975E;&#x5E38;&#x5C0F;&#x7684;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x56E0;&#x6B64;&#x4ECE;&#x5386;&#x53F2;&#x4E0A;&#x6765;&#x770B;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x8FD8;&#x662F;&#x4F9D;&#x8D56;&#x4E8E;&#x5927;&#x91CF;&#x7684;&#x624B;&#x5DE5;&#x5DE5;&#x7A0B;&#x3002;&#x751A;&#x81F3;&#x5728;&#x8FC7;&#x53BB;&#x7684;&#x51E0;&#x5E74;&#x91CC;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x4EFB;&#x52A1;&#x7684;&#x6570;&#x636E;&#x91CF;&#x6025;&#x5267;&#x589E;&#x52A0;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x8FD9;&#x5BFC;&#x81F4;&#x4E86;&#x624B;&#x5DE5;&#x5DE5;&#x7A0B;&#x91CF;&#x5927;&#x5E45;&#x51CF;&#x5C11;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x4E0A;&#x4ECD;&#x7136;&#x6709;&#x5F88;&#x591A;&#x7684;&#x7F51;&#x7EDC;&#x67B6;&#x6784;&#x4F7F;&#x7528;&#x624B;&#x5DE5;&#x5DE5;&#x7A0B;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x4F60;&#x4F1A;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x4E2D;&#x770B;&#x5230;&#x975E;&#x5E38;&#x590D;&#x6742;&#x7684;&#x8D85;&#x53C2;&#x6570;&#x9009;&#x62E9;&#xFF0C;&#x6BD4;&#x4F60;&#x5728;&#x5176;&#x4ED6;&#x9886;&#x57DF;&#x4E2D;&#x8981;&#x590D;&#x6742;&#x7684;&#x591A;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x901A;&#x5E38;&#x6709;&#x6BD4;&#x56FE;&#x50CF;&#x8BC6;&#x522B;&#x6570;&#x636E;&#x96C6;&#x66F4;&#x5C0F;&#x7684;&#x5BF9;&#x8C61;&#x68C0;&#x6D4B;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x8C08;&#x8BBA;&#x5BF9;&#x8C61;&#x68C0;&#x6D4B;&#x65F6;&#xFF0C;&#x5176;&#x5B9E;&#x8FD9;&#x662F;&#x4E0B;&#x5468;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x4F60;&#x4F1A;&#x770B;&#x5230;&#x7B97;&#x6CD5;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x590D;&#x6742;&#xFF0C;&#x800C;&#x4E14;&#x6709;&#x66F4;&#x591A;&#x7279;&#x6B8A;&#x7684;&#x7EC4;&#x4EF6;&#x3002;</p>
<p>&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x5F53;&#x4F60;&#x6709;&#x5C11;&#x91CF;&#x7684;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x6709;&#x4E00;&#x4EF6;&#x4E8B;&#x5BF9;&#x4F60;&#x5F88;&#x6709;&#x5E2E;&#x52A9;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x3002;&#x6211;&#x60F3;&#x8BF4;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x4E4B;&#x524D;&#x7684;&#x5E7B;&#x706F;&#x7247;&#x4E2D;&#xFF0C;<strong>Tigger</strong>&#x3001;<strong>Misty</strong>&#x6216;&#x8005;&#x4E8C;&#x8005;&#x90FD;&#x4E0D;&#x662F;&#x7684;&#x68C0;&#x6D4B;&#x95EE;&#x9898;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x8FD9;&#x4E48;&#x5C11;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x4F1A;&#x6709;&#x5F88;&#x5927;&#x5E2E;&#x52A9;&#x3002;&#x8FD9;&#x662F;&#x53E6;&#x4E00;&#x5957;&#x6280;&#x672F;&#xFF0C;&#x5F53;&#x4F60;&#x6709;&#x76F8;&#x5BF9;&#x8F83;&#x5C11;&#x7684;&#x6570;&#x636E;&#x65F6;&#x5C31;&#x53EF;&#x4EE5;&#x7528;&#x5F88;&#x591A;&#x76F8;&#x4F3C;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x770B;&#x4E00;&#x4E0B;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x65B9;&#x9762;&#x7684;&#x4F5C;&#x54C1;&#xFF0C;&#x770B;&#x770B;&#x90A3;&#x91CC;&#x7684;&#x521B;&#x610F;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x4EBA;&#x4EEC;&#x771F;&#x7684;&#x662F;&#x8E0C;&#x8E87;&#x6EE1;&#x5FD7;&#xFF0C;&#x4ED6;&#x4EEC;&#x5728;&#x57FA;&#x51C6;&#x6D4B;&#x8BD5;&#x4E2D;&#x548C;&#x7ADE;&#x8D5B;&#x4E2D;&#x8868;&#x73B0;&#x51FA;&#x8272;&#x3002;&#x5BF9;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x7814;&#x7A76;&#x8005;&#x6765;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5728;&#x57FA;&#x51C6;&#x4E0A;&#x505A;&#x5F97;&#x5F88;&#x597D;&#x4E86;&#xFF0C;&#x90A3;&#x5C31;&#x66F4;&#x5BB9;&#x6613;&#x53D1;&#x8868;&#x8BBA;&#x6587;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x6709;&#x8BB8;&#x591A;&#x4EBA;&#x81F4;&#x529B;&#x4E8E;&#x8FD9;&#x4E9B;&#x57FA;&#x51C6;&#x4E0A;&#xFF0C;&#x628A;&#x5B83;&#x505A;&#x5F97;&#x5F88;&#x597D;&#x3002;&#x79EF;&#x6781;&#x7684;&#x4E00;&#x9762;&#x662F;&#xFF0C;&#x5B83;&#x6709;&#x52A9;&#x4E8E;&#x6574;&#x4E2A;&#x793E;&#x533A;&#x627E;&#x51FA;&#x6700;&#x6709;&#x6548;&#x5F97;&#x7B97;&#x6CD5;&#x3002;&#x4F46;&#x662F;&#x4F60;&#x5728;&#x8BBA;&#x6587;&#x4E0A;&#x4E5F;&#x770B;&#x5230;&#xFF0C;&#x4EBA;&#x4EEC;&#x6240;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x8BA9;&#x4F60;&#x5728;&#x6570;&#x636E;&#x57FA;&#x51C6;&#x4E0A;&#x8868;&#x73B0;&#x51FA;&#x8272;&#xFF0C;&#x4F46;&#x4F60;&#x4E0D;&#x4F1A;&#x771F;&#x6B63;&#x90E8;&#x7F72;&#x5728;&#x4E00;&#x4E2A;&#x5B9E;&#x9645;&#x5F97;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7528;&#x5728;&#x751F;&#x4EA7;&#x6216;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E0A;&#x3002;</p>
<p>&#xFF08;&#x6574;&#x7406;&#x7740;&#x6CE8;&#xFF1A;<strong>Benchmark</strong> &#x57FA;&#x51C6;&#x6D4B;&#x8BD5;&#xFF0C;<strong>Benchmark</strong>&#x662F;&#x4E00;&#x4E2A;&#x8BC4;&#x4EF7;&#x65B9;&#x5F0F;&#xFF0C;&#x5728;&#x6574;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x9886;&#x57DF;&#x6709;&#x7740;&#x957F;&#x671F;&#x7684;&#x5E94;&#x7528;&#x3002;&#x7EF4;&#x57FA;&#x767E;&#x79D1;&#x4E0A;&#x89E3;&#x91CA;&#xFF1A;&#x201C;As computer architecture advanced, it became more difficult to compare the performance of various computer systems simply by looking at their specifications.Therefore, tests were developed that allowed comparison of different architectures.&#x201D;Benchmark&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x9886;&#x57DF;&#x5E94;&#x7528;&#x6700;&#x6210;&#x529F;&#x7684;&#x5C31;&#x662F;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#xFF0C;&#x4E3B;&#x8981;&#x6D4B;&#x8BD5;&#x8D1F;&#x8F7D;&#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x3001;&#x4F20;&#x8F93;&#x901F;&#x5EA6;&#x3001;&#x541E;&#x5410;&#x91CF;&#x3001;&#x8D44;&#x6E90;&#x5360;&#x7528;&#x7387;&#x7B49;&#x3002;&#xFF09;</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x4E00;&#x4E9B;&#x6709;&#x52A9;&#x4E8E;&#x5728;&#x57FA;&#x51C6;&#x6D4B;&#x8BD5;&#x4E2D;&#x8868;&#x73B0;&#x51FA;&#x8272;&#x7684;&#x5C0F;&#x6280;&#x5DE7;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x6211;&#x81EA;&#x5DF1;&#x4ECE;&#x6765;&#x6CA1;&#x4F7F;&#x7528;&#x8FC7;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x628A;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x6295;&#x5165;&#x751F;&#x4EA7;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x4E3A;&#x5BA2;&#x6237;&#x670D;&#x52A1;&#x3002;</p>
<p><img src="../images/0d0a3e182ddb9e995af3c6a68c7a72eb.png" alt=""></p>
<p>&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x662F;&#x96C6;&#x6210;&#xFF0C;&#x8FD9;&#x5C31;&#x610F;&#x5473;&#x7740;&#x5728;&#x4F60;&#x60F3;&#x597D;&#x4E86;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E4B;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x8BAD;&#x7EC3;&#x51E0;&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x5E76;&#x5E73;&#x5747;&#x5B83;&#x4EEC;&#x7684;&#x8F93;&#x51FA;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#x968F;&#x673A;&#x521D;&#x59CB;&#x5316;&#x4E09;&#x4E2A;&#x3001;&#x4E94;&#x4E2A;&#x6216;&#x8005;&#x4E03;&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x7136;&#x540E;&#x8BAD;&#x7EC3;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x7F51;&#x7EDC;&#xFF0C;&#x7136;&#x540E;&#x5E73;&#x5747;&#x5B83;&#x4EEC;&#x7684;&#x8F93;&#x51FA;&#x3002;&#x53E6;&#x5916;&#x5BF9;&#x4ED6;&#x4EEC;&#x7684;&#x8F93;&#x51FA;$\hat y$&#x8FDB;&#x884C;&#x5E73;&#x5747;&#x8BA1;&#x7B97;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x4E0D;&#x8981;&#x5E73;&#x5747;&#x4ED6;&#x4EEC;&#x7684;&#x6743;&#x91CD;&#xFF0C;&#x8FD9;&#x662F;&#x884C;&#x4E0D;&#x901A;&#x7684;&#x3002;&#x770B;&#x770B;&#x4F60;&#x7684;7&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x5B83;&#x4EEC;&#x6709;7&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x9884;&#x6D4B;&#xFF0C;&#x7136;&#x540E;&#x5E73;&#x5747;&#x4ED6;&#x4EEC;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x4F1A;&#x8BA9;&#x4F60;&#x5728;&#x57FA;&#x51C6;&#x4E0A;&#x63D0;&#x9AD8;1%&#xFF0C;2%&#x6216;&#x8005;&#x66F4;&#x597D;&#x3002;&#x8FD9;&#x4F1A;&#x8BA9;&#x4F60;&#x505A;&#x5F97;&#x66F4;&#x597D;&#xFF0C;&#x4E5F;&#x8BB8;&#x6709;&#x65F6;&#x4F1A;&#x8FBE;&#x5230;1%&#x6216;2%&#xFF0C;&#x8FD9;&#x771F;&#x7684;&#x80FD;&#x5E2E;&#x52A9;&#x4F60;&#x8D62;&#x5F97;&#x6BD4;&#x8D5B;&#x3002;&#x4F46;&#x56E0;&#x4E3A;&#x96C6;&#x6210;&#x610F;&#x5473;&#x7740;&#x8981;&#x5BF9;&#x6BCF;&#x5F20;&#x56FE;&#x7247;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5728;&#x4ECE;3&#x5230;15&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x7F51;&#x7EDC;&#x4E2D;&#x8FD0;&#x884C;&#x4E00;&#x4E2A;&#x56FE;&#x50CF;&#xFF0C;&#x8FD9;&#x662F;&#x5F88;&#x5178;&#x578B;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;3&#x5230;15&#x4E2A;&#x7F51;&#x7EDC;&#x53EF;&#x80FD;&#x4F1A;&#x8BA9;&#x4F60;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#x53D8;&#x6162;&#xFF0C;&#x751A;&#x81F3;&#x66F4;&#x591A;&#x65F6;&#x95F4;&#xFF0C;&#x6240;&#x4EE5;&#x6280;&#x5DE7;&#x4E4B;&#x4E00;&#x7684;&#x96C6;&#x6210;&#x662F;&#x4EBA;&#x4EEC;&#x5728;&#x57FA;&#x51C6;&#x6D4B;&#x8BD5;&#x4E2D;&#x8868;&#x73B0;&#x51FA;&#x8272;&#x548C;&#x8D62;&#x5F97;&#x6BD4;&#x8D5B;&#x7684;&#x5229;&#x5668;&#xFF0C;&#x4F46;&#x6211;&#x8BA4;&#x4E3A;&#x8FD9;&#x51E0;&#x4E4E;&#x4E0D;&#x7528;&#x4E8E;&#x751F;&#x4EA7;&#x670D;&#x52A1;&#x4E8E;&#x5BA2;&#x6237;&#x7684;&#xFF0C;&#x6211;&#x60F3;&#x9664;&#x975E;&#x4F60;&#x6709;&#x4E00;&#x4E2A;&#x5DE8;&#x5927;&#x7684;&#x8BA1;&#x7B97;&#x9884;&#x7B97;&#x800C;&#x4E14;&#x4E0D;&#x4ECB;&#x610F;&#x5728;&#x6BCF;&#x4E2A;&#x7528;&#x6237;&#x56FE;&#x50CF;&#x6570;&#x636E;&#x4E0A;&#x82B1;&#x8D39;&#x5927;&#x91CF;&#x7684;&#x8BA1;&#x7B97;&#x3002;</p>
<p>&#x4F60;&#x5728;&#x8BBA;&#x6587;&#x4E2D;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5728;&#x6D4B;&#x8BD5;&#x65F6;&#xFF0C;&#x5BF9;&#x8FDB;&#x51C6;&#x6D4B;&#x8BD5;&#x6709;&#x5E2E;&#x52A9;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x6280;&#x5DE7;&#x5C31;&#x662F;<strong>Multi-crop at test time</strong>&#xFF0C;&#x6211;&#x7684;&#x610F;&#x601D;&#x662F;&#x4F60;&#x5DF2;&#x7ECF;&#x770B;&#x5230;&#x4E86;&#x5982;&#x4F55;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x6269;&#x5145;&#xFF0C;<strong>Multi-crop</strong>&#x662F;&#x4E00;&#x79CD;&#x5C06;&#x6570;&#x636E;&#x6269;&#x5145;&#x5E94;&#x7528;&#x5230;&#x4F60;&#x7684;&#x6D4B;&#x8BD5;&#x56FE;&#x50CF;&#x4E2D;&#x7684;&#x4E00;&#x79CD;&#x5F62;&#x5F0F;&#x3002;</p>
<p><img src="../images/6027faa79b81f9940281ea36ca901504.png" alt=""></p>
<p>&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x732B;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x5B83;&#x590D;&#x5236;&#x56DB;&#x904D;&#xFF0C;&#x5305;&#x62EC;&#x5B83;&#x7684;&#x4E24;&#x4E2A;&#x955C;&#x50CF;&#x7248;&#x672C;&#x3002;&#x6709;&#x4E00;&#x79CD;&#x53EB;&#x4F5C;<strong>10-crop</strong>&#x7684;&#x6280;&#x672F;&#xFF08;<strong>crop</strong>&#x7406;&#x89E3;&#x4E3A;&#x88C1;&#x526A;&#x7684;&#x610F;&#x601D;&#xFF09;&#xFF0C;&#x5B83;&#x57FA;&#x672C;&#x4E0A;&#x8BF4;&#xFF0C;&#x5047;&#x8BBE;&#x4F60;&#x53D6;&#x8FD9;&#x4E2A;&#x4E2D;&#x5FC3;&#x533A;&#x57DF;&#xFF0C;&#x88C1;&#x526A;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x4F60;&#x7684;&#x5206;&#x7C7B;&#x5668;&#x53BB;&#x8FD0;&#x884C;&#x5B83;&#xFF0C;&#x7136;&#x540E;&#x53D6;&#x5DE6;&#x4E0A;&#x89D2;&#x533A;&#x57DF;&#xFF0C;&#x8FD0;&#x884C;&#x4F60;&#x7684;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x53F3;&#x4E0A;&#x89D2;&#x7528;&#x7EFF;&#x8272;&#x8868;&#x793A;&#xFF0C;&#x5DE6;&#x4E0B;&#x65B9;&#x7528;&#x9EC4;&#x8272;&#x8868;&#x793A;&#xFF0C;&#x53F3;&#x4E0B;&#x65B9;&#x7528;&#x6A59;&#x8272;&#x8868;&#x793A;&#xFF0C;&#x901A;&#x8FC7;&#x4F60;&#x7684;&#x5206;&#x7C7B;&#x5668;&#x6765;&#x8FD0;&#x884C;&#x5B83;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x955C;&#x50CF;&#x56FE;&#x50CF;&#x505A;&#x540C;&#x6837;&#x7684;&#x4E8B;&#x60C5;&#x5BF9;&#x5427;&#xFF1F;&#x6240;&#x4EE5;&#x53D6;&#x4E2D;&#x5FC3;&#x7684;<strong>crop</strong>&#xFF0C;&#x7136;&#x540E;&#x53D6;&#x56DB;&#x4E2A;&#x89D2;&#x843D;&#x7684;<strong>crop</strong>&#x3002;</p>
<p><img src="../images/fbb8d5acae8a02c366cea92000577d62.png" alt=""></p>
<p>&#x8FD9;&#x662F;&#x8FD9;&#x91CC;&#xFF08;&#x7F16;&#x53F7;1&#xFF09;&#x548C;&#x8FD9;&#x91CC;&#xFF08;&#x7F16;&#x53F7;3&#xFF09;&#x5C31;&#x662F;&#x4E2D;&#x5FC3;<strong>crop</strong>&#xFF0C;&#x8FD9;&#x91CC;&#xFF08;&#x7F16;&#x53F7;2&#xFF09;&#x548C;&#x8FD9;&#x91CC;&#xFF08;&#x7F16;&#x53F7;4&#xFF09;&#x5C31;&#x662F;&#x56DB;&#x4E2A;&#x89D2;&#x843D;&#x7684;<strong>crop</strong>&#x3002;&#x5982;&#x679C;&#x628A;&#x8FD9;&#x4E9B;&#x52A0;&#x8D77;&#x6765;&#xFF0C;&#x5C31;&#x4F1A;&#x6709;10&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x56FE;&#x50CF;&#x7684;<strong>crop</strong>&#xFF0C;&#x56E0;&#x6B64;&#x547D;&#x540D;&#x4E3A;<strong>10-crop</strong>&#x3002;&#x6240;&#x4EE5;&#x4F60;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#xFF0C;&#x901A;&#x8FC7;&#x4F60;&#x7684;&#x5206;&#x7C7B;&#x5668;&#x6765;&#x8FD0;&#x884C;&#x8FD9;&#x5341;&#x5F20;&#x56FE;&#x7247;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x7ED3;&#x679C;&#x8FDB;&#x884C;&#x5E73;&#x5747;&#x3002;&#x5982;&#x679C;&#x4F60;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x8BA1;&#x7B97;&#x9884;&#x7B97;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8FD9;&#x4E48;&#x505A;&#xFF0C;&#x4E5F;&#x8BB8;&#x4ED6;&#x4EEC;&#x9700;&#x8981;10&#x4E2A;<strong>crops</strong>&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x66F4;&#x591A;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x4F1A;&#x8BA9;&#x4F60;&#x5728;&#x751F;&#x4EA7;&#x7CFB;&#x7EDF;&#x4E2D;&#x83B7;&#x5F97;&#x66F4;&#x597D;&#x7684;&#x6027;&#x80FD;&#x3002;&#x5982;&#x679C;&#x662F;&#x751F;&#x4EA7;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x7684;&#x610F;&#x601D;&#x8FD8;&#x662F;&#x5B9E;&#x9645;&#x90E8;&#x7F72;&#x7528;&#x6237;&#x7684;&#x7CFB;&#x7EDF;&#x3002;&#x4F46;&#x8FD9;&#x662F;&#x53E6;&#x4E00;&#x79CD;&#x6280;&#x672F;&#xFF0C;&#x5B83;&#x5728;&#x57FA;&#x51C6;&#x6D4B;&#x8BD5;&#x4E0A;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x8981;&#x6BD4;&#x5B9E;&#x9645;&#x751F;&#x4EA7;&#x7CFB;&#x7EDF;&#x4E2D;&#x597D;&#x5F97;&#x591A;&#x3002;</p>
<p><img src="../images/824971b5b093abce4d152560fead1a8a.png" alt=""></p>
<p>&#x96C6;&#x6210;&#x7684;&#x4E00;&#x4E2A;&#x5927;&#x95EE;&#x9898;&#x662F;&#x4F60;&#x9700;&#x8981;&#x4FDD;&#x6301;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x4E0D;&#x540C;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x8FD9;&#x5C31;&#x5360;&#x7528;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x5185;&#x5B58;&#x3002;&#x5BF9;&#x4E8E;<strong>multi-crop</strong>&#xFF0C;&#x6211;&#x60F3;&#x4F60;&#x53EA;&#x4FDD;&#x7559;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x4E0D;&#x4F1A;&#x5360;&#x7528;&#x592A;&#x591A;&#x7684;&#x5185;&#x5B58;&#xFF0C;&#x4F46;&#x5B83;&#x4ECD;&#x7136;&#x4F1A;&#x8BA9;&#x4F60;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#x53D8;&#x6162;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x662F;&#x4F60;&#x770B;&#x5230;&#x7684;&#x5C0F;&#x6280;&#x5DE7;&#xFF0C;&#x7814;&#x7A76;&#x8BBA;&#x6587;&#x4E5F;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#x8FD9;&#x4E9B;&#xFF0C;&#x4F46;&#x6211;&#x4E2A;&#x4EBA;&#x5E76;&#x4E0D;&#x503E;&#x5411;&#x4E8E;&#x5728;&#x6784;&#x5EFA;&#x751F;&#x4EA7;&#x7CFB;&#x7EDF;&#x65F6;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#xFF0C;&#x5C3D;&#x7BA1;&#x5B83;&#x4EEC;&#x5728;&#x57FA;&#x51C6;&#x6D4B;&#x8BD5;&#x548C;&#x7ADE;&#x8D5B;&#x4E0A;&#x505A;&#x5F97;&#x5F88;&#x597D;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x95EE;&#x9898;&#x5EFA;&#x7ACB;&#x5728;&#x5C0F;&#x6570;&#x636E;&#x96C6;&#x4E4B;&#x4E0A;&#xFF0C;&#x5176;&#x4ED6;&#x4EBA;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x7F51;&#x7EDC;&#x67B6;&#x6784;&#x7684;&#x624B;&#x5DE5;&#x5DE5;&#x7A0B;&#x3002;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5728;&#x67D0;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x95EE;&#x9898;&#x4E0A;&#x5F88;&#x6709;&#x6548;&#xFF0C;&#x4F46;&#x4EE4;&#x4EBA;&#x60CA;&#x8BB6;&#x7684;&#x662F;&#x5B83;&#x901A;&#x5E38;&#x4E5F;&#x4F1A;&#x89E3;&#x51B3;&#x5176;&#x4ED6;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x8981;&#x60F3;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x5B9E;&#x7528;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F60;&#x6700;&#x597D;&#x5148;&#x4ECE;&#x5176;&#x4ED6;&#x4EBA;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x67B6;&#x6784;&#x5165;&#x624B;&#x3002;&#x5982;&#x679C;&#x53EF;&#x80FD;&#x7684;&#x8BDD;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5F00;&#x6E90;&#x7684;&#x4E00;&#x4E9B;&#x5E94;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x5F00;&#x653E;&#x7684;&#x6E90;&#x7801;&#x5B9E;&#x73B0;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x627E;&#x5230;&#x4E86;&#x6240;&#x6709;&#x7E41;&#x7410;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x6BD4;&#x5982;&#x5B66;&#x4E60;&#x7387;&#x8870;&#x51CF;&#x65B9;&#x5F0F;&#x6216;&#x8005;&#x8D85;&#x53C2;&#x6570;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x5176;&#x4ED6;&#x4EBA;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x5728;&#x51E0;&#x8DEF;<strong>GPU</strong>&#x4E0A;&#x82B1;&#x4E86;&#x51E0;&#x4E2A;&#x661F;&#x671F;&#x7684;&#x65F6;&#x95F4;&#x6765;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x6A21;&#x578B;&#xFF0C;&#x8BAD;&#x7EC3;&#x8D85;&#x8FC7;&#x4E00;&#x767E;&#x4E07;&#x5F20;&#x56FE;&#x7247;&#xFF0C;&#x6240;&#x4EE5;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x4EBA;&#x7684;&#x9884;&#x5148;&#x8BAD;&#x7EC3;&#x5F97;&#x6A21;&#x578B;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x6570;&#x636E;&#x96C6;&#x4E0A;&#x8FDB;&#x884C;&#x5FAE;&#x8C03;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E0A;&#x8FD0;&#x884C;&#x5F97;&#x66F4;&#x5FEB;&#x3002;&#x5F53;&#x7136;&#x5982;&#x679C;&#x4F60;&#x6709;&#x7535;&#x8111;&#x8D44;&#x6E90;&#x5E76;&#x4E14;&#x6709;&#x610F;&#x613F;&#xFF0C;&#x6211;&#x4E0D;&#x4F1A;&#x963B;&#x6B62;&#x4F60;&#x4ECE;&#x5934;&#x5F00;&#x59CB;&#x8BAD;&#x7EC3;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x7F51;&#x7EDC;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x53D1;&#x660E;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x7B97;&#x6CD5;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x662F;&#x4F60;&#x5FC5;&#x987B;&#x8981;&#x505A;&#x7684;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x672C;&#x5468;&#x7684;&#x5B66;&#x4E60;&#xFF0C;&#x6211;&#x5E0C;&#x671B;&#x770B;&#x5230;&#x5927;&#x91CF;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x67B6;&#x6784;&#x80FD;&#x591F;&#x5E2E;&#x52A9;&#x4F60;&#x7406;&#x89E3;&#x4EC0;&#x4E48;&#x662F;&#x6709;&#x6548;&#x7684;&#x3002;&#x5728;&#x672C;&#x5468;&#x7684;&#x7F16;&#x7A0B;&#x7EC3;&#x4E60;&#x4E2D;&#xFF0C;&#x4F60;&#x5B9E;&#x9645;&#x4E0A;&#x4F1A;&#x5B66;&#x4E60;&#x53E6;&#x4E00;&#x79CD;&#x7F16;&#x7A0B;&#x6846;&#x67B6;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x5B83;&#x6765;&#x5B9E;&#x73B0;<strong>ResNets</strong>&#x3002;&#x6240;&#x4EE5;&#x6211;&#x5E0C;&#x671B;&#x4F60;&#x4EEC;&#x559C;&#x6B22;&#x8FD9;&#x4E2A;&#x7F16;&#x7A0B;&#x7EC3;&#x4E60;&#xFF0C;&#x6211;&#x671F;&#x5F85;&#x4E0B;&#x5468;&#x8FD8;&#x80FD;&#x89C1;&#x5230;&#x4F60;&#x4EEC;&#x3002;</p>
<p><strong>&#x53C2;&#x8003;&#x6587;&#x732E;&#xFF1A;</strong></p>
<ul>
<li>Kaiming He, Xiangyu Zhang, Shaoqing Ren, Jian Sun - <a href="https://arxiv.org/abs/1512.03385" target="_blank">Deep Residual Learning for Image Recognition (2015)</a></li>
<li>Francois Chollet&apos;s github repository: <a href="https://github.com/fchollet/deep-learning-models/blob/master/resnet50.py" target="_blank">https://github.com/fchollet/deep-learning-models/blob/master/resnet50.py</a></li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="lesson4-week1.html" class="navigation navigation-prev " aria-label="Previous page: 第一周 卷积神经网络">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="lesson4-week3.html" class="navigation navigation-next " aria-label="Next page: 第三周 目标检测">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第二周 深度卷积网络：实例探究","level":"4.2","depth":1,"next":{"title":"第三周 目标检测","level":"4.3","depth":1,"path":"lesson4-week3.md","ref":"lesson4-week3.md","articles":[]},"previous":{"title":"第一周 卷积神经网络","level":"4.1","depth":1,"path":"lesson4-week1.md","ref":"lesson4-week1.md","articles":[]},"dir":"ltr"},"config":{"plugins":["fontsettings","sharing","-lunr","-search","search-pro","highlight","livereload","back-to-top-button","cdn"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"cdn":{"url":"//cdn.jsdelivr.net/gh/zhepama/C-Sharp-Playground@gh-pages/","img_url":"//cdn.jsdelivr.net/gh/zhepama/C-Sharp-Playground@gh-pages/"},"fontsettings":{"family":"sans","size":2,"theme":"white"},"sharing":{"all":["facebook","google","twitter","weibo","instapaper"],"facebook":true,"google":false,"instapaper":false,"twitter":true,"vk":false,"weibo":false},"search-pro":{},"highlight":{},"livereload":{},"back-to-top-button":{},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"深度学习教程","language":"zh-hans","links":{"sidebar":{"编程网":"https://www.editcode.net"}},"gitbook":"*"},"file":{"path":"lesson4-week2.md","mtime":"2020-11-28T01:34:16.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-05-09T13:30:39.812Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook.js"></script>
    <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/theme.js"></script>
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    

    </body>
</html>

