
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第四周 特殊应用：人脸识别和神经风格转换 · 深度学习教程</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/style.css">

    
            
                
                <link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-back-to-top-button/plugin.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="lesson5-week1.html" />
    
    
    <link rel="prev" href="lesson4-week3.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://www.editcode.net" target="_blank" class="custom-link">编程网</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        <li class="header">第一门课 神经网络和深度学习</li>
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="lesson1-week1.html">
            
                <a href="lesson1-week1.html">
            
                    
                    第一周：深度学习引言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="lesson1-week2.html">
            
                <a href="lesson1-week2.html">
            
                    
                    第二周：神经网络的编程基础
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="lesson1-week3.html">
            
                <a href="lesson1-week3.html">
            
                    
                    第三周：浅层神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="lesson1-week4.html">
            
                <a href="lesson1-week4.html">
            
                    
                    第四周：深层神经网络
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第二门课 改善深层神经网络</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="lesson2-week1.html">
            
                <a href="lesson2-week1.html">
            
                    
                    第一周：深度学习的实践层面
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="lesson2-week2.html">
            
                <a href="lesson2-week2.html">
            
                    
                    第二周：优化算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="lesson2-week3.html">
            
                <a href="lesson2-week3.html">
            
                    
                    第三周超参数调试，batch正则化和程序框架
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第三门课 结构化机器学习项目</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="lesson3-week1.html">
            
                <a href="lesson3-week1.html">
            
                    
                    第一周：机器学习策略
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="lesson3-week2.html">
            
                <a href="lesson3-week2.html">
            
                    
                    第二周：机器学习策略
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第四门课 卷积神经网络</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="lesson4-week1.html">
            
                <a href="lesson4-week1.html">
            
                    
                    第一周 卷积神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="lesson4-week2.html">
            
                <a href="lesson4-week2.html">
            
                    
                    第二周 深度卷积网络：实例探究
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.3" data-path="lesson4-week3.html">
            
                <a href="lesson4-week3.html">
            
                    
                    第三周 目标检测
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="4.4" data-path="lesson4-week4.html">
            
                <a href="lesson4-week4.html">
            
                    
                    第四周 特殊应用：人脸识别和神经风格转换
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第五门课 序列模型</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="lesson5-week1.html">
            
                <a href="lesson5-week1.html">
            
                    
                    第一周 循环序列模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.2" data-path="lesson5-week2.html">
            
                <a href="lesson5-week2.html">
            
                    
                    第二周 自然语言处理与词嵌入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.3" data-path="lesson5-week3.html">
            
                <a href="lesson5-week3.html">
            
                    
                    第三周 序列模型和注意力机制
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">附件</li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="interview.html">
            
                <a href="interview.html">
            
                    
                    人工智能大师访谈
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.2" data-path="notation.html">
            
                <a href="notation.html">
            
                    
                    深度学习符号指南（原课程翻译）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.3" data-path="notation.html">
            
                <a href="notation.html">
            
                    
                    机器学习的数学基础
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第四周 特殊应用：人脸识别和神经风格转换</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x7B2C;&#x56DB;&#x5468;-&#x7279;&#x6B8A;&#x5E94;&#x7528;&#xFF1A;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x548C;&#x795E;&#x7ECF;&#x98CE;&#x683C;&#x8F6C;&#x6362;&#xFF08;special-applications-face-recognition-neural-style-transfer&#xFF09;">&#x7B2C;&#x56DB;&#x5468; &#x7279;&#x6B8A;&#x5E94;&#x7528;&#xFF1A;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x548C;&#x795E;&#x7ECF;&#x98CE;&#x683C;&#x8F6C;&#x6362;&#xFF08;Special applications: Face recognition &amp;Neural style transfer&#xFF09;</h2>
<p>[TOC]</p>
<h3 id="41-&#x4EC0;&#x4E48;&#x662F;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#xFF1F;&#xFF08;what-is-face-recognition&#xFF09;">4.1 &#x4EC0;&#x4E48;&#x662F;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#xFF1F;&#xFF08;What is face recognition?&#xFF09;</h3>
<p>&#x6B22;&#x8FCE;&#x6765;&#x5230;&#x7B2C;&#x56DB;&#x5468;&#xFF0C;&#x5373;&#x8FD9;&#x95E8;&#x8BFE;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8BFE;&#x7A0B;&#x7684;&#x6700;&#x540E;&#x4E00;&#x5468;&#x3002;&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x4F60;&#x5B66;&#x4E86;&#x5F88;&#x591A;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x77E5;&#x8BC6;&#x3002;&#x6211;&#x8FD9;&#x5468;&#x51C6;&#x5907;&#x5411;&#x4F60;&#x5C55;&#x793A;&#x4E00;&#x4E9B;&#x91CD;&#x8981;&#x7684;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x7279;&#x6B8A;&#x5E94;&#x7528;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4ECE;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x5F00;&#x59CB;&#xFF0C;&#x4E4B;&#x540E;&#x8BB2;&#x795E;&#x7ECF;&#x98CE;&#x683C;&#x8FC1;&#x79FB;&#xFF0C;&#x4F60;&#x5C06;&#x6709;&#x673A;&#x4F1A;&#x5728;&#x7F16;&#x7A0B;&#x4F5C;&#x4E1A;&#x4E2D;&#x5B9E;&#x73B0;&#x8FD9;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#xFF0C;&#x521B;&#x9020;&#x81EA;&#x5DF1;&#x7684;&#x827A;&#x672F;&#x4F5C;&#x54C1;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x5148;&#x4ECE;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x5F00;&#x59CB;&#xFF0C;&#x6211;&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x4E2A;&#x6709;&#x610F;&#x601D;&#x7684;&#x6F14;&#x793A;&#x3002;&#x6211;&#x5728;&#x9886;&#x5BFC;&#x767E;&#x5EA6;<strong>AI</strong>&#x56E2;&#x961F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x5C0F;&#x7EC4;&#x7531;&#x6797;&#x5143;&#x5E86;&#x5E26;&#x9886;&#x7684;&#xFF0C;&#x505A;&#x8FC7;&#x4E00;&#x4E2A;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x7CFB;&#x7EDF;&#xFF0C;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x975E;&#x5E38;&#x68D2;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E0B;&#x3002;</p>
<p>&#xFF08;&#x4EE5;&#x4E0B;&#x5185;&#x5BB9;&#x4E3A;&#x6F14;&#x793A;&#x89C6;&#x9891;&#x5185;&#x5BB9;&#xFF09;</p>
<p><img src="../images/d57c488693021009431b107d968c06f7.png" alt=""></p>
<p><strong>&#x89C6;&#x9891;&#x5F00;&#x59CB;&#xFF1A;</strong></p>
<p>&#x6211;&#x60F3;&#x6F14;&#x793A;&#x4E00;&#x4E2A;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x7CFB;&#x7EDF;&#xFF0C;&#x6211;&#x73B0;&#x5728;&#x5728;&#x767E;&#x5EA6;&#x7684;&#x4E2D;&#x56FD;&#x603B;&#x90E8;&#xFF0C;&#x5F88;&#x591A;&#x516C;&#x53F8;&#x8981;&#x6C42;&#x8FDB;&#x5165;&#x516C;&#x53F8;&#x7684;&#x65F6;&#x5019;&#x8981;&#x5237;&#x5DE5;&#x5361;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x5B83;&#xFF0C;&#x4F7F;&#x7528;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#xFF0C;&#x770B;&#x770B;&#x6211;&#x80FD;&#x505A;&#x4EC0;&#x4E48;&#x3002;&#x5F53;&#x6211;&#x8D70;&#x8FD1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x4F1A;&#x8BC6;&#x522B;&#x6211;&#x7684;&#x8138;&#xFF0C;&#x7136;&#x540E;&#x8BF4;&#x6B22;&#x8FCE;&#x6211;&#xFF08;<strong>Andrew NG</strong>&#xFF09;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x5DE5;&#x5361;&#xFF0C;&#x6211;&#x5C31;&#x80FD;&#x901A;&#x8FC7;&#x4E86;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x53E6;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x5728;&#x65C1;&#x8FB9;&#x7684;&#x662F;&#x6797;&#x5143;&#x5E86;&#xFF0C;<strong>IDL</strong>&#xFF08;&#x767E;&#x5EA6;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x5B9E;&#x9A8C;&#x5BA4;&#xFF09;&#x7684;&#x4E3B;&#x7BA1;&#xFF0C;&#x4ED6;&#x9886;&#x5BFC;&#x5F00;&#x53D1;&#x4E86;&#x8FD9;&#x4E2A;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x7CFB;&#x7EDF;&#xFF0C;&#x6211;&#x628A;&#x6211;&#x7684;&#x5DE5;&#x5361;&#x7ED9;&#x4ED6;&#xFF0C;&#x4E0A;&#x9762;&#x6709;&#x6211;&#x7684;&#x5934;&#x50CF;&#xFF0C;&#x4ED6;&#x4F1A;&#x8BD5;&#x7740;&#x7528;&#x6211;&#x7684;&#x5934;&#x50CF;&#x7167;&#x7247;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x771F;&#x4EBA;&#x6765;&#x901A;&#x8FC7;&#x3002;</p>
<p><img src="../images/7a81af99f48fa41796b4dd0dc0dae8a7.png" alt=""></p>
<p>&#xFF08;&#x6797;&#x5143;&#x5E86;&#x8BED;&#xFF1A;&#x6211;&#x5C06;&#x5C1D;&#x8BD5;&#x7528;<strong>Andrew</strong>&#x7684;&#x5DE5;&#x5361;&#x9A97;&#x8FC7;&#x673A;&#x5668;&#xFF0C;&#x770B;&#x770B;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#xFF0C;&#x7CFB;&#x7EDF;&#x4E0D;&#x4F1A;&#x8BC6;&#x522B;&#xFF0C;&#x7CFB;&#x7EDF;&#x62D2;&#x7EDD;&#x8BC6;&#x522B;&#x3002;&#x73B0;&#x5728;&#x6211;&#x8981;&#x7528;&#x6211;&#x81EA;&#x5DF1;&#x7684;&#x8138;&#xFF0C;&#xFF08;&#x7CFB;&#x7EDF;&#x8BED;&#x97F3;&#xFF1A;&#x201C;&#x6B22;&#x8FCE;&#x60A8;&#x201D;&#xFF09;&#xFF08;&#x6797;&#x5143;&#x5E86;&#x987A;&#x5229;&#x901A;&#x8FC7;&#xFF09;&#xFF09;</p>
<p>&#x7C7B;&#x4F3C;&#x4E8E;&#x8FD9;&#x6837;&#x7684;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x7CFB;&#x7EDF;&#x5728;&#x4E2D;&#x56FD;&#x53D1;&#x5C55;&#x5F88;&#x5FEB;&#xFF0C;&#x6211;&#x5E0C;&#x671B;&#x8FD9;&#x4E2A;&#x6280;&#x672F;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x5176;&#x4ED6;&#x7684;&#x56FD;&#x5BB6;&#x4F7F;&#x7528;&#x3002;</p>
<p><strong>#&#x89C6;&#x9891;&#x7ED3;&#x675F;</strong></p>
<p>&#x633A;&#x5389;&#x5BB3;&#x7684;&#x5427;&#xFF0C;&#x4F60;&#x521A;&#x770B;&#x5230;&#x7684;&#x8FD9;&#x4E2A;&#x89C6;&#x9891;&#x5C55;&#x793A;&#x4E86;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x548C;&#x6D3B;&#x4F53;&#x68C0;&#x6D4B;&#xFF0C;&#x540E;&#x4E00;&#x9879;&#x6280;&#x672F;&#x786E;&#x8BA4;&#x4F60;&#x662F;&#x4E00;&#x4E2A;&#x6D3B;&#x4EBA;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x6D3B;&#x4F53;&#x68C0;&#x6D4B;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x6765;&#x5B9E;&#x73B0;&#xFF0C;&#x53BB;&#x9884;&#x6D4B;&#x662F;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x771F;&#x4EBA;&#xFF0C;&#x8FD9;&#x4E2A;&#x65B9;&#x9762;&#x6211;&#x5C31;&#x4E0D;&#x591A;&#x8BF4;&#x4E86;&#x3002;&#x6211;&#x4E3B;&#x8981;&#x60F3;&#x8BB2;&#x7684;&#x662F;&#xFF0C;&#x5982;&#x4F55;&#x6784;&#x9020;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x8FD9;&#x4E00;&#x90E8;&#x5206;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x4E86;&#x89E3;&#x4E00;&#x4E0B;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x7684;&#x4E00;&#x4E9B;&#x672F;&#x8BED;&#x3002;</p>
<p>&#x5728;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x7684;&#x76F8;&#x5173;&#x6587;&#x732E;&#x4E2D;&#xFF0C;&#x4EBA;&#x4EEC;&#x7ECF;&#x5E38;&#x63D0;&#x5230;&#x4EBA;&#x8138;&#x9A8C;&#x8BC1;&#xFF08;<strong>face verification</strong>&#xFF09;&#x548C;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#xFF08;<strong>face recognition</strong>&#xFF09;&#x3002;</p>
<p><img src="../images/15eaee3ee185a2c7e0e55dc940b512c5.png" alt=""></p>
<p>&#x8FD9;&#x662F;&#x4EBA;&#x8138;&#x9A8C;&#x8BC1;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;&#x4E00;&#x5F20;&#x8F93;&#x5165;&#x56FE;&#x7247;&#xFF0C;&#x4EE5;&#x53CA;&#x67D0;&#x4EBA;&#x7684;<strong>ID</strong>&#x6216;&#x8005;&#x662F;&#x540D;&#x5B57;&#xFF0C;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x8981;&#x505A;&#x7684;&#x662F;&#xFF0C;&#x9A8C;&#x8BC1;&#x8F93;&#x5165;&#x56FE;&#x7247;&#x662F;&#x5426;&#x662F;&#x8FD9;&#x4E2A;&#x4EBA;&#x3002;&#x6709;&#x65F6;&#x5019;&#x4E5F;&#x88AB;&#x79F0;&#x4F5C;1&#x5BF9;1&#x95EE;&#x9898;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x5F04;&#x660E;&#x767D;&#x8FD9;&#x4E2A;&#x4EBA;&#x662F;&#x5426;&#x548C;&#x4ED6;&#x58F0;&#x79F0;&#x7684;&#x8EAB;&#x4EFD;&#x76F8;&#x7B26;&#x3002;</p>
<p>&#x800C;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x95EE;&#x9898;&#x6BD4;&#x4EBA;&#x8138;&#x9A8C;&#x8BC1;&#x95EE;&#x9898;&#x96BE;&#x5F88;&#x591A;&#xFF08;&#x6574;&#x7406;&#x8005;&#x6CE8;&#xFF1A;1&#x5BF9;&#x591A;&#x95EE;&#x9898;&#xFF08;$1:K$&#xFF09;&#xFF09;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x5047;&#x8BBE;&#x4F60;&#x6709;&#x4E00;&#x4E2A;&#x9A8C;&#x8BC1;&#x7CFB;&#x7EDF;&#xFF0C;&#x51C6;&#x786E;&#x7387;&#x662F;99%&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x3002;&#x4F46;&#x662F;&#x73B0;&#x5728;&#xFF0C;&#x5047;&#x8BBE;&#x5728;&#x8BC6;&#x522B;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;$K=100$&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x628A;&#x8FD9;&#x4E2A;&#x9A8C;&#x8BC1;&#x7CFB;&#x7EDF;&#x5E94;&#x7528;&#x5728;100&#x4E2A;&#x4EBA;&#x8EAB;&#x4E0A;&#xFF0C;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x4E0A;&#xFF0C;&#x4F60;&#x72AF;&#x9519;&#x7684;&#x673A;&#x4F1A;&#x5C31;&#x662F;100&#x500D;&#x4E86;&#x3002;&#x5982;&#x679C;&#x6BCF;&#x4E2A;&#x4EBA;&#x72AF;&#x9519;&#x7684;&#x6982;&#x7387;&#x662F;1%&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;&#x4E00;&#x4E2A;&#x4E0A;&#x767E;&#x4EBA;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#x8BC6;&#x522B;&#x8BEF;&#x5DEE;&#xFF0C;&#x4F60;&#x8981;&#x6784;&#x9020;&#x4E00;&#x4E2A;&#x9A8C;&#x8BC1;&#x7CFB;&#x7EDF;&#xFF0C;&#x5176;&#x51C6;&#x786E;&#x7387;&#x4E3A;99.9%&#x6216;&#x8005;&#x66F4;&#x9AD8;&#xFF0C;&#x7136;&#x540E;&#x624D;&#x53EF;&#x4EE5;&#x5728;100&#x4EBA;&#x7684;&#x6570;&#x636E;&#x5E93;&#x4E0A;&#x8FD0;&#x884C;&#xFF0C;&#x800C;&#x4FDD;&#x8BC1;&#x6709;&#x5F88;&#x5927;&#x51E0;&#x7387;&#x4E0D;&#x51FA;&#x9519;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x4E2A;100&#x4EBA;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x6B63;&#x786E;&#x7387;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x8FDC;&#x5927;&#x4E8E;99%&#xFF0C;&#x624D;&#x80FD;&#x5F97;&#x5230;&#x5F88;&#x597D;&#x7684;&#x6548;&#x679C;&#x3002;</p>
<p><img src="../images/b0d5f91254b48dcc44944bfbdc05992b.png" alt=""></p>
<p>&#x5728;&#x4E4B;&#x540E;&#x7684;&#x51E0;&#x4E2A;&#x89C6;&#x9891;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4E3B;&#x8981;&#x8BB2;&#x6784;&#x9020;&#x4E00;&#x4E2A;&#x4EBA;&#x8138;&#x9A8C;&#x8BC1;&#xFF0C;&#x4F5C;&#x4E3A;&#x57FA;&#x672C;&#x6A21;&#x5757;&#xFF0C;&#x5982;&#x679C;&#x51C6;&#x786E;&#x7387;&#x591F;&#x9AD8;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x628A;&#x5B83;&#x7528;&#x5728;&#x8BC6;&#x522B;&#x7CFB;&#x7EDF;&#x4E0A;&#x3002;</p>
<p>&#x4E0B;&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5F00;&#x59CB;&#x8BA8;&#x8BBA;&#x5982;&#x4F55;&#x6784;&#x9020;&#x4EBA;&#x8138;&#x9A8C;&#x8BC1;&#x7CFB;&#x7EDF;&#xFF0C;&#x4EBA;&#x8138;&#x9A8C;&#x8BC1;&#x4E4B;&#x6240;&#x4EE5;&#x96BE;&#xFF0C;&#x539F;&#x56E0;&#x4E4B;&#x4E00;&#x5728;&#x4E8E;&#x8981;&#x89E3;&#x51B3;&#x201C;&#x4E00;&#x6B21;&#x5B66;&#x201D;&#xFF08;<strong>one-shot learning problem</strong>&#xFF09;&#x95EE;&#x9898;&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x4E0B;&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#xFF0C;&#x4EC0;&#x4E48;&#x662F;&#x4E00;&#x6B21;&#x5B66;&#x4E60;&#x95EE;&#x9898;&#x3002;</p>
<h3 id="42-one-shot&#x5B66;&#x4E60;&#xFF08;one-shot-learning&#xFF09;">4.2 One-Shot&#x5B66;&#x4E60;&#xFF08;One-shot learning&#xFF09;</h3>
<p>&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x6240;&#x9762;&#x4E34;&#x7684;&#x4E00;&#x4E2A;&#x6311;&#x6218;&#x5C31;&#x662F;&#x4F60;&#x9700;&#x8981;&#x89E3;&#x51B3;&#x4E00;&#x6B21;&#x5B66;&#x4E60;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5728;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x5E94;&#x7528;&#x4E2D;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x5355;&#x5355;&#x4E00;&#x5F20;&#x56FE;&#x7247;&#x6216;&#x8005;&#x5355;&#x5355;&#x4E00;&#x4E2A;&#x4EBA;&#x8138;&#x6837;&#x4F8B;&#x5C31;&#x80FD;&#x53BB;&#x8BC6;&#x522B;&#x8FD9;&#x4E2A;&#x4EBA;&#x3002;&#x800C;&#x5386;&#x53F2;&#x4E0A;&#xFF0C;&#x5F53;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x8BAD;&#x7EC3;&#x6837;&#x4F8B;&#x65F6;&#xFF0C;&#x5B83;&#x7684;&#x8868;&#x73B0;&#x5E76;&#x4E0D;&#x597D;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x4E00;&#x4E2A;&#x76F4;&#x89C2;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5E76;&#x8BA8;&#x8BBA;&#x5982;&#x4F55;&#x53BB;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<p><img src="../images/caacd6c34068c73d285698ae5da34c33.png" alt=""></p>
<p>&#x5047;&#x8BBE;&#x4F60;&#x7684;&#x6570;&#x636E;&#x5E93;&#x91CC;&#x6709;4&#x5F20;&#x4F60;&#x4EEC;&#x516C;&#x53F8;&#x7684;&#x5458;&#x5DE5;&#x7167;&#x7247;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x4ED6;&#x4EEC;&#x786E;&#x5B9E;&#x662F;&#x6211;&#x4EEC;<strong>deeplearning.ai</strong>&#x7684;&#x5458;&#x5DE5;&#xFF0C;&#x5206;&#x522B;&#x662F;<strong>Kian</strong>&#xFF0C;<strong>Danielle</strong>&#xFF0C;<strong>Younes</strong>&#x548C;<strong>Tian</strong>&#x3002;&#x73B0;&#x5728;&#x5047;&#x8BBE;&#x6709;&#x4E2A;&#x4EBA;&#xFF08;&#x7F16;&#x53F7;1&#x6240;&#x793A;&#xFF09;&#x6765;&#x5230;&#x529E;&#x516C;&#x5BA4;&#xFF0C;&#x5E76;&#x4E14;&#x5979;&#x60F3;&#x901A;&#x8FC7;&#x5E26;&#x6709;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x7CFB;&#x7EDF;&#x7684;&#x6805;&#x95E8;&#xFF0C;&#x73B0;&#x5728;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#xFF0C;&#x4EC5;&#x4EC5;&#x901A;&#x8FC7;&#x4E00;&#x5F20;&#x5DF2;&#x6709;&#x7684;<strong>Danielle</strong>&#x7167;&#x7247;&#xFF0C;&#x6765;&#x8BC6;&#x522B;&#x524D;&#x9762;&#x8FD9;&#x4E2A;&#x4EBA;&#x786E;&#x5B9E;&#x662F;&#x5979;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5982;&#x679C;&#x673A;&#x5668;&#x770B;&#x5230;&#x4E00;&#x4E2A;&#x4E0D;&#x5728;&#x6570;&#x636E;&#x5E93;&#x91CC;&#x7684;&#x4EBA;&#xFF08;&#x7F16;&#x53F7;2&#x6240;&#x793A;&#xFF09;&#xFF0C;&#x673A;&#x5668;&#x5E94;&#x8BE5;&#x80FD;&#x5206;&#x8FA8;&#x51FA;&#x5979;&#x4E0D;&#x662F;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x56DB;&#x4E2A;&#x4EBA;&#x4E4B;&#x4E00;&#x3002;</p>
<p><img src="../images/a44671322cb67db58ce08068353708db.png" alt=""></p>
<p>&#x6240;&#x4EE5;&#x5728;&#x4E00;&#x6B21;&#x5B66;&#x4E60;&#x95EE;&#x9898;&#x4E2D;&#xFF0C;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x6837;&#x672C;&#x8FDB;&#x884C;&#x5B66;&#x4E60;&#xFF0C;&#x4EE5;&#x80FD;&#x591F;&#x8BA4;&#x51FA;&#x540C;&#x4E00;&#x4E2A;&#x4EBA;&#x3002;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x7CFB;&#x7EDF;&#x90FD;&#x9700;&#x8981;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x4F60;&#x7684;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x6BCF;&#x4E2A;&#x96C7;&#x5458;&#x6216;&#x8005;&#x7EC4;&#x5458;&#x53EF;&#x80FD;&#x90FD;&#x53EA;&#x6709;&#x4E00;&#x5F20;&#x7167;&#x7247;&#x3002;</p>
<p><img src="../images/26eb4f2409bc863471eee4d3e9da3c53.png" alt=""></p>
<p>&#x6709;&#x4E00;&#x79CD;&#x529E;&#x6CD5;&#x662F;&#xFF0C;&#x5C06;&#x4EBA;&#x7684;&#x7167;&#x7247;&#x653E;&#x8FDB;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#xFF0C;&#x4F7F;&#x7528;<strong>softmax</strong>&#x5355;&#x5143;&#x6765;&#x8F93;&#x51FA;4&#x79CD;&#xFF0C;&#x6216;&#x8005;&#x8BF4;5&#x79CD;&#x6807;&#x7B7E;&#xFF0C;&#x5206;&#x522B;&#x5BF9;&#x5E94;&#x8FD9;4&#x4E2A;&#x4EBA;&#xFF0C;&#x6216;&#x8005;4&#x4E2A;&#x90FD;&#x4E0D;&#x662F;&#xFF0C;&#x6240;&#x4EE5;<strong>softmax</strong>&#x91CC;&#x6211;&#x4EEC;&#x4F1A;&#x6709;5&#x79CD;&#x8F93;&#x51FA;&#x3002;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#x8FD9;&#x6837;&#x6548;&#x679C;&#x5E76;&#x4E0D;&#x597D;&#xFF0C;&#x56E0;&#x4E3A;&#x5982;&#x6B64;&#x5C0F;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0D;&#x8DB3;&#x4EE5;&#x53BB;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x7A33;&#x5065;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;</p>
<p><img src="../images/261614878aff990556fc363521af1409.png" alt=""></p>
<p>&#x800C;&#x4E14;&#xFF0C;&#x5047;&#x5982;&#x6709;&#x65B0;&#x4EBA;&#x52A0;&#x5165;&#x4F60;&#x7684;&#x56E2;&#x961F;&#xFF0C;&#x4F60;&#x73B0;&#x5728;&#x5C06;&#x4F1A;&#x6709;5&#x4E2A;&#x7EC4;&#x5458;&#x9700;&#x8981;&#x8BC6;&#x522B;&#xFF0C;&#x6240;&#x4EE5;&#x8F93;&#x51FA;&#x5C31;&#x53D8;&#x6210;&#x4E86;6&#x79CD;&#xFF0C;&#x8FD9;&#x65F6;&#x4F60;&#x8981;&#x91CD;&#x65B0;&#x8BAD;&#x7EC3;&#x4F60;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5417;&#xFF1F;&#x8FD9;&#x542C;&#x8D77;&#x6765;&#x5B9E;&#x5728;&#x4E0D;&#x50CF;&#x4E00;&#x4E2A;&#x597D;&#x529E;&#x6CD5;&#x3002;</p>
<p><img src="../images/8b3b58571307fce29dbced077bd86ea7.png" alt=""></p>
<p>&#x6240;&#x4EE5;&#x8981;&#x8BA9;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x80FD;&#x591F;&#x505A;&#x5230;&#x4E00;&#x6B21;&#x5B66;&#x4E60;&#xFF0C;&#x4E3A;&#x4E86;&#x80FD;&#x6709;&#x66F4;&#x597D;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x4F60;&#x73B0;&#x5728;&#x8981;&#x505A;&#x7684;&#x5E94;&#x8BE5;&#x662F;&#x5B66;&#x4E60;<strong>Similarity</strong>&#x51FD;&#x6570;&#x3002;&#x8BE6;&#x7EC6;&#x5730;&#x8BF4;&#xFF0C;&#x4F60;&#x60F3;&#x8981;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5B66;&#x4E60;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x7528;$d$&#x8868;&#x793A;&#x7684;&#x51FD;&#x6570;&#xFF0C;$d(img1,img2) = degree\ of\ difference\ between\ images$&#xFF0C;&#x5B83;&#x4EE5;&#x4E24;&#x5F20;&#x56FE;&#x7247;&#x4F5C;&#x4E3A;&#x8F93;&#x5165;&#xFF0C;&#x7136;&#x540E;&#x8F93;&#x51FA;&#x8FD9;&#x4E24;&#x5F20;&#x56FE;&#x7247;&#x7684;&#x5DEE;&#x5F02;&#x503C;&#x3002;&#x5982;&#x679C;&#x4F60;&#x653E;&#x8FDB;&#x540C;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x4E24;&#x5F20;&#x7167;&#x7247;&#xFF0C;&#x4F60;&#x5E0C;&#x671B;&#x5B83;&#x80FD;&#x8F93;&#x51FA;&#x4E00;&#x4E2A;&#x5F88;&#x5C0F;&#x7684;&#x503C;&#xFF0C;&#x5982;&#x679C;&#x653E;&#x8FDB;&#x4E24;&#x4E2A;&#x957F;&#x76F8;&#x5DEE;&#x522B;&#x5F88;&#x5927;&#x7684;&#x4EBA;&#x7684;&#x7167;&#x7247;&#xFF0C;&#x5B83;&#x5C31;&#x8F93;&#x51FA;&#x4E00;&#x4E2A;&#x5F88;&#x5927;&#x7684;&#x503C;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x8BC6;&#x522B;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x4E24;&#x5F20;&#x56FE;&#x7247;&#x7684;&#x5DEE;&#x5F02;&#x503C;&#x5C0F;&#x4E8E;&#x67D0;&#x4E2A;&#x9608;&#x503C;$\tau$&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x8D85;&#x53C2;&#x6570;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x65F6;&#x5C31;&#x80FD;&#x9884;&#x6D4B;&#x8FD9;&#x4E24;&#x5F20;&#x56FE;&#x7247;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x5982;&#x679C;&#x5DEE;&#x5F02;&#x503C;&#x5927;&#x4E8E;&#x3C4;&#xFF0C;&#x5C31;&#x80FD;&#x9884;&#x6D4B;&#x8FD9;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x4E24;&#x4E2A;&#x4EBA;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x89E3;&#x51B3;&#x4EBA;&#x8138;&#x9A8C;&#x8BC1;&#x95EE;&#x9898;&#x7684;&#x4E00;&#x4E2A;&#x53EF;&#x884C;&#x529E;&#x6CD5;&#x3002;</p>
<p><img src="../images/f46e9ff3ef4819665b487a81784ab821.png" alt=""></p>
<p>&#x8981;&#x5C06;&#x5B83;&#x5E94;&#x7528;&#x4E8E;&#x8BC6;&#x522B;&#x4EFB;&#x52A1;&#xFF0C;&#x4F60;&#x8981;&#x505A;&#x7684;&#x662F;&#x62FF;&#x8FD9;&#x5F20;&#x65B0;&#x56FE;&#x7247;&#xFF08;&#x7F16;&#x53F7;6&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x7528;$d$&#x51FD;&#x6570;&#x53BB;&#x6BD4;&#x8F83;&#x8FD9;&#x4E24;&#x5F20;&#x56FE;&#x7247;&#xFF08;&#x7F16;&#x53F7;1&#x548C;&#x7F16;&#x53F7;6&#xFF09;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x80FD;&#x4F1A;&#x8F93;&#x51FA;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x5927;&#x7684;&#x6570;&#x5B57;&#xFF0C;&#x5728;&#x8BE5;&#x4F8B;&#x4E2D;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x8FD9;&#x4E2A;&#x6570;&#x5B57;&#x662F;10&#x3002;&#x4E4B;&#x540E;&#x4F60;&#x518D;&#x8BA9;&#x5B83;&#x548C;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7B2C;&#x4E8C;&#x5F20;&#x56FE;&#xFF08;&#x7F16;&#x53F7;2&#xFF09;&#x7247;&#x6BD4;&#x8F83;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E24;&#x5F20;&#x7167;&#x7247;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x4F1A;&#x8F93;&#x51FA;&#x4E00;&#x4E2A;&#x5F88;&#x5C0F;&#x7684;&#x6570;&#x3002;&#x7136;&#x540E;&#x4F60;&#x518D;&#x7528;&#x5B83;&#x4E0E;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x5176;&#x4ED6;&#x56FE;&#x7247;&#xFF08;&#x7F16;&#x53F7;3&#x3001;4&#xFF09;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#xFF0C;&#x901A;&#x8FC7;&#x8FD9;&#x6837;&#x7684;&#x8BA1;&#x7B97;&#xFF0C;&#x6700;&#x7EC8;&#x4F60;&#x80FD;&#x591F;&#x77E5;&#x9053;&#xFF0C;&#x8FD9;&#x4E2A;&#x4EBA;&#x786E;&#x5B9E;&#x662F;<strong>Danielle</strong>&#x3002;</p>
<p>&#x5BF9;&#x5E94;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x67D0;&#x4E2A;&#x4EBA;&#xFF08;&#x7F16;&#x53F7;7&#xFF09;&#x4E0D;&#x5728;&#x4F60;&#x7684;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x4F60;&#x901A;&#x8FC7;&#x51FD;&#x6570;$d$&#x5C06;&#x4ED6;&#x4EEC;&#x7684;&#x7167;&#x7247;&#x4E24;&#x4E24;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#xFF0C;&#x6700;&#x540E;&#x6211;&#x4EEC;&#x5E0C;&#x671B;$d$&#x4F1A;&#x5BF9;&#x6240;&#x6709;&#x7684;&#x6BD4;&#x8F83;&#x90FD;&#x8F93;&#x51FA;&#x4E00;&#x4E2A;&#x5F88;&#x5927;&#x7684;&#x503C;&#xFF0C;&#x8FD9;&#x5C31;&#x8BC1;&#x660E;&#x8FD9;&#x4E2A;&#x4EBA;&#x5E76;&#x4E0D;&#x662F;&#x6570;&#x636E;&#x5E93;&#x4E2D;4&#x4E2A;&#x4EBA;&#x7684;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x3002;</p>
<p>&#x8981;&#x6CE8;&#x610F;&#x5728;&#x8FD9;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F60;&#x662F;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x4E00;&#x6B21;&#x5B66;&#x4E60;&#x95EE;&#x9898;&#x7684;&#xFF0C;&#x53EA;&#x8981;&#x4F60;&#x80FD;&#x5B66;&#x4E60;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;$d$&#xFF0C;&#x901A;&#x8FC7;&#x8F93;&#x5165;&#x4E00;&#x5BF9;&#x56FE;&#x7247;&#xFF0C;&#x5B83;&#x5C06;&#x4F1A;&#x544A;&#x8BC9;&#x4F60;&#x8FD9;&#x4E24;&#x5F20;&#x56FE;&#x7247;&#x662F;&#x5426;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x4EBA;&#x3002;&#x5982;&#x679C;&#x4E4B;&#x540E;&#x6709;&#x65B0;&#x4EBA;&#x52A0;&#x5165;&#x4E86;&#x4F60;&#x7684;&#x56E2;&#x961F;&#xFF08;&#x7F16;&#x53F7;5&#xFF09;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x5C06;&#x4ED6;&#x7684;&#x7167;&#x7247;&#x52A0;&#x5165;&#x4F60;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x7CFB;&#x7EDF;&#x4F9D;&#x7136;&#x80FD;&#x7167;&#x5E38;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x4F60;&#x5DF2;&#x7ECF;&#x77E5;&#x9053;&#x51FD;&#x6570;d&#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#xFF0C;&#x901A;&#x8FC7;&#x8F93;&#x5165;&#x4E24;&#x5F20;&#x7167;&#x7247;&#xFF0C;&#x5B83;&#x5C06;&#x8BA9;&#x4F60;&#x80FD;&#x591F;&#x89E3;&#x51B3;&#x4E00;&#x6B21;&#x5B66;&#x4E60;&#x95EE;&#x9898;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x4E0B;&#x8282;&#x89C6;&#x9891;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x8BAD;&#x7EC3;&#x4F60;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5B66;&#x4F1A;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;$d$&#x3002;</p>
<h3 id="43-siamese-&#x7F51;&#x7EDC;&#xFF08;siamese-network&#xFF09;">4.3 Siamese &#x7F51;&#x7EDC;&#xFF08;Siamese network&#xFF09;</h3>
<p>&#x4E0A;&#x4E2A;&#x89C6;&#x9891;&#x4E2D;&#x4F60;&#x5B66;&#x5230;&#x7684;&#x51FD;&#x6570;$d$&#x7684;&#x4F5C;&#x7528;&#x5C31;&#x662F;&#x8F93;&#x5165;&#x4E24;&#x5F20;&#x4EBA;&#x8138;&#xFF0C;&#x7136;&#x540E;&#x544A;&#x8BC9;&#x4F60;&#x5B83;&#x4EEC;&#x7684;&#x76F8;&#x4F3C;&#x5EA6;&#x3002;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x7684;&#x4E00;&#x4E2A;&#x65B9;&#x5F0F;&#x5C31;&#x662F;&#x7528;<strong>Siamese</strong>&#x7F51;&#x7EDC;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x4E00;&#x4E0B;&#x3002;</p>
<p><img src="../images/18679869eb23651215b517b0f00806f5.png" alt=""></p>
<p>&#x4F60;&#x7ECF;&#x5E38;&#x770B;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#xFF0C;&#x8F93;&#x5165;&#x56FE;&#x7247;$x^{(1)}$&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x4E00;&#x4E9B;&#x5217;&#x5377;&#x79EF;&#xFF0C;&#x6C60;&#x5316;&#x548C;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#xFF0C;&#x6700;&#x7EC8;&#x5F97;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x7279;&#x5F81;&#x5411;&#x91CF;&#xFF08;&#x7F16;&#x53F7;1&#xFF09;&#x3002;&#x6709;&#x65F6;&#x8FD9;&#x4E2A;&#x4F1A;&#x88AB;&#x9001;&#x8FDB;<strong>softmax</strong>&#x5355;&#x5143;&#x6765;&#x505A;&#x5206;&#x7C7B;&#xFF0C;&#x4F46;&#x5728;&#x8FD9;&#x4E2A;&#x89C6;&#x9891;&#x91CC;&#x6211;&#x4EEC;&#x4E0D;&#x4F1A;&#x8FD9;&#x4E48;&#x505A;&#x3002;&#x6211;&#x4EEC;&#x5173;&#x6CE8;&#x7684;&#x91CD;&#x70B9;&#x662F;&#x8FD9;&#x4E2A;&#x5411;&#x91CF;&#xFF08;&#x7F16;&#x53F7;1&#xFF09;&#xFF0C;&#x5047;&#x5982;&#x5B83;&#x6709;128&#x4E2A;&#x6570;&#xFF0C;&#x5B83;&#x662F;&#x7531;&#x7F51;&#x7EDC;&#x6DF1;&#x5C42;&#x7684;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x8BA1;&#x7B97;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x6211;&#x8981;&#x7ED9;&#x8FD9;128&#x4E2A;&#x6570;&#x547D;&#x4E2A;&#x540D;&#x5B57;&#xFF0C;&#x628A;&#x5B83;&#x53EB;&#x505A;$f(x^{(1)})$&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x628A;$f(x^{(1)})$&#x770B;&#x4F5C;&#x662F;&#x8F93;&#x5165;&#x56FE;&#x50CF;$x^{(1)}$&#x7684;&#x7F16;&#x7801;&#xFF0C;&#x53D6;&#x8FD9;&#x4E2A;&#x8F93;&#x5165;&#x56FE;&#x50CF;&#xFF08;&#x7F16;&#x53F7;2&#xFF09;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x662F;<strong>Kian</strong>&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x7136;&#x540E;&#x8868;&#x793A;&#x6210;128&#x7EF4;&#x7684;&#x5411;&#x91CF;&#x3002;</p>
<p><img src="../images/ecd4f7ca6487b4ccb19c1f5039e9d876.png" alt=""></p>
<p>&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x7CFB;&#x7EDF;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8981;&#x6BD4;&#x8F83;&#x4E24;&#x4E2A;&#x56FE;&#x7247;&#x7684;&#x8BDD;&#xFF0C;&#x4F8B;&#x5982;&#x8FD9;&#x91CC;&#x7684;&#x7B2C;&#x4E00;&#x5F20;&#xFF08;&#x7F16;&#x53F7;1&#xFF09;&#x548C;&#x7B2C;&#x4E8C;&#x5F20;&#x56FE;&#x7247;&#xFF08;&#x7F16;&#x53F7;2&#xFF09;&#xFF0C;&#x4F60;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x628A;&#x7B2C;&#x4E8C;&#x5F20;&#x56FE;&#x7247;&#x5582;&#x7ED9;&#x6709;&#x540C;&#x6837;&#x53C2;&#x6570;&#x7684;&#x540C;&#x6837;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x7136;&#x540E;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x4E0D;&#x540C;&#x7684;128&#x7EF4;&#x7684;&#x5411;&#x91CF;&#xFF08;&#x7F16;&#x53F7;3&#xFF09;&#xFF0C;&#x8FD9;&#x4E2A;&#x5411;&#x91CF;&#x4EE3;&#x8868;&#x6216;&#x8005;&#x7F16;&#x7801;&#x7B2C;&#x4E8C;&#x4E2A;&#x56FE;&#x7247;&#xFF0C;&#x6211;&#x8981;&#x628A;&#x7B2C;&#x4E8C;&#x5F20;&#x56FE;&#x7247;&#x7684;&#x7F16;&#x7801;&#x53EB;&#x505A;$f(x^{(2)})$&#x3002;&#x8FD9;&#x91CC;&#x6211;&#x7528;$x^{(1)}$&#x548C;$x^{(2)}$&#x4EC5;&#x4EC5;&#x4EE3;&#x8868;&#x4E24;&#x4E2A;&#x8F93;&#x5165;&#x56FE;&#x7247;&#xFF0C;&#x4ED6;&#x4EEC;&#x6CA1;&#x5FC5;&#x8981;&#x975E;&#x662F;&#x7B2C;&#x4E00;&#x4E2A;&#x548C;&#x7B2C;&#x4E8C;&#x4E2A;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#xFF0C;&#x53EF;&#x4EE5;&#x662F;&#x4EFB;&#x610F;&#x4E24;&#x4E2A;&#x56FE;&#x7247;&#x3002;</p>
<p>&#x6700;&#x540E;&#x5982;&#x679C;&#x4F60;&#x76F8;&#x4FE1;&#x8FD9;&#x4E9B;&#x7F16;&#x7801;&#x5F88;&#x597D;&#x5730;&#x4EE3;&#x8868;&#x4E86;&#x8FD9;&#x4E24;&#x4E2A;&#x56FE;&#x7247;&#xFF0C;&#x4F60;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x5B9A;&#x4E49;$d$&#xFF0C;&#x5C06;$x^{(1)}$&#x548C;$x^{(2)}$&#x7684;&#x8DDD;&#x79BB;&#x5B9A;&#x4E49;&#x4E3A;&#x8FD9;&#x4E24;&#x5E45;&#x56FE;&#x7247;&#x7684;&#x7F16;&#x7801;&#x4E4B;&#x5DEE;&#x7684;&#x8303;&#x6570;&#xFF0C;$d( x^{( 1)},x^{( 2)}) =|| f( x^{( 1)}) - f( x^{( 2)})||_{2}^{2}$&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x8FD0;&#x884C;&#x76F8;&#x540C;&#x7684;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x7136;&#x540E;&#x6BD4;&#x8F83;&#x5B83;&#x4EEC;&#xFF0C;&#x8FD9;&#x4E00;&#x822C;&#x53EB;&#x505A;<strong>Siamese</strong>&#x7F51;&#x7EDC;&#x67B6;&#x6784;&#x3002;&#x8FD9;&#x91CC;&#x63D0;&#x5230;&#x7684;&#x5F88;&#x591A;&#x89C2;&#x70B9;&#xFF0C;&#x90FD;&#x6765;&#x81EA;&#x4E8E;<strong>Yaniv Taigman</strong>&#xFF0C;<strong>Ming Yang</strong>&#xFF0C;<strong>Marc&#x2019; Aurelio Ranzato</strong>&#xFF0C;<strong>Lior Wolf</strong>&#x7684;&#x8FD9;&#x7BC7;&#x8BBA;&#x6587;&#xFF0C;&#x4ED6;&#x4EEC;&#x5F00;&#x53D1;&#x7684;&#x7CFB;&#x7EDF;&#x53EB;&#x505A;<strong>DeepFace</strong>&#x3002;</p>
<p><img src="../images/214e009729b015bc6088200e3c1ca3cd.png" alt=""></p>
<p>&#x600E;&#x4E48;&#x8BAD;&#x7EC3;&#x8FD9;&#x4E2A;<strong>Siamese</strong>&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5462;&#xFF1F;&#x4E0D;&#x8981;&#x5FD8;&#x4E86;&#x8FD9;&#x4E24;&#x4E2A;&#x7F51;&#x7EDC;&#x6709;&#x76F8;&#x540C;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x5B9E;&#x9645;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#xFF0C;&#x5B83;&#x8BA1;&#x7B97;&#x5F97;&#x5230;&#x7684;&#x7F16;&#x7801;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x51FD;&#x6570;$d$&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x544A;&#x8BC9;&#x4F60;&#x4E24;&#x5F20;&#x56FE;&#x7247;&#x662F;&#x5426;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x4EBA;&#x3002;&#x66F4;&#x51C6;&#x786E;&#x5730;&#x8BF4;&#xFF0C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x53C2;&#x6570;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x7F16;&#x7801;&#x51FD;&#x6570;$f(x^{(i)})$&#xFF0C;&#x5982;&#x679C;&#x7ED9;&#x5B9A;&#x8F93;&#x5165;&#x56FE;&#x50CF;$x^{(i)}$&#xFF0C;&#x8FD9;&#x4E2A;&#x7F51;&#x7EDC;&#x4F1A;&#x8F93;&#x51FA;$x^{(i)}$&#x7684;128&#x7EF4;&#x7684;&#x7F16;&#x7801;&#x3002;&#x4F60;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x5B66;&#x4E60;&#x53C2;&#x6570;&#xFF0C;&#x4F7F;&#x5F97;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x56FE;&#x7247;$x^{( i)}$&#x548C;$x^{( j)}$&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x5F97;&#x5230;&#x7684;&#x4E24;&#x4E2A;&#x7F16;&#x7801;&#x7684;&#x8DDD;&#x79BB;&#x5C31;&#x5C0F;&#x3002;&#x524D;&#x9762;&#x51E0;&#x4E2A;&#x5E7B;&#x706F;&#x7247;&#x6211;&#x90FD;&#x7528;&#x7684;&#x662F;$x^{(1)}$&#x548C;$x^{( 2)}$&#xFF0C;&#x5176;&#x5B9E;&#x8BAD;&#x7EC3;&#x96C6;&#x91CC;&#x4EFB;&#x610F;&#x4E00;&#x5BF9;$x^{(i)}$&#x548C;$x^{(j)}$&#x90FD;&#x53EF;&#x4EE5;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5982;&#x679C;$x^{(i)}$&#x548C;$x^{(j)}$&#x662F;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x4F1A;&#x60F3;&#x8BA9;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x7F16;&#x7801;&#x8DDD;&#x79BB;&#x5927;&#x4E00;&#x70B9;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x6539;&#x53D8;&#x8FD9;&#x4E2A;&#x7F51;&#x7EDC;&#x6240;&#x6709;&#x5C42;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x4F60;&#x4F1A;&#x5F97;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x7F16;&#x7801;&#x7ED3;&#x679C;&#xFF0C;&#x4F60;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x7528;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x6765;&#x6539;&#x53D8;&#x8FD9;&#x4E9B;&#x6240;&#x6709;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x6EE1;&#x8DB3;&#x8FD9;&#x4E9B;&#x6761;&#x4EF6;&#x3002;</p>
<p>&#x4F60;&#x5DF2;&#x7ECF;&#x4E86;&#x89E3;&#x4E86;<strong>Siamese</strong>&#x7F51;&#x7EDC;&#x67B6;&#x6784;&#xFF0C;&#x5E76;&#x4E14;&#x77E5;&#x9053;&#x4F60;&#x60F3;&#x8981;&#x7F51;&#x7EDC;&#x8F93;&#x51FA;&#x4EC0;&#x4E48;&#xFF0C;&#x5373;&#x4EC0;&#x4E48;&#x662F;&#x597D;&#x7684;&#x7F16;&#x7801;&#x3002;&#x4F46;&#x662F;&#x5982;&#x4F55;&#x5B9A;&#x4E49;&#x5B9E;&#x9645;&#x7684;&#x76EE;&#x6807;&#x51FD;&#x6570;&#xFF0C;&#x80FD;&#x591F;&#x8BA9;&#x4F60;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5B66;&#x4E60;&#x5E76;&#x505A;&#x5230;&#x6211;&#x4EEC;&#x521A;&#x624D;&#x8BA8;&#x8BBA;&#x7684;&#x5185;&#x5BB9;&#x5462;&#xFF1F;&#x5728;&#x4E0B;&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x770B;&#x5230;&#x5982;&#x4F55;&#x7528;&#x4E09;&#x5143;&#x7EC4;&#x635F;&#x5931;&#x51FD;&#x6570;&#x8FBE;&#x5230;&#x8FD9;&#x4E2A;&#x76EE;&#x7684;&#x3002;</p>
<h3 id="44-triplet-&#x635F;&#x5931;&#xFF08;triplet-&#x635F;&#x5931;&#xFF09;">4.4 Triplet &#x635F;&#x5931;&#xFF08;Triplet &#x635F;&#x5931;&#xFF09;</h3>
<p>&#x8981;&#x60F3;&#x901A;&#x8FC7;&#x5B66;&#x4E60;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x53C2;&#x6570;&#x6765;&#x5F97;&#x5230;&#x4F18;&#x8D28;&#x7684;&#x4EBA;&#x8138;&#x56FE;&#x7247;&#x7F16;&#x7801;&#xFF0C;&#x65B9;&#x6CD5;&#x4E4B;&#x4E00;&#x5C31;&#x662F;&#x5B9A;&#x4E49;&#x4E09;&#x5143;&#x7EC4;&#x635F;&#x5931;&#x51FD;&#x6570;&#x7136;&#x540E;&#x5E94;&#x7528;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x3002;</p>
<p><img src="../images/c447ba74230d1c73a50fe7ae77bc2f4b.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x770B;&#x4E0B;&#x8FD9;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF0C;&#x4E3A;&#x4E86;&#x5E94;&#x7528;&#x4E09;&#x5143;&#x7EC4;&#x635F;&#x5931;&#x51FD;&#x6570;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x6BD4;&#x8F83;&#x6210;&#x5BF9;&#x7684;&#x56FE;&#x50CF;&#xFF0C;&#x6BD4;&#x5982;&#x8FD9;&#x4E2A;&#x56FE;&#x7247;&#xFF0C;&#x4E3A;&#x4E86;&#x5B66;&#x4E60;&#x7F51;&#x7EDC;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x540C;&#x65F6;&#x770B;&#x51E0;&#x5E45;&#x56FE;&#x7247;&#xFF0C;&#x6BD4;&#x5982;&#x8FD9;&#x5BF9;&#x56FE;&#x7247;&#xFF08;&#x7F16;&#x53F7;1&#x548C;&#x7F16;&#x53F7;2&#xFF09;&#xFF0C;&#x4F60;&#x60F3;&#x8981;&#x5B83;&#x4EEC;&#x7684;&#x7F16;&#x7801;&#x76F8;&#x4F3C;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x4EBA;&#x3002;&#x7136;&#x800C;&#x5047;&#x5982;&#x662F;&#x8FD9;&#x5BF9;&#x56FE;&#x7247;&#xFF08;&#x7F16;&#x53F7;3&#x548C;&#x7F16;&#x53F7;4&#xFF09;&#xFF0C;&#x4F60;&#x4F1A;&#x60F3;&#x8981;&#x5B83;&#x4EEC;&#x7684;&#x7F16;&#x7801;&#x5DEE;&#x5F02;&#x5927;&#x4E00;&#x4E9B;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#x3002;</p>
<p>&#x7528;&#x4E09;&#x5143;&#x7EC4;&#x635F;&#x5931;&#x7684;&#x672F;&#x8BED;&#x6765;&#x8BF4;&#xFF0C;&#x4F60;&#x8981;&#x505A;&#x7684;&#x901A;&#x5E38;&#x662F;&#x770B;&#x4E00;&#x4E2A; <strong>Anchor</strong> &#x56FE;&#x7247;&#xFF0C;&#x4F60;&#x60F3;&#x8BA9;<strong>Anchor</strong>&#x56FE;&#x7247;&#x548C;<strong>Positive</strong>&#x56FE;&#x7247;&#xFF08;<strong>Positive</strong>&#x610F;&#x5473;&#x7740;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x4EBA;&#xFF09;&#x7684;&#x8DDD;&#x79BB;&#x5F88;&#x63A5;&#x8FD1;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5F53;<strong>Anchor</strong>&#x56FE;&#x7247;&#x4E0E;<strong>Negative</strong>&#x56FE;&#x7247;&#xFF08;<strong>Negative</strong>&#x610F;&#x5473;&#x7740;&#x662F;&#x975E;&#x540C;&#x4E00;&#x4E2A;&#x4EBA;&#xFF09;&#x5BF9;&#x6BD4;&#x65F6;&#xFF0C;&#x4F60;&#x4F1A;&#x60F3;&#x8BA9;&#x4ED6;&#x4EEC;&#x7684;&#x8DDD;&#x79BB;&#x79BB;&#x5F97;&#x66F4;&#x8FDC;&#x4E00;&#x70B9;&#x3002;</p>
<p><img src="../images/d56e1c92b45d8b9e76c1592fdbf0fc7f.png" alt=""></p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x53EB;&#x505A;&#x4E09;&#x5143;&#x7EC4;&#x635F;&#x5931;&#xFF0C;&#x5B83;&#x4EE3;&#x8868;&#x4F60;&#x901A;&#x5E38;&#x4F1A;&#x540C;&#x65F6;&#x770B;&#x4E09;&#x5F20;&#x56FE;&#x7247;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x770B;<strong>Anchor</strong>&#x56FE;&#x7247;&#x3001;<strong>Postive</strong>&#x56FE;&#x7247;&#xFF0C;&#x8FD8;&#x6709;<strong>Negative</strong>&#x56FE;&#x7247;&#xFF0C;&#x6211;&#x8981;&#x628A;<strong>Anchor</strong>&#x56FE;&#x7247;&#x3001;<strong>Positive</strong>&#x56FE;&#x7247;&#x548C;<strong>Negative</strong>&#x56FE;&#x7247;&#x7B80;&#x5199;&#x6210;$A$&#x3001;$P$&#x3001;$N$&#x3002;</p>
<p>&#x628A;&#x8FD9;&#x4E9B;&#x5199;&#x6210;&#x516C;&#x5F0F;&#x7684;&#x8BDD;&#xFF0C;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x662F;&#x7F51;&#x7EDC;&#x7684;&#x53C2;&#x6570;&#x6216;&#x8005;&#x7F16;&#x7801;&#x80FD;&#x591F;&#x6EE1;&#x8DB3;&#x4EE5;&#x4E0B;&#x7279;&#x6027;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x4F60;&#x60F3;&#x8981;$|| f(A) - f(P) ||^{2}$&#xFF0C;&#x4F60;&#x5E0C;&#x671B;&#x8FD9;&#x4E2A;&#x6570;&#x503C;&#x5F88;&#x5C0F;&#xFF0C;&#x51C6;&#x786E;&#x5730;&#x8BF4;&#xFF0C;&#x4F60;&#x60F3;&#x8BA9;&#x5B83;&#x5C0F;&#x4E8E;&#x7B49;$f(A)$&#x548C;$f(N)$&#x4E4B;&#x95F4;&#x7684;&#x8DDD;&#x79BB;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x662F;&#x5B83;&#x4EEC;&#x7684;&#x8303;&#x6570;&#x7684;&#x5E73;&#x65B9;&#xFF08;&#x5373;&#xFF1A;$|| f(A) - f(P)||^{2} \leq ||f(A) - f(N)||^{2}$&#xFF09;&#x3002;&#xFF08;$|| f(A) - f(P) ||^{2}$&#xFF09;&#x5F53;&#x7136;&#x8FD9;&#x5C31;&#x662F;$d(A,P)$&#xFF0C;&#xFF08;$|| f(A) - f(N) ||^{2}$&#xFF09;&#x8FD9;&#x662F;$d(A,N)$&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x628A;$d$ &#x770B;&#x4F5C;&#x662F;&#x8DDD;&#x79BB;(<strong>distance</strong>)&#x51FD;&#x6570;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x628A;&#x5B83;&#x547D;&#x540D;&#x4E3A;$d$&#x3002;</p>
<p><img src="../images/76d6eaae60caea5f2c4fcca0db226737.png" alt=""></p>
<p>&#x73B0;&#x5728;&#x5982;&#x679C;&#x6211;&#x628A;&#x65B9;&#x7A0B;&#x53F3;&#x8FB9;&#x9879;&#x79FB;&#x5230;&#x5DE6;&#x8FB9;&#xFF0C;&#x6700;&#x7EC8;&#x5C31;&#x5F97;&#x5230;&#xFF1A;</p>
<p>$|| f(A) - f(P)||^{2} \leq ||f(A) - f(N)||^{2}$</p>
<p>&#x73B0;&#x5728;&#x6211;&#x8981;&#x5BF9;&#x8FD9;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x505A;&#x4E00;&#x4E9B;&#x5C0F;&#x7684;&#x6539;&#x53D8;&#xFF0C;&#x6709;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#x6EE1;&#x8DB3;&#x8FD9;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x4F46;&#x662F;&#x6CA1;&#x6709;&#x7528;&#x5904;&#xFF0C;&#x5C31;&#x662F;&#x628A;&#x6240;&#x6709;&#x7684;&#x4E1C;&#x897F;&#x90FD;&#x5B66;&#x6210;0&#xFF0C;&#x5982;&#x679C;$f$&#x603B;&#x662F;&#x8F93;&#x51FA;0&#xFF0C;&#x5373;0-0&#x2264;0&#xFF0C;&#x8FD9;&#x5C31;&#x662F;0&#x51CF;&#x53BB;0&#x8FD8;&#x7B49;&#x4E8E;0&#xFF0C;&#x5982;&#x679C;&#x6240;&#x6709;&#x56FE;&#x50CF;&#x7684;$f$&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x96F6;&#x5411;&#x91CF;&#xFF0C;&#x90A3;&#x4E48;&#x603B;&#x80FD;&#x6EE1;&#x8DB3;&#x8FD9;&#x4E2A;&#x65B9;&#x7A0B;&#x3002;&#x6240;&#x4EE5;&#x4E3A;&#x4E86;&#x786E;&#x4FDD;&#x7F51;&#x7EDC;&#x5BF9;&#x4E8E;&#x6240;&#x6709;&#x7684;&#x7F16;&#x7801;&#x4E0D;&#x4F1A;&#x603B;&#x662F;&#x8F93;&#x51FA;0&#xFF0C;&#x4E5F;&#x4E3A;&#x4E86;&#x786E;&#x4FDD;&#x5B83;&#x4E0D;&#x4F1A;&#x628A;&#x6240;&#x6709;&#x7684;&#x7F16;&#x7801;&#x90FD;&#x8BBE;&#x6210;&#x4E92;&#x76F8;&#x76F8;&#x7B49;&#x7684;&#x3002;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x80FD;&#x8BA9;&#x7F51;&#x7EDC;&#x5F97;&#x5230;&#x8FD9;&#x79CD;&#x6CA1;&#x7528;&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x5C31;&#x662F;&#x5982;&#x679C;&#x6BCF;&#x4E2A;&#x56FE;&#x7247;&#x7684;&#x7F16;&#x7801;&#x548C;&#x5176;&#x4ED6;&#x56FE;&#x7247;&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x4F60;&#x8FD8;&#x662F;&#x5F97;&#x5230;0-0&#x3002;</p>
<p><img src="../images/eadc17c7748d8d2c36d74fa95e317e0d.png" alt=""></p>
<p>&#x4E3A;&#x4E86;&#x963B;&#x6B62;&#x7F51;&#x7EDC;&#x51FA;&#x73B0;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E0D;&#x80FD;&#x662F;&#x521A;&#x597D;&#x5C0F;&#x4E8E;&#x7B49;&#x4E8E;0&#xFF0C;&#x5E94;&#x8BE5;&#x662F;&#x6BD4;0&#x8FD8;&#x8981;&#x5C0F;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x5E94;&#x8BE5;&#x5C0F;&#x4E8E;&#x4E00;&#x4E2A;$-a$&#x503C;&#xFF08;&#x5373;$|| f(A) - f(P)||^{2} -||f(A) - f(N)||^{2} \leq -a$&#xFF09;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;$a$&#x662F;&#x53E6;&#x4E00;&#x4E2A;&#x8D85;&#x53C2;&#x6570;&#xFF0C;&#x8FD9;&#x4E2A;&#x5C31;&#x53EF;&#x4EE5;&#x963B;&#x6B62;&#x7F51;&#x7EDC;&#x8F93;&#x51FA;&#x65E0;&#x7528;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x6309;&#x7167;&#x60EF;&#x4F8B;&#xFF0C;&#x6211;&#x4EEC;&#x4E60;&#x60EF;&#x5199;$+a$&#xFF08;&#x5373;$|| f(A) - f(P)||^{2} -||f(A) - f(N)||^{2} +a\leq0$&#xFF09;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x628A;$-a$&#x5199;&#x5728;&#x540E;&#x9762;&#xFF0C;&#x5B83;&#x4E5F;&#x53EB;&#x505A;&#x95F4;&#x9694;(<strong>margin</strong>)&#xFF0C;&#x8FD9;&#x4E2A;&#x672F;&#x8BED;&#x4F60;&#x4F1A;&#x5F88;&#x719F;&#x6089;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x770B;&#x8FC7;&#x5173;&#x4E8E;&#x652F;&#x6301;&#x5411;&#x91CF;&#x673A; (<strong>SVM</strong>)&#x7684;&#x6587;&#x732E;&#xFF0C;&#x6CA1;&#x770B;&#x8FC7;&#x4E5F;&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x628A;&#x4E0A;&#x9762;&#x8FD9;&#x4E2A;&#x65B9;&#x7A0B;&#xFF08;$|| f(A) - f(P)||^{2}  -||f(A) - f(N)||^{2}$&#xFF09;&#x4E5F;&#x4FEE;&#x6539;&#x4E00;&#x4E0B;&#xFF0C;&#x52A0;&#x4E0A;&#x8FD9;&#x4E2A;&#x95F4;&#x9694;&#x53C2;&#x6570;&#x3002;haox </p>
<p>&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5047;&#x5982;&#x95F4;&#x9694;&#x8BBE;&#x7F6E;&#x6210;0.2&#xFF0C;&#x5982;&#x679C;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;$d(A,P) =0.5$&#xFF0C;&#x5982;&#x679C; <strong>Anchor</strong>&#x548C; <strong>Negative</strong>&#x56FE;&#x7247;&#x7684;$d$&#xFF0C;&#x5373;$d(A,N)$&#x53EA;&#x5927;&#x4E00;&#x70B9;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;0.51&#xFF0C;&#x6761;&#x4EF6;&#x5C31;&#x4E0D;&#x80FD;&#x6EE1;&#x8DB3;&#x3002;&#x867D;&#x7136;0.51&#x4E5F;&#x662F;&#x5927;&#x4E8E;0.5&#x7684;&#xFF0C;&#x4F46;&#x8FD8;&#x662F;&#x4E0D;&#x591F;&#x597D;&#xFF0C;&#x6211;&#x4EEC;&#x60F3;&#x8981;$d(A,N)$&#x6BD4;$d(A,P)$&#x5927;&#x5F88;&#x591A;&#xFF0C;&#x4F60;&#x4F1A;&#x60F3;&#x8BA9;&#x8FD9;&#x4E2A;&#x503C;&#xFF08;$d(A,N)$&#xFF09;&#x81F3;&#x5C11;&#x662F;0.7&#x6216;&#x8005;&#x66F4;&#x9AD8;&#xFF0C;&#x6216;&#x8005;&#x4E3A;&#x4E86;&#x4F7F;&#x8FD9;&#x4E2A;&#x95F4;&#x9694;&#xFF0C;&#x6216;&#x8005;&#x95F4;&#x8DDD;&#x81F3;&#x5C11;&#x8FBE;&#x5230;0.2&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x8FD9;&#x9879;&#x8C03;&#x5927;&#x6216;&#x8005;&#x8FD9;&#x4E2A;&#x8C03;&#x5C0F;&#xFF0C;&#x8FD9;&#x6837;&#x8FD9;&#x4E2A;&#x95F4;&#x9694;$a$&#xFF0C;&#x8D85;&#x53C2;&#x6570;$a$ &#x81F3;&#x5C11;&#x662F;0.2&#xFF0C;&#x5728;$d(A,P)$&#x548C;$d(A,N)$&#x4E4B;&#x95F4;&#x81F3;&#x5C11;&#x76F8;&#x5DEE;0.2&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x95F4;&#x9694;&#x53C2;&#x6570;$a$&#x7684;&#x4F5C;&#x7528;&#x3002;&#x5B83;&#x62C9;&#x5927;&#x4E86;<strong>Anchor</strong>&#x548C;<strong>Positive</strong> &#x56FE;&#x7247;&#x5BF9;&#x548C;<strong>Anchor</strong>&#x4E0E;<strong>Negative</strong> &#x56FE;&#x7247;&#x5BF9;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x8DDD;&#x3002;&#x53D6;&#x4E0B;&#x9762;&#x7684;&#x8FD9;&#x4E2A;&#x65B9;&#x6846;&#x5708;&#x8D77;&#x6765;&#x7684;&#x65B9;&#x7A0B;&#x5F0F;&#xFF0C;&#x5728;&#x4E0B;&#x4E2A;&#x5E7B;&#x706F;&#x7247;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x66F4;&#x516C;&#x5F0F;&#x5316;&#x8868;&#x793A;&#xFF0C;&#x7136;&#x540E;&#x5B9A;&#x4E49;&#x4E09;&#x5143;&#x7EC4;&#x635F;&#x5931;&#x51FD;&#x6570;&#x3002;</p>
<p><img src="../images/6a701944309f6dce72d03f5070275d5f.png" alt=""></p>
<p>&#x4E09;&#x5143;&#x7EC4;&#x635F;&#x5931;&#x51FD;&#x6570;&#x7684;&#x5B9A;&#x4E49;&#x57FA;&#x4E8E;&#x4E09;&#x5F20;&#x56FE;&#x7247;&#xFF0C;&#x5047;&#x5982;&#x4E09;&#x5F20;&#x56FE;&#x7247;$A$&#x3001;$P$&#x3001;$N$&#xFF0C;&#x5373;<strong>Anchor</strong>&#x6837;&#x672C;&#x3001;<strong>Positive</strong>&#x6837;&#x672C;&#x548C;<strong>Negative</strong>&#x6837;&#x672C;&#xFF0C;&#x5176;&#x4E2D;<strong>Positive</strong>&#x56FE;&#x7247;&#x548C;<strong>Anchor</strong>&#x56FE;&#x7247;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x4F46;&#x662F;<strong>Negative</strong>&#x56FE;&#x7247;&#x548C;<strong>Anchor</strong>&#x4E0D;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x4EBA;&#x3002;</p>
<p><img src="../images/a02aa8d399cce854eac79eb26a90b205.png" alt=""></p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x635F;&#x5931;&#x51FD;&#x6570;&#xFF0C;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x7684;&#x635F;&#x5931;&#x51FD;&#x6570;&#xFF0C;&#x5B83;&#x7684;&#x5B9A;&#x4E49;&#x57FA;&#x4E8E;&#x4E09;&#x5143;&#x56FE;&#x7247;&#x7EC4;&#xFF0C;&#x6211;&#x5148;&#x4ECE;&#x524D;&#x4E00;&#x5F20;&#x5E7B;&#x706F;&#x7247;&#x590D;&#x5236;&#x8FC7;&#x6765;&#x4E00;&#x4E9B;&#x5F0F;&#x5B50;&#xFF0C;&#x5C31;&#x662F;$|| f( A) - f( P)||^{2} -||f( A) - f( N)||^{2} +a \leq0$&#x3002;&#x6240;&#x4EE5;&#x4E3A;&#x4E86;&#x5B9A;&#x4E49;&#x8FD9;&#x4E2A;&#x635F;&#x5931;&#x51FD;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x53D6;&#x8FD9;&#x4E2A;&#x548C;0&#x7684;&#x6700;&#x5927;&#x503C;&#xFF1A;</p>
<p>$L( A,P,N) = max(|| f( A) - f( P)||^{2} -|| f( A) - f( N)||^{2} + a,0)$</p>
<p>&#x8FD9;&#x4E2A;$max$&#x51FD;&#x6570;&#x7684;&#x4F5C;&#x7528;&#x5C31;&#x662F;&#xFF0C;&#x53EA;&#x8981;&#x8FD9;&#x4E2A;$|| f( A) - f( P)||^{2} -|| f( A) - f( N)||^{2} + a\leq0$&#xFF0C;&#x90A3;&#x4E48;&#x635F;&#x5931;&#x51FD;&#x6570;&#x5C31;&#x662F;0&#x3002;&#x53EA;&#x8981;&#x4F60;&#x80FD;&#x4F7F;&#x753B;&#x7EFF;&#x8272;&#x4E0B;&#x5212;&#x7EBF;&#x90E8;&#x5206;&#x5C0F;&#x4E8E;&#x7B49;&#x4E8E;0&#xFF0C;&#x53EA;&#x8981;&#x4F60;&#x80FD;&#x8FBE;&#x5230;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x7684;&#x635F;&#x5931;&#x5C31;&#x662F;0&#x3002;</p>
<p><img src="../images/16bd20003ac6e93b71abb565ac4fd98e.png" alt=""></p>
<p>&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x5982;&#x679C;&#x8FD9;&#x4E2A;$|| f( A) - f( P)||^{2} -|| f( A) - f( N)||^{2} + a\leq0$&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x53D6;&#x5B83;&#x4EEC;&#x7684;&#x6700;&#x5927;&#x503C;&#xFF0C;&#x6700;&#x7EC8;&#x4F60;&#x4F1A;&#x5F97;&#x5230;&#x7EFF;&#x8272;&#x4E0B;&#x5212;&#x7EBF;&#x90E8;&#x5206;&#xFF08;&#x5373;$|| f(A) - f( P)||^{2} -|| f( A) - f( N)||^{2} +a$&#xFF09;&#x662F;&#x6700;&#x5927;&#x503C;&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x6B63;&#x7684;&#x635F;&#x5931;&#x503C;&#x3002;&#x901A;&#x8FC7;&#x6700;&#x5C0F;&#x5316;&#x8FD9;&#x4E2A;&#x635F;&#x5931;&#x51FD;&#x6570;&#x8FBE;&#x5230;&#x7684;&#x6548;&#x679C;&#x5C31;&#x662F;&#x4F7F;&#x8FD9;&#x90E8;&#x5206;$|| f( A) - f( P)||^{2} -||f( A) - f( N)||^{2} +a$&#x6210;&#x4E3A;0&#xFF0C;&#x6216;&#x8005;&#x5C0F;&#x4E8E;&#x7B49;&#x4E8E;0&#x3002;&#x53EA;&#x8981;&#x8FD9;&#x4E2A;&#x635F;&#x5931;&#x51FD;&#x6570;&#x5C0F;&#x4E8E;&#x7B49;&#x4E8E;0&#xFF0C;&#x7F51;&#x7EDC;&#x4E0D;&#x4F1A;&#x5173;&#x5FC3;&#x5B83;&#x8D1F;&#x503C;&#x6709;&#x591A;&#x5927;&#x3002;</p>
<p><img src="../images/bb258e78602ca65b6556a502da731764.png" alt=""></p>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x4E09;&#x5143;&#x7EC4;&#x5B9A;&#x4E49;&#x7684;&#x635F;&#x5931;&#xFF0C;&#x6574;&#x4E2A;&#x7F51;&#x7EDC;&#x7684;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x5E94;&#x8BE5;&#x662F;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#x8FD9;&#x4E9B;&#x5355;&#x4E2A;&#x4E09;&#x5143;&#x7EC4;&#x635F;&#x5931;&#x7684;&#x603B;&#x548C;&#x3002;&#x5047;&#x5982;&#x4F60;&#x6709;&#x4E00;&#x4E2A;10000&#x4E2A;&#x56FE;&#x7247;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x91CC;&#x9762;&#x662F;1000&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#x7684;&#x7167;&#x7247;&#xFF0C;&#x4F60;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x53D6;&#x8FD9;10000&#x4E2A;&#x56FE;&#x7247;&#xFF0C;&#x7136;&#x540E;&#x751F;&#x6210;&#x8FD9;&#x6837;&#x7684;&#x4E09;&#x5143;&#x7EC4;&#xFF0C;&#x7136;&#x540E;&#x8BAD;&#x7EC3;&#x4F60;&#x7684;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#xFF0C;&#x5BF9;&#x8FD9;&#x79CD;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x7528;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#xFF0C;&#x8FD9;&#x4E2A;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x5C31;&#x662F;&#x5B9A;&#x4E49;&#x5728;&#x4F60;&#x6570;&#x636E;&#x96C6;&#x91CC;&#x7684;&#x8FD9;&#x6837;&#x7684;&#x4E09;&#x5143;&#x7EC4;&#x56FE;&#x7247;&#x4E0A;&#x3002;</p>
<p>&#x6CE8;&#x610F;&#xFF0C;&#x4E3A;&#x4E86;&#x5B9A;&#x4E49;&#x4E09;&#x5143;&#x7EC4;&#x7684;&#x6570;&#x636E;&#x96C6;&#x4F60;&#x9700;&#x8981;&#x6210;&#x5BF9;&#x7684;$A$&#x548C;$P$&#xFF0C;&#x5373;&#x540C;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x6210;&#x5BF9;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x4E3A;&#x4E86;&#x8BAD;&#x7EC3;&#x4F60;&#x7684;&#x7CFB;&#x7EDF;&#x4F60;&#x786E;&#x5B9E;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x91CC;&#x9762;&#x6709;&#x540C;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x591A;&#x4E2A;&#x7167;&#x7247;&#x3002;&#x8FD9;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6211;&#x8BF4;&#x5047;&#x8BBE;&#x4F60;&#x6709;1000&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#x7684;10000&#x5F20;&#x7167;&#x7247;&#xFF0C;&#x4E5F;&#x8BB8;&#x662F;&#x8FD9;1000&#x4E2A;&#x4EBA;&#x5E73;&#x5747;&#x6BCF;&#x4E2A;&#x4EBA;10&#x5F20;&#x7167;&#x7247;&#xFF0C;&#x7EC4;&#x6210;&#x4E86;&#x4F60;&#x6574;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#x3002;&#x5982;&#x679C;&#x4F60;&#x53EA;&#x6709;&#x6BCF;&#x4E2A;&#x4EBA;&#x4E00;&#x5F20;&#x7167;&#x7247;&#xFF0C;&#x90A3;&#x4E48;&#x6839;&#x672C;&#x6CA1;&#x6CD5;&#x8BAD;&#x7EC3;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x8BAD;&#x7EC3;&#x5B8C;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5E94;&#x7528;&#x5230;&#x4F60;&#x7684;&#x4E00;&#x6B21;&#x5B66;&#x4E60;&#x95EE;&#x9898;&#x4E0A;&#xFF0C;&#x5BF9;&#x4E8E;&#x4F60;&#x7684;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x7CFB;&#x7EDF;&#xFF0C;&#x53EF;&#x80FD;&#x4F60;&#x53EA;&#x6709;&#x60F3;&#x8981;&#x8BC6;&#x522B;&#x7684;&#x67D0;&#x4E2A;&#x4EBA;&#x7684;&#x4E00;&#x5F20;&#x7167;&#x7247;&#x3002;&#x4F46;&#x5BF9;&#x4E8E;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x786E;&#x4FDD;&#x6709;&#x540C;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x591A;&#x4E2A;&#x56FE;&#x7247;&#xFF0C;&#x81F3;&#x5C11;&#x662F;&#x4F60;&#x8BAD;&#x7EC3;&#x96C6;&#x91CC;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x4EBA;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x6709;&#x6210;&#x5BF9;&#x7684;<strong>Anchor</strong>&#x548C;<strong>Positive</strong>&#x56FE;&#x7247;&#x4E86;&#x3002;</p>
<p><img src="../images/5d0ec945435eeb29f78463e38c58e90d.png" alt=""></p>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6765;&#x770B;&#xFF0C;&#x4F60;&#x5982;&#x4F55;&#x9009;&#x62E9;&#x8FD9;&#x4E9B;&#x4E09;&#x5143;&#x7EC4;&#x6765;&#x5F62;&#x6210;&#x8BAD;&#x7EC3;&#x96C6;&#x3002;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#x5982;&#x679C;&#x4F60;&#x4ECE;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#xFF0C;&#x968F;&#x673A;&#x5730;&#x9009;&#x62E9;$A$&#x3001;$P$&#x548C;$N$&#xFF0C;&#x9075;&#x5B88;$A$&#x548C;$P$&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x800C;$A$&#x548C;$N$&#x662F;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#x8FD9;&#x4E00;&#x539F;&#x5219;&#x3002;&#x6709;&#x4E2A;&#x95EE;&#x9898;&#x5C31;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x968F;&#x673A;&#x7684;&#x9009;&#x62E9;&#x5B83;&#x4EEC;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x7EA6;&#x675F;&#x6761;&#x4EF6;&#xFF08;$d(A,P) + a \leq d(A,N)$&#xFF09;&#x5F88;&#x5BB9;&#x6613;&#x8FBE;&#x5230;&#xFF0C;&#x56E0;&#x4E3A;&#x968F;&#x673A;&#x9009;&#x62E9;&#x7684;&#x56FE;&#x7247;&#xFF0C;$A$&#x548C;$N$&#x6BD4;$A$&#x548C;$P$&#x5DEE;&#x522B;&#x5F88;&#x5927;&#x7684;&#x6982;&#x7387;&#x5F88;&#x5927;&#x3002;&#x6211;&#x5E0C;&#x671B;&#x4F60;&#x8FD8;&#x8BB0;&#x5F97;&#x8FD9;&#x4E2A;&#x7B26;&#x53F7;$d(A,P)$&#x5C31;&#x662F;&#x524D;&#x51E0;&#x4E2A;&#x5E7B;&#x706F;&#x7247;&#x91CC;&#x5199;&#x7684;$|| f(A) - f(P)||^{2}$&#xFF0C;$d(A,N)$&#x5C31;&#x662F;$||f(A) -f(N)||^{2}$&#xFF0C;$d(A,P) + a \leq d(A,N)$&#x5373;$|| f( A) - f( P)||^{2} + a \leq|| f(A) - f( N)||^{2}$&#x3002;&#x4F46;&#x662F;&#x5982;&#x679C;$A$&#x548C;$N$&#x662F;&#x968F;&#x673A;&#x9009;&#x62E9;&#x7684;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#xFF0C;&#x6709;&#x5F88;&#x5927;&#x7684;&#x53EF;&#x80FD;&#x6027;$||f(A) - f(N)||^{2}$&#x4F1A;&#x6BD4;&#x5DE6;&#x8FB9;&#x8FD9;&#x9879;$||f( A) - f(P)||^{2}$&#x5927;&#xFF0C;&#x800C;&#x4E14;&#x5DEE;&#x8DDD;&#x8FDC;&#x5927;&#x4E8E;$a$&#xFF0C;&#x8FD9;&#x6837;&#x7F51;&#x7EDC;&#x5E76;&#x4E0D;&#x80FD;&#x4ECE;&#x4E2D;&#x5B66;&#x5230;&#x4EC0;&#x4E48;&#x3002;</p>
<p><img src="../images/8d010b8d7ee7011cf7f5d1889af0e4ce.png" alt=""></p>
<p>&#x6240;&#x4EE5;&#x4E3A;&#x4E86;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x4F60;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x5C3D;&#x53EF;&#x80FD;&#x9009;&#x62E9;&#x96BE;&#x8BAD;&#x7EC3;&#x7684;&#x4E09;&#x5143;&#x7EC4;$A$&#x3001;$P$&#x548C;$N$&#x3002;&#x5177;&#x4F53;&#x800C;&#x8A00;&#xFF0C;&#x4F60;&#x60F3;&#x8981;&#x6240;&#x6709;&#x7684;&#x4E09;&#x5143;&#x7EC4;&#x90FD;&#x6EE1;&#x8DB3;&#x8FD9;&#x4E2A;&#x6761;&#x4EF6;&#xFF08;$d(A,P) + a \leq d(A,N)$&#xFF09;&#xFF0C;&#x96BE;&#x8BAD;&#x7EC3;&#x7684;&#x4E09;&#x5143;&#x7EC4;&#x5C31;&#x662F;&#xFF0C;&#x4F60;&#x7684;$A$&#x3001;$P$&#x548C;$N$&#x7684;&#x9009;&#x62E9;&#x4F7F;&#x5F97;$d(A,P)$&#x5F88;&#x63A5;&#x8FD1;$d(A,N)$&#xFF0C;&#x5373;$d(A,P) \approx d(A,N)$&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x7684;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x4F1A;&#x7AED;&#x5C3D;&#x5168;&#x529B;&#x4F7F;&#x53F3;&#x8FB9;&#x8FD9;&#x4E2A;&#x5F0F;&#x5B50;&#x53D8;&#x5927;&#xFF08;$d(A,N)$&#xFF09;&#xFF0C;&#x6216;&#x8005;&#x4F7F;&#x5DE6;&#x8FB9;&#x8FD9;&#x4E2A;&#x5F0F;&#x5B50;&#xFF08;$d(A,P)$&#xFF09;&#x53D8;&#x5C0F;&#xFF0C;&#x8FD9;&#x6837;&#x5DE6;&#x53F3;&#x4E24;&#x8FB9;&#x81F3;&#x5C11;&#x6709;&#x4E00;&#x4E2A;$a$&#x7684;&#x95F4;&#x9694;&#x3002;&#x5E76;&#x4E14;&#x9009;&#x62E9;&#x8FD9;&#x6837;&#x7684;&#x4E09;&#x5143;&#x7EC4;&#x8FD8;&#x53EF;&#x4EE5;&#x589E;&#x52A0;&#x4F60;&#x7684;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x7684;&#x8BA1;&#x7B97;&#x6548;&#x7387;&#xFF0C;&#x5982;&#x679C;&#x968F;&#x673A;&#x7684;&#x9009;&#x62E9;&#x8FD9;&#x4E9B;&#x4E09;&#x5143;&#x7EC4;&#xFF0C;&#x5176;&#x4E2D;&#x6709;&#x592A;&#x591A;&#x4F1A;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x68AF;&#x5EA6;&#x7B97;&#x6CD5;&#x4E0D;&#x4F1A;&#x6709;&#x4EC0;&#x4E48;&#x6548;&#x679C;&#xFF0C;&#x56E0;&#x4E3A;&#x7F51;&#x7EDC;&#x603B;&#x662F;&#x5F88;&#x8F7B;&#x677E;&#x5C31;&#x80FD;&#x5F97;&#x5230;&#x6B63;&#x786E;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x53EA;&#x6709;&#x9009;&#x62E9;&#x96BE;&#x7684;&#x4E09;&#x5143;&#x7EC4;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x6CD5;&#x624D;&#x80FD;&#x53D1;&#x6325;&#x4F5C;&#x7528;&#xFF0C;&#x4F7F;&#x5F97;&#x8FD9;&#x4E24;&#x8FB9;&#x79BB;&#x5F97;&#x5C3D;&#x53EF;&#x80FD;&#x8FDC;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x6B64;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x8BDD;&#xFF0C;&#x8FD9;&#x7BC7;&#x8BBA;&#x6587;&#x4E2D;&#x6709;&#x66F4;&#x591A;&#x7EC6;&#x8282;&#xFF0C;&#x4F5C;&#x8005;&#x662F;<strong>Florian Schroff</strong>, <strong>Dmitry Kalenichenko</strong>, <strong>James Philbin</strong>&#xFF0C;&#x4ED6;&#x4EEC;&#x5EFA;&#x7ACB;&#x4E86;&#x8FD9;&#x4E2A;&#x53EB;&#x505A;<strong>FaceNet</strong>&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x6211;&#x89C6;&#x9891;&#x91CC;&#x8BB8;&#x591A;&#x7684;&#x89C2;&#x70B9;&#x90FD;&#x662F;&#x6765;&#x81EA;&#x4E8E;&#x4ED6;&#x4EEC;&#x7684;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x2022;  <strong>Florian Schroff, Dmitry Kalenichenko, James Philbin (2015).</strong> <a href="https://arxiv.org/pdf/1503.03832.pdf" target="_blank">FaceNet: A Unified Embedding forFace Recognition and Clustering</a></p>
<p>&#x987A;&#x4FBF;&#x8BF4;&#x4E00;&#x4E0B;&#xFF0C;&#x8FD9;&#x6709;&#x4E00;&#x4E2A;&#x6709;&#x8DA3;&#x7684;&#x4E8B;&#x5B9E;&#xFF0C;&#x5173;&#x4E8E;&#x5728;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x9886;&#x57DF;&#xFF0C;&#x7B97;&#x6CD5;&#x662F;&#x5982;&#x4F55;&#x547D;&#x540D;&#x7684;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7814;&#x7A76;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x9886;&#x57DF;&#xFF0C;&#x5047;&#x5982;&#x8BF4;&#x201C;&#x67D0;&#x67D0;&#x201D;&#x9886;&#x57DF;&#xFF0C;&#x901A;&#x5E38;&#x4F1A;&#x5C06;&#x7CFB;&#x7EDF;&#x547D;&#x540D;&#x4E3A;&#x201C;&#x67D0;&#x67D0;&#x201D;&#x7F51;&#x7EDC;&#x6216;&#x8005;&#x6DF1;&#x5EA6;&#x201C;&#x67D0;&#x67D0;&#x201D;&#xFF0C;&#x6211;&#x4EEC;&#x4E00;&#x76F4;&#x8BA8;&#x8BBA;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x7BC7;&#x8BBA;&#x6587;&#x53EB;&#x505A;<strong>FaceNet</strong>(&#x4EBA;&#x8138;&#x7F51;&#x7EDC;)&#xFF0C;&#x4E0A;&#x4E2A;&#x89C6;&#x9891;&#x91CC;&#x4F60;&#x770B;&#x5230;&#x8FC7;<strong>DeepFace</strong>(&#x6DF1;&#x5EA6;&#x4EBA;&#x8138;)&#x3002;&#x201C;&#x67D0;&#x67D0;&#x201D;&#x7F51;&#x7EDC;&#x6216;&#x8005;&#x6DF1;&#x5EA6;&#x201C;&#x67D0;&#x67D0;&#x201D;&#xFF0C;&#x662F;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x9886;&#x57DF;&#x6D41;&#x884C;&#x7684;&#x547D;&#x540D;&#x7B97;&#x6CD5;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x770B;&#x4E00;&#x4E0B;&#x8FD9;&#x7BC7;&#x8BBA;&#x6587;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8981;&#x4E86;&#x89E3;&#x66F4;&#x591A;&#x7684;&#x5173;&#x4E8E;&#x901A;&#x8FC7;&#x9009;&#x62E9;&#x6700;&#x6709;&#x7528;&#x7684;&#x4E09;&#x5143;&#x7EC4;&#x8BAD;&#x7EC3;&#x6765;&#x52A0;&#x901F;&#x7B97;&#x6CD5;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x68D2;&#x7684;&#x8BBA;&#x6587;&#x3002;</p>
<p>&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#xFF0C;&#x8BAD;&#x7EC3;&#x8FD9;&#x4E2A;&#x4E09;&#x5143;&#x7EC4;&#x635F;&#x5931;&#x4F60;&#x9700;&#x8981;&#x53D6;&#x4F60;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x5B83;&#x505A;&#x6210;&#x5F88;&#x591A;&#x4E09;&#x5143;&#x7EC4;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x4E09;&#x5143;&#x7EC4;&#xFF08;&#x7F16;&#x53F7;1&#xFF09;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;<strong>Anchor</strong>&#x56FE;&#x7247;&#x548C;<strong>Positive</strong>&#x56FE;&#x7247;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#xFF08;<strong>Anchor</strong>&#x548C;<strong>Positive</strong>&#xFF09;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x5F20;&#x53E6;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;<strong>Negative</strong>&#x56FE;&#x7247;&#x3002;&#x8FD9;&#x662F;&#x53E6;&#x4E00;&#x7EC4;&#xFF08;&#x7F16;&#x53F7;2&#xFF09;&#xFF0C;&#x5176;&#x4E2D;<strong>Anchor</strong>&#x548C;<strong>Positive</strong>&#x56FE;&#x7247;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x4F46;&#x662F;<strong>Anchor</strong>&#x548C;<strong>Negative</strong>&#x4E0D;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x7B49;&#x7B49;&#x3002;</p>
<p><img src="../images/347cf0fc665abe47fa0999d8bf771d26.png" alt=""></p>
<p>&#x5B9A;&#x4E49;&#x4E86;&#x8FD9;&#x4E9B;&#x5305;&#x62EC;$A$&#x3001;$P$&#x548C;$N$&#x56FE;&#x7247;&#x7684;&#x6570;&#x636E;&#x96C6;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x8FD8;&#x9700;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x7528;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x6700;&#x5C0F;&#x5316;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x5B9A;&#x4E49;&#x7684;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;$J$&#xFF0C;&#x8FD9;&#x6837;&#x505A;&#x7684;&#x6548;&#x679C;&#x5C31;&#x662F;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x5230;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x53C2;&#x6570;&#x6765;&#x5B66;&#x4E60;&#x5230;&#x4E00;&#x79CD;&#x7F16;&#x7801;&#xFF0C;&#x4F7F;&#x5F97;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x56FE;&#x7247;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x4EEC;&#x7684;$d$&#x5C31;&#x4F1A;&#x5F88;&#x5C0F;&#xFF0C;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x56FE;&#x7247;&#x4E0D;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;$d$ &#x5C31;&#x4F1A;&#x5F88;&#x5927;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x4E09;&#x5143;&#x7EC4;&#x635F;&#x5931;&#xFF0C;&#x5E76;&#x4E14;&#x5982;&#x4F55;&#x7528;&#x5B83;&#x6765;&#x8BAD;&#x7EC3;&#x7F51;&#x7EDC;&#x8F93;&#x51FA;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x7F16;&#x7801;&#x7528;&#x4E8E;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x3002;&#x73B0;&#x5728;&#x7684;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x7CFB;&#x7EDF;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5927;&#x89C4;&#x6A21;&#x7684;&#x5546;&#x4E1A;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x7CFB;&#x7EDF;&#x90FD;&#x662F;&#x5728;&#x5F88;&#x5927;&#x7684;&#x6570;&#x636E;&#x96C6;&#x4E0A;&#x8BAD;&#x7EC3;&#xFF0C;&#x8D85;&#x8FC7;&#x767E;&#x4E07;&#x56FE;&#x7247;&#x7684;&#x6570;&#x636E;&#x96C6;&#x5E76;&#x4E0D;&#x7F55;&#x89C1;&#xFF0C;&#x4E00;&#x4E9B;&#x516C;&#x53F8;&#x7528;&#x5343;&#x4E07;&#x7EA7;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x7528;&#x4E0A;&#x4EBF;&#x7684;&#x56FE;&#x7247;&#x6765;&#x8BAD;&#x7EC3;&#x8FD9;&#x4E9B;&#x7CFB;&#x7EDF;&#x3002;&#x8FD9;&#x4E9B;&#x662F;&#x5F88;&#x5927;&#x7684;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x5373;&#x4F7F;&#x6309;&#x7167;&#x73B0;&#x5728;&#x7684;&#x6807;&#x51C6;&#xFF0C;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x96C6;&#x5E76;&#x4E0D;&#x5BB9;&#x6613;&#x83B7;&#x5F97;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x4E00;&#x4E9B;&#x516C;&#x53F8;&#x5DF2;&#x7ECF;&#x8BAD;&#x7EC3;&#x4E86;&#x8FD9;&#x4E9B;&#x5927;&#x578B;&#x7684;&#x7F51;&#x7EDC;&#x5E76;&#x4E14;&#x4E0A;&#x4F20;&#x4E86;&#x6A21;&#x578B;&#x53C2;&#x6570;&#x3002;&#x6240;&#x4EE5;&#x76F8;&#x6BD4;&#x4E8E;&#x4ECE;&#x5934;&#x8BAD;&#x7EC3;&#x8FD9;&#x4E9B;&#x7F51;&#x7EDC;&#xFF0C;&#x5728;&#x8FD9;&#x4E00;&#x9886;&#x57DF;&#xFF0C;&#x7531;&#x4E8E;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x96C6;&#x592A;&#x5927;&#xFF0C;&#x8FD9;&#x4E00;&#x9886;&#x57DF;&#x7684;&#x4E00;&#x4E2A;&#x5B9E;&#x7528;&#x64CD;&#x4F5C;&#x5C31;&#x662F;&#x4E0B;&#x8F7D;&#x522B;&#x4EBA;&#x7684;&#x9884;&#x8BAD;&#x7EC3;&#x6A21;&#x578B;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E00;&#x5207;&#x90FD;&#x8981;&#x4ECE;&#x5934;&#x5F00;&#x59CB;&#x3002;&#x4F46;&#x662F;&#x5373;&#x4F7F;&#x4F60;&#x4E0B;&#x8F7D;&#x4E86;&#x522B;&#x4EBA;&#x7684;&#x9884;&#x8BAD;&#x7EC3;&#x6A21;&#x578B;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x4E86;&#x89E3;&#x600E;&#x4E48;&#x8BAD;&#x7EC3;&#x8FD9;&#x4E9B;&#x7B97;&#x6CD5;&#x4E5F;&#x662F;&#x6709;&#x7528;&#x7684;&#xFF0C;&#x4EE5;&#x9632;&#x9488;&#x5BF9;&#x4E00;&#x4E9B;&#x5E94;&#x7528;&#x4F60;&#x9700;&#x8981;&#x4ECE;&#x5934;&#x5B9E;&#x73B0;&#x8FD9;&#x4E9B;&#x60F3;&#x6CD5;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x4E09;&#x5143;&#x7EC4;&#x635F;&#x5931;&#xFF0C;&#x4E0B;&#x4E2A;&#x89C6;&#x9891;&#x4E2D;&#xFF0C;&#x6211;&#x4F1A;&#x7ED9;&#x4F60;&#x5C55;&#x793A;<strong>Siamese</strong>&#x7F51;&#x7EDC;&#x7684;&#x4E00;&#x4E9B;&#x5176;&#x4ED6;&#x53D8;&#x4F53;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x8BAD;&#x7EC3;&#x8FD9;&#x4E9B;&#x7F51;&#x7EDC;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x8FDB;&#x5165;&#x4E0B;&#x4E2A;&#x89C6;&#x9891;&#x5427;&#x3002;</p>
<h3 id="45-&#x4EBA;&#x8138;&#x9A8C;&#x8BC1;&#x4E0E;&#x4E8C;&#x5206;&#x7C7B;&#xFF08;face-verification-and-binary-classification&#xFF09;">4.5 &#x4EBA;&#x8138;&#x9A8C;&#x8BC1;&#x4E0E;&#x4E8C;&#x5206;&#x7C7B;&#xFF08;Face verification and binary classification&#xFF09;</h3>
<p><strong>Triplet loss</strong>&#x662F;&#x4E00;&#x4E2A;&#x5B66;&#x4E60;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x53C2;&#x6570;&#x7684;&#x597D;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x5B66;&#x4E60;&#x53C2;&#x6570;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x5982;&#x4F55;&#x5C06;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x5F53;&#x6210;&#x4E00;&#x4E2A;&#x4E8C;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#x3002;</p>
<p><img src="../images/c3bf61934da2f20a7d15e183c1d1d2ab.png" alt=""></p>
<p>&#x53E6;&#x4E00;&#x4E2A;&#x8BAD;&#x7EC3;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x9009;&#x53D6;&#x4E00;&#x5BF9;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x9009;&#x53D6;<strong>Siamese</strong>&#x7F51;&#x7EDC;&#xFF0C;&#x4F7F;&#x5176;&#x540C;&#x65F6;&#x8BA1;&#x7B97;&#x8FD9;&#x4E9B;&#x5D4C;&#x5165;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;128&#x7EF4;&#x7684;&#x5D4C;&#x5165;&#xFF08;&#x7F16;&#x53F7;1&#xFF09;&#xFF0C;&#x6216;&#x8005;&#x66F4;&#x9AD8;&#x7EF4;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x5176;&#x8F93;&#x5165;&#x5230;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x5355;&#x5143;&#xFF0C;&#x7136;&#x540E;&#x8FDB;&#x884C;&#x9884;&#x6D4B;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x76F8;&#x540C;&#x7684;&#x4EBA;&#xFF0C;&#x90A3;&#x4E48;&#x8F93;&#x51FA;&#x662F;1&#xFF0C;&#x82E5;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#xFF0C;&#x8F93;&#x51FA;&#x662F;0&#x3002;&#x8FD9;&#x5C31;&#x628A;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x95EE;&#x9898;&#x8F6C;&#x6362;&#x4E3A;&#x4E00;&#x4E2A;&#x4E8C;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#xFF0C;&#x8BAD;&#x7EC3;&#x8FD9;&#x79CD;&#x7CFB;&#x7EDF;&#x65F6;&#x53EF;&#x4EE5;&#x66FF;&#x6362;<strong>Triplet loss</strong>&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p><img src="../images/31b10a3bd68ec1ff87c075cc1241d64e.png" alt=""></p>
<p>&#x6700;&#x540E;&#x7684;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x5355;&#x5143;&#x662F;&#x600E;&#x4E48;&#x5904;&#x7406;&#x7684;&#xFF1F;&#x8F93;&#x51FA;$\hat y$&#x4F1A;&#x53D8;&#x6210;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;<strong>sigmoid</strong>&#x51FD;&#x6570;&#x5E94;&#x7528;&#x5230;&#x67D0;&#x4E9B;&#x7279;&#x5F81;&#x4E0A;&#xFF0C;&#x76F8;&#x6BD4;&#x8D77;&#x76F4;&#x63A5;&#x653E;&#x5165;&#x8FD9;&#x4E9B;&#x7F16;&#x7801;&#xFF08;$f(x^{(i)}),f( x^{(j)})$&#xFF09;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x7F16;&#x7801;&#x4E4B;&#x95F4;&#x7684;&#x4E0D;&#x540C;&#x3002;</p>
<p>$\hat y = \sigma(\sum<em>{k = 1}^{128}{w</em>{i}| f( x^{( i)})<em>{k} - f( x^{( j)})</em>{k}| + b})$</p>
<p>&#x6211;&#x89E3;&#x91CA;&#x4E00;&#x4E0B;&#xFF0C;&#x7B26;&#x53F7;$f( x^{( i)})<em>{k}$&#x4EE3;&#x8868;&#x56FE;&#x7247;$x^{(i)}$&#x7684;&#x7F16;&#x7801;&#xFF0C;&#x4E0B;&#x6807;$k$&#x4EE3;&#x8868;&#x9009;&#x62E9;&#x8FD9;&#x4E2A;&#x5411;&#x91CF;&#x4E2D;&#x7684;&#x7B2C;$k$&#x4E2A;&#x5143;&#x7D20;&#xFF0C;$| f(x^{( i)})</em>{k} - f( x^{( j)})<em>{k}|$&#x5BF9;&#x8FD9;&#x4E24;&#x4E2A;&#x7F16;&#x7801;&#x53D6;&#x5143;&#x7D20;&#x5DEE;&#x7684;&#x7EDD;&#x5BF9;&#x503C;&#x3002;&#x4F60;&#x53EF;&#x80FD;&#x60F3;&#xFF0C;&#x628A;&#x8FD9;128&#x4E2A;&#x5143;&#x7D20;&#x5F53;&#x4F5C;&#x7279;&#x5F81;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x4ED6;&#x4EEC;&#x653E;&#x5165;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x4E2D;&#xFF0C;&#x6700;&#x540E;&#x7684;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x53EF;&#x4EE5;&#x589E;&#x52A0;&#x53C2;&#x6570;$w</em>{i}$&#x548C;$b$&#xFF0C;&#x5C31;&#x50CF;&#x666E;&#x901A;&#x7684;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x4E00;&#x6837;&#x3002;&#x4F60;&#x5C06;&#x5728;&#x8FD9;128&#x4E2A;&#x5355;&#x5143;&#x4E0A;&#x8BAD;&#x7EC3;&#x5408;&#x9002;&#x7684;&#x6743;&#x91CD;&#xFF0C;&#x7528;&#x6765;&#x9884;&#x6D4B;&#x4E24;&#x5F20;&#x56FE;&#x7247;&#x662F;&#x5426;&#x662F;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x5408;&#x7406;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x5B66;&#x4E60;&#x9884;&#x6D4B;0&#x6216;&#x8005;1&#xFF0C;&#x5373;&#x662F;&#x5426;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x4EBA;&#x3002;</p>
<p><img src="../images/2cce4727d7a6d1b1fa10163231d43291.png" alt=""></p>
<p>&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x4E0D;&#x540C;&#x7684;&#x5F62;&#x5F0F;&#x6765;&#x8BA1;&#x7B97;&#x7EFF;&#x8272;&#x6807;&#x8BB0;&#x7684;&#x8FD9;&#x90E8;&#x5206;&#x516C;&#x5F0F;&#xFF08;$| f( x^{( i)})<em>{k} - f( x^{( j)})</em>{k}|$&#xFF09;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x516C;&#x5F0F;&#x53EF;&#x4EE5;&#x662F;$\frac{(f( x^{( i)})<em>{k} - f(x^{( j)})</em>{k})^{2}}{f(x^{( i)})<em>{k} + f( x^{( j)})</em>{k}}$&#xFF0C;&#x8FD9;&#x4E2A;&#x516C;&#x5F0F;&#x4E5F;&#x88AB;&#x53EB;&#x505A;$\chi^{2}$&#x516C;&#x5F0F;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x5E0C;&#x814A;&#x5B57;&#x6BCD;$\chi$&#xFF0C;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;$\chi$&#x5E73;&#x65B9;&#x76F8;&#x4F3C;&#x5EA6;&#x3002;</p>
<p>&#x2022;      <strong>Yaniv Taigman, Ming Yang, Marc&apos;Aurelio Ranzato, Lior Wolf (2014).</strong> <a href="https://research.fb.com/wp-content/uploads/2016/11/deepface-closing-the-gap-to-human-level-performance-in-face-verification.pdf" target="_blank">DeepFace:Closing the gap to human-level performance in face verification</a></p>
<p>&#x8FD9;&#x4E9B;&#x516C;&#x5F0F;&#x53CA;&#x5176;&#x53D8;&#x5F62;&#x5728;&#x8FD9;&#x7BC7;<strong>DeepFace</strong>&#x8BBA;&#x6587;&#x4E2D;&#x6709;&#x8BA8;&#x8BBA;&#xFF0C;&#x6211;&#x4E4B;&#x524D;&#x4E5F;&#x5F15;&#x7528;&#x8FC7;&#x3002;</p>
<p><img src="../images/3054acaedc374b50c13ece55b7e1ff27.png" alt=""></p>
<p>&#x4F46;&#x662F;&#x5728;&#x8FD9;&#x4E2A;&#x5B66;&#x4E60;&#x516C;&#x5F0F;&#x4E2D;&#xFF0C;&#x8F93;&#x5165;&#x662F;&#x4E00;&#x5BF9;&#x56FE;&#x7247;&#xFF0C;&#x8FD9;&#x662F;&#x4F60;&#x7684;&#x8BAD;&#x7EC3;&#x8F93;&#x5165;$x$&#xFF08;&#x7F16;&#x53F7;1&#x3001;2&#xFF09;&#xFF0C;&#x8F93;&#x51FA;$y$&#x662F;0&#x6216;&#x8005;1&#xFF0C;&#x53D6;&#x51B3;&#x4E8E;&#x4F60;&#x7684;&#x8F93;&#x5165;&#x662F;&#x76F8;&#x4F3C;&#x56FE;&#x7247;&#x8FD8;&#x662F;&#x975E;&#x76F8;&#x4F3C;&#x56FE;&#x7247;&#x3002;&#x4E0E;&#x4E4B;&#x524D;&#x7C7B;&#x4F3C;&#xFF0C;&#x4F60;&#x6B63;&#x5728;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;<strong>Siamese</strong>&#x7F51;&#x7EDC;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x4E0A;&#x9762;&#x8FD9;&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x62E5;&#x6709;&#x7684;&#x53C2;&#x6570;&#x548C;&#x4E0B;&#x9762;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x76F8;&#x540C;&#xFF08;&#x7F16;&#x53F7;3&#x548C;4&#x6240;&#x793A;&#x7684;&#x7F51;&#x7EDC;&#xFF09;&#xFF0C;&#x4E24;&#x7EC4;&#x53C2;&#x6570;&#x662F;&#x7ED1;&#x5B9A;&#x7684;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x7CFB;&#x7EDF;&#x6548;&#x679C;&#x5F88;&#x597D;&#x3002;</p>
<p>&#x4E4B;&#x524D;&#x63D0;&#x5230;&#x4E00;&#x4E2A;&#x8BA1;&#x7B97;&#x6280;&#x5DE7;&#x53EF;&#x4EE5;&#x5E2E;&#x4F60;&#x663E;&#x8457;&#x63D0;&#x9AD8;&#x90E8;&#x7F72;&#x6548;&#x679C;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x662F;&#x4E00;&#x5F20;&#x65B0;&#x56FE;&#x7247;&#xFF08;&#x7F16;&#x53F7;1&#xFF09;&#xFF0C;&#x5F53;&#x5458;&#x5DE5;&#x8D70;&#x8FDB;&#x95E8;&#x65F6;&#xFF0C;&#x5E0C;&#x671B;&#x95E8;&#x53EF;&#x4EE5;&#x81EA;&#x52A8;&#x4E3A;&#x4ED6;&#x4EEC;&#x6253;&#x5F00;&#xFF0C;&#x8FD9;&#x4E2A;&#xFF08;&#x7F16;&#x53F7;2&#xFF09;&#x662F;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x6BCF;&#x6B21;&#x90FD;&#x8BA1;&#x7B97;&#x8FD9;&#x4E9B;&#x7279;&#x5F81;&#xFF08;&#x7F16;&#x53F7;6&#xFF09;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x6BCF;&#x6B21;&#x90FD;&#x8BA1;&#x7B97;&#x8FD9;&#x4E2A;&#x5D4C;&#x5165;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x63D0;&#x524D;&#x8BA1;&#x7B97;&#x597D;&#xFF0C;&#x90A3;&#x4E48;&#x5F53;&#x4E00;&#x4E2A;&#x65B0;&#x5458;&#x5DE5;&#x8D70;&#x8FD1;&#x65F6;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E0A;&#x65B9;&#x7684;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x6765;&#x8BA1;&#x7B97;&#x8FD9;&#x4E9B;&#x7F16;&#x7801;&#xFF08;&#x7F16;&#x53F7;5&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x5B83;&#xFF0C;&#x548C;&#x9884;&#x5148;&#x8BA1;&#x7B97;&#x597D;&#x7684;&#x7F16;&#x7801;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#xFF0C;&#x7136;&#x540E;&#x8F93;&#x51FA;&#x9884;&#x6D4B;&#x503C;$\hat y$&#x3002;</p>
<p>&#x56E0;&#x4E3A;&#x4E0D;&#x9700;&#x8981;&#x5B58;&#x50A8;&#x539F;&#x59CB;&#x56FE;&#x50CF;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x5927;&#x7684;&#x5458;&#x5DE5;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x4F60;&#x4E0D;&#x9700;&#x8981;&#x4E3A;&#x6BCF;&#x4E2A;&#x5458;&#x5DE5;&#x6BCF;&#x6B21;&#x90FD;&#x8BA1;&#x7B97;&#x8FD9;&#x4E9B;&#x7F16;&#x7801;&#x3002;&#x8FD9;&#x4E2A;&#x9884;&#x5148;&#x8BA1;&#x7B97;&#x7684;&#x601D;&#x60F3;&#xFF0C;&#x53EF;&#x4EE5;&#x8282;&#x7701;&#x5927;&#x91CF;&#x7684;&#x8BA1;&#x7B97;&#xFF0C;&#x8FD9;&#x4E2A;&#x9884;&#x8BAD;&#x7EC3;&#x7684;&#x5DE5;&#x4F5C;&#x53EF;&#x4EE5;&#x7528;&#x5728;<strong>Siamese</strong>&#x7F51;&#x8DEF;&#x7ED3;&#x6784;&#x4E2D;&#xFF0C;&#x5C06;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x5F53;&#x4F5C;&#x4E00;&#x4E2A;&#x4E8C;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x5728;&#x5B66;&#x4E60;&#x548C;&#x4F7F;&#x7528;<strong>Triplet loss</strong>&#x51FD;&#x6570;&#x4E0A;&#xFF0C;&#x6211;&#x5728;&#x4E4B;&#x524D;&#x7684;&#x89C6;&#x9891;&#x4E2D;&#x63CF;&#x8FF0;&#x8FC7;&#x3002;</p>
<p>&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#xFF0C;&#x628A;&#x4EBA;&#x8138;&#x9A8C;&#x8BC1;&#x5F53;&#x4F5C;&#x4E00;&#x4E2A;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#xFF0C;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x53EA;&#x6709;&#x6210;&#x5BF9;&#x56FE;&#x7247;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x4E0D;&#x662F;&#x4E09;&#x4E2A;&#x4E00;&#x7EC4;&#xFF0C;&#x800C;&#x662F;&#x6210;&#x5BF9;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x76EE;&#x6807;&#x6807;&#x7B7E;&#x662F;1&#x8868;&#x793A;&#x4E00;&#x5BF9;&#x56FE;&#x7247;&#x662F;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x76EE;&#x6807;&#x6807;&#x7B7E;&#x662F;0&#x8868;&#x793A;&#x56FE;&#x7247;&#x4E2D;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#x3002;&#x5229;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x6210;&#x5BF9;&#x56FE;&#x7247;&#xFF0C;&#x4F7F;&#x7528;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x7B97;&#x6CD5;&#x53BB;&#x8BAD;&#x7EC3;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x8BAD;&#x7EC3;<strong>Siamese</strong>&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;</p>
<p><img src="../images/bb970476d7de45a473a1c98b8d87b23a.png" alt=""></p>
<p>&#x8FD9;&#x4E2A;&#x4F60;&#x770B;&#x5230;&#x7684;&#x7248;&#x672C;&#xFF0C;&#x5904;&#x7406;&#x4EBA;&#x8138;&#x9A8C;&#x8BC1;&#x548C;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x6269;&#x5C55;&#x4E3A;&#x4E8C;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x6548;&#x679C;&#x4E5F;&#x5F88;&#x597D;&#x3002;&#x6211;&#x5E0C;&#x671B;&#x4F60;&#x77E5;&#x9053;&#xFF0C;&#x5728;&#x4E00;&#x6B21;&#x5B66;&#x4E60;&#x65F6;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4EC0;&#x4E48;&#x6765;&#x8BAD;&#x7EC3;&#x4EBA;&#x8138;&#x9A8C;&#x8BC1;&#xFF0C;&#x6216;&#x8005;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x7CFB;&#x7EDF;&#x3002;</p>
<h3 id="46-&#x4EC0;&#x4E48;&#x662F;&#x795E;&#x7ECF;&#x98CE;&#x683C;&#x8FC1;&#x79FB;&#xFF1F;&#xFF08;what-is-neural-style-transfer&#xFF09;">4.6 &#x4EC0;&#x4E48;&#x662F;&#x795E;&#x7ECF;&#x98CE;&#x683C;&#x8FC1;&#x79FB;&#xFF1F;&#xFF08;What is neural style transfer?&#xFF09;</h3>
<p>&#x6700;&#x8FD1;&#xFF0C;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6700;&#x6709;&#x8DA3;&#x7684;&#x5E94;&#x7528;&#x662F;&#x795E;&#x7ECF;&#x98CE;&#x683C;&#x8FC1;&#x79FB;&#xFF0C;&#x5728;&#x7F16;&#x7A0B;&#x4F5C;&#x4E1A;&#x4E2D;&#xFF0C;&#x4F60;&#x5C06;&#x81EA;&#x5DF1;&#x5B9E;&#x73B0;&#x8FD9;&#x90E8;&#x5206;&#x5E76;&#x521B;&#x9020;&#x51FA;&#x4F60;&#x7684;&#x827A;&#x672F;&#x4F5C;&#x54C1;&#x3002;</p>
<p>&#x4EC0;&#x4E48;&#x662F;&#x795E;&#x7ECF;&#x98CE;&#x683C;&#x8FC1;&#x79FB;&#xFF1F;&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x51E0;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x6BD4;&#x5982;&#x8FD9;&#x5F20;&#x7167;&#x7247;&#xFF0C;&#x7167;&#x7247;&#x662F;&#x5728;&#x65AF;&#x5766;&#x798F;&#x5927;&#x5B66;&#x62CD;&#x6444;&#x7684;&#xFF0C;&#x79BB;&#x6211;&#x7684;&#x529E;&#x516C;&#x5BA4;&#x4E0D;&#x8FDC;&#xFF0C;&#x4F60;&#x60F3;&#x5229;&#x7528;&#x53F3;&#x8FB9;&#x7167;&#x7247;&#x7684;&#x98CE;&#x683C;&#x6765;&#x91CD;&#x65B0;&#x521B;&#x9020;&#x539F;&#x672C;&#x7684;&#x7167;&#x7247;&#xFF0C;&#x53F3;&#x8FB9;&#x7684;&#x662F;&#x68B5;&#x9AD8;&#x7684;&#x661F;&#x7A7A;&#xFF0C;&#x795E;&#x7ECF;&#x98CE;&#x683C;&#x8FC1;&#x79FB;&#x53EF;&#x4EE5;&#x5E2E;&#x4F60;&#x751F;&#x6210;&#x4E0B;&#x9762;&#x8FD9;&#x5F20;&#x7167;&#x7247;&#x3002;</p>
<p><img src="../images/7b75c69ef064be274c82127a970461cf.png" alt=""></p>
<p>&#x8FD9;&#x4ECD;&#x662F;&#x65AF;&#x5766;&#x798F;&#x5927;&#x5B66;&#x7684;&#x7167;&#x7247;&#xFF0C;&#x4F46;&#x662F;&#x7528;&#x53F3;&#x8FB9;&#x56FE;&#x50CF;&#x7684;&#x98CE;&#x683C;&#x753B;&#x51FA;&#x6765;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x63CF;&#x8FF0;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8FC1;&#x79FB;&#xFF0C;&#x6211;&#x5C06;&#x4F7F;&#x7528;$C$&#x6765;&#x8868;&#x793A;&#x5185;&#x5BB9;&#x56FE;&#x50CF;&#xFF0C;$S$&#x8868;&#x793A;&#x98CE;&#x683C;&#x56FE;&#x50CF;&#xFF0C;$G$&#x8868;&#x793A;&#x751F;&#x6210;&#x7684;&#x56FE;&#x50CF;&#x3002;</p>
<p><img src="../images/0dc775a1d37fea84466b48d1c8c3fa97.png" alt=""></p>
<p>&#x53E6;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x8FD9;&#x5F20;&#x56FE;&#x7247;&#xFF0C;$C$&#x4EE3;&#x8868;&#x5728;&#x65E7;&#x91D1;&#x5C71;&#x7684;&#x91D1;&#x95E8;&#x5927;&#x6865;&#xFF0C;&#x8FD8;&#x6709;&#x8FD9;&#x5F20;&#x98CE;&#x683C;&#x56FE;&#x7247;&#xFF0C;&#x662F;&#x6BD5;&#x52A0;&#x7D22;&#x7684;&#x98CE;&#x683C;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x4E24;&#x5F20;&#x7167;&#x7247;&#x7ED3;&#x5408;&#x8D77;&#x6765;&#xFF0C;&#x5F97;&#x5230;G&#x8FD9;&#x5F20;&#x6BD5;&#x52A0;&#x7D22;&#x98CE;&#x683C;&#x7684;&#x7684;&#x91D1;&#x95E8;&#x5927;&#x6865;&#x3002;</p>
<p>&#x8FD9;&#x9875;&#x4E2D;&#x5C55;&#x793A;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x662F;&#x7531;<strong>Justin Johnson</strong>&#x5236;&#x4F5C;&#xFF0C;&#x5728;&#x4E0B;&#x9762;&#x51E0;&#x4E2A;&#x89C6;&#x9891;&#x4E2D;&#x4F60;&#x5C06;&#x5B66;&#x5230;&#x5982;&#x4F55;&#x81EA;&#x5DF1;&#x751F;&#x6210;&#x8FD9;&#x6837;&#x7684;&#x56FE;&#x7247;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x795E;&#x7ECF;&#x98CE;&#x683C;&#x8FC1;&#x79FB;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x77E5;&#x9053;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x63D0;&#x53D6;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x6DF1;&#x5C42;&#x7684;&#x3001;&#x6D45;&#x5C42;&#x7684;&#x3002;&#x5728;&#x6DF1;&#x5165;&#x4E86;&#x89E3;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x795E;&#x7ECF;&#x98CE;&#x683C;&#x8FC1;&#x79FB;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x5C06;&#x5728;&#x4E0B;&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#x4E2D;&#x76F4;&#x89C2;&#x5730;&#x4ECB;&#x7ECD;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E0D;&#x540C;&#x5C42;&#x4E4B;&#x95F4;&#x7684;&#x5177;&#x4F53;&#x8FD0;&#x7B97;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E0B;&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#x3002;</p>
<h3 id="47-cnn&#x7279;&#x5F81;&#x53EF;&#x89C6;&#x5316;&#xFF08;what-are-deep-convnets-learning&#xFF09;">4.7 CNN&#x7279;&#x5F81;&#x53EF;&#x89C6;&#x5316;&#xFF08;What are deep ConvNets learning?&#xFF09;</h3>
<p>&#x6DF1;&#x5EA6;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x5230;&#x5E95;&#x5728;&#x5B66;&#x4EC0;&#x4E48;&#xFF1F;&#x5728;&#x8FD9;&#x4E2A;&#x89C6;&#x9891;&#x4E2D;&#x6211;&#x5C06;&#x5C55;&#x793A;&#x4E00;&#x4E9B;&#x53EF;&#x89C6;&#x5316;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x4F60;&#x7406;&#x89E3;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x4E2D;&#x6DF1;&#x5EA6;&#x8F83;&#x5927;&#x7684;&#x5C42;&#x771F;&#x6B63;&#x5728;&#x505A;&#x4EC0;&#x4E48;&#xFF0C;&#x8FD9;&#x6837;&#x6709;&#x52A9;&#x4E8E;&#x7406;&#x89E3;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x795E;&#x7ECF;&#x98CE;&#x683C;&#x8FC1;&#x79FB;&#x3002;</p>
<p><img src="../images/6d489f040214efb27bf0f109874b3918.png" alt=""></p>
<p>&#x6765;&#x770B;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5047;&#x5982;&#x4F60;&#x8BAD;&#x7EC3;&#x4E86;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;<strong>Alexnet</strong>&#xFF0C;&#x8F7B;&#x91CF;&#x7EA7;&#x7F51;&#x7EDC;&#xFF0C;&#x4F60;&#x5E0C;&#x671B;&#x5C06;&#x770B;&#x5230;&#x4E0D;&#x540C;&#x5C42;&#x4E4B;&#x95F4;&#x9690;&#x85CF;&#x5355;&#x5143;&#x7684;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x3002;</p>
<p><img src="../images/1472cbf93948173ac314ceb4eb5e4c97.png" alt=""></p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x505A;&#xFF0C;&#x4ECE;&#x7B2C;&#x4E00;&#x5C42;&#x7684;&#x9690;&#x85CF;&#x5355;&#x5143;&#x5F00;&#x59CB;&#xFF0C;&#x5047;&#x8BBE;&#x4F60;&#x904D;&#x5386;&#x4E86;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x7136;&#x540E;&#x627E;&#x5230;&#x90A3;&#x4E9B;&#x4F7F;&#x5F97;&#x5355;&#x5143;&#x6FC0;&#x6D3B;&#x6700;&#x5927;&#x5316;&#x7684;&#x4E00;&#x4E9B;&#x56FE;&#x7247;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x56FE;&#x7247;&#x5757;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5C06;&#x4F60;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#x7ECF;&#x8FC7;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x7136;&#x540E;&#x5F04;&#x660E;&#x767D;&#x54EA;&#x4E00;&#x5F20;&#x56FE;&#x7247;&#x6700;&#x5927;&#x9650;&#x5EA6;&#x5730;&#x6FC0;&#x6D3B;&#x7279;&#x5B9A;&#x7684;&#x5355;&#x5143;&#x3002;&#x6CE8;&#x610F;&#x5728;&#x7B2C;&#x4E00;&#x5C42;&#x7684;&#x9690;&#x85CF;&#x5355;&#x5143;&#xFF0C;&#x53EA;&#x80FD;&#x770B;&#x5230;&#x5C0F;&#x90E8;&#x5206;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x753B;&#x51FA;&#x6765;&#x54EA;&#x4E9B;&#x6FC0;&#x6D3B;&#x4E86;&#x6FC0;&#x6D3B;&#x5355;&#x5143;&#xFF0C;&#x53EA;&#x6709;&#x4E00;&#x5C0F;&#x5757;&#x56FE;&#x7247;&#x5757;&#x662F;&#x6709;&#x610F;&#x4E49;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x5C31;&#x662F;&#x7279;&#x5B9A;&#x5355;&#x5143;&#x6240;&#x80FD;&#x770B;&#x5230;&#x7684;&#x5168;&#x90E8;&#x3002;&#x4F60;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x9690;&#x85CF;&#x5355;&#x5143;&#xFF0C;&#x53D1;&#x73B0;&#x6709;9&#x4E2A;&#x56FE;&#x7247;&#x6700;&#x5927;&#x5316;&#x4E86;&#x5355;&#x5143;&#x6FC0;&#x6D3B;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x627E;&#x5230;&#x8FD9;&#x6837;&#x7684;9&#x4E2A;&#x56FE;&#x7247;&#x5757;&#xFF08;&#x7F16;&#x53F7;1&#xFF09;&#xFF0C;&#x4F3C;&#x4E4E;&#x662F;&#x56FE;&#x7247;&#x6D45;&#x5C42;&#x533A;&#x57DF;&#x663E;&#x793A;&#x4E86;&#x9690;&#x85CF;&#x5355;&#x5143;&#x6240;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x627E;&#x5230;&#x4E86;&#x50CF;&#x8FD9;&#x6837;&#x7684;&#x8FB9;&#x7F18;&#x6216;&#x8005;&#x7EBF;&#xFF08;&#x7F16;&#x53F7;2&#xFF09;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x90A3;9&#x4E2A;&#x6700;&#x5927;&#x5316;&#x5730;&#x6FC0;&#x6D3B;&#x4E86;&#x9690;&#x85CF;&#x5355;&#x5143;&#x6FC0;&#x6D3B;&#x9879;&#x7684;&#x56FE;&#x7247;&#x5757;&#x3002;</p>
<p><img src="../images/5b097161aa8a3e22c081185a69a367a3.png" alt=""></p>
<p>&#x7136;&#x540E;&#x4F60;&#x53EF;&#x4EE5;&#x9009;&#x4E00;&#x4E2A;&#x53E6;&#x4E00;&#x4E2A;&#x7B2C;&#x4E00;&#x5C42;&#x7684;&#x9690;&#x85CF;&#x5355;&#x5143;&#xFF0C;&#x91CD;&#x590D;&#x521A;&#x624D;&#x7684;&#x6B65;&#x9AA4;&#xFF0C;&#x8FD9;&#x662F;&#x53E6;&#x4E00;&#x4E2A;&#x9690;&#x85CF;&#x5355;&#x5143;&#xFF0C;&#x4F3C;&#x4E4E;&#x7B2C;&#x4E8C;&#x4E2A;&#x7531;&#x8FD9;9&#x4E2A;&#x56FE;&#x7247;&#x5757;&#xFF08;&#x7F16;&#x53F7;1&#xFF09;&#x7EC4;&#x6210;&#x3002;&#x770B;&#x6765;&#x8FD9;&#x4E2A;&#x9690;&#x85CF;&#x5355;&#x5143;&#x5728;&#x8F93;&#x5165;&#x533A;&#x57DF;&#xFF0C;&#x5BFB;&#x627E;&#x8FD9;&#x6837;&#x7684;&#x7EBF;&#x6761;&#xFF08;&#x7F16;&#x53F7;2&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x79F0;&#x4E4B;&#x4E3A;&#x63A5;&#x53D7;&#x57DF;&#x3002;</p>
<p><img src="../images/eb711a9de1a7c8681c25c9c6e3bf71cd.png" alt=""></p>
<p>&#x5BF9;&#x5176;&#x4ED6;&#x9690;&#x85CF;&#x5355;&#x5143;&#x4E5F;&#x8FDB;&#x884C;&#x5904;&#x7406;&#xFF0C;&#x4F1A;&#x53D1;&#x73B0;&#x5176;&#x4ED6;&#x9690;&#x85CF;&#x5355;&#x5143;&#x8D8B;&#x5411;&#x4E8E;&#x6FC0;&#x6D3B;&#x7C7B;&#x4F3C;&#x4E8E;&#x8FD9;&#x6837;&#x7684;&#x56FE;&#x7247;&#x3002;&#x8FD9;&#x4E2A;&#x4F3C;&#x4E4E;&#x5BF9;&#x5782;&#x76F4;&#x660E;&#x4EAE;&#x8FB9;&#x7F18;&#x5DE6;&#x8FB9;&#x6709;&#x7EFF;&#x8272;&#x7684;&#x56FE;&#x7247;&#x5757;&#xFF08;&#x7F16;&#x53F7;1&#xFF09;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x8FD9;&#x4E00;&#x4E2A;&#x9690;&#x85CF;&#x5355;&#x5143;&#x503E;&#x5411;&#x4E8E;&#x6A58;&#x8272;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x6709;&#x8DA3;&#x7684;&#x56FE;&#x7247;&#x5757;&#xFF08;&#x7F16;&#x53F7;2&#xFF09;&#xFF0C;&#x7EA2;&#x8272;&#x548C;&#x7EFF;&#x8272;&#x6DF7;&#x5408;&#x6210;&#x8910;&#x8272;&#x6216;&#x8005;&#x68D5;&#x6A59;&#x8272;&#xFF0C;&#x4F46;&#x662F;&#x795E;&#x7ECF;&#x5143;&#x4ECD;&#x53EF;&#x4EE5;&#x6FC0;&#x6D3B;&#x5B83;&#x3002;</p>
<p><img src="../images/4000d4a71a5820691197d506654216bd.png" alt=""></p>
<p>&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#xFF0C;&#x8FD9;&#x662F;9&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x4EE3;&#x8868;&#x6027;&#x795E;&#x7ECF;&#x5143;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x56FE;&#x7247;&#x5757;&#x90FD;&#x6700;&#x5927;&#x5316;&#x5730;&#x6FC0;&#x6D3B;&#x4E86;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x7406;&#x89E3;&#xFF0C;&#x7B2C;&#x4E00;&#x5C42;&#x7684;&#x9690;&#x85CF;&#x5355;&#x5143;&#x901A;&#x5E38;&#x4F1A;&#x627E;&#x4E00;&#x4E9B;&#x7B80;&#x5355;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x8FB9;&#x7F18;&#x6216;&#x8005;&#x989C;&#x8272;&#x9634;&#x5F71;&#x3002;</p>
<p>&#x6211;&#x5728;&#x8FD9;&#x4E2A;&#x89C6;&#x9891;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x6240;&#x6709;&#x4F8B;&#x5B50;&#x6765;&#x81EA;&#x4E8E;<strong>Matthew Zener</strong>&#x548C;<strong>Rob Fergus</strong>&#x7684;&#x8FD9;&#x7BC7;&#x8BBA;&#x6587;&#xFF0C;&#x9898;&#x76EE;&#x662F;&#xFF08;<strong>Zeiler M D, Fergus R.Visualizing and Understanding Convolutional Networks[J]. 2013, 8689:818-833.</strong>&#xFF09;&#x300A;&#x53EF;&#x89C6;&#x5316;&#x7406;&#x89E3;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x300B;&#xFF0C;&#x6211;&#x4F1A;&#x4F7F;&#x7528;&#x4E00;&#x79CD;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x53EF;&#x89C6;&#x5316;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x9690;&#x85CF;&#x5355;&#x5143;&#x7684;&#x8BA1;&#x7B97;&#x5185;&#x5BB9;&#x3002;&#x5982;&#x679C;&#x4F60;&#x8BFB;&#x8FC7;&#x4ED6;&#x4EEC;&#x7684;&#x8BBA;&#x6587;&#xFF0C;&#x4ED6;&#x4EEC;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x4E9B;&#x66F4;&#x590D;&#x6742;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x53EF;&#x89C6;&#x5316;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x8BA1;&#x7B97;&#x3002;</p>
<p>&#x4F60;&#x5DF2;&#x7ECF;&#x5728;&#x7B2C;&#x4E00;&#x5C42;&#x7684;9&#x4E2A;&#x9690;&#x85CF;&#x5355;&#x5143;&#x91CD;&#x590D;&#x4E86;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x597D;&#x51E0;&#x904D;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x6DF1;&#x5C42;&#x7684;&#x9690;&#x85CF;&#x5355;&#x5143;&#x4E2D;&#x8FDB;&#x884C;&#x8FD9;&#x6837;&#x7684;&#x8BA1;&#x7B97;&#x5462;&#xFF1F;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x6DF1;&#x5C42;&#x90E8;&#x5206;&#x5B66;&#x5230;&#x4E86;&#x4EC0;&#x4E48;&#xFF1F;&#x5728;&#x6DF1;&#x5C42;&#x90E8;&#x5206;&#xFF0C;&#x4E00;&#x4E2A;&#x9690;&#x85CF;&#x5355;&#x5143;&#x4F1A;&#x770B;&#x5230;&#x4E00;&#x5F20;&#x56FE;&#x7247;&#x66F4;&#x5927;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x5728;&#x6781;&#x7AEF;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EF;&#x4EE5;&#x5047;&#x8BBE;&#x6BCF;&#x4E00;&#x4E2A;&#x50CF;&#x7D20;&#x90FD;&#x4F1A;&#x5F71;&#x54CD;&#x5230;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x66F4;&#x6DF1;&#x5C42;&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x9760;&#x540E;&#x7684;&#x9690;&#x85CF;&#x5355;&#x5143;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x66F4;&#x5927;&#x7684;&#x56FE;&#x7247;&#x5757;&#xFF0C;&#x6211;&#x8FD8;&#x4F1A;&#x753B;&#x51FA;&#x548C;&#x8FD9;&#x9875;&#x4E2D;&#x7684;&#x5927;&#x5C0F;&#x76F8;&#x540C;&#x7684;&#x56FE;&#x7247;&#x5757;&#x3002;</p>
<p><img src="../images/96beb39f85ea9ab52ac1bdf562b440ec.png" alt=""></p>
<p>&#x4F46;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x91CD;&#x590D;&#x8FD9;&#x4E00;&#x8FC7;&#x7A0B;&#xFF0C;&#x8FD9;&#xFF08;<strong>Layer 1</strong>&#x6240;&#x793A;&#x56FE;&#x7247;&#xFF09;&#x662F;&#x4E4B;&#x524D;&#x7B2C;&#x4E00;&#x5C42;&#x5F97;&#x5230;&#x7684;&#xFF0C;&#x8FD9;&#x4E2A;&#xFF08;<strong>Layer 2</strong>&#x6240;&#x793A;&#x56FE;&#x7247;&#xFF09;&#x662F;&#x53EF;&#x89C6;&#x5316;&#x7684;&#x7B2C;2&#x5C42;&#x4E2D;&#x6700;&#x5927;&#x7A0B;&#x5EA6;&#x6FC0;&#x6D3B;&#x7684;9&#x4E2A;&#x9690;&#x85CF;&#x5355;&#x5143;&#x3002;&#x6211;&#x60F3;&#x89E3;&#x91CA;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;&#x53EF;&#x89C6;&#x5316;&#xFF0C;&#x8FD9;&#x662F;&#xFF08;&#x7F16;&#x53F7;2&#x6240;&#x793A;&#xFF09;&#x4F7F;&#x4E00;&#x4E2A;&#x9690;&#x85CF;&#x5355;&#x5143;&#x6700;&#x5927;&#x6FC0;&#x6D3B;&#x7684;9&#x4E2A;&#x56FE;&#x7247;&#x5757;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x7EC4;&#x5408;&#xFF0C;&#x8FD9;&#x662F;&#x53E6;&#x4E00;&#x7EC4;&#xFF08;&#x7F16;&#x53F7;2&#xFF09;&#xFF0C;&#x4F7F;&#x5F97;&#x4E00;&#x4E2A;&#x9690;&#x85CF;&#x5355;&#x5143;&#x88AB;&#x6FC0;&#x6D3B;&#x7684;9&#x4E2A;&#x56FE;&#x7247;&#x5757;&#xFF0C;&#x8FD9;&#x4E2A;&#x53EF;&#x89C6;&#x5316;&#x5C55;&#x793A;&#x4E86;&#x7B2C;&#x4E8C;&#x5C42;&#x7684;9&#x4E2A;&#x9690;&#x85CF;&#x5355;&#x5143;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x53C8;&#x6709;9&#x4E2A;&#x56FE;&#x7247;&#x5757;&#x4F7F;&#x5F97;&#x9690;&#x85CF;&#x5355;&#x5143;&#x6709;&#x8F83;&#x5927;&#x7684;&#x8F93;&#x51FA;&#x6216;&#x662F;&#x8F83;&#x5927;&#x7684;&#x6FC0;&#x6D3B;&#x3002;</p>
<p><img src="../images/2ccff4b8e125893f330414574cd03af8.png" alt=""></p>
<p>&#x5728;&#x66F4;&#x6DF1;&#x7684;&#x5C42;&#x4E0A;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x91CD;&#x590D;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x3002;</p>
<p><img src="../images/d7fd293116929c0e6e807e10156d7e5a.png" alt=""></p>
<p>&#x5728;&#x8FD9;&#x9875;&#x91CC;&#x5F88;&#x96BE;&#x770B;&#x6E05;&#x695A;&#xFF0C;&#x8FD9;&#x4E9B;&#x5FAE;&#x5C0F;&#x7684;&#x6D45;&#x5C42;&#x56FE;&#x7247;&#x5757;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x653E;&#x5927;&#x4E00;&#x4E9B;&#xFF0C;&#x8FD9;&#x662F;&#x7B2C;&#x4E00;&#x5C42;&#xFF0C;&#x8FD9;&#x662F;&#x7B2C;&#x4E00;&#x4E2A;&#x88AB;&#x9AD8;&#x5EA6;&#x6FC0;&#x6D3B;&#x7684;&#x5355;&#x5143;&#xFF0C;&#x4F60;&#x80FD;&#x5728;&#x8F93;&#x5165;&#x56FE;&#x7247;&#x7684;&#x533A;&#x57DF;&#x770B;&#x5230;&#xFF0C;&#x5927;&#x6982;&#x662F;&#x8FD9;&#x4E2A;&#x89D2;&#x5EA6;&#x7684;&#x8FB9;&#x7F18;&#xFF08;&#x7F16;&#x53F7;1&#xFF09;&#x653E;&#x5927;&#x7B2C;&#x4E8C;&#x5C42;&#x7684;&#x53EF;&#x89C6;&#x5316;&#x56FE;&#x50CF;&#x3002;</p>
<p><img src="../images/83f73c165fe6ec9c98ab2993d3efaf7f.png" alt=""></p>
<p>&#x6709;&#x610F;&#x601D;&#x4E86;&#xFF0C;&#x7B2C;&#x4E8C;&#x5C42;&#x4F3C;&#x4E4E;&#x68C0;&#x6D4B;&#x5230;&#x66F4;&#x590D;&#x6742;&#x7684;&#x5F62;&#x72B6;&#x548C;&#x6A21;&#x5F0F;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x8FD9;&#x4E2A;&#x9690;&#x85CF;&#x5355;&#x5143;&#xFF08;&#x7F16;&#x53F7;1&#xFF09;&#xFF0C;&#x5B83;&#x4F1A;&#x627E;&#x5230;&#x6709;&#x5F88;&#x591A;&#x5782;&#x7EBF;&#x7684;&#x5782;&#x76F4;&#x56FE;&#x6848;&#xFF0C;&#x8FD9;&#x4E2A;&#x9690;&#x85CF;&#x5355;&#x5143;&#xFF08;&#x7F16;&#x53F7;2&#xFF09;&#x4F3C;&#x4E4E;&#x5728;&#x5DE6;&#x4FA7;&#x6709;&#x5706;&#x5F62;&#x56FE;&#x6848;&#x65F6;&#x4F1A;&#x88AB;&#x9AD8;&#x5EA6;&#x6FC0;&#x6D3B;&#xFF0C;&#x8FD9;&#x4E2A;&#x7684;&#x7279;&#x5F81;&#xFF08;&#x7F16;&#x53F7;3&#xFF09;&#x662F;&#x5F88;&#x7EC6;&#x7684;&#x5782;&#x7EBF;&#xFF0C;&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#xFF0C;&#x7B2C;&#x4E8C;&#x5C42;&#x68C0;&#x6D4B;&#x7684;&#x7279;&#x5F81;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x590D;&#x6742;&#x3002;</p>
<p><img src="../images/62ac4181d43c9f937b33a70428d1fca1.png" alt=""></p>
<p>&#x770B;&#x770B;&#x7B2C;&#x4E09;&#x5C42;&#x6211;&#x4EEC;&#x5C06;&#x5176;&#x653E;&#x5927;&#xFF0C;&#x653E;&#x5F97;&#x66F4;&#x5927;&#x4E00;&#x70B9;&#xFF0C;&#x770B;&#x5F97;&#x66F4;&#x6E05;&#x695A;&#x4E00;&#x70B9;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x6FC0;&#x6D3B;&#x4E86;&#x7B2C;&#x4E09;&#x5C42;&#x3002;&#x518D;&#x653E;&#x5927;&#x4E00;&#x70B9;&#xFF0C;&#x8FD9;&#x53C8;&#x5F88;&#x6709;&#x8DA3;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x9690;&#x85CF;&#x5355;&#x5143;&#xFF08;&#x7F16;&#x53F7;1&#xFF09;&#x4F3C;&#x4E4E;&#x5BF9;&#x56FE;&#x50CF;&#x5DE6;&#x4E0B;&#x89D2;&#x7684;&#x5706;&#x5F62;&#x5F88;&#x654F;&#x611F;&#xFF0C;&#x6240;&#x4EE5;&#x68C0;&#x6D4B;&#x5230;&#x5F88;&#x591A;&#x8F66;&#x3002;&#x8FD9;&#x4E00;&#x4E2A;&#xFF08;&#x7F16;&#x53F7;2&#xFF09;&#x4F3C;&#x4E4E;&#x5F00;&#x59CB;&#x68C0;&#x6D4B;&#x5230;&#x4EBA;&#x7C7B;&#xFF0C;&#x8FD9;&#x4E2A;&#xFF08;&#x7F16;&#x53F7;3&#xFF09;&#x4F3C;&#x4E4E;&#x68C0;&#x6D4B;&#x7279;&#x5B9A;&#x7684;&#x56FE;&#x6848;&#xFF0C;&#x8702;&#x7A9D;&#x5F62;&#x72B6;&#x6216;&#x8005;&#x65B9;&#x5F62;&#xFF0C;&#x7C7B;&#x4F3C;&#x8FD9;&#x6837;&#x89C4;&#x5F8B;&#x7684;&#x56FE;&#x6848;&#x3002;&#x6709;&#x4E9B;&#x5F88;&#x96BE;&#x770B;&#x51FA;&#x6765;&#xFF0C;&#x9700;&#x8981;&#x624B;&#x52A8;&#x5F04;&#x660E;&#x767D;&#x68C0;&#x6D4B;&#x5230;&#x4EC0;&#x4E48;&#xFF0C;&#x4F46;&#x662F;&#x7B2C;&#x4E09;&#x5C42;&#x660E;&#x663E;&#xFF0C;&#x68C0;&#x6D4B;&#x5230;&#x66F4;&#x590D;&#x6742;&#x7684;&#x6A21;&#x5F0F;&#x3002;</p>
<p><img src="../images/96585e7bfa539245870080d4db16f255.png" alt=""></p>
<p>&#x4E0B;&#x4E00;&#x5C42;&#x5462;&#xFF1F;&#x8FD9;&#x662F;&#x7B2C;&#x56DB;&#x5C42;&#xFF0C;&#x68C0;&#x6D4B;&#x5230;&#x7684;&#x6A21;&#x5F0F;&#x548C;&#x7279;&#x5F81;&#x66F4;&#x52A0;&#x590D;&#x6742;&#xFF0C;&#x8FD9;&#x4E2A;&#xFF08;&#x7F16;&#x53F7;1&#xFF09;&#x5B66;&#x4E60;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x72D7;&#x7684;&#x68C0;&#x6D4B;&#x5668;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E9B;&#x72D7;&#x770B;&#x8D77;&#x6765;&#x90FD;&#x5F88;&#x7C7B;&#x4F3C;&#xFF0C;&#x6211;&#x5E76;&#x4E0D;&#x77E5;&#x9053;&#x8FD9;&#x4E9B;&#x72D7;&#x7684;&#x79CD;&#x7C7B;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x77E5;&#x9053;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x72D7;&#xFF0C;&#x4ED6;&#x4EEC;&#x770B;&#x8D77;&#x6765;&#x4E5F;&#x7C7B;&#x4F3C;&#x3002;&#x7B2C;&#x56DB;&#x5C42;&#x4E2D;&#x7684;&#x8FD9;&#x4E2A;&#xFF08;&#x7F16;&#x53F7;2&#xFF09;&#x9690;&#x85CF;&#x5355;&#x5143;&#x5B83;&#x68C0;&#x6D4B;&#x4EC0;&#x4E48;&#xFF1F;&#x6C34;&#x5417;&#xFF1F;&#x8FD9;&#x4E2A;&#xFF08;&#x7F16;&#x53F7;3&#xFF09;&#x4F3C;&#x4E4E;&#x68C0;&#x6D4B;&#x5230;&#x9E1F;&#x7684;&#x811A;&#x7B49;&#x7B49;&#x3002;</p>
<p><img src="../images/ac77f5f5dd63264cf8af597c3aa20d59.png" alt=""></p>
<p>&#x7B2C;&#x4E94;&#x5C42;&#x68C0;&#x6D4B;&#x5230;&#x66F4;&#x52A0;&#x590D;&#x6742;&#x7684;&#x4E8B;&#x7269;&#xFF0C;&#x6CE8;&#x610F;&#x5230;&#x8FD9;&#xFF08;&#x7F16;&#x53F7;1&#xFF09;&#x4E5F;&#x6709;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#xFF0C;&#x4F3C;&#x4E4E;&#x662F;&#x4E00;&#x4E2A;&#x72D7;&#x68C0;&#x6D4B;&#x5668;&#xFF0C;&#x4F46;&#x662F;&#x53EF;&#x4EE5;&#x68C0;&#x6D4B;&#x5230;&#x7684;&#x72D7;&#x4F3C;&#x4E4E;&#x66F4;&#x52A0;&#x591A;&#x6837;&#x6027;&#x3002;&#x8FD9;&#x4E2A;&#xFF08;&#x7F16;&#x53F7;2&#xFF09;&#x53EF;&#x4EE5;&#x68C0;&#x6D4B;&#x5230;&#x952E;&#x76D8;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x952E;&#x76D8;&#x8D28;&#x5730;&#x7684;&#x7269;&#x4F53;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x6709;&#x5F88;&#x591A;&#x70B9;&#x7684;&#x7269;&#x4F53;&#x3002;&#x6211;&#x8BA4;&#x4E3A;&#x8FD9;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#xFF08;&#x7F16;&#x53F7;3&#xFF09;&#x53EF;&#x80FD;&#x68C0;&#x6D4B;&#x5230;&#x6587;&#x672C;&#xFF0C;&#x4F46;&#x662F;&#x5F88;&#x96BE;&#x786E;&#x5B9A;&#xFF0C;&#x8FD9;&#x4E2A;&#xFF08;&#x7F16;&#x53F7;4&#xFF09;&#x68C0;&#x6D4B;&#x5230;&#x82B1;&#x3002;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x4E00;&#x4E9B;&#x8FDB;&#x5C55;&#xFF0C;&#x4ECE;&#x68C0;&#x6D4B;&#x7B80;&#x5355;&#x7684;&#x4E8B;&#x7269;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x7B2C;&#x4E00;&#x5C42;&#x7684;&#x8FB9;&#x7F18;&#xFF0C;&#x7B2C;&#x4E8C;&#x5C42;&#x7684;&#x8D28;&#x5730;&#xFF0C;&#x5230;&#x6DF1;&#x5C42;&#x7684;&#x590D;&#x6742;&#x7269;&#x4F53;&#x3002;</p>
<p>&#x6211;&#x5E0C;&#x671B;&#x8FD9;&#x8BA9;&#x4F60;&#x53EF;&#x4EE5;&#x66F4;&#x76F4;&#x89C2;&#x5730;&#x4E86;&#x89E3;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x6D45;&#x5C42;&#x548C;&#x6DF1;&#x5C42;&#x662F;&#x5982;&#x4F55;&#x8BA1;&#x7B97;&#x7684;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x8BA9;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x77E5;&#x8BC6;&#x5F00;&#x59CB;&#x6784;&#x9020;&#x795E;&#x7ECF;&#x98CE;&#x683C;&#x8FC1;&#x79FB;&#x7B97;&#x6CD5;&#x3002;</p>
<h3 id="48-&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#xFF08;cost-function&#xFF09;">4.8 &#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#xFF08;Cost function&#xFF09;</h3>
<p>&#x8981;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x98CE;&#x683C;&#x8FC1;&#x79FB;&#x7CFB;&#x7EDF;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x4E3A;&#x751F;&#x6210;&#x7684;&#x56FE;&#x50CF;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#xFF0C;&#x4F60;&#x63A5;&#x4E0B;&#x770B;&#x5230;&#x7684;&#x662F;&#xFF0C;&#x901A;&#x8FC7;&#x6700;&#x5C0F;&#x5316;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x751F;&#x6210;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x4EFB;&#x4F55;&#x56FE;&#x50CF;&#x3002;</p>
<p><img src="../images/dd9dc6d164ca059f7996a6cbf58997a5.jpg" alt=""></p>
<p>&#x8BB0;&#x4F4F;&#x6211;&#x4EEC;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x7ED9;&#x4F60;&#x4E00;&#x4E2A;&#x5185;&#x5BB9;&#x56FE;&#x50CF;$C$&#xFF0C;&#x7ED9;&#x5B9A;&#x4E00;&#x4E2A;&#x98CE;&#x683C;&#x56FE;&#x7247;$S$&#xFF0C;&#x800C;&#x4F60;&#x7684;&#x76EE;&#x6807;&#x662F;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x65B0;&#x56FE;&#x7247;$G$&#x3002;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x795E;&#x7ECF;&#x98CE;&#x683C;&#x8FC1;&#x79FB;&#xFF0C;&#x4F60;&#x8981;&#x505A;&#x7684;&#x662F;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x5173;&#x4E8E;$G$&#x7684;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;$J$&#x7528;&#x6765;&#x8BC4;&#x5224;&#x67D0;&#x4E2A;&#x751F;&#x6210;&#x56FE;&#x50CF;&#x7684;&#x597D;&#x574F;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F7F;&#x7528;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x6CD5;&#x53BB;&#x6700;&#x5C0F;&#x5316;$J(G)$&#xFF0C;&#x4EE5;&#x4FBF;&#x4E8E;&#x751F;&#x6210;&#x8FD9;&#x4E2A;&#x56FE;&#x50CF;&#x3002;</p>
<p>&#x600E;&#x4E48;&#x5224;&#x65AD;&#x751F;&#x6210;&#x56FE;&#x50CF;&#x7684;&#x597D;&#x574F;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x628A;&#x8FD9;&#x4E2A;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x4E3A;&#x4E24;&#x4E2A;&#x90E8;&#x5206;&#x3002;</p>
<p>$J_{\text{content}}(C,G)$</p>
<p>&#x7B2C;&#x4E00;&#x90E8;&#x5206;&#x88AB;&#x79F0;&#x4F5C;&#x5185;&#x5BB9;&#x4EE3;&#x4EF7;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5173;&#x4E8E;&#x5185;&#x5BB9;&#x56FE;&#x7247;&#x548C;&#x751F;&#x6210;&#x56FE;&#x7247;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x5B83;&#x662F;&#x7528;&#x6765;&#x5EA6;&#x91CF;&#x751F;&#x6210;&#x56FE;&#x7247;$G$&#x7684;&#x5185;&#x5BB9;&#x4E0E;&#x5185;&#x5BB9;&#x56FE;&#x7247;$C$&#x7684;&#x5185;&#x5BB9;&#x6709;&#x591A;&#x76F8;&#x4F3C;&#x3002;</p>
<p>$J_{\text{style}}(S,G)$</p>
<p>&#x7136;&#x540E;&#x6211;&#x4EEC;&#x4F1A;&#x628A;&#x7ED3;&#x679C;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&#x98CE;&#x683C;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5173;&#x4E8E;$S$&#x548C;$G$&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x7528;&#x6765;&#x5EA6;&#x91CF;&#x56FE;&#x7247;$G$&#x7684;&#x98CE;&#x683C;&#x548C;&#x56FE;&#x7247;$S$&#x7684;&#x98CE;&#x683C;&#x7684;&#x76F8;&#x4F3C;&#x5EA6;&#x3002;</p>
<p>$J( G) = a J<em>{\text{content}}( C,G) + \beta J</em>{\text{style}}(S,G)$</p>
<p>&#x6700;&#x540E;&#x6211;&#x4EEC;&#x7528;&#x4E24;&#x4E2A;&#x8D85;&#x53C2;&#x6570;$a$&#x548C;$\beta$&#x6765;&#x6765;&#x786E;&#x5B9A;&#x5185;&#x5BB9;&#x4EE3;&#x4EF7;&#x548C;&#x98CE;&#x683C;&#x4EE3;&#x4EF7;&#xFF0C;&#x4E24;&#x8005;&#x4E4B;&#x95F4;&#x7684;&#x6743;&#x91CD;&#x7528;&#x4E24;&#x4E2A;&#x8D85;&#x53C2;&#x6570;&#x6765;&#x786E;&#x5B9A;&#x3002;&#x4E24;&#x4E2A;&#x4EE3;&#x4EF7;&#x7684;&#x6743;&#x91CD;&#x4F3C;&#x4E4E;&#x662F;&#x591A;&#x4F59;&#x7684;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x4E00;&#x4E2A;&#x8D85;&#x53C2;&#x6570;&#x4F3C;&#x4E4E;&#x5C31;&#x591F;&#x4E86;&#xFF0C;&#x4F46;&#x63D0;&#x51FA;&#x795E;&#x7ECF;&#x98CE;&#x683C;&#x8FC1;&#x79FB;&#x7684;&#x539F;&#x59CB;&#x4F5C;&#x8005;&#x4F7F;&#x7528;&#x4E86;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x8D85;&#x53C2;&#x6570;&#xFF0C;&#x6211;&#x51C6;&#x5907;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x3002;</p>
<p>&#x5173;&#x4E8E;&#x795E;&#x7ECF;&#x98CE;&#x683C;&#x8FC1;&#x79FB;&#x7B97;&#x6CD5;&#x6211;&#x5C06;&#x5728;&#x63A5;&#x4E0B;&#x6765;&#x51E0;&#x6BB5;&#x89C6;&#x9891;&#x4E2D;&#x5C55;&#x793A;&#x7684;&#xFF0C;&#x662F;&#x57FA;&#x4E8E;<strong>Leon Gatys</strong>&#xFF0C; <strong>Alexandra Ecker</strong>&#x548C;<strong>Matthias Bethge</strong>&#x7684;&#x8FD9;&#x7BC7;&#x8BBA;&#x6587;&#x3002;&#x8FD9;&#x7BC7;&#x8BBA;&#x6587;&#x5E76;&#x4E0D;&#x662F;&#x5F88;&#x96BE;&#x8BFB;&#x61C2;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x613F;&#x610F;&#xFF0C;&#x770B;&#x5B8C;&#x8FD9;&#x4E9B;&#x89C6;&#x9891;&#xFF0C;&#x6211;&#x4E5F;&#x975E;&#x5E38;&#x63A8;&#x8350;&#x4F60;&#x53BB;&#x770B;&#x770B;&#x4ED6;&#x4EEC;&#x7684;&#x8BBA;&#x6587;&#x3002;</p>
<p><strong>Leon A. Gatys, Alexander S. Ecker, Matthias Bethge, (2015). A Neural Algorithm of Artistic Style</strong> (<a href="https://arxiv.org/abs/1508.06576" target="_blank">https://arxiv.org/abs/1508.06576</a>)</p>
<p>&#x7B97;&#x6CD5;&#x7684;&#x8FD0;&#x884C;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF0C;&#x5BF9;&#x4E8E;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;$J(G)$&#xFF0C;&#x4E3A;&#x4E86;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x65B0;&#x56FE;&#x50CF;&#xFF0C;&#x4F60;&#x63A5;&#x4E0B;&#x6765;&#x8981;&#x505A;&#x7684;&#x662F;&#x968F;&#x673A;&#x521D;&#x59CB;&#x5316;&#x751F;&#x6210;&#x56FE;&#x50CF;$G$&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x662F;100&#xD7;100&#xD7;3&#xFF0C;&#x53EF;&#x80FD;&#x662F;500&#xD7;500&#xD7;3&#xFF0C;&#x53C8;&#x6216;&#x8005;&#x662F;&#x4EFB;&#x4F55;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x5C3A;&#x5BF8;&#x3002;</p>
<p><img src="../images/b8dafd082111a86c00066dedd1033ef1.png" alt=""></p>
<p>&#x7136;&#x540E;&#x4F7F;&#x7528;&#x5728;&#x4E4B;&#x524D;&#x7684;&#x5E7B;&#x706F;&#x7247;&#x4E0A;&#x5B9A;&#x4E49;&#x7684;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;$J(G)$&#xFF0C;&#x4F60;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x505A;&#x7684;&#x662F;&#x4F7F;&#x7528;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7684;&#x65B9;&#x6CD5;&#x5C06;&#x5176;&#x6700;&#x5C0F;&#x5316;&#xFF0C;&#x66F4;&#x65B0;$G:= G - \frac{\partial}{\partial G}J(G)$&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x6B65;&#x9AA4;&#x4E2D;&#xFF0C;&#x4F60;&#x5B9E;&#x9645;&#x4E0A;&#x66F4;&#x65B0;&#x7684;&#x662F;&#x56FE;&#x50CF;$G$&#x7684;&#x50CF;&#x7D20;&#x503C;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;100&#xD7;100&#xD7;3&#xFF0C;&#x6BD4;&#x5982;<strong>RGB</strong>&#x901A;&#x9053;&#x7684;&#x56FE;&#x7247;&#x3002;</p>
<p><img src="../images/dd376e74155008845e96d662cc45493a.png" alt=""></p>
<p>&#x8FD9;&#x91CC;&#x6709;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5047;&#x8BBE;&#x4F60;&#x4ECE;&#x8FD9;&#x5F20;&#x5185;&#x5BB9;&#x56FE;&#x7247;&#xFF08;&#x7F16;&#x53F7;1&#xFF09;&#x548C;&#x98CE;&#x683C;&#xFF08;&#x7F16;&#x53F7;2&#xFF09;&#x56FE;&#x7247;&#x5F00;&#x59CB;&#xFF0C;&#x8FD9;&#x662F;&#x53E6;&#x4E00;&#x5F20;&#x516C;&#x5F00;&#x7684;&#x6BD5;&#x52A0;&#x7D22;&#x753B;&#x4F5C;&#xFF0C;&#x5F53;&#x4F60;&#x968F;&#x673A;&#x521D;&#x59CB;&#x5316;$G$&#xFF0C;&#x4F60;&#x968F;&#x673A;&#x521D;&#x59CB;&#x5316;&#x7684;&#x751F;&#x6210;&#x56FE;&#x50CF;&#x5C31;&#x662F;&#x8FD9;&#x5F20;&#x968F;&#x673A;&#x9009;&#x53D6;&#x50CF;&#x7D20;&#x7684;&#x767D;&#x566A;&#x58F0;&#x56FE;&#xFF08;&#x7F16;&#x53F7;3&#xFF09;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x8FD0;&#x884C;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7B97;&#x6CD5;&#xFF0C;&#x6700;&#x5C0F;&#x5316;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;$J(G)$&#xFF0C;&#x9010;&#x6B65;&#x5904;&#x7406;&#x50CF;&#x7D20;&#xFF0C;&#x8FD9;&#x6837;&#x6162;&#x6162;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x751F;&#x6210;&#x56FE;&#x7247;&#xFF08;&#x7F16;&#x53F7;4&#x3001;5&#x3001;6&#xFF09;&#xFF0C;&#x8D8A;&#x6765;&#x8D8A;&#x50CF;&#x7528;&#x98CE;&#x683C;&#x56FE;&#x7247;&#x7684;&#x98CE;&#x683C;&#x753B;&#x51FA;&#x6765;&#x7684;&#x5185;&#x5BB9;&#x56FE;&#x7247;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x6BB5;&#x89C6;&#x9891;&#x4E2D;&#x4F60;&#x770B;&#x5230;&#x4E86;&#x795E;&#x7ECF;&#x98CE;&#x683C;&#x8FC1;&#x79FB;&#x7B97;&#x6CD5;&#x7684;&#x6982;&#x8981;&#xFF0C;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x751F;&#x6210;&#x56FE;&#x7247;$G$&#x7684;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x6700;&#x5C0F;&#x5316;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x600E;&#x4E48;&#x53BB;&#x5B9A;&#x4E49;&#x5185;&#x5BB9;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x548C;&#x98CE;&#x683C;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x4ECE;&#x4E0B;&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#x5F00;&#x59CB;&#x5B66;&#x4E60;&#x8FD9;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x5427;&#x3002;</p>
<h3 id="49-&#x5185;&#x5BB9;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#xFF08;content-cost-function&#xFF09;">4.9 &#x5185;&#x5BB9;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#xFF08;Content cost function&#xFF09;</h3>
<p><img src="../images/2c39492e728ea3605a3247860b23e1a0.png" alt=""></p>
<p>&#x98CE;&#x683C;&#x8FC1;&#x79FB;&#x7F51;&#x7EDC;&#x7684;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x6709;&#x4E00;&#x4E2A;&#x5185;&#x5BB9;&#x4EE3;&#x4EF7;&#x90E8;&#x5206;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x98CE;&#x683C;&#x4EE3;&#x4EF7;&#x90E8;&#x5206;&#x3002;</p>
<p>$J( G) = \alpha J<em>{\text{content}}( C,G) + \beta J</em>{\text{style}}(S,G)$</p>
<p>&#x6211;&#x4EEC;&#x5148;&#x5B9A;&#x4E49;&#x5185;&#x5BB9;&#x4EE3;&#x4EF7;&#x90E8;&#x5206;&#xFF0C;&#x4E0D;&#x8981;&#x5FD8;&#x4E86;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x6574;&#x4E2A;&#x98CE;&#x683C;&#x8FC1;&#x79FB;&#x7F51;&#x7EDC;&#x7684;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x5185;&#x5BB9;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x5E94;&#x8BE5;&#x662F;&#x4EC0;&#x4E48;&#x3002;</p>
<p><img src="../images/d54256309adfc1e140390a334bfc49ee.png" alt=""></p>
<p>&#x5047;&#x5982;&#x8BF4;&#xFF0C;&#x4F60;&#x7528;&#x9690;&#x542B;&#x5C42;$l$&#x6765;&#x8BA1;&#x7B97;&#x5185;&#x5BB9;&#x4EE3;&#x4EF7;&#xFF0C;&#x5982;&#x679C;$l$&#x662F;&#x4E2A;&#x5F88;&#x5C0F;&#x7684;&#x6570;&#xFF0C;&#x6BD4;&#x5982;&#x7528;&#x9690;&#x542B;&#x5C42;1&#xFF0C;&#x8FD9;&#x4E2A;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x5C31;&#x4F1A;&#x4F7F;&#x4F60;&#x7684;&#x751F;&#x6210;&#x56FE;&#x7247;&#x50CF;&#x7D20;&#x4E0A;&#x975E;&#x5E38;&#x63A5;&#x8FD1;&#x4F60;&#x7684;&#x5185;&#x5BB9;&#x56FE;&#x7247;&#x3002;&#x7136;&#x800C;&#x5982;&#x679C;&#x4F60;&#x7528;&#x5F88;&#x6DF1;&#x7684;&#x5C42;&#xFF0C;&#x90A3;&#x4E48;&#x90A3;&#x5C31;&#x4F1A;&#x95EE;&#xFF0C;&#x5185;&#x5BB9;&#x56FE;&#x7247;&#x91CC;&#x662F;&#x5426;&#x6709;&#x72D7;&#xFF0C;&#x7136;&#x540E;&#x5B83;&#x5C31;&#x4F1A;&#x786E;&#x4FDD;&#x751F;&#x6210;&#x56FE;&#x7247;&#x91CC;&#x6709;&#x4E00;&#x4E2A;&#x72D7;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x5B9E;&#x9645;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E2A;&#x5C42;$l$&#x5728;&#x7F51;&#x7EDC;&#x4E2D;&#x65E2;&#x4E0D;&#x4F1A;&#x9009;&#x7684;&#x592A;&#x6D45;&#x4E5F;&#x4E0D;&#x4F1A;&#x9009;&#x7684;&#x592A;&#x6DF1;&#x3002;&#x56E0;&#x4E3A;&#x4F60;&#x8981;&#x81EA;&#x5DF1;&#x505A;&#x8FD9;&#x5468;&#x7ED3;&#x675F;&#x7684;&#x7F16;&#x7A0B;&#x7EC3;&#x4E60;&#xFF0C;&#x6211;&#x4F1A;&#x8BA9;&#x4F60;&#x83B7;&#x5F97;&#x4E00;&#x4E9B;&#x76F4;&#x89C9;&#xFF0C;&#x5728;&#x7F16;&#x7A0B;&#x7EC3;&#x4E60;&#x4E2D;&#x7684;&#x5177;&#x4F53;&#x4F8B;&#x5B50;&#x91CC;&#x901A;&#x5E38;$l$&#x4F1A;&#x9009;&#x62E9;&#x5728;&#x7F51;&#x7EDC;&#x7684;&#x4E2D;&#x95F4;&#x5C42;&#xFF0C;&#x65E2;&#x4E0D;&#x592A;&#x6D45;&#x4E5F;&#x4E0D;&#x5F88;&#x6DF1;&#xFF0C;&#x7136;&#x540E;&#x7528;&#x4E00;&#x4E2A;&#x9884;&#x8BAD;&#x7EC3;&#x7684;&#x5377;&#x79EF;&#x6A21;&#x578B;&#xFF0C;&#x53EF;&#x4EE5;&#x662F;<strong>VGG&#x7F51;&#x7EDC;</strong>&#x6216;&#x8005;&#x5176;&#x4ED6;&#x7684;&#x7F51;&#x7EDC;&#x4E5F;&#x53EF;&#x4EE5;&#x3002;</p>
<p><img src="../images/5b63e8b0c5c991bc19838b709524b79d.png" alt=""></p>
<p>&#x73B0;&#x5728;&#x4F60;&#x9700;&#x8981;&#x8861;&#x91CF;&#x5047;&#x5982;&#x6709;&#x4E00;&#x4E2A;&#x5185;&#x5BB9;&#x56FE;&#x7247;&#x548C;&#x4E00;&#x4E2A;&#x751F;&#x6210;&#x56FE;&#x7247;&#x4ED6;&#x4EEC;&#x5728;&#x5185;&#x5BB9;&#x4E0A;&#x7684;&#x76F8;&#x4F3C;&#x5EA6;&#xFF0C;&#x6211;&#x4EEC;&#x4EE4;&#x8FD9;&#x4E2A;$a^{[l][C]}$&#x548C;$a^{[l][G]}$&#xFF0C;&#x4EE3;&#x8868;&#x8FD9;&#x4E24;&#x4E2A;&#x56FE;&#x7247;$C$&#x548C;$G$&#x7684;$l$&#x5C42;&#x7684;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x503C;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E24;&#x4E2A;&#x6FC0;&#x6D3B;&#x503C;&#x76F8;&#x4F3C;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x610F;&#x5473;&#x7740;&#x4E24;&#x4E2A;&#x56FE;&#x7247;&#x7684;&#x5185;&#x5BB9;&#x76F8;&#x4F3C;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x8FD9;&#x4E2A;</p>
<p>$J_{\text{content}}( C,G) = \frac{1}{2}|| a^{[l][C]} - a^{[l][G]}||^{2}$</p>
<p>&#x4E3A;&#x4E24;&#x4E2A;&#x6FC0;&#x6D3B;&#x503C;&#x4E0D;&#x540C;&#x6216;&#x8005;&#x76F8;&#x4F3C;&#x7684;&#x7A0B;&#x5EA6;&#xFF0C;&#x6211;&#x4EEC;&#x53D6;$l$&#x5C42;&#x7684;&#x9690;&#x542B;&#x5355;&#x5143;&#x7684;&#x6FC0;&#x6D3B;&#x503C;&#xFF0C;&#x6309;&#x5143;&#x7D20;&#x76F8;&#x51CF;&#xFF0C;&#x5185;&#x5BB9;&#x56FE;&#x7247;&#x7684;&#x6FC0;&#x6D3B;&#x503C;&#x4E0E;&#x751F;&#x6210;&#x56FE;&#x7247;&#x76F8;&#x6BD4;&#x8F83;&#xFF0C;&#x7136;&#x540E;&#x53D6;&#x5E73;&#x65B9;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x524D;&#x9762;&#x52A0;&#x4E0A;&#x5F52;&#x4E00;&#x5316;&#x6216;&#x8005;&#x4E0D;&#x52A0;&#xFF0C;&#x6BD4;&#x5982;$\frac{1}{2}$&#x6216;&#x8005;&#x5176;&#x4ED6;&#x7684;&#xFF0C;&#x90FD;&#x5F71;&#x54CD;&#x4E0D;&#x5927;,&#x56E0;&#x4E3A;&#x8FD9;&#x90FD;&#x53EF;&#x4EE5;&#x7531;&#x8FD9;&#x4E2A;&#x8D85;&#x53C2;&#x6570;$a$&#x6765;&#x8C03;&#x6574;&#xFF08;$J(G) =a J<em>{\text{content}}( C,G) + \beta J</em>{\text{style}}(S,G)$&#xFF09;&#x3002;</p>
<p>&#x8981;&#x6E05;&#x695A;&#x6211;&#x8FD9;&#x91CC;&#x7528;&#x7684;&#x7B26;&#x53F7;&#x90FD;&#x662F;&#x5C55;&#x6210;&#x5411;&#x91CF;&#x5F62;&#x5F0F;&#x7684;&#xFF0C;&#x8FD9;&#x4E2A;&#x5C31;&#x53D8;&#x6210;&#x4E86;&#x8FD9;&#x4E00;&#x9879;&#xFF08;$a^{[l]\lbrack C\rbrack}$&#xFF09;&#x51CF;&#x8FD9;&#x4E00;&#x9879;&#xFF08;$a^{[l]\lbrack C\rbrack}$&#xFF09;&#x7684;$L2$&#x8303;&#x6570;&#x7684;&#x5E73;&#x65B9;&#xFF0C;&#x5728;&#x628A;&#x4ED6;&#x4EEC;&#x5C55;&#x6210;&#x5411;&#x91CF;&#x540E;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x4E24;&#x4E2A;&#x6FC0;&#x6D3B;&#x503C;&#x95F4;&#x7684;&#x5DEE;&#x503C;&#x5E73;&#x65B9;&#x548C;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4E24;&#x4E2A;&#x56FE;&#x7247;&#x4E4B;&#x95F4;$l$&#x5C42;&#x6FC0;&#x6D3B;&#x503C;&#x5DEE;&#x503C;&#x7684;&#x5E73;&#x65B9;&#x548C;&#x3002;&#x540E;&#x9762;&#x5982;&#x679C;&#x5BF9;$J(G)$&#x505A;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x6765;&#x627E;$G$&#x7684;&#x503C;&#x65F6;&#xFF0C;&#x6574;&#x4E2A;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x4F1A;&#x6FC0;&#x52B1;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x6765;&#x627E;&#x5230;&#x56FE;&#x50CF;$G$&#xFF0C;&#x4F7F;&#x5F97;&#x9690;&#x542B;&#x5C42;&#x7684;&#x6FC0;&#x6D3B;&#x503C;&#x548C;&#x4F60;&#x5185;&#x5BB9;&#x56FE;&#x50CF;&#x7684;&#x76F8;&#x4F3C;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x5982;&#x4F55;&#x5B9A;&#x4E49;&#x98CE;&#x683C;&#x8FC1;&#x79FB;&#x7F51;&#x7EDC;&#x7684;&#x5185;&#x5BB9;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x8BA9;&#x6211;&#x4EEC;&#x5B66;&#x4E60;&#x98CE;&#x683C;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x3002;</p>
<h3 id="410-&#x98CE;&#x683C;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#xFF08;style-cost-function&#xFF09;">4.10 &#x98CE;&#x683C;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#xFF08;Style cost function&#xFF09;</h3>
<p>&#x5728;&#x4E0A;&#x8282;&#x89C6;&#x9891;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5B66;&#x4E60;&#x4E86;&#x5982;&#x4F55;&#x4E3A;&#x795E;&#x7ECF;&#x98CE;&#x683C;&#x8FC1;&#x79FB;&#x5B9A;&#x4E49;&#x5185;&#x5BB9;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#xFF0C;&#x8FD9;&#x8282;&#x8BFE;&#x6211;&#x4EEC;&#x6765;&#x4E86;&#x89E3;&#x98CE;&#x683C;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x3002;&#x90A3;&#x4E48;&#x56FE;&#x7247;&#x7684;&#x98CE;&#x683C;&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#x5462;&#xFF1F;</p>
<p><img src="../images/efa0f6e81320966647658cba96ff28ee.png" alt=""></p>
<p>&#x8FD9;&#x4E48;&#x8BF4;&#x5427;&#xFF0C;&#x6BD4;&#x5982;&#x4F60;&#x6709;&#x8FD9;&#x6837;&#x4E00;&#x5F20;&#x56FE;&#x7247;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x5BF9;&#x8FD9;&#x4E2A;&#x8BA1;&#x7B97;&#x5F88;&#x719F;&#x6089;&#x4E86;&#xFF0C;&#x5B83;&#x80FD;&#x7B97;&#x51FA;&#x8FD9;&#x91CC;&#x662F;&#x5426;&#x542B;&#x6709;&#x4E0D;&#x540C;&#x9690;&#x85CF;&#x5C42;&#x3002;&#x73B0;&#x5728;&#x4F60;&#x9009;&#x62E9;&#x4E86;&#x67D0;&#x4E00;&#x5C42;$l$&#xFF08;&#x7F16;&#x53F7;1&#xFF09;&#xFF0C;&#x6BD4;&#x5982;&#x8FD9;&#x4E00;&#x5C42;&#x53BB;&#x4E3A;&#x56FE;&#x7247;&#x7684;&#x98CE;&#x683C;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x6DF1;&#x5EA6;&#x6D4B;&#x91CF;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x5C06;&#x56FE;&#x7247;&#x7684;&#x98CE;&#x683C;&#x5B9A;&#x4E49;&#x4E3A;$l$&#x5C42;&#x4E2D;&#x5404;&#x4E2A;&#x901A;&#x9053;&#x4E4B;&#x95F4;&#x6FC0;&#x6D3B;&#x9879;&#x7684;&#x76F8;&#x5173;&#x7CFB;&#x6570;&#x3002;</p>
<p><img src="../images/e2bc16e5d114bac50383a1998220c4f5.png" alt=""></p>
<p>&#x6211;&#x6765;&#x8BE6;&#x7EC6;&#x89E3;&#x91CA;&#x4E00;&#x4E0B;&#xFF0C;&#x73B0;&#x5728;&#x4F60;&#x5C06;$l$&#x5C42;&#x7684;&#x6FC0;&#x6D3B;&#x9879;&#x53D6;&#x51FA;&#xFF0C;&#x8FD9;&#x662F;&#x4E2A;$ n<em>{H} \times n</em>{W} \times n_{C}$&#x7684;&#x6FC0;&#x6D3B;&#x9879;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x4E09;&#x7EF4;&#x7684;&#x6570;&#x636E;&#x5757;&#x3002;&#x73B0;&#x5728;&#x95EE;&#x9898;&#x6765;&#x4E86;&#xFF0C;&#x5982;&#x4F55;&#x77E5;&#x9053;&#x8FD9;&#x4E9B;&#x4E0D;&#x540C;&#x901A;&#x9053;&#x4E4B;&#x95F4;&#x6FC0;&#x6D3B;&#x9879;&#x7684;&#x76F8;&#x5173;&#x7CFB;&#x6570;&#x5462;&#xFF1F;</p>
<p>&#x4E3A;&#x4E86;&#x89E3;&#x91CA;&#x8FD9;&#x4E9B;&#x542C;&#x8D77;&#x6765;&#x5F88;&#x542B;&#x7CCA;&#x4E0D;&#x6E05;&#x7684;&#x8BCD;&#x8BED;&#xFF0C;&#x73B0;&#x5728;&#x6CE8;&#x610F;&#x8FD9;&#x4E2A;&#x6FC0;&#x6D3B;&#x5757;&#xFF0C;&#x6211;&#x628A;&#x5B83;&#x7684;&#x4E0D;&#x540C;&#x901A;&#x9053;&#x6E32;&#x67D3;&#x6210;&#x4E0D;&#x540C;&#x7684;&#x989C;&#x8272;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x5047;&#x5982;&#x6211;&#x4EEC;&#x6709;5&#x4E2A;&#x901A;&#x9053;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x8BB2;&#x89E3;&#xFF0C;&#x6211;&#x5C06;&#x5B83;&#x4EEC;&#x67D3;&#x6210;&#x4E86;&#x4E94;&#x79CD;&#x989C;&#x8272;&#x3002;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x4F1A;&#x6709;&#x8BB8;&#x591A;&#x901A;&#x9053;&#xFF0C;&#x4F46;&#x8FD9;&#x91CC;&#x53EA;&#x7528;5&#x4E2A;&#x901A;&#x9053;&#xFF0C;&#x4F1A;&#x66F4;&#x65B9;&#x4FBF;&#x6211;&#x4EEC;&#x7406;&#x89E3;&#x3002;</p>
<p><img src="../images/0eb48b8a610f7f430186e3249bfb9f1c.png" alt=""></p>
<p>&#x4E3A;&#x4E86;&#x80FD;&#x6355;&#x6349;&#x56FE;&#x7247;&#x7684;&#x98CE;&#x683C;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x4E0B;&#x9762;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#xFF0C;&#x9996;&#x5148;&#xFF0C;&#x5148;&#x770B;&#x524D;&#x4E24;&#x4E2A;&#x901A;&#x9053;&#xFF0C;&#x524D;&#x4E24;&#x4E2A;&#x901A;&#x9053;&#xFF08;&#x7F16;&#x53F7;1&#x3001;2&#xFF09;&#x5206;&#x522B;&#x662F;&#x56FE;&#x4E2D;&#x7684;&#x7EA2;&#x8272;&#x548C;&#x9EC4;&#x8272;&#x90E8;&#x5206;&#xFF0C;&#x90A3;&#x6211;&#x4EEC;&#x8BE5;&#x5982;&#x4F55;&#x8BA1;&#x7B97;&#x8FD9;&#x4E24;&#x4E2A;&#x901A;&#x9053;&#x95F4;&#x6FC0;&#x6D3B;&#x9879;&#x7684;&#x76F8;&#x5173;&#x7CFB;&#x6570;&#x5462;&#xFF1F;</p>
<p><img src="../images/e3d74c1ce2393ae4e706a1cc4024f311.png" alt=""></p>
<p>&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5728;&#x89C6;&#x9891;&#x7684;&#x5DE6;&#x4E0B;&#x89D2;&#x5728;&#x7B2C;&#x4E00;&#x4E2A;&#x901A;&#x9053;&#x4E2D;&#x542B;&#x6709;&#x67D0;&#x4E2A;&#x6FC0;&#x6D3B;&#x9879;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x901A;&#x9053;&#x4E5F;&#x542B;&#x6709;&#x67D0;&#x4E2A;&#x6FC0;&#x6D3B;&#x9879;&#xFF0C;&#x4E8E;&#x662F;&#x5B83;&#x4EEC;&#x7EC4;&#x6210;&#x4E86;&#x4E00;&#x5BF9;&#x6570;&#x5B57;&#xFF08;&#x7F16;&#x53F7;1&#x6240;&#x793A;&#xFF09;&#x3002;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x518D;&#x770B;&#x770B;&#x8FD9;&#x4E2A;&#x6FC0;&#x6D3B;&#x9879;&#x5757;&#x4E2D;&#x5176;&#x4ED6;&#x4F4D;&#x7F6E;&#x7684;&#x6FC0;&#x6D3B;&#x9879;&#xFF0C;&#x5B83;&#x4EEC;&#x4E5F;&#x5206;&#x522B;&#x7EC4;&#x6210;&#x4E86;&#x5F88;&#x591A;&#x5BF9;&#x6570;&#x5B57;&#xFF08;&#x7F16;&#x53F7;2&#xFF0C;3&#x6240;&#x793A;&#xFF09;&#xFF0C;&#x5206;&#x522B;&#x6765;&#x81EA;&#x7B2C;&#x4E00;&#x4E2A;&#x901A;&#x9053;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x7EA2;&#x8272;&#x901A;&#x9053;&#x548C;&#x7B2C;&#x4E8C;&#x4E2A;&#x901A;&#x9053;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x9EC4;&#x8272;&#x901A;&#x9053;&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5F97;&#x5230;&#x4E86;&#x5F88;&#x591A;&#x4E2A;&#x6570;&#x5B57;&#x5BF9;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x53D6;&#x5F97;&#x8FD9;&#x4E24;&#x4E2A;$n<em>{H}\times n</em>{W}$&#x7684;&#x901A;&#x9053;&#x4E2D;&#x6240;&#x6709;&#x7684;&#x6570;&#x5B57;&#x5BF9;&#x540E;&#xFF0C;&#x73B0;&#x5728;&#x8BE5;&#x5982;&#x4F55;&#x8BA1;&#x7B97;&#x5B83;&#x4EEC;&#x7684;&#x76F8;&#x5173;&#x7CFB;&#x6570;&#x5462;&#xFF1F;&#x5B83;&#x662F;&#x5982;&#x4F55;&#x51B3;&#x5B9A;&#x56FE;&#x7247;&#x98CE;&#x683C;&#x7684;&#x5462;&#xFF1F;</p>
<p><img src="../images/fd244a4fe8bb2d27956dd9bc7d8bcf52.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x8FD9;&#x662F;&#x4E4B;&#x524D;&#x89C6;&#x9891;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x53EF;&#x89C6;&#x5316;&#x4F8B;&#x5B50;&#xFF0C;&#x5B83;&#x6765;&#x81EA;&#x4E00;&#x7BC7;&#x8BBA;&#x6587;&#xFF0C;&#x4F5C;&#x8005;&#x662F;<strong>Matthew Zeile</strong>&#x548C;<strong>Rob Fergus</strong> &#x6211;&#x4E4B;&#x524D;&#x6709;&#x63D0;&#x5230;&#x8FC7;&#x3002;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;&#x8FD9;&#x4E2A;&#x7EA2;&#x8272;&#x7684;&#x901A;&#x9053;&#xFF08;&#x7F16;&#x53F7;1&#xFF09;&#x5BF9;&#x5E94;&#x7684;&#x662F;&#x8FD9;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#xFF0C;&#x5B83;&#x80FD;&#x627E;&#x51FA;&#x56FE;&#x7247;&#x4E2D;&#x7684;&#x7279;&#x5B9A;&#x4F4D;&#x7F6E;&#x662F;&#x5426;&#x542B;&#x6709;&#x8FD9;&#x4E9B;&#x5782;&#x76F4;&#x7684;&#x7EB9;&#x7406;&#xFF08;&#x7F16;&#x53F7;3&#xFF09;&#xFF0C;&#x800C;&#x7B2C;&#x4E8C;&#x4E2A;&#x901A;&#x9053;&#x4E5F;&#x5C31;&#x662F;&#x9EC4;&#x8272;&#x7684;&#x901A;&#x9053;&#xFF08;&#x7F16;&#x53F7;2&#xFF09;&#xFF0C;&#x5BF9;&#x5E94;&#x8FD9;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#xFF08;&#x7F16;&#x53F7;4&#xFF09;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x7C97;&#x7565;&#x5730;&#x627E;&#x51FA;&#x6A59;&#x8272;&#x7684;&#x533A;&#x57DF;&#x3002;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x4E24;&#x4E2A;&#x901A;&#x9053;&#x62E5;&#x6709;&#x9AD8;&#x5EA6;&#x76F8;&#x5173;&#x6027;&#x5462;&#xFF1F;&#x5982;&#x679C;&#x5B83;&#x4EEC;&#x6709;&#x9AD8;&#x5EA6;&#x76F8;&#x5173;&#x6027;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x5E45;&#x56FE;&#x7247;&#x4E2D;&#x51FA;&#x73B0;&#x5782;&#x76F4;&#x7EB9;&#x7406;&#x7684;&#x5730;&#x65B9;&#xFF08;&#x7F16;&#x53F7;2&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x5757;&#x5730;&#x65B9;&#xFF08;&#x7F16;&#x53F7;4&#xFF09;&#x5F88;&#x5927;&#x6982;&#x7387;&#x662F;&#x6A59;&#x8272;&#x7684;&#x3002;&#x5982;&#x679C;&#x8BF4;&#x5B83;&#x4EEC;&#x662F;&#x4E0D;&#x76F8;&#x5173;&#x7684;&#xFF0C;&#x53C8;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#x5462;&#xFF1F;&#x663E;&#x7136;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x56FE;&#x7247;&#x4E2D;&#x6709;&#x5782;&#x76F4;&#x7EB9;&#x7406;&#x7684;&#x5730;&#x65B9;&#x5F88;&#x5927;&#x6982;&#x7387;&#x4E0D;&#x662F;&#x6A59;&#x8272;&#x7684;&#x3002;&#x800C;&#x76F8;&#x5173;&#x7CFB;&#x6570;&#x63CF;&#x8FF0;&#x7684;&#x5C31;&#x662F;&#x5F53;&#x56FE;&#x7247;&#x67D0;&#x5904;&#x51FA;&#x73B0;&#x8FD9;&#x79CD;&#x5782;&#x76F4;&#x7EB9;&#x7406;&#x65F6;&#xFF0C;&#x8BE5;&#x5904;&#x53C8;&#x540C;&#x65F6;&#x662F;&#x6A59;&#x8272;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002;</p>
<p>&#x76F8;&#x5173;&#x7CFB;&#x6570;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x4E3A;&#x4F60;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x53BB;&#x6D4B;&#x91CF;&#x8FD9;&#x4E9B;&#x4E0D;&#x540C;&#x7684;&#x7279;&#x5F81;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x6BD4;&#x5982;&#x8FD9;&#x4E9B;&#x5782;&#x76F4;&#x7EB9;&#x7406;&#xFF0C;&#x8FD9;&#x4E9B;&#x6A59;&#x8272;&#x6216;&#x662F;&#x5176;&#x4ED6;&#x7684;&#x7279;&#x5F81;&#x53BB;&#x6D4B;&#x91CF;&#x5B83;&#x4EEC;&#x5728;&#x56FE;&#x7247;&#x4E2D;&#x7684;&#x5404;&#x4E2A;&#x4F4D;&#x7F6E;&#x540C;&#x65F6;&#x51FA;&#x73B0;&#x6216;&#x4E0D;&#x540C;&#x65F6;&#x51FA;&#x73B0;&#x7684;&#x9891;&#x7387;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5728;&#x901A;&#x9053;&#x4E4B;&#x95F4;&#x4F7F;&#x7528;&#x76F8;&#x5173;&#x7CFB;&#x6570;&#x6765;&#x63CF;&#x8FF0;&#x901A;&#x9053;&#x7684;&#x98CE;&#x683C;&#xFF0C;&#x4F60;&#x80FD;&#x505A;&#x7684;&#x5C31;&#x662F;&#x6D4B;&#x91CF;&#x4F60;&#x7684;&#x751F;&#x6210;&#x56FE;&#x50CF;&#x4E2D;&#x7B2C;&#x4E00;&#x4E2A;&#x901A;&#x9053;&#xFF08;&#x7F16;&#x53F7;1&#xFF09;&#x662F;&#x5426;&#x4E0E;&#x7B2C;&#x4E8C;&#x4E2A;&#x901A;&#x9053;&#xFF08;&#x7F16;&#x53F7;2&#xFF09;&#x76F8;&#x5173;&#xFF0C;&#x901A;&#x8FC7;&#x6D4B;&#x91CF;&#xFF0C;&#x4F60;&#x80FD;&#x5F97;&#x77E5;&#x5728;&#x751F;&#x6210;&#x7684;&#x56FE;&#x50CF;&#x4E2D;&#x5782;&#x76F4;&#x7EB9;&#x7406;&#x548C;&#x6A59;&#x8272;&#x540C;&#x65F6;&#x51FA;&#x73B0;&#x6216;&#x8005;&#x4E0D;&#x540C;&#x65F6;&#x51FA;&#x73B0;&#x7684;&#x9891;&#x7387;&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x5C06;&#x80FD;&#x591F;&#x6D4B;&#x91CF;&#x751F;&#x6210;&#x7684;&#x56FE;&#x50CF;&#x7684;&#x98CE;&#x683C;&#x4E0E;&#x8F93;&#x5165;&#x7684;&#x98CE;&#x683C;&#x56FE;&#x50CF;&#x7684;&#x76F8;&#x4F3C;&#x7A0B;&#x5EA6;&#x3002;</p>
<p><img src="../images/4a29d913a9a5edd0b0e02362494db68e.png" alt=""></p>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6765;&#x8BC1;&#x5B9E;&#x8FD9;&#x79CD;&#x8BF4;&#x6CD5;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E24;&#x4E2A;&#x56FE;&#x50CF;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x98CE;&#x683C;&#x56FE;&#x50CF;&#x4E0E;&#x751F;&#x6210;&#x56FE;&#x50CF;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x8BA1;&#x7B97;&#x4E00;&#x4E2A;&#x98CE;&#x683C;&#x77E9;&#x9635;&#xFF0C;&#x8BF4;&#x5F97;&#x66F4;&#x5177;&#x4F53;&#x4E00;&#x70B9;&#x5C31;&#x662F;&#x7528;$l$&#x5C42;&#x6765;&#x6D4B;&#x91CF;&#x98CE;&#x683C;&#x3002;</p>
<p><img src="../images/2ddb759f19ac980ccdfe0b01729691db.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x8BBE;$a<em>{i,\ j,\ k}^{[l]}$&#xFF0C;&#x8BBE;&#x5B83;&#x4E3A;&#x9690;&#x85CF;&#x5C42;l&#x4E2D;$(i,j,k)$&#x4F4D;&#x7F6E;&#x7684;&#x6FC0;&#x6D3B;&#x9879;&#xFF0C;$i$&#xFF0C;$j$&#xFF0C;$k$&#x5206;&#x522B;&#x4EE3;&#x8868;&#x8BE5;&#x4F4D;&#x7F6E;&#x7684;&#x9AD8;&#x5EA6;&#x3001;&#x5BBD;&#x5EA6;&#x4EE5;&#x53CA;&#x5BF9;&#x5E94;&#x7684;&#x901A;&#x9053;&#x6570;&#x3002;&#x73B0;&#x5728;&#x4F60;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x53BB;&#x8BA1;&#x7B97;&#x4E00;&#x4E2A;&#x5173;&#x4E8E;$l$&#x5C42;&#x548C;&#x98CE;&#x683C;&#x56FE;&#x50CF;&#x7684;&#x77E9;&#x9635;&#xFF0C;&#x5373;$G^{<a href="S">l</a>}$&#xFF08;$l$&#x8868;&#x793A;&#x5C42;&#x6570;&#xFF0C;$S$&#x8868;&#x793A;&#x98CE;&#x683C;&#x56FE;&#x50CF;&#xFF09;&#xFF0C;&#x8FD9;&#xFF08;$G^{<a href="S">l</a>}$&#xFF09;&#x662F;&#x4E00;&#x4E2A;$n</em>{c} \times n_{c}$&#x7684;&#x77E9;&#x9635;&#xFF0C;&#x540C;&#x6837;&#x5730;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x5BF9;&#x751F;&#x6210;&#x7684;&#x56FE;&#x50CF;&#x8FDB;&#x884C;&#x8FD9;&#x4E2A;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5148;&#x6765;&#x5B9A;&#x4E49;&#x98CE;&#x683C;&#x56FE;&#x50CF;&#xFF0C;&#x8BBE;&#x8FD9;&#x4E2A;&#x5173;&#x4E8E;$l$&#x5C42;&#x548C;&#x98CE;&#x683C;&#x56FE;&#x50CF;&#x7684;&#xFF0C;$G$&#x662F;&#x4E00;&#x4E2A;&#x77E9;&#x9635;&#xFF0C;&#x8FD9;&#x4E2A;&#x77E9;&#x9635;&#x7684;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#x90FD;&#x662F;$l$&#x5C42;&#x7684;&#x901A;&#x9053;&#x6570;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x77E9;&#x9635;&#x4E2D;$k$&#x548C;$k&apos;$&#x5143;&#x7D20;&#x88AB;&#x7528;&#x6765;&#x63CF;&#x8FF0;$k$&#x901A;&#x9053;&#x548C;$k&apos;$&#x901A;&#x9053;&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x5173;&#x7CFB;&#x6570;&#x3002;&#x5177;&#x4F53;&#x5730;&#xFF1A;</p>
<p>$G<em>{kk^{&apos;}}^{<a href="S">l</a>} = \sum</em>{i = 1}^{n<em>{H}^{[l]}}{\sum</em>{j = 1}^{n<em>{W}^{[l]}}{a</em>{i,\ j,\ k}^{<a href="S">l</a>}a_{i,\ j,\ k^{&apos;}}^{<a href="S">l</a>}}}$</p>
<p>&#x7528;&#x7B26;&#x53F7;$i$&#xFF0C;$j$&#x8868;&#x793A;&#x4E0B;&#x754C;&#xFF0C;&#x5BF9;$i$&#xFF0C;$j$&#xFF0C;$k$&#x4F4D;&#x7F6E;&#x7684;&#x6FC0;&#x6D3B;&#x9879;$a<em>{i,\ j,\ k}^{[l]}$&#xFF0C;&#x4E58;&#x4EE5;&#x540C;&#x6837;&#x4F4D;&#x7F6E;&#x7684;&#x6FC0;&#x6D3B;&#x9879;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;$i$,$ j$,$k&apos;$&#x4F4D;&#x7F6E;&#x7684;&#x6FC0;&#x6D3B;&#x9879;&#xFF0C;&#x5373;$a</em>{i,j,k^{&apos;}}^{[l]}$&#xFF0C;&#x5C06;&#x5B83;&#x4EEC;&#x4E24;&#x4E2A;&#x76F8;&#x4E58;&#x3002;&#x7136;&#x540E;$i$&#x548C;$j$&#x5206;&#x522B;&#x52A0;&#x5230;l&#x5C42;&#x7684;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#xFF0C;&#x5373;$n<em>{H}^{[l]}$&#x548C;$n</em>{W}^{[l]}$&#xFF0C;&#x5C06;&#x8FD9;&#x4E9B;&#x4E0D;&#x540C;&#x4F4D;&#x7F6E;&#x7684;&#x6FC0;&#x6D3B;&#x9879;&#x90FD;&#x52A0;&#x8D77;&#x6765;&#x3002;$(i,j,k)$&#x548C;$(i,j,k&apos;)$&#x4E2D;$x$&#x5750;&#x6807;&#x548C;$y$&#x5750;&#x6807;&#x5206;&#x522B;&#x5BF9;&#x5E94;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#xFF0C;&#x5C06;$k$&#x901A;&#x9053;&#x548C;$k&apos;$&#x901A;&#x9053;&#x4E0A;&#x8FD9;&#x4E9B;&#x4F4D;&#x7F6E;&#x7684;&#x6FC0;&#x6D3B;&#x9879;&#x90FD;&#x8FDB;&#x884C;&#x76F8;&#x4E58;&#x3002;&#x6211;&#x4E00;&#x76F4;&#x4EE5;&#x6765;&#x7528;&#x7684;&#x8FD9;&#x4E2A;&#x516C;&#x5F0F;&#xFF0C;&#x4E25;&#x683C;&#x6765;&#x8BF4;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x79CD;&#x975E;&#x6807;&#x51C6;&#x7684;&#x4E92;&#x76F8;&#x5173;&#x51FD;&#x6570;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x51CF;&#x53BB;&#x5E73;&#x5747;&#x6570;&#xFF0C;&#x800C;&#x662F;&#x5C06;&#x5B83;&#x4EEC;&#x76F4;&#x63A5;&#x76F8;&#x4E58;&#x3002;</p>
<p><img src="../images/0ea92955dd1fc34f0d729180f7817ebe.png" alt=""></p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x8F93;&#x5165;&#x7684;&#x98CE;&#x683C;&#x56FE;&#x50CF;&#x6240;&#x6784;&#x6210;&#x7684;&#x98CE;&#x683C;&#x77E9;&#x9635;&#xFF0C;&#x7136;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x518D;&#x5BF9;&#x751F;&#x6210;&#x56FE;&#x50CF;&#x505A;&#x540C;&#x6837;&#x7684;&#x64CD;&#x4F5C;&#x3002;</p>
<p>$G<em>{kk^{&apos;}}^{<a href="G">l</a>} = \sum</em>{i = 1}^{n<em>{H}^{[l]}}{\sum</em>{j = 1}^{n<em>{W}^{[l]}}{a</em>{i,\ j,\ k}^{<a href="G">l</a>}a_{i,\ j,\ k^{&apos;}}^{<a href="G">l</a>}}}$</p>
<p>$a<em>{i,\ j,\ k}^{<a href="S">l</a>}$&#x548C;$a</em>{i, j,k}^{<a href="G">l</a>}$&#x4E2D;&#x7684;&#x4E0A;&#x6807;$(S)$&#x548C;$(G)$&#x5206;&#x522B;&#x8868;&#x793A;&#x5728;&#x98CE;&#x683C;&#x56FE;&#x50CF;$S$&#x4E2D;&#x7684;&#x6FC0;&#x6D3B;&#x9879;&#x548C;&#x5728;&#x751F;&#x6210;&#x56FE;&#x50CF;$G$&#x7684;&#x6FC0;&#x6D3B;&#x9879;&#x3002;&#x6211;&#x4EEC;&#x4E4B;&#x6240;&#x4EE5;&#x7528;&#x5927;&#x5199;&#x5B57;&#x6BCD;$G$&#x6765;&#x4EE3;&#x8868;&#x8FD9;&#x4E9B;&#x98CE;&#x683C;&#x77E9;&#x9635;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x5728;&#x7EBF;&#x6027;&#x4EE3;&#x6570;&#x4E2D;&#x8FD9;&#x79CD;&#x77E9;&#x9635;&#x6709;&#x65F6;&#x4E5F;&#x53EB;<strong>Gram</strong>&#x77E9;&#x9635;&#xFF0C;&#x4F46;&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x53EA;&#x628A;&#x5B83;&#x4EEC;&#x53EB;&#x505A;&#x98CE;&#x683C;&#x77E9;&#x9635;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x4F60;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x8BA1;&#x7B97;&#x51FA;&#x8FD9;&#x5F20;&#x56FE;&#x50CF;&#x7684;&#x98CE;&#x683C;&#x77E9;&#x9635;&#xFF0C;&#x4EE5;&#x4FBF;&#x80FD;&#x591F;&#x6D4B;&#x91CF;&#x51FA;&#x521A;&#x624D;&#x6240;&#x8BF4;&#x7684;&#x8FD9;&#x4E9B;&#x76F8;&#x5173;&#x7CFB;&#x6570;&#x3002;&#x66F4;&#x6B63;&#x89C4;&#x5730;&#x6765;&#x8868;&#x793A;&#xFF0C;&#x6211;&#x4EEC;&#x7528;$a_{i,j,k}^{[l]}$&#x6765;&#x8BB0;&#x5F55;&#x76F8;&#x5E94;&#x4F4D;&#x7F6E;&#x7684;&#x6FC0;&#x6D3B;&#x9879;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;$l$&#x5C42;&#x4E2D;&#x7684;$i,j,k$&#x4F4D;&#x7F6E;&#xFF0C;&#x6240;&#x4EE5;$i$&#x4EE3;&#x8868;&#x9AD8;&#x5EA6;&#xFF0C;$j$&#x4EE3;&#x8868;&#x5BBD;&#x5EA6;&#xFF0C;$k$&#x4EE3;&#x8868;&#x7740;$l$&#x4E2D;&#x7684;&#x4E0D;&#x540C;&#x901A;&#x9053;&#x3002;&#x4E4B;&#x524D;&#x8BF4;&#x8FC7;&#xFF0C;&#x6211;&#x4EEC;&#x6709;5&#x4E2A;&#x901A;&#x9053;&#xFF0C;&#x6240;&#x4EE5;$k$&#x5C31;&#x4EE3;&#x8868;&#x8FD9;&#x4E94;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x901A;&#x9053;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x98CE;&#x683C;&#x77E9;&#x9635;&#xFF0C;&#x4F60;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x8BA1;&#x7B97;&#x8FD9;&#x4E2A;&#x77E9;&#x9635;&#x4E5F;&#x5C31;&#x662F;$G^{[l]}$&#x77E9;&#x9635;&#xFF0C;&#x5B83;&#x662F;&#x4E2A;$n<em>{c} \times n</em>{c}$&#x7684;&#x77E9;&#x9635;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x65B9;&#x9635;&#x3002;&#x8BB0;&#x4F4F;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x91CC;&#x6709;$n<em>{c}$&#x4E2A;&#x901A;&#x9053;&#xFF0C;&#x6240;&#x4EE5;&#x77E9;&#x9635;&#x7684;&#x5927;&#x5C0F;&#x662F;$n</em>{c}\times n<em>{c}$&#x3002;&#x4EE5;&#x4FBF;&#x8BA1;&#x7B97;&#x6BCF;&#x4E00;&#x5BF9;&#x6FC0;&#x6D3B;&#x9879;&#x7684;&#x76F8;&#x5173;&#x7CFB;&#x6570;&#xFF0C;&#x6240;&#x4EE5;$G</em>{\text{kk}^{&apos;}}^{[l]}$&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x6D4B;&#x91CF;$k$&#x901A;&#x9053;&#x4E0E;$k&apos;$&#x901A;&#x9053;&#x4E2D;&#x7684;&#x6FC0;&#x6D3B;&#x9879;&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x5173;&#x7CFB;&#x6570;&#xFF0C;$k$&#x548C;$k&apos;$&#x4F1A;&#x5728;1&#x5230;$n<em>{c}$&#x4E4B;&#x95F4;&#x53D6;&#x503C;&#xFF0C;$n</em>{c}$&#x5C31;&#x662F;$l$&#x5C42;&#x4E2D;&#x901A;&#x9053;&#x7684;&#x603B;&#x6570;&#x91CF;&#x3002;</p>
<p><img src="../images/8f0b8aadb933e4bf5088a79b2434793c.png" alt=""></p>
<p>&#x5F53;&#x5728;&#x8BA1;&#x7B97;$G^{[l]}$&#x65F6;&#xFF0C;&#x6211;&#x5199;&#x4E0B;&#x7684;&#x8FD9;&#x4E2A;&#x7B26;&#x53F7;&#xFF08;&#x4E0B;&#x6807;$kk&#x2019;$&#xFF09;&#x53EA;&#x4EE3;&#x8868;&#x4E00;&#x79CD;&#x5143;&#x7D20;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x8981;&#x5728;&#x53F3;&#x4E0B;&#x89D2;&#x6807;&#x660E;&#x662F;$kk&apos;$&#x5143;&#x7D20;&#xFF0C;&#x548C;&#x4E4B;&#x524D;&#x4E00;&#x6837;$i$&#xFF0C;$j$&#x4ECE;&#x4E00;&#x5F00;&#x59CB;&#x5F80;&#x4E0A;&#x52A0;&#xFF0C;&#x5BF9;&#x5E94;$(i,j,k)$&#x4F4D;&#x7F6E;&#x7684;&#x6FC0;&#x6D3B;&#x9879;&#x4E0E;&#x5BF9;&#x5E94;$(i, j, k&apos;)$&#x4F4D;&#x7F6E;&#x7684;&#x6FC0;&#x6D3B;&#x9879;&#x76F8;&#x4E58;&#x3002;&#x8BB0;&#x4F4F;&#xFF0C;&#x8FD9;&#x4E2A;$i$&#x548C;$j$&#x662F;&#x6FC0;&#x6D3B;&#x5757;&#x4E2D;&#x5BF9;&#x5E94;&#x4F4D;&#x7F6E;&#x7684;&#x5750;&#x6807;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BE5;&#x6FC0;&#x6D3B;&#x9879;&#x6240;&#x5728;&#x7684;&#x9AD8;&#x548C;&#x5BBD;&#xFF0C;&#x6240;&#x4EE5;$i$&#x4F1A;&#x4ECE;1&#x52A0;&#x5230;$n<em>{H}^{[l]}$&#xFF0C;$j$&#x4F1A;&#x4ECE;1&#x52A0;&#x5230;$n</em>{W}^{[l]}$&#xFF0C;$k$&#x548C;$k&apos;$&#x5219;&#x8868;&#x793A;&#x5BF9;&#x5E94;&#x7684;&#x901A;&#x9053;&#xFF0C;&#x6240;&#x4EE5;$k$&#x548C;$k&apos;$&#x503C;&#x7684;&#x8303;&#x56F4;&#x662F;&#x4ECE;1&#x5F00;&#x59CB;&#x5230;&#x8FD9;&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x8BE5;&#x5C42;&#x7684;&#x901A;&#x9053;&#x6570;&#x91CF;$n<em>{C}^{[l]}$&#x3002;&#x8FD9;&#x4E2A;&#x5F0F;&#x5B50;&#x5C31;&#x662F;&#x628A;&#x56FE;&#x4E2D;&#x5404;&#x4E2A;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#x7684;&#x6FC0;&#x6D3B;&#x9879;&#x90FD;&#x904D;&#x5386;&#x4E00;&#x904D;&#xFF0C;&#x5E76;&#x5C06;$k$&#x548C;$k&apos;$&#x901A;&#x9053;&#x4E2D;&#x5BF9;&#x5E94;&#x4F4D;&#x7F6E;&#x7684;&#x6FC0;&#x6D3B;&#x9879;&#x90FD;&#x8FDB;&#x884C;&#x76F8;&#x4E58;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;$G</em>&#xFF5B;&#xFF5B;kk}^{&apos;}}^{[l]}$&#x7684;&#x5B9A;&#x4E49;&#x3002;&#x901A;&#x8FC7;&#x5BF9;$k$&#x548C;$k&apos;$&#x901A;&#x9053;&#x4E2D;&#x6240;&#x6709;&#x7684;&#x6570;&#x503C;&#x8FDB;&#x884C;&#x8BA1;&#x7B97;&#x5C31;&#x5F97;&#x5230;&#x4E86;$G$&#x77E9;&#x9635;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x98CE;&#x683C;&#x77E9;&#x9635;&#x3002;</p>
<p>$G<em>{kk^{&apos;}}^{[l]} = \sum</em>{i = 1}^{n<em>{H}^{[l]}}{\sum</em>{j = 1}^{n<em>{W}^{[l]}}{a</em>{i,\ j,\ k}^{[l]}a_{i,\ j,\ k^{&apos;}}^{[l]}}}$</p>
<p>&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x901A;&#x9053;&#x4E2D;&#x7684;&#x6FC0;&#x6D3B;&#x9879;&#x6570;&#x503C;&#x90FD;&#x5F88;&#x5927;&#xFF0C;&#x90A3;&#x4E48;$G<em>&#xFF5B;&#xFF5B;kk}^{&apos;}}^{[l]}$&#x4E5F;&#x4F1A;&#x53D8;&#x5F97;&#x5F88;&#x5927;&#xFF0C;&#x5BF9;&#x5E94;&#x5730;&#xFF0C;&#x5982;&#x679C;&#x4ED6;&#x4EEC;&#x4E0D;&#x76F8;&#x5173;&#x90A3;&#x4E48;$G</em>&#xFF5B;&#xFF5B;kk}^{&apos;}}^{[l]}$&#x5C31;&#x4F1A;&#x5F88;&#x5C0F;&#x3002;&#x4E25;&#x683C;&#x6765;&#x8BB2;&#xFF0C;&#x6211;&#x4E00;&#x76F4;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x516C;&#x5F0F;&#x6765;&#x8868;&#x8FBE;&#x76F4;&#x89C9;&#x60F3;&#x6CD5;&#xFF0C;&#x4F46;&#x5B83;&#x5176;&#x5B9E;&#x662F;&#x4E00;&#x79CD;&#x975E;&#x6807;&#x51C6;&#x7684;&#x4E92;&#x534F;&#x65B9;&#x5DEE;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5E76;&#x6CA1;&#x6709;&#x51CF;&#x53BB;&#x5747;&#x503C;&#x800C;&#x53EA;&#x662F;&#x628A;&#x8FD9;&#x4E9B;&#x5143;&#x7D20;&#x76F4;&#x63A5;&#x76F8;&#x4E58;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x8BA1;&#x7B97;&#x56FE;&#x50CF;&#x98CE;&#x683C;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p><img src="../images/547dcd1b5e61ed975d62a86cf41b8b96.png" alt=""></p>
<p>$G<em>{kk^{&apos;}}^{<a href="S">l</a>} = \sum</em>{i = 1}^{n<em>{H}^{[l]}}{\sum</em>{j = 1}^{n<em>{W}^{[l]}}{a</em>{i,\ j,\ k}^{<a href="S">l</a>}a_{i,\ j,\ k^{&apos;}}^{<a href="S">l</a>}}}$</p>
<p>&#x4F60;&#x8981;&#x540C;&#x65F6;&#x5BF9;&#x98CE;&#x683C;&#x56FE;&#x50CF;$S$&#x548C;&#x751F;&#x6210;&#x56FE;&#x50CF;$G$&#x90FD;&#x8FDB;&#x884C;&#x8FD9;&#x4E2A;&#x8FD0;&#x7B97;&#xFF0C;&#x4E3A;&#x4E86;&#x533A;&#x5206;&#x5B83;&#x4EEC;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x5B83;&#x7684;&#x53F3;&#x4E0A;&#x89D2;&#x52A0;&#x4E00;&#x4E2A;$(S)$&#xFF0C;&#x8868;&#x660E;&#x5B83;&#x662F;&#x98CE;&#x683C;&#x56FE;&#x50CF;$S$&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x98CE;&#x683C;&#x56FE;&#x50CF;S&#x4E2D;&#x7684;&#x6FC0;&#x6D3B;&#x9879;&#xFF0C;&#x4E4B;&#x540E;&#x4F60;&#x9700;&#x8981;&#x5BF9;&#x751F;&#x6210;&#x56FE;&#x50CF;&#x4E5F;&#x505A;&#x76F8;&#x540C;&#x7684;&#x8FD0;&#x7B97;&#x3002;</p>
<p>$G<em>{kk^{&apos;}}^{<a href="G">l</a>} = \sum</em>{i = 1}^{n<em>{H}^{[l]}}{\sum</em>{j = 1}^{n<em>{W}^{[l]}}{a</em>{i,\ j,\ k}^{<a href="G">l</a>}a_{i,\ j,\ k^{&apos;}}^{<a href="G">l</a>}}}$</p>
<p>&#x548C;&#x4E4B;&#x524D;&#x4E00;&#x6837;&#xFF0C;&#x518D;&#x628A;&#x516C;&#x5F0F;&#x90FD;&#x5199;&#x4E00;&#x904D;&#xFF0C;&#x628A;&#x8FD9;&#x4E9B;&#x90FD;&#x52A0;&#x8D77;&#x6765;&#xFF0C;&#x4E3A;&#x4E86;&#x533A;&#x5206;&#x5B83;&#x662F;&#x751F;&#x6210;&#x56FE;&#x50CF;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x653E;&#x4E00;&#x4E2A;$(G)$&#x3002;</p>
<p><img src="../images/bb452a42fa5bd9c73e2b471a658fd71e.png" alt=""></p>
<p>&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x4EEC;&#x6709;2&#x4E2A;&#x77E9;&#x9635;&#xFF0C;&#x5206;&#x522B;&#x4ECE;&#x98CE;&#x683C;&#x56FE;&#x50CF;$S$&#x548C;&#x751F;&#x6210;&#x56FE;&#x50CF;$G$&#x3002;</p>
<p><img src="../images/5325e3116beea8347d011dbdca03c55b.png" alt=""></p>
<p>&#x518D;&#x63D0;&#x9192;&#x4E00;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x4E00;&#x76F4;&#x4F7F;&#x7528;&#x5927;&#x5199;&#x5B57;&#x6BCD;$G$&#x6765;&#x8868;&#x793A;&#x77E9;&#x9635;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x5728;&#x7EBF;&#x6027;&#x4EE3;&#x6570;&#x4E2D;&#xFF0C;&#x8FD9;&#x79CD;&#x77E9;&#x9635;&#x88AB;&#x79F0;&#x4E3A;<strong>Gram</strong>&#x77E9;&#x9635;&#xFF0C;&#x4F46;&#x5728;&#x672C;&#x89C6;&#x9891;&#x4E2D;&#x6211;&#x628A;&#x5B83;&#x53EB;&#x505A;&#x98CE;&#x683C;&#x77E9;&#x9635;&#xFF0C;&#x6211;&#x4EEC;&#x53D6;&#x4E86;<strong>Gram</strong>&#x77E9;&#x9635;&#x7684;&#x9996;&#x5B57;&#x6BCD;$G$&#x6765;&#x8868;&#x793A;&#x8FD9;&#x4E9B;&#x98CE;&#x683C;&#x77E9;&#x9635;&#x3002;</p>
<p><img src="../images/488c5e6bdc2a519b6c620aae53bdf206.png" alt=""></p>
<p>&#x6700;&#x540E;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5C06;$S$&#x548C;$G$&#x4EE3;&#x5165;&#x5230;&#x98CE;&#x683C;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x4E2D;&#x53BB;&#x8BA1;&#x7B97;&#xFF0C;&#x8FD9;&#x5C06;&#x5F97;&#x5230;&#x8FD9;&#x4E24;&#x4E2A;&#x77E9;&#x9635;&#x4E4B;&#x95F4;&#x7684;&#x8BEF;&#x5DEE;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x662F;&#x77E9;&#x9635;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x8FD9;&#x91CC;&#x52A0;&#x4E00;&#x4E2A;$F$&#xFF08;<strong>Frobenius</strong>&#x8303;&#x6570;&#xFF0C;&#x7F16;&#x53F7;1&#x6240;&#x793A;&#xFF09;&#xFF0C;&#x8FD9;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x8BA1;&#x7B97;&#x4E24;&#x4E2A;&#x77E9;&#x9635;&#x5BF9;&#x5E94;&#x5143;&#x7D20;&#x76F8;&#x51CF;&#x7684;&#x5E73;&#x65B9;&#x7684;&#x548C;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x8FD9;&#x4E2A;&#x5F0F;&#x5B50;&#x5C55;&#x5F00;&#xFF0C;&#x4ECE;$k$&#x548C;$k&apos;$&#x5F00;&#x59CB;&#x4F5C;&#x5B83;&#x4EEC;&#x7684;&#x5DEE;&#xFF0C;&#x628A;&#x5BF9;&#x5E94;&#x7684;&#x5F0F;&#x5B50;&#x5199;&#x4E0B;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x5F97;&#x5230;&#x7684;&#x7ED3;&#x679C;&#x90FD;&#x52A0;&#x8D77;&#x6765;&#xFF0C;&#x4F5C;&#x8005;&#x5728;&#x8FD9;&#x91CC;&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x5F52;&#x4E00;&#x5316;&#x5E38;&#x6570;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;$\frac{1}{2n<em>{H}^{[l]l}n</em>{W}^{[l]}n_{C}^{[l]}}$&#xFF0C;&#x518D;&#x5728;&#x5916;&#x9762;&#x52A0;&#x4E00;&#x4E2A;&#x5E73;&#x65B9;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#x4F60;&#x4E0D;&#x7528;&#x5199;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x4E00;&#x822C;&#x6211;&#x4EEC;&#x53EA;&#x8981;&#x5C06;&#x5B83;&#x4E58;&#x4EE5;&#x4E00;&#x4E2A;&#x8D85;&#x53C2;&#x6570;$\beta$&#x5C31;&#x884C;&#x3002;</p>
<p><img src="../images/0f0f535ee576716b074ef893097eed44.png" alt=""></p>
<p>&#x6700;&#x540E;&#xFF0C;&#x8FD9;&#x662F;&#x5BF9;$l$&#x5C42;&#x5B9A;&#x4E49;&#x7684;&#x98CE;&#x683C;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#xFF0C;&#x548C;&#x4E4B;&#x524D;&#x4F60;&#x89C1;&#x5230;&#x7684;&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x662F;&#x4E24;&#x4E2A;&#x77E9;&#x9635;&#x95F4;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x7684;<strong>Frobenius</strong>&#x8303;&#x6570;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;$S$&#x56FE;&#x50CF;&#x548C;$G$&#x56FE;&#x50CF;&#x4E4B;&#x95F4;&#x7684;&#x8303;&#x6570;&#x518D;&#x4E58;&#x4E0A;&#x4E00;&#x4E2A;&#x5F52;&#x4E00;&#x5316;&#x5E38;&#x6570;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD9;&#x4E0D;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x5404;&#x5C42;&#x90FD;&#x4F7F;&#x7528;&#x98CE;&#x683C;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#xFF0C;&#x4F1A;&#x8BA9;&#x7ED3;&#x679C;&#x53D8;&#x5F97;&#x66F4;&#x597D;&#x3002;&#x5982;&#x679C;&#x8981;&#x5BF9;&#x5404;&#x5C42;&#x90FD;&#x4F7F;&#x7528;&#x98CE;&#x683C;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8FD9;&#x4E48;&#x5B9A;&#x4E49;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#xFF0C;&#x628A;&#x5404;&#x4E2A;&#x5C42;&#x7684;&#x7ED3;&#x679C;&#xFF08;&#x5404;&#x5C42;&#x7684;&#x98CE;&#x683C;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#xFF09;&#x90FD;&#x52A0;&#x8D77;&#x6765;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x80FD;&#x5B9A;&#x4E49;&#x5B83;&#x4EEC;&#x5168;&#x4F53;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x8FD8;&#x9700;&#x8981;&#x5BF9;&#x6BCF;&#x4E2A;&#x5C42;&#x5B9A;&#x4E49;&#x6743;&#x91CD;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x8D85;&#x53C2;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x7528;$\lambda^{[l]}$&#x6765;&#x8868;&#x793A;&#xFF0C;&#x8FD9;&#x6837;&#x5C06;&#x4F7F;&#x4F60;&#x80FD;&#x591F;&#x5728;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x5C42;&#xFF0C;&#x5305;&#x62EC;&#x4E4B;&#x524D;&#x7684;&#x4E00;&#x4E9B;&#x53EF;&#x4EE5;&#x6D4B;&#x91CF;&#x7C7B;&#x4F3C;&#x8FB9;&#x7F18;&#x8FD9;&#x6837;&#x7684;&#x4F4E;&#x7EA7;&#x7279;&#x5F81;&#x7684;&#x5C42;&#xFF0C;&#x4EE5;&#x53CA;&#x4E4B;&#x540E;&#x7684;&#x4E00;&#x4E9B;&#x80FD;&#x6D4B;&#x91CF;&#x9AD8;&#x7EA7;&#x7279;&#x5F81;&#x7684;&#x5C42;&#xFF0C;&#x4F7F;&#x5F97;&#x6211;&#x4EEC;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5728;&#x8BA1;&#x7B97;&#x98CE;&#x683C;&#x65F6;&#x80FD;&#x591F;&#x540C;&#x65F6;&#x8003;&#x8651;&#x5230;&#x8FD9;&#x4E9B;&#x4F4E;&#x7EA7;&#x548C;&#x9AD8;&#x7EA7;&#x7279;&#x5F81;&#x7684;&#x76F8;&#x5173;&#x7CFB;&#x6570;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x5728;&#x57FA;&#x7840;&#x7684;&#x8BAD;&#x7EC3;&#x4E2D;&#x4F60;&#x5728;&#x5B9A;&#x4E49;&#x8D85;&#x53C2;&#x6570;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x5F97;&#x5230;&#x66F4;&#x5408;&#x7406;&#x7684;&#x9009;&#x62E9;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x628A;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x5C01;&#x88C5;&#x8D77;&#x6765;&#xFF0C;&#x4F60;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x5168;&#x4F53;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#xFF1A;</p>
<p>$J(G) = a J<em>{\text{content}( C,G)} + \beta J</em>&#xFF5B;&#xFF5B;style}}(S,G)$</p>
<p>&#x4E4B;&#x540E;&#x7528;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x6CD5;&#xFF0C;&#x6216;&#x8005;&#x66F4;&#x590D;&#x6742;&#x7684;&#x4F18;&#x5316;&#x7B97;&#x6CD5;&#x6765;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x5408;&#x9002;&#x7684;&#x56FE;&#x50CF;$G$&#xFF0C;&#x5E76;&#x8BA1;&#x7B97;$J(G)$&#x7684;&#x6700;&#x5C0F;&#x503C;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x4F60;&#x5C06;&#x80FD;&#x591F;&#x5F97;&#x5230;&#x975E;&#x5E38;&#x597D;&#x770B;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x4F60;&#x5C06;&#x80FD;&#x591F;&#x5F97;&#x5230;&#x975E;&#x5E38;&#x6F02;&#x4EAE;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x8FD9;&#x8282;&#x795E;&#x7ECF;&#x98CE;&#x683C;&#x8FC1;&#x79FB;&#x7684;&#x5185;&#x5BB9;&#x5C31;&#x8BB2;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x5E0C;&#x671B;&#x4F60;&#x80FD;&#x6109;&#x5FEB;&#x5730;&#x5728;&#x672C;&#x5468;&#x7684;&#x57FA;&#x7840;&#x8BAD;&#x7EC3;&#x4E2D;&#x8FDB;&#x884C;&#x5B9E;&#x8DF5;&#x3002;&#x5728;&#x672C;&#x5468;&#x7ED3;&#x675F;&#x4E4B;&#x524D;&#xFF0C;&#x8FD8;&#x6709;&#x6700;&#x540E;&#x4E00;&#x8282;&#x5185;&#x5BB9;&#x60F3;&#x544A;&#x8BC9;&#x4F60;&#x4EEC;&#xFF0C;&#x5C31;&#x662F;&#x5982;&#x4F55;&#x5BF9;<strong>1D</strong>&#x548C;<strong>3D</strong>&#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x5377;&#x79EF;&#xFF0C;&#x4E4B;&#x524D;&#x6211;&#x4EEC;&#x5904;&#x7406;&#x7684;&#x90FD;&#x662F;<strong>2D</strong>&#x56FE;&#x7247;&#xFF0C;&#x6211;&#x4EEC;&#x4E0B;&#x8282;&#x89C6;&#x9891;&#x518D;&#x89C1;&#x3002;</p>
<h3 id="411-&#x4E00;&#x7EF4;&#x5230;&#x4E09;&#x7EF4;&#x63A8;&#x5E7F;&#xFF08;1d-and-3d-generalizations-of-models&#xFF09;">4.11 &#x4E00;&#x7EF4;&#x5230;&#x4E09;&#x7EF4;&#x63A8;&#x5E7F;&#xFF08;1D and 3D generalizations of models&#xFF09;</h3>
<p>&#x4F60;&#x5DF2;&#x7ECF;&#x5B66;&#x4E60;&#x4E86;&#x8BB8;&#x591A;&#x5173;&#x4E8E;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF08;<strong>ConvNets</strong>&#xFF09;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x4ECE;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6846;&#x67B6;&#xFF0C;&#x5230;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x5B83;&#x8FDB;&#x884C;&#x56FE;&#x50CF;&#x8BC6;&#x522B;&#x3001;&#x5BF9;&#x8C61;&#x68C0;&#x6D4B;&#x3001;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x4E0E;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8F6C;&#x6362;&#x3002;&#x5373;&#x4F7F;&#x6211;&#x4EEC;&#x5927;&#x90E8;&#x5206;&#x8BA8;&#x8BBA;&#x7684;&#x56FE;&#x50CF;&#x6570;&#x636E;&#xFF0C;&#x67D0;&#x79CD;&#x610F;&#x4E49;&#x4E0A;&#x800C;&#x8A00;&#x90FD;&#x662F;<strong>2D</strong>&#x6570;&#x636E;&#xFF0C;&#x8003;&#x8651;&#x5230;&#x56FE;&#x50CF;&#x5982;&#x6B64;&#x666E;&#x904D;&#xFF0C;&#x8BB8;&#x591A;&#x4F60;&#x6240;&#x638C;&#x63E1;&#x7684;&#x601D;&#x60F3;&#x4E0D;&#x4EC5;&#x5C40;&#x9650;&#x4E8E;<strong>2D</strong>&#x56FE;&#x50CF;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x5EF6;&#x4F38;&#x81F3;<strong>1D</strong>&#xFF0C;&#x4E43;&#x81F3;<strong>3D</strong>&#x6570;&#x636E;&#x3002;</p>
<p><img src="../images/3f11df7d95906b407b070047d76043d1.png" alt=""></p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x56DE;&#x5934;&#x770B;&#x770B;&#x5728;&#x7B2C;&#x4E00;&#x5468;&#x8BFE;&#x7A0B;&#x4E2D;&#x4F60;&#x6240;&#x5B66;&#x4E60;&#x5173;&#x4E8E;<strong>2D</strong>&#x5377;&#x79EF;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x8F93;&#x5165;&#x4E00;&#x4E2A;14&#xD7;14&#x7684;&#x56FE;&#x50CF;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;5&#xD7;5&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x8FDB;&#x884C;&#x5377;&#x79EF;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x4F60;&#x770B;&#x5230;&#x4E86;14&#xD7;14&#x56FE;&#x50CF;&#x662F;&#x5982;&#x4F55;&#x4E0E;5&#xD7;5&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x8FDB;&#x884C;&#x5377;&#x79EF;&#x7684;&#xFF0C;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x64CD;&#x4F5C;&#x4F60;&#x4F1A;&#x5F97;&#x5230;10&#xD7;10&#x7684;&#x8F93;&#x51FA;&#x3002;</p>
<p><img src="../images/fbd6d69ed332d3e4e044b7f1686f2fd7.png" alt=""></p>
<p>&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;&#x4E86;&#x591A;&#x901A;&#x9053;&#xFF0C;&#x6BD4;&#x5982;14&#xD7;14&#xD7;3&#xFF0C;&#x90A3;&#x4E48;&#x76F8;&#x5339;&#x914D;&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x53EF;&#x80FD;&#x662F;5&#xD7;5&#xD7;3&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;&#x4E86;&#x591A;&#x91CD;&#x8FC7;&#x6EE4;&#xFF0C;&#x6BD4;&#x5982;16&#xFF0C;&#x6700;&#x7EC8;&#x4F60;&#x5F97;&#x5230;&#x7684;&#x662F;10&#xD7;10&#xD7;16&#x3002;</p>
<p><img src="../images/6ab115668c48dfcc2db2462f7caa0415.png" alt=""></p>
<p>&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#x65E9;&#x671F;&#x60F3;&#x6CD5;&#x4E5F;&#x540C;&#x6837;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;1&#x7EF4;&#x6570;&#x636E;&#xFF0C;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5DE6;&#x8FB9;&#x662F;&#x4E00;&#x4E2A;<strong>EKG</strong>&#x4FE1;&#x53F7;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x662F;&#x5FC3;&#x7535;&#x56FE;&#xFF0C;&#x5F53;&#x4F60;&#x5728;&#x4F60;&#x7684;&#x80F8;&#x90E8;&#x653E;&#x7F6E;&#x4E00;&#x4E2A;&#x7535;&#x6781;&#xFF0C;&#x7535;&#x6781;&#x900F;&#x8FC7;&#x80F8;&#x90E8;&#x6D4B;&#x91CF;&#x5FC3;&#x8DF3;&#x5E26;&#x6765;&#x7684;&#x5FAE;&#x5F31;&#x7535;&#x6D41;&#xFF0C;&#x6B63;&#x56E0;&#x4E3A;&#x5FC3;&#x810F;&#x8DF3;&#x52A8;&#xFF0C;&#x4EA7;&#x751F;&#x7684;&#x5FAE;&#x5F31;&#x7535;&#x6CE2;&#x80FD;&#x88AB;&#x4E00;&#x7EC4;&#x7535;&#x6781;&#x6D4B;&#x91CF;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4EBA;&#x5FC3;&#x8DF3;&#x4EA7;&#x751F;&#x7684;<strong>EKG</strong>&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x5CF0;&#x503C;&#x90FD;&#x5BF9;&#x5E94;&#x7740;&#x4E00;&#x6B21;&#x5FC3;&#x8DF3;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x60F3;&#x4F7F;&#x7528;<strong>EKG</strong>&#x4FE1;&#x53F7;&#xFF0C;&#x6BD4;&#x5982;&#x533B;&#x5B66;&#x8BCA;&#x65AD;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x5C06;&#x5904;&#x7406;1&#x7EF4;&#x6570;&#x636E;&#xFF0C;&#x56E0;&#x4E3A;<strong>EKG</strong>&#x6570;&#x636E;&#x662F;&#x7531;&#x65F6;&#x95F4;&#x5E8F;&#x5217;&#x5BF9;&#x5E94;&#x7684;&#x6BCF;&#x4E2A;&#x77AC;&#x95F4;&#x7684;&#x7535;&#x538B;&#x7EC4;&#x6210;&#xFF0C;&#x8FD9;&#x6B21;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;14&#xD7;14&#x7684;&#x5C3A;&#x5BF8;&#x8F93;&#x5165;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x53EA;&#x6709;&#x4E00;&#x4E2A;14&#x5C3A;&#x5BF8;&#x8F93;&#x5165;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x4F60;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;1&#x7EF4;&#x8FC7;&#x6EE4;&#x8FDB;&#x884C;&#x5377;&#x79EF;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x4E00;&#x4E2A;1&#xD7;5&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;5&#xD7;5&#x7684;&#x3002;</p>
<p><img src="../images/155e535d0d3725181e7c080707acd84f.png" alt=""></p>
<p>&#x4E8C;&#x7EF4;&#x6570;&#x636E;&#x7684;&#x5377;&#x79EF;&#x662F;&#x5C06;&#x540C;&#x4E00;&#x4E2A;5&#xD7;5&#x7279;&#x5F81;&#x68C0;&#x6D4B;&#x5668;&#x5E94;&#x7528;&#x4E8E;&#x56FE;&#x50CF;&#x4E2D;&#x4E0D;&#x540C;&#x7684;&#x4F4D;&#x7F6E;&#xFF08;&#x7F16;&#x53F7;1&#x6240;&#x793A;&#xFF09;&#xFF0C;&#x4F60;&#x6700;&#x540E;&#x4F1A;&#x5F97;&#x5230;10&#xD7;10&#x7684;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x3002;1&#x7EF4;&#x8FC7;&#x6EE4;&#x5668;&#x53EF;&#x4EE5;&#x53D6;&#x4EE3;&#x4F60;&#x7684;5&#x7EF4;&#x8FC7;&#x6EE4;&#x5668;&#xFF08;&#x7F16;&#x53F7;2&#x6240;&#x793A;&#xFF09;&#xFF0C;&#x53EF;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x4F4D;&#x7F6E;&#x4E2D;&#x5E94;&#x7528;&#x7C7B;&#x4F3C;&#x7684;&#x65B9;&#x6CD5;&#xFF08;&#x7F16;&#x53F7;3&#xFF0C;4&#xFF0C;5&#x6240;&#x793A;&#xFF09;&#x3002;</p>
<p><img src="../images/eeb764b9c08e48aa2bac70eb76110979.png" alt=""></p>
<p>&#x5F53;&#x4F60;&#x5BF9;&#x8FD9;&#x4E2A;1&#x7EF4;&#x4FE1;&#x53F7;&#x4F7F;&#x7528;&#x5377;&#x79EF;&#xFF0C;&#x4F60;&#x5C06;&#x53D1;&#x73B0;&#x4E00;&#x4E2A;14&#x7EF4;&#x7684;&#x6570;&#x636E;&#x4E0E;5&#x7EF4;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x5377;&#x79EF;&#xFF0C;&#x5E76;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;10&#x7EF4;&#x8F93;&#x51FA;&#x3002;</p>
<p><img src="../images/e8274e05078653cf68313e891c79796c.png" alt=""></p>
<p>&#x518D;&#x4E00;&#x6B21;&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;&#x591A;&#x901A;&#x9053;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x573A;&#x666F;&#x4E0B;&#x53EF;&#x80FD;&#x4F1A;&#x83B7;&#x5F97;&#x4E00;&#x4E2A;14&#xD7;1&#x7684;&#x901A;&#x9053;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;<strong>EKG</strong>&#xFF0C;&#x5C31;&#x662F;5&#xD7;1&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;16&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x53EF;&#x80FD;&#x4F60;&#x6700;&#x540E;&#x4F1A;&#x83B7;&#x5F97;&#x4E00;&#x4E2A;10&#xD7;16&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x4F1A;&#x662F;&#x4F60;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x67D0;&#x4E00;&#x5C42;&#x3002;</p>
<p><img src="../images/8b2d8ac94e71fb591c44c29ded5d6b7e.png" alt=""></p>
<p>&#x5BF9;&#x4E8E;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x7684;&#x4E0B;&#x4E00;&#x5C42;&#xFF0C;&#x5982;&#x679C;&#x8F93;&#x5165;&#x4E00;&#x4E2A;10&#xD7;16&#x6570;&#x636E;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;5&#x7EF4;&#x8FC7;&#x6EE4;&#x5668;&#x8FDB;&#x884C;&#x5377;&#x79EF;&#xFF0C;&#x8FD9;&#x9700;&#x8981;16&#x4E2A;&#x901A;&#x9053;&#x8FDB;&#x884C;&#x5339;&#x914D;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;32&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x53E6;&#x4E00;&#x5C42;&#x7684;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x5C31;&#x662F;6&#xD7;32&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;&#x4E86;32&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#x7684;&#x8BDD;&#x3002;</p>
<p><img src="../images/a39bb1f228d8f0cf91ef8298b81604d9.png" alt=""></p>
<p>&#x5BF9;&#x4E8E;2D&#x6570;&#x636E;&#x800C;&#x8A00;&#xFF0C;&#x5F53;&#x4F60;&#x5904;&#x7406;10&#xD7;10&#xD7;16&#x7684;&#x6570;&#x636E;&#x65F6;&#x4E5F;&#x662F;&#x7C7B;&#x4F3C;&#x7684;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;5&#xD7;5&#xD7;16&#x8FDB;&#x884C;&#x5377;&#x79EF;&#xFF0C;&#x5176;&#x4E2D;&#x4E24;&#x4E2A;&#x901A;&#x9053;&#x6570;16&#x8981;&#x76F8;&#x5339;&#x914D;&#xFF0C;&#x4F60;&#x5C06;&#x5F97;&#x5230;&#x4E00;&#x4E2A;6&#xD7;6&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7528;&#x7684;&#x662F;32&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x5C31;&#x662F;6&#xD7;6&#xD7;32&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;32&#x7684;&#x6765;&#x6E90;&#x3002;</p>
<p>&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x4E5F;&#x53EF;&#x4EE5;&#x5E94;&#x7528;&#x4E8E;1&#x7EF4;&#x6570;&#x636E;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x4F4D;&#x7F6E;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x7279;&#x5F81;&#x68C0;&#x6D4B;&#x5668;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x4E3A;&#x4E86;&#x533A;&#x5206;<strong>EKG</strong>&#x4FE1;&#x53F7;&#x4E2D;&#x7684;&#x5FC3;&#x8DF3;&#x7684;&#x5DEE;&#x5F02;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x65F6;&#x95F4;&#x8F74;&#x4F4D;&#x7F6E;&#x4F7F;&#x7528;&#x540C;&#x6837;&#x7684;&#x7279;&#x5F81;&#x6765;&#x68C0;&#x6D4B;&#x5FC3;&#x8DF3;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x540C;&#x6837;&#x53EF;&#x4EE5;&#x88AB;&#x7528;&#x4E8E;<strong>1D</strong>&#x6570;&#x636E;&#xFF0C;&#x5BF9;&#x4E8E;&#x8BB8;&#x591A;1&#x7EF4;&#x6570;&#x636E;&#x5E94;&#x7528;&#xFF0C;&#x4F60;&#x5B9E;&#x9645;&#x4E0A;&#x4F1A;&#x4F7F;&#x7528;&#x9012;&#x5F52;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8FDB;&#x884C;&#x5904;&#x7406;&#xFF0C;&#x8FD9;&#x4E2A;&#x7F51;&#x7EDC;&#x4F60;&#x4F1A;&#x5728;&#x4E0B;&#x4E00;&#x4E2A;&#x8BFE;&#x7A0B;&#x4E2D;&#x5B66;&#x5230;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x4E9B;&#x4EBA;&#x4F9D;&#x65E7;&#x613F;&#x610F;&#x5C1D;&#x8BD5;&#x4F7F;&#x7528;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x4E0B;&#x4E00;&#x95E8;&#x8BFE;&#x5C06;&#x8BA8;&#x8BBA;&#x5E8F;&#x5217;&#x6A21;&#x578B;&#xFF0C;&#x5305;&#x62EC;&#x9012;&#x5F52;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3001;<strong>LCM</strong>&#x4E0E;&#x5176;&#x4ED6;&#x7C7B;&#x4F3C;&#x6A21;&#x578B;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x63A2;&#x8BA8;&#x4F7F;&#x7528;<strong>1D</strong>&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x7684;&#x4F18;&#x7F3A;&#x70B9;&#xFF0C;&#x5BF9;&#x6BD4;&#x4E8E;&#x5176;&#x5B83;&#x4E13;&#x95E8;&#x4E3A;&#x5E8F;&#x5217;&#x6570;&#x636E;&#x800C;&#x7CBE;&#x5FC3;&#x8BBE;&#x8BA1;&#x7684;&#x6A21;&#x578B;&#x3002;</p>
<p>&#x8FD9;&#x4E5F;&#x662F;<strong>2D</strong>&#x5411;<strong>1D</strong>&#x7684;&#x8FDB;&#x5316;&#xFF0C;&#x5BF9;&#x4E8E;3D&#x6570;&#x636E;&#x6765;&#x8BF4;&#x5982;&#x4F55;&#x5462;&#xFF1F;&#x4EC0;&#x4E48;&#x662F;<strong>3D</strong>&#x6570;&#x636E;&#xFF1F;&#x4E0E;<strong>1D</strong>&#x6570;&#x5217;&#x6216;&#x6570;&#x5B57;&#x77E9;&#x9635;&#x4E0D;&#x540C;&#xFF0C;&#x4F60;&#x73B0;&#x5728;&#x6709;&#x4E86;&#x4E00;&#x4E2A;<strong>3D</strong>&#x5757;&#xFF0C;&#x4E00;&#x4E2A;<strong>3D</strong>&#x8F93;&#x5165;&#x6570;&#x636E;&#x3002;&#x4EE5;&#x4F60;&#x505A;<strong>CT</strong>&#x626B;&#x63CF;&#x4E3A;&#x4F8B;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x4F7F;&#x7528;<strong>X</strong>&#x5149;&#x7167;&#x5C04;&#xFF0C;&#x7136;&#x540E;&#x8F93;&#x51FA;&#x8EAB;&#x4F53;&#x7684;<strong>3D</strong>&#x6A21;&#x578B;&#xFF0C;<strong>CT</strong>&#x626B;&#x63CF;&#x5B9E;&#x73B0;&#x7684;&#x662F;&#x5B83;&#x53EF;&#x4EE5;&#x83B7;&#x53D6;&#x4F60;&#x8EAB;&#x4F53;&#x4E0D;&#x540C;&#x7247;&#x6BB5;&#xFF08;&#x56FE;&#x7247;&#x4FE1;&#x606F;&#xFF09;&#x3002;</p>
<p><img src="../images/38e111b08f94c905ff97f627a4b986ff.png" alt=""></p>
<p>&#x5F53;&#x4F60;&#x8FDB;&#x884C;<strong>CT</strong>&#x626B;&#x63CF;&#x65F6;&#xFF0C;&#x4E0E;&#x6211;&#x73B0;&#x5728;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x4E00;&#x6837;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x4EBA;&#x4F53;&#x8EAF;&#x5E72;&#x7684;&#x4E0D;&#x540C;&#x5207;&#x7247;&#xFF08;&#x6574;&#x7406;&#x8005;&#x6CE8;&#xFF1A;&#x56FE;&#x4E2D;&#x6240;&#x793A;&#x4E3A;&#x4EBA;&#x4F53;&#x8EAF;&#x5E72;&#x4E2D;&#x4E0D;&#x540C;&#x5C42;&#x7684;&#x5207;&#x7247;&#xFF0C;&#x9644;<strong>CT</strong>&#x626B;&#x63CF;&#x793A;&#x610F;&#x56FE;&#xFF0C;&#x56FE;&#x7247;&#x6E90;&#x4E8E;&#x4E92;&#x8054;&#x7F51;&#xFF09;&#xFF0C;&#x672C;&#x8D28;&#x4E0A;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x662F;3&#x7EF4;&#x7684;&#x3002;</p>
<p><img src="../images/cbdb2ba568ef4906d8904b952667de67.png" alt=""></p>
<p>&#x4E00;&#x79CD;&#x5BF9;&#x8FD9;&#x4EFD;&#x6570;&#x636E;&#x7684;&#x7406;&#x89E3;&#x65B9;&#x5F0F;&#x662F;&#xFF0C;&#x5047;&#x8BBE;&#x4F60;&#x7684;&#x6570;&#x636E;&#x73B0;&#x5728;&#x5177;&#x5907;&#x4E00;&#x5B9A;&#x957F;&#x5EA6;&#x3001;&#x5BBD;&#x5EA6;&#x4E0E;&#x9AD8;&#x5EA6;&#xFF0C;&#x5176;&#x4E2D;&#x6BCF;&#x4E00;&#x4E2A;&#x5207;&#x7247;&#x90FD;&#x4E0E;&#x8EAF;&#x5E72;&#x7684;&#x5207;&#x7247;&#x5BF9;&#x5E94;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8981;&#x5728;<strong>3D</strong>&#x626B;&#x63CF;&#x6216;<strong>CT</strong>&#x626B;&#x63CF;&#x4E2D;&#x5E94;&#x7528;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x8FDB;&#x884C;&#x7279;&#x5F81;&#x8BC6;&#x522B;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x4ECE;&#x7B2C;&#x4E00;&#x5F20;&#x5E7B;&#x706F;&#x7247;&#xFF08;<strong>Convolutions in 2D and 1D</strong>&#xFF09;&#x91CC;&#x5F97;&#x5230;&#x60F3;&#x6CD5;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x5E94;&#x7528;&#x5230;<strong>3D</strong>&#x5377;&#x79EF;&#x4E2D;&#x3002;&#x4E3A;&#x4E86;&#x7B80;&#x5355;&#x8D77;&#x89C1;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;&#x4E00;&#x4E2A;<strong>3D</strong>&#x5BF9;&#x8C61;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x662F;14&#xD7;14&#xD7;14&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x8F93;&#x5165;<strong>CT</strong>&#x626B;&#x63CF;&#x7684;&#x5BBD;&#x5EA6;&#x4E0E;&#x6DF1;&#x5EA6;&#xFF08;&#x540E;&#x4E24;&#x4E2A;14&#xFF09;&#x3002;&#x518D;&#x6B21;&#x63D0;&#x9192;&#xFF0C;&#x6B63;&#x5982;&#x56FE;&#x50CF;&#x4E0D;&#x662F;&#x5FC5;&#x987B;&#x4EE5;&#x77E9;&#x5F62;&#x5448;&#x73B0;&#xFF0C;<strong>3D</strong>&#x5BF9;&#x8C61;&#x4E5F;&#x4E0D;&#x662F;&#x4E00;&#x5B9A;&#x662F;&#x4E00;&#x4E2A;&#x5B8C;&#x7F8E;&#x7ACB;&#x65B9;&#x4F53;&#xFF0C;&#x6240;&#x4EE5;&#x957F;&#x548C;&#x5BBD;&#x53EF;&#x4EE5;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x540C;&#x6837;<strong>CT</strong>&#x626B;&#x63CF;&#x7ED3;&#x679C;&#x7684;&#x957F;&#x5BBD;&#x9AD8;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x3002;&#x4E3A;&#x4E86;&#x7B80;&#x5316;&#x8BA8;&#x8BBA;&#xFF0C;&#x6211;&#x4EC5;&#x4F7F;&#x7528;14&#xD7;14&#xD7;14&#x4E3A;&#x4F8B;&#x3002;</p>
<p><img src="../images/8323f5f9c33edb284eb038020f3ff7e7.png" alt=""></p>
<p>&#x5982;&#x679C;&#x4F60;&#x73B0;&#x5728;&#x4F7F;&#x7528;5&#xD7;5&#xD7;5&#x8FC7;&#x6EE4;&#x5668;&#x8FDB;&#x884C;&#x5377;&#x79EF;&#xFF0C;&#x4F60;&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x73B0;&#x5728;&#x4E5F;&#x662F;<strong>3D</strong>&#x7684;&#xFF0C;&#x8FD9;&#x5C06;&#x4F1A;&#x7ED9;&#x4F60;&#x4E00;&#x4E2A;10&#xD7;10&#xD7;10&#x7684;&#x7ED3;&#x679C;&#x8F93;&#x51FA;&#xFF0C;&#x6280;&#x672F;&#x4E0A;&#x6765;&#x8BF4;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x518D;&#xD7;1&#xFF08;&#x7F16;&#x53F7;1&#x6240;&#x793A;&#xFF09;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x6709;&#x4E00;&#x4E2A;1&#x7684;&#x901A;&#x9053;&#x3002;&#x8FD9;&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x4E2A;<strong>3D</strong>&#x6A21;&#x5757;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x7684;&#x6570;&#x636E;&#x53EF;&#x4EE5;&#x6709;&#x4E0D;&#x540C;&#x6570;&#x76EE;&#x7684;&#x901A;&#x9053;&#xFF0C;&#x90A3;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x4E5F;&#x662F;&#x4E58;1&#xFF08;&#x7F16;&#x53F7;2&#x6240;&#x793A;&#xFF09;&#xFF0C;&#x56E0;&#x4E3A;&#x901A;&#x9053;&#x7684;&#x6570;&#x76EE;&#x5FC5;&#x987B;&#x4E0E;&#x8FC7;&#x6EE4;&#x5668;&#x5339;&#x914D;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;16&#x8FC7;&#x6EE4;&#x5668;&#x5904;&#x7406;5&#xD7;5&#xD7;5&#xD7;1&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x8F93;&#x51FA;&#x5C06;&#x662F;10&#xD7;10&#xD7;10&#xD7;16&#xFF0C;&#x8FD9;&#x5C06;&#x6210;&#x4E3A;&#x4F60;<strong>3D</strong>&#x6570;&#x636E;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x4E0A;&#x7684;&#x4E00;&#x5C42;&#x3002;</p>
<p><img src="../images/49076b88b9ecbd1597f6ae37e8d87dc3.png" alt=""></p>
<p>&#x5982;&#x679C;&#x4E0B;&#x4E00;&#x5C42;&#x5377;&#x79EF;&#x4F7F;&#x7528;5&#xD7;5&#xD7;5&#xD7;16&#x7EF4;&#x5EA6;&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x518D;&#x6B21;&#x5377;&#x79EF;&#xFF0C;&#x901A;&#x9053;&#x6570;&#x76EE;&#x4E5F;&#x4E0E;&#x5F80;&#x5E38;&#x4E00;&#x6837;&#x5339;&#x914D;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;32&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x64CD;&#x4F5C;&#x4E5F;&#x4E0E;&#x4E4B;&#x524D;&#x76F8;&#x540C;&#xFF0C;&#x6700;&#x7EC8;&#x4F60;&#x5F97;&#x5230;&#x4E00;&#x4E2A;6&#xD7;6&#xD7;6&#xD7;32&#x7684;&#x8F93;&#x51FA;&#x3002;</p>
<p>&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;<strong>3D</strong>&#x6570;&#x636E;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<strong>3D</strong>&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x5B66;&#x4E60;&#xFF0C;&#x8FD9;&#x4E9B;&#x8FC7;&#x6EE4;&#x5668;&#x5B9E;&#x73B0;&#x7684;&#x529F;&#x80FD;&#x6B63;&#x662F;&#x901A;&#x8FC7;&#x4F60;&#x7684;3D&#x6570;&#x636E;&#x8FDB;&#x884C;&#x7279;&#x5F81;&#x68C0;&#x6D4B;&#x3002;<strong>CT</strong>&#x533B;&#x7597;&#x626B;&#x63CF;&#x662F;<strong>3D</strong>&#x6570;&#x636E;&#x7684;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5904;&#x7406;&#x7684;&#x4F8B;&#x5B50;&#x662F;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x7535;&#x5F71;&#x4E2D;&#x968F;&#x65F6;&#x95F4;&#x53D8;&#x5316;&#x7684;&#x4E0D;&#x540C;&#x89C6;&#x9891;&#x5207;&#x7247;&#x770B;&#x4F5C;&#x662F;<strong>3D</strong>&#x6570;&#x636E;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x8FD9;&#x4E2A;&#x6280;&#x672F;&#x7528;&#x4E8E;&#x68C0;&#x6D4B;&#x52A8;&#x4F5C;&#x53CA;&#x4EBA;&#x7269;&#x884C;&#x4E3A;&#x3002;</p>
<p>&#x603B;&#x800C;&#x8A00;&#x4E4B;&#x8FD9;&#x5C31;&#x662F;<strong>1D</strong>&#x3001;<strong>2D</strong>&#x53CA;<strong>3D</strong>&#x6570;&#x636E;&#x5904;&#x7406;&#xFF0C;&#x56FE;&#x50CF;&#x6570;&#x636E;&#x65E0;&#x5904;&#x4E0D;&#x5728;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x5927;&#x591A;&#x6570;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x90FD;&#x662F;&#x57FA;&#x4E8E;&#x56FE;&#x50CF;&#x4E0A;&#x7684;<strong>2D</strong>&#x6570;&#x636E;&#xFF0C;&#x4F46;&#x6211;&#x5E0C;&#x671B;&#x5176;&#x4ED6;&#x6A21;&#x578B;&#x540C;&#x6837;&#x4F1A;&#x5BF9;&#x4F60;&#x6709;&#x5E2E;&#x52A9;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x672C;&#x5468;&#x6700;&#x540E;&#x4E00;&#x6B21;&#x89C6;&#x9891;&#xFF0C;&#x4E5F;&#x662F;&#x6700;&#x540E;&#x4E00;&#x6B21;&#x5173;&#x4E8E;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x8BFE;&#x7A0B;&#xFF0C;&#x4F60;&#x5DF2;&#x7ECF;&#x5B66;&#x4E60;&#x4E86;&#x8BB8;&#x591A;&#x5173;&#x4E8E;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x6211;&#x5E0C;&#x671B;&#x4F60;&#x80FD;&#x591F;&#x5728;&#x672A;&#x6765;&#x5DE5;&#x4F5C;&#x4E2D;&#x53D1;&#x73B0;&#x8BB8;&#x591A;&#x601D;&#x60F3;&#x5BF9;&#x4F60;&#x6709;&#x6240;&#x88E8;&#x76CA;&#xFF0C;&#x795D;&#x8D3A;&#x4F60;&#x5B8C;&#x6210;&#x4E86;&#x8FD9;&#x4E9B;&#x89C6;&#x9891;&#x5B66;&#x4E60;&#xFF0C;&#x6211;&#x5E0C;&#x671B;&#x4F60;&#x80FD;&#x559C;&#x6B22;&#x8FD9;&#x5468;&#x7684;&#x8BFE;&#x540E;&#x7EC3;&#x4E60;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x5173;&#x4E8E;&#x987A;&#x5E8F;&#x6A21;&#x578B;&#x7684;&#x8BFE;&#x7A0B;&#x6211;&#x4EEC;&#x4E0D;&#x89C1;&#x4E0D;&#x6563;&#x3002;</p>
<p><strong>&#x53C2;&#x8003;&#x6587;&#x732E;&#xFF1A;</strong></p>
<ul>
<li>Florian Schroff, Dmitry Kalenichenko, James Philbin (2015). <a href="https://arxiv.org/pdf/1503.03832.pdf" target="_blank">FaceNet: A Unified Embedding for Face Recognition and Clustering</a></li>
<li>Yaniv Taigman, Ming Yang, Marc&apos;Aurelio Ranzato, Lior Wolf (2014). <a href="https://research.fb.com/wp-content/uploads/2016/11/deepface-closing-the-gap-to-human-level-performance-in-face-verification.pdf" target="_blank">DeepFace: Closing the gap to human-level performance in face verification</a></li>
<li>The pretrained model we use is inspired by Victor Sy Wang&apos;s implementation and was loaded using his code: <a href="https://github.com/iwantooxxoox/Keras-OpenFace" target="_blank">https://github.com/iwantooxxoox/Keras-OpenFace</a>.</li>
<li>Our implementation also took a lot of inspiration from the official FaceNet github repository: <a href="https://github.com/davidsandberg/facenet" target="_blank">https://github.com/davidsandberg/facenet</a></li>
<li>Leon A. Gatys, Alexander S. Ecker, Matthias Bethge, (2015). A Neural Algorithm of Artistic Style (<a href="https://arxiv.org/abs/1508.06576" target="_blank">https://arxiv.org/abs/1508.06576</a>)</li>
<li>Harish Narayanan, Convolutional neural networks for artistic style transfer. <a href="https://harishnarayanan.org/writing/artistic-style-transfer/" target="_blank">https://harishnarayanan.org/writing/artistic-style-transfer/</a></li>
<li>Log0, TensorFlow Implementation of &quot;A Neural Algorithm of Artistic Style&quot;. <a href="http://www.chioka.in/tensorflow-implementation-neural-algorithm-of-artistic-style" target="_blank">http://www.chioka.in/tensorflow-implementation-neural-algorithm-of-artistic-style</a></li>
<li>Karen Simonyan and Andrew Zisserman (2015). Very deep convolutional networks for large-scale image recognition (<a href="https://arxiv.org/pdf/1409.1556.pdf" target="_blank">https://arxiv.org/pdf/1409.1556.pdf</a>)</li>
<li>MatConvNet. <a href="http://www.vlfeat.org/matconvnet/pretrained/" target="_blank">http://www.vlfeat.org/matconvnet/pretrained/</a></li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="lesson4-week3.html" class="navigation navigation-prev " aria-label="Previous page: 第三周 目标检测">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="lesson5-week1.html" class="navigation navigation-next " aria-label="Next page: 第一周 循环序列模型">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第四周 特殊应用：人脸识别和神经风格转换","level":"4.4","depth":1,"next":{"title":"第一周 循环序列模型","level":"5.1","depth":1,"path":"lesson5-week1.md","ref":"lesson5-week1.md","articles":[]},"previous":{"title":"第三周 目标检测","level":"4.3","depth":1,"path":"lesson4-week3.md","ref":"lesson4-week3.md","articles":[]},"dir":"ltr"},"config":{"plugins":["fontsettings","sharing","-lunr","-search","search-pro","highlight","livereload","back-to-top-button","cdn"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"cdn":{"url":"//cdn.jsdelivr.net/gh/zhepama/C-Sharp-Playground@gh-pages/","img_url":"//cdn.jsdelivr.net/gh/zhepama/C-Sharp-Playground@gh-pages/"},"fontsettings":{"family":"sans","size":2,"theme":"white"},"sharing":{"all":["facebook","google","twitter","weibo","instapaper"],"facebook":true,"google":false,"instapaper":false,"twitter":true,"vk":false,"weibo":false},"search-pro":{},"highlight":{},"livereload":{},"back-to-top-button":{},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"深度学习教程","language":"zh-hans","links":{"sidebar":{"编程网":"https://www.editcode.net"}},"gitbook":"*"},"file":{"path":"lesson4-week4.md","mtime":"2021-05-09T12:45:38.889Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-05-09T13:30:39.812Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook.js"></script>
    <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/theme.js"></script>
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    

    </body>
</html>

