
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第一周：深度学习引言 · 深度学习教程</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
        <link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/style.css">

    
            
                
                <link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-back-to-top-button/plugin.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="lesson1-week2.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://www.editcode.net" target="_blank" class="custom-link">编程网</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        <li class="header">第一门课 神经网络和深度学习</li>
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="lesson1-week1.html">
            
                <a href="lesson1-week1.html">
            
                    
                    第一周：深度学习引言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="lesson1-week2.html">
            
                <a href="lesson1-week2.html">
            
                    
                    第二周：神经网络的编程基础
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="lesson1-week3.html">
            
                <a href="lesson1-week3.html">
            
                    
                    第三周：浅层神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="lesson1-week4.html">
            
                <a href="lesson1-week4.html">
            
                    
                    第四周：深层神经网络
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第二门课 改善深层神经网络</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="lesson2-week1.html">
            
                <a href="lesson2-week1.html">
            
                    
                    第一周：深度学习的实践层面
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="lesson2-week2.html">
            
                <a href="lesson2-week2.html">
            
                    
                    第二周：优化算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="lesson2-week3.html">
            
                <a href="lesson2-week3.html">
            
                    
                    第三周超参数调试，batch正则化和程序框架
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第三门课 结构化机器学习项目</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="lesson3-week1.html">
            
                <a href="lesson3-week1.html">
            
                    
                    第一周：机器学习策略
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="lesson3-week2.html">
            
                <a href="lesson3-week2.html">
            
                    
                    第二周：机器学习策略
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第四门课 卷积神经网络</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="lesson4-week1.html">
            
                <a href="lesson4-week1.html">
            
                    
                    第一周 卷积神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="lesson4-week2.html">
            
                <a href="lesson4-week2.html">
            
                    
                    第二周 深度卷积网络：实例探究
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.3" data-path="lesson4-week3.html">
            
                <a href="lesson4-week3.html">
            
                    
                    第三周 目标检测
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.4" data-path="lesson4-week4.html">
            
                <a href="lesson4-week4.html">
            
                    
                    第四周 特殊应用：人脸识别和神经风格转换
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第五门课 序列模型</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="lesson5-week1.html">
            
                <a href="lesson5-week1.html">
            
                    
                    第一周 循环序列模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.2" data-path="lesson5-week2.html">
            
                <a href="lesson5-week2.html">
            
                    
                    第二周 自然语言处理与词嵌入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.3" data-path="lesson5-week3.html">
            
                <a href="lesson5-week3.html">
            
                    
                    第三周 序列模型和注意力机制
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">附件</li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="interview.html">
            
                <a href="interview.html">
            
                    
                    人工智能大师访谈
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.2" data-path="notation.html">
            
                <a href="notation.html">
            
                    
                    深度学习符号指南（原课程翻译）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.3" data-path="notation.html">
            
                <a href="notation.html">
            
                    
                    机器学习的数学基础
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第一周：深度学习引言</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;&#x4E00;&#x95E8;&#x8BFE;-&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x548C;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;neural-networks-and-deep-learning">&#x7B2C;&#x4E00;&#x95E8;&#x8BFE; &#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x548C;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;(Neural Networks and Deep Learning)</h1>
<p>[TOC]</p>
<h2 id="&#x7B2C;&#x4E00;&#x5468;&#xFF1A;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x5F15;&#x8A00;introduction-to-deep-learning">&#x7B2C;&#x4E00;&#x5468;&#xFF1A;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x5F15;&#x8A00;(Introduction to Deep Learning)</h2>
<h3 id="11-&#x6B22;&#x8FCE;welcome">1.1 &#x6B22;&#x8FCE;(Welcome)</h3>
<p>&#x7B2C;&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#x4E3B;&#x8981;&#x8BB2;&#x4E86;&#x4EC0;&#x4E48;&#x662F;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#xFF0C;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x80FD;&#x505A;&#x4E9B;&#x4EC0;&#x4E48;&#x4E8B;&#x60C5;&#x3002;&#x4EE5;&#x4E0B;&#x662F;&#x5434;&#x6069;&#x8FBE;&#x8001;&#x5E08;&#x7684;&#x539F;&#x8BDD;&#xFF1A;</p>
<p>&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x6539;&#x53D8;&#x4E86;&#x4F20;&#x7EDF;&#x4E92;&#x8054;&#x7F51;&#x4E1A;&#x52A1;&#xFF0C;&#x4F8B;&#x5982;&#x5982;&#x7F51;&#x7EDC;&#x641C;&#x7D22;&#x548C;&#x5E7F;&#x544A;&#x3002;&#x4F46;&#x662F;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x540C;&#x65F6;&#x4E5F;&#x4F7F;&#x5F97;&#x8BB8;&#x591A;&#x65B0;&#x4EA7;&#x54C1;&#x548C;&#x4F01;&#x4E1A;&#x4EE5;&#x5F88;&#x591A;&#x65B9;&#x5F0F;&#x5E2E;&#x52A9;&#x4EBA;&#x4EEC;&#xFF0C;&#x4ECE;&#x83B7;&#x5F97;&#x66F4;&#x597D;&#x7684;&#x5065;&#x5EB7;&#x5173;&#x6CE8;&#x3002;</p>
<p>&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x505A;&#x7684;&#x975E;&#x5E38;&#x597D;&#x7684;&#x4E00;&#x4E2A;&#x65B9;&#x9762;&#x5C31;&#x662F;&#x8BFB;&#x53D6;X&#x5149;&#x56FE;&#x50CF;&#xFF0C;&#x5230;&#x751F;&#x6D3B;&#x4E2D;&#x7684;&#x4E2A;&#x6027;&#x5316;&#x6559;&#x80B2;&#xFF0C;&#x5230;&#x7CBE;&#x51C6;&#x5316;&#x519C;&#x4E1A;&#xFF0C;&#x751A;&#x81F3;&#x5230;&#x9A7E;&#x9A76;&#x6C7D;&#x8F66;&#x4EE5;&#x53CA;&#x5176;&#x5B83;&#x4E00;&#x4E9B;&#x65B9;&#x9762;&#x3002;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8981;&#x5B66;&#x4E60;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#xFF0C;&#x5E76;&#x5E94;&#x7528;&#x5B83;&#x4EEC;&#x6765;&#x505A;&#x8FD9;&#x4E9B;&#x4EE4;&#x4EBA;&#x7A92;&#x606F;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x672C;&#x8BFE;&#x7A0B;&#x5C06;&#x5E2E;&#x52A9;&#x4F60;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#x3002;&#x5F53;&#x4F60;&#x5B8C;&#x6210;<strong>cousera</strong>&#x4E0A;&#x9762;&#x7684;&#x8FD9;&#x4E00;&#x7CFB;&#x5217;&#x4E13;&#x9879;&#x8BFE;&#x7A0B;&#xFF0C;&#x4F60;&#x5C06;&#x80FD;&#x66F4;&#x52A0;&#x81EA;&#x4FE1;&#x7684;&#x7EE7;&#x7EED;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x4E4B;&#x8DEF;&#x3002;&#x5728;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x5341;&#x5E74;&#x4E2D;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x6211;&#x4EEC;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x6709;&#x673A;&#x4F1A;&#x521B;&#x9020;&#x4E00;&#x4E2A;&#x60CA;&#x4EBA;&#x7684;&#x4E16;&#x754C;&#x548C;&#x793E;&#x4F1A;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;<strong>AI</strong>&#xFF08;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#xFF09;&#x7684;&#x529B;&#x91CF;&#x3002;&#x6211;&#x5E0C;&#x671B;&#x4F60;&#x4EEC;&#x80FD;&#x5728;&#x521B;&#x5EFA;<strong>AI</strong>&#xFF08;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#xFF09;&#x793E;&#x4F1A;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x53D1;&#x6325;&#x91CD;&#x8981;&#x4F5C;&#x7528;&#x3002;</p>
<p>&#x6211;&#x8BA4;&#x4E3A;AI&#x662F;&#x6700;&#x65B0;&#x7684;&#x7535;&#x529B;&#xFF0C;&#x5927;&#x7EA6;&#x5728;&#x4E00;&#x767E;&#x5E74;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x793E;&#x4F1A;&#x7684;&#x7535;&#x6C14;&#x5316;&#x6539;&#x53D8;&#x4E86;&#x6BCF;&#x4E2A;&#x4E3B;&#x8981;&#x884C;&#x4E1A;&#xFF0C;&#x4ECE;&#x4EA4;&#x901A;&#x8FD0;&#x8F93;&#x884C;&#x4E1A;&#x5230;&#x5236;&#x9020;&#x4E1A;&#x3001;&#x533B;&#x7597;&#x4FDD;&#x5065;&#x3001;&#x901A;&#x8BAF;&#x7B49;&#x65B9;&#x9762;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x5982;&#x4ECA;&#x6211;&#x4EEC;&#x89C1;&#x5230;&#x4E86;<strong>AI</strong>&#x660E;&#x663E;&#x7684;&#x4EE4;&#x4EBA;&#x60CA;&#x8BB6;&#x7684;&#x80FD;&#x91CF;&#xFF0C;&#x5E26;&#x6765;&#x4E86;&#x540C;&#x6837;&#x5DE8;&#x5927;&#x7684;&#x8F6C;&#x53D8;&#x3002;&#x663E;&#x7136;&#xFF0C;AI&#x7684;&#x5404;&#x4E2A;&#x5206;&#x652F;&#x4E2D;&#xFF0C;&#x53D1;&#x5C55;&#x7684;&#x6700;&#x4E3A;&#x8FC5;&#x901F;&#x7684;&#x5C31;&#x662F;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x3002;&#x56E0;&#x6B64;&#x73B0;&#x5728;&#xFF0C;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x662F;&#x5728;&#x79D1;&#x6280;&#x4E16;&#x754C;&#x4E2D;&#x5E7F;&#x53D7;&#x6B22;&#x8FCE;&#x7684;&#x4E00;&#x79CD;&#x6280;&#x5DE7;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x8BFE;&#x7A0B;&#xFF0C;&#x4EE5;&#x53CA;&#x8FD9;&#x95E8;&#x8BFE;&#x7A0B;&#x540E;&#x9762;&#x7684;&#x51E0;&#x95E8;&#x8BFE;&#x7A0B;&#xFF0C;&#x4F60;&#x5C06;&#x83B7;&#x53D6;&#x5E76;&#x4E14;&#x638C;&#x63E1;&#x90A3;&#x4E9B;&#x6280;&#x80FD;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x4F60;&#x5C06;&#x5B66;&#x4E60;&#x5230;&#x7684;&#x5185;&#x5BB9;&#xFF1A;</p>
<p>&#x5728;<strong>cousera</strong>&#x7684;&#x8FD9;&#x4E00;&#x7CFB;&#x5217;&#x4E5F;&#x53EB;&#x505A;&#x4E13;&#x9879;&#x8BFE;&#x7A0B;&#x4E2D;,&#x5728;&#x7B2C;&#x4E00;&#x95E8;&#x8BFE;&#x4E2D;&#xFF08;<strong>&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x548C;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;</strong>&#xFF09;&#xFF0C;&#x4F60;&#x5C06;&#x5B66;&#x4E60;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x4F60;&#x5C06;&#x5B66;&#x4E60;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x548C;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#xFF0C;&#x8FD9;&#x95E8;&#x8BFE;&#x5C06;&#x6301;&#x7EED;&#x56DB;&#x5468;&#xFF0C;&#x4E13;&#x9879;&#x8BFE;&#x7A0B;&#x4E2D;&#x7684;&#x6BCF;&#x95E8;&#x8BFE;&#x5C06;&#x6301;&#x7EED;2&#x81F3;4&#x5468;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x5728;&#x7B2C;&#x4E00;&#x95E8;&#x8BFE;&#x7A0B;&#x4E2D;&#xFF0C;&#x4F60;&#x5C06;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x5EFA;&#x7ACB;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF08;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF09;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x5728;&#x6570;&#x636E;&#x4E0A;&#x9762;&#x8BAD;&#x7EC3;&#x4ED6;&#x4EEC;&#x3002;&#x5728;&#x8FD9;&#x95E8;&#x8BFE;&#x7A0B;&#x7684;&#x7ED3;&#x5C3E;&#xFF0C;&#x4F60;&#x5C06;&#x7528;&#x4E00;&#x4E2A;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8FDB;&#x884C;&#x8FA8;&#x8BA4;&#x732B;&#x3002;</p>
<p><img src="../images/ac477ba60e120e318cfb2ed71ff55478.png" alt=""></p>
<p>&#x7531;&#x4E8E;&#x67D0;&#x79CD;&#x539F;&#x56E0;&#xFF0C;&#x7B2C;&#x4E00;&#x95E8;&#x8BFE;&#x4F1A;&#x4EE5;&#x732B;&#x4F5C;&#x4E3A;&#x5BF9;&#x8C61;&#x8BC6;&#x522B;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x5728;&#x7B2C;&#x4E8C;&#x95E8;&#x8BFE;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F7F;&#x7528;&#x4E09;&#x5468;&#x65F6;&#x95F4;&#x3002;&#x4F60;&#x5C06;&#x8FDB;&#x884C;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x65B9;&#x9762;&#x7684;&#x5B9E;&#x8DF5;&#xFF0C;&#x5B66;&#x4E60;&#x4E25;&#x5BC6;&#x5730;&#x6784;&#x5EFA;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x5982;&#x4F55;&#x771F;&#x6B63;&#x8BA9;&#x5B83;&#x8868;&#x73B0;&#x826F;&#x597D;&#xFF0C;&#x56E0;&#x6B64;&#x4F60;&#x5C06;&#x8981;&#x5B66;&#x4E60;&#x8D85;&#x53C2;&#x6570;&#x8C03;&#x6574;&#x3001;&#x6B63;&#x5219;&#x5316;&#x3001;&#x8BCA;&#x65AD;&#x504F;&#x5DEE;&#x548C;&#x65B9;&#x5DEE;&#x4EE5;&#x53CA;&#x4E00;&#x4E9B;&#x9AD8;&#x7EA7;&#x4F18;&#x5316;&#x7B97;&#x6CD5;&#xFF0C;&#x6BD4;&#x5982;<strong>Momentum</strong>&#x548C;<strong>Adam</strong>&#x7B97;&#x6CD5;&#xFF0C;&#x72B9;&#x5982;&#x9ED1;&#x9B54;&#x6CD5;&#x4E00;&#x6837;&#x6839;&#x636E;&#x4F60;&#x5EFA;&#x7ACB;&#x7F51;&#x7EDC;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x7B2C;&#x4E8C;&#x95E8;&#x8BFE;&#x53EA;&#x6709;&#x4E09;&#x5468;&#x5B66;&#x4E60;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x5728;&#x7B2C;&#x4E09;&#x95E8;&#x8BFE;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F7F;&#x7528;&#x4E24;&#x5468;&#x65F6;&#x95F4;&#x6765;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x7ED3;&#x6784;&#x5316;&#x4F60;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5DE5;&#x7A0B;&#x3002;&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#xFF0C;&#x6784;&#x5EFA;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7CFB;&#x7EDF;&#x7684;&#x7B56;&#x7565;&#x6539;&#x53D8;&#x4E86;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x9519;&#x8BEF;&#x3002;</p>
<p>&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;&#x4F60;&#x5206;&#x5272;&#x6570;&#x636E;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5206;&#x5272;&#x6210;&#x8BAD;&#x7EC3;&#x96C6;&#x3001;&#x6BD4;&#x8F83;&#x96C6;&#x6216;&#x6539;&#x53D8;&#x7684;&#x9A8C;&#x8BC1;&#x96C6;&#xFF0C;&#x4EE5;&#x53CA;&#x6D4B;&#x8BD5;&#x96C6;&#x5408;&#xFF0C;&#x6539;&#x53D8;&#x4E86;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x9519;&#x8BEF;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x6700;&#x597D;&#x7684;&#x5B9E;&#x8DF5;&#x65B9;&#x5F0F;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;</p>
<p>&#x4F60;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x6765;&#x81EA;&#x4E0D;&#x540C;&#x7684;&#x8D21;&#x732E;&#x5EA6;&#x5728;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x4E2D;&#x7684;&#x5F71;&#x54CD;&#x5F88;&#x5927;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x5E94;&#x8BE5;&#x600E;&#x4E48;&#x5904;&#x7406;&#x5462;&#xFF1F;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x542C;&#x8BF4;&#x8FC7;&#x7AEF;&#x5BF9;&#x7AEF;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#xFF0C;&#x4F60;&#x4E5F;&#x4F1A;&#x5728;&#x7B2C;&#x4E09;&#x95E8;&#x8BFE;&#x4E2D;&#x4E86;&#x89E3;&#x5230;&#x66F4;&#x591A;&#xFF0C;&#x8FDB;&#x800C;&#x4E86;&#x89E3;&#x5230;&#x4F60;&#x662F;&#x5426;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x5B83;&#xFF0C;&#x7B2C;&#x4E09;&#x8BFE;&#x7684;&#x8D44;&#x6599;&#x662F;&#x76F8;&#x5BF9;&#x6BD4;&#x8F83;&#x72EC;&#x7279;&#x7684;&#xFF0C;&#x6211;&#x5C06;&#x548C;&#x4F60;&#x5206;&#x4EAB;&#x3002;&#x6211;&#x4EEC;&#x4E86;&#x89E3;&#x5230;&#x7684;&#x6240;&#x6709;&#x7684;&#x70ED;&#x95E8;&#x9886;&#x57DF;&#x7684;&#x5EFA;&#x7ACB;&#x5E76;&#x4E14;&#x6539;&#x826F;&#x8BB8;&#x591A;&#x7684;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x4E9B;&#x5F53;&#x4ECA;&#x70ED;&#x95E8;&#x7684;&#x8D44;&#x6599;&#xFF0C;&#x7EDD;&#x5927;&#x90E8;&#x5206;&#x5927;&#x5B66;&#x5728;&#x4ED6;&#x4EEC;&#x7684;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x8BFE;&#x5802;&#x4E0A;&#x9762;&#x91CC;&#x9762;&#x4E0D;&#x4F1A;&#x6559;&#x7684;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x5B83;&#x4F1A;&#x63D0;&#x4F9B;&#x4F60;&#x5E2E;&#x52A9;&#xFF0C;&#x8BA9;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7CFB;&#x7EDF;&#x5DE5;&#x4F5C;&#x7684;&#x66F4;&#x597D;&#x3002;</p>
<p>&#x5728;&#x7B2C;&#x56DB;&#x95E8;&#x8BFE;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x63D0;&#x5230;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;(<strong>CNN(s)</strong>)&#xFF0C;&#x5B83;&#x7ECF;&#x5E38;&#x88AB;&#x7528;&#x4E8E;&#x56FE;&#x50CF;&#x9886;&#x57DF;&#xFF0C;&#x4F60;&#x5C06;&#x4F1A;&#x5728;&#x7B2C;&#x56DB;&#x95E8;&#x8BFE;&#x7A0B;&#x4E2D;&#x5B66;&#x5230;&#x5982;&#x4F55;&#x642D;&#x5EFA;&#x8FD9;&#x6837;&#x7684;&#x6A21;&#x578B;&#x3002;</p>
<p>&#x6700;&#x540E;&#x5728;&#x7B2C;&#x4E94;&#x95E8;&#x8BFE;&#x4E2D;&#xFF0C;&#x4F60;&#x5C06;&#x4F1A;&#x5B66;&#x4E60;&#x5230;&#x5E8F;&#x5217;&#x6A21;&#x578B;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x5C06;&#x5B83;&#x4EEC;&#x5E94;&#x7528;&#x4E8E;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x5904;&#x7406;&#xFF0C;&#x4EE5;&#x53CA;&#x5176;&#x5B83;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5E8F;&#x5217;&#x6A21;&#x578B;&#x5305;&#x62EC;&#x7684;&#x6A21;&#x578B;&#x6709;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF08;<strong>RNN</strong>&#xFF09;&#x3001;&#x5168;&#x79F0;&#x662F;&#x957F;&#x77ED;&#x671F;&#x8BB0;&#x5FC6;&#x7F51;&#x7EDC;&#xFF08;<strong>LSTM</strong>&#xFF09;&#x3002;&#x4F60;&#x5C06;&#x5728;&#x8BFE;&#x7A0B;&#x4E94;&#x4E2D;&#x4E86;&#x89E3;&#x5176;&#x4E2D;&#x7684;&#x65F6;&#x671F;&#x662F;&#x4EC0;&#x4E48;&#x542B;&#x4E49;&#xFF0C;&#x5E76;&#x4E14;&#x6709;&#x80FD;&#x529B;&#x5E94;&#x7528;&#x5230;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x5904;&#x7406;&#xFF08;<strong>NLP</strong>&#xFF09;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x603B;&#x4E4B;&#x4F60;&#x5C06;&#x5728;&#x8BFE;&#x7A0B;&#x4E94;&#x4E2D;&#x5B66;&#x4E60;&#x8FD9;&#x4E9B;&#x6A21;&#x578B;&#xFF0C;&#x4EE5;&#x53CA;&#x80FD;&#x591F;&#x5C06;&#x5B83;&#x4EEC;&#x5E94;&#x7528;&#x4E8E;&#x5E8F;&#x5217;&#x6570;&#x636E;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5355;&#x8BCD;&#x5E8F;&#x5217;&#x3002;&#x4F60;&#x4E5F;&#x5C06;&#x80FD;&#x591F;&#x7406;&#x89E3;&#x8FD9;&#x4E9B;&#x6A21;&#x578B;&#x5982;&#x4F55;&#x5E94;&#x7528;&#x5230;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#x6216;&#x8005;&#x662F;&#x7F16;&#x66F2;&#x4EE5;&#x53CA;&#x5176;&#x5B83;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x901A;&#x8FC7;&#x8FD9;&#x4E9B;&#x8BFE;&#x7A0B;&#xFF0C;&#x4F60;&#x5C06;&#x5B66;&#x4E60;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#xFF0C;&#x4F60;&#x5C06;&#x80FD;&#x591F;&#x53BB;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x53BB;&#x505A;&#x4E00;&#x4E9B;&#x795E;&#x5947;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5E76;&#x501F;&#x6B64;&#x6765;&#x63D0;&#x5347;&#x4F60;&#x7684;&#x804C;&#x4E1A;&#x751F;&#x6DAF;&#x3002;</p>
<p>&#x5434;&#x6069;&#x8FBE;</p>
<hr>
<h3 id="12-&#x4EC0;&#x4E48;&#x662F;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF1F;what-is-a-neural-network">1.2 &#x4EC0;&#x4E48;&#x662F;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF1F;(What is a Neural Network)</h3>
<p>&#x6211;&#x4EEC;&#x5E38;&#x5E38;&#x7528;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x8FD9;&#x4E2A;&#x672F;&#x8BED;&#x6765;&#x6307;&#x8BAD;&#x7EC3;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x6709;&#x65F6;&#x5B83;&#x6307;&#x7684;&#x662F;&#x7279;&#x522B;&#x5927;&#x89C4;&#x6A21;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8BAD;&#x7EC3;&#x3002;&#x90A3;&#x4E48;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7A76;&#x7ADF;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x5728;&#x8FD9;&#x4E2A;&#x89C6;&#x9891;&#x4E2D;&#xFF0C;&#x6211;&#x4F1A;&#x8BB2;&#x89E3;&#x4E00;&#x4E9B;&#x76F4;&#x89C2;&#x7684;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x4ECE;&#x4E00;&#x4E2A;&#x623F;&#x4EF7;&#x9884;&#x6D4B;&#x7684;&#x4F8B;&#x5B50;&#x5F00;&#x59CB;&#x8BB2;&#x8D77;&#x3002;</p>
<p>&#x5047;&#x8BBE;&#x4F60;&#x6709;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x5B83;&#x5305;&#x542B;&#x4E86;&#x516D;&#x680B;&#x623F;&#x5B50;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x4F60;&#x77E5;&#x9053;&#x623F;&#x5C4B;&#x7684;&#x9762;&#x79EF;&#x662F;&#x591A;&#x5C11;&#x5E73;&#x65B9;&#x82F1;&#x5C3A;&#x6216;&#x8005;&#x5E73;&#x65B9;&#x7C73;&#xFF0C;&#x5E76;&#x4E14;&#x77E5;&#x9053;&#x623F;&#x5C4B;&#x4EF7;&#x683C;&#x3002;&#x8FD9;&#x65F6;&#xFF0C;&#x4F60;&#x60F3;&#x8981;&#x62DF;&#x5408;&#x4E00;&#x4E2A;&#x6839;&#x636E;&#x623F;&#x5C4B;&#x9762;&#x79EF;&#x9884;&#x6D4B;&#x623F;&#x4EF7;&#x7684;&#x51FD;&#x6570;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x5F88;&#x719F;&#x6089;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x8BF4;&#xFF1A;&#x201C;&#x597D;&#x5427;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x7528;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x62DF;&#x5408;&#x4E00;&#x6761;&#x76F4;&#x7EBF;&#x3002;&#x201D;&#x4E8E;&#x662F;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x5F97;&#x5230;&#x8FD9;&#x6837;&#x4E00;&#x6761;&#x76F4;&#x7EBF;&#x3002;</p>
<p><img src="../images/3fe6da26014467243e3d499569be3675.png" alt=""></p>
<p>&#x4F46;&#x6709;&#x70B9;&#x5947;&#x602A;&#x7684;&#x662F;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4E5F;&#x53D1;&#x73B0;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x4EF7;&#x683C;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x662F;&#x8D1F;&#x6570;&#x7684;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4E3A;&#x4E86;&#x66FF;&#x4EE3;&#x4E00;&#x6761;&#x53EF;&#x80FD;&#x4F1A;&#x8BA9;&#x4EF7;&#x683C;&#x4E3A;&#x8D1F;&#x7684;&#x76F4;&#x7EBF;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x76F4;&#x7EBF;&#x5F2F;&#x66F2;&#x4E00;&#x70B9;&#xFF0C;&#x8BA9;&#x5B83;&#x6700;&#x7EC8;&#x5728;&#x96F6;&#x7ED3;&#x675F;&#x3002;&#x8FD9;&#x6761;&#x7C97;&#x7684;&#x84DD;&#x7EBF;&#x6700;&#x7EC8;&#x5C31;&#x662F;&#x4F60;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x7528;&#x4E8E;&#x6839;&#x636E;&#x623F;&#x5C4B;&#x9762;&#x79EF;&#x9884;&#x6D4B;&#x4EF7;&#x683C;&#x3002;&#x6709;&#x90E8;&#x5206;&#x662F;&#x96F6;&#xFF0C;&#x800C;&#x76F4;&#x7EBF;&#x7684;&#x90E8;&#x5206;&#x62DF;&#x5408;&#x7684;&#x5F88;&#x597D;&#x3002;&#x4F60;&#x4E5F;&#x8BB8;&#x8BA4;&#x4E3A;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x53EA;&#x62DF;&#x5408;&#x623F;&#x5C4B;&#x4EF7;&#x683C;&#x3002;</p>
<p>&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x8FD9;&#x51E0;&#x4E4E;&#x53EF;&#x80FD;&#x662F;&#x6700;&#x7B80;&#x5355;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;&#x6211;&#x4EEC;&#x628A;&#x623F;&#x5C4B;&#x7684;&#x9762;&#x79EF;&#x4F5C;&#x4E3A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x8F93;&#x5165;&#xFF08;&#x6211;&#x4EEC;&#x79F0;&#x4E4B;&#x4E3A;$x$&#xFF09;&#xFF0C;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#xFF08;&#x4E00;&#x4E2A;&#x5C0F;&#x5706;&#x5708;&#xFF09;&#xFF0C;&#x6700;&#x7EC8;&#x8F93;&#x51FA;&#x4E86;&#x4EF7;&#x683C;&#xFF08;&#x6211;&#x4EEC;&#x7528;$y$&#x8868;&#x793A;&#xFF09;&#x3002;&#x5176;&#x5B9E;&#x8FD9;&#x4E2A;&#x5C0F;&#x5706;&#x5708;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x3002;&#x63A5;&#x7740;&#x4F60;&#x7684;&#x7F51;&#x7EDC;&#x5B9E;&#x73B0;&#x4E86;&#x5DE6;&#x8FB9;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x7684;&#x529F;&#x80FD;&#x3002;</p>
<p>&#x5728;&#x6709;&#x5173;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x6587;&#x732E;&#x4E2D;&#xFF0C;&#x4F60;&#x7ECF;&#x5E38;&#x770B;&#x5F97;&#x5230;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x3002;&#x4ECE;&#x8D8B;&#x8FD1;&#x4E8E;&#x96F6;&#x5F00;&#x59CB;&#xFF0C;&#x7136;&#x540E;&#x53D8;&#x6210;&#x4E00;&#x6761;&#x76F4;&#x7EBF;&#x3002;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x88AB;&#x79F0;&#x4F5C;<strong>ReLU</strong>&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF0C;&#x5B83;&#x7684;&#x5168;&#x79F0;&#x662F;<strong>Rectified Linear Unit</strong>&#x3002;rectify&#xFF08;&#x4FEE;&#x6B63;&#xFF09;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x6210;$max(0,x)$&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x4F60;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x8FD9;&#x79CD;&#x5F62;&#x72B6;&#x7684;&#x51FD;&#x6570;&#x7684;&#x539F;&#x56E0;&#x3002;</p>
<p><img src="../images/9433d636eeeaa3469910ae75298820cc.png" alt=""></p>
<p>&#x4F60;&#x73B0;&#x5728;&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#x4E0D;&#x7406;&#x89E3;<strong>ReLU</strong>&#x51FD;&#x6570;&#xFF0C;&#x4F60;&#x5C06;&#x4F1A;&#x5728;&#x8FD9;&#x95E8;&#x8BFE;&#x7684;&#x540E;&#x9762;&#x518D;&#x6B21;&#x770B;&#x5230;&#x5B83;&#x3002;</p>
<p>&#x5982;&#x679C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5355;&#x795E;&#x7ECF;&#x5143;&#x7F51;&#x7EDC;&#xFF0C;&#x4E0D;&#x7BA1;&#x89C4;&#x6A21;&#x5927;&#x5C0F;&#xFF0C;&#x5B83;&#x6B63;&#x662F;&#x901A;&#x8FC7;&#x628A;&#x8FD9;&#x4E9B;&#x5355;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x53E0;&#x52A0;&#x5728;&#x4E00;&#x8D77;&#x6765;&#x5F62;&#x6210;&#x3002;&#x5982;&#x679C;&#x4F60;&#x628A;&#x8FD9;&#x4E9B;&#x795E;&#x7ECF;&#x5143;&#x60F3;&#x8C61;&#x6210;&#x5355;&#x72EC;&#x7684;&#x4E50;&#x9AD8;&#x79EF;&#x6728;&#xFF0C;&#x4F60;&#x5C31;&#x901A;&#x8FC7;&#x642D;&#x79EF;&#x6728;&#x6765;&#x5B8C;&#x6210;&#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x4EC5;&#x4EC5;&#x7528;&#x623F;&#x5C4B;&#x7684;&#x9762;&#x79EF;&#x6765;&#x9884;&#x6D4B;&#x5B83;&#x7684;&#x4EF7;&#x683C;&#xFF0C;&#x73B0;&#x5728;&#x4F60;&#x6709;&#x4E86;&#x4E00;&#x4E9B;&#x6709;&#x5173;&#x623F;&#x5C4B;&#x7684;&#x5176;&#x5B83;&#x7279;&#x5F81;&#xFF0C;&#x6BD4;&#x5982;&#x5367;&#x5BA4;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x6216;&#x8BB8;&#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x56E0;&#x7D20;&#xFF0C;&#x4E00;&#x5BB6;&#x4EBA;&#x7684;&#x6570;&#x91CF;&#x4E5F;&#x4F1A;&#x5F71;&#x54CD;&#x623F;&#x5C4B;&#x4EF7;&#x683C;&#xFF0C;&#x8FD9;&#x4E2A;&#x623F;&#x5C4B;&#x80FD;&#x4F4F;&#x4E0B;&#x4E00;&#x5BB6;&#x4EBA;&#x6216;&#x8005;&#x662F;&#x56DB;&#x4E94;&#x4E2A;&#x4EBA;&#x7684;&#x5BB6;&#x5EAD;&#x5417;&#xFF1F;&#x800C;&#x8FD9;&#x786E;&#x5B9E;&#x662F;&#x57FA;&#x4E8E;&#x623F;&#x5C4B;&#x5927;&#x5C0F;&#xFF0C;&#x4EE5;&#x53CA;&#x771F;&#x6B63;&#x51B3;&#x5B9A;&#x4E00;&#x680B;&#x623F;&#x5B50;&#x662F;&#x5426;&#x80FD;&#x9002;&#x5408;&#x4F60;&#x4EEC;&#x5BB6;&#x5EAD;&#x4EBA;&#x6570;&#x7684;&#x5367;&#x5BA4;&#x6570;&#x3002;</p>
<p>&#x6362;&#x4E2A;&#x8BDD;&#x9898;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x77E5;&#x9053;&#x90AE;&#x653F;&#x7F16;&#x7801;&#x6216;&#x8BB8;&#x80FD;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x7279;&#x5F81;&#xFF0C;&#x544A;&#x8BC9;&#x4F60;&#x6B65;&#x884C;&#x5316;&#x7A0B;&#x5EA6;&#x3002;&#x6BD4;&#x5982;&#x8FD9;&#x9644;&#x8FD1;&#x662F;&#x4E0D;&#x662F;&#x9AD8;&#x5EA6;&#x6B65;&#x884C;&#x5316;&#xFF0C;&#x4F60;&#x662F;&#x5426;&#x80FD;&#x6B65;&#x884C;&#x53BB;&#x6742;&#x8D27;&#x5E97;&#x6216;&#x8005;&#x662F;&#x5B66;&#x6821;&#xFF0C;&#x4EE5;&#x53CA;&#x4F60;&#x662F;&#x5426;&#x9700;&#x8981;&#x9A7E;&#x9A76;&#x6C7D;&#x8F66;&#x3002;&#x6709;&#x4E9B;&#x4EBA;&#x559C;&#x6B22;&#x5C45;&#x4F4F;&#x5728;&#x4EE5;&#x6B65;&#x884C;&#x4E3A;&#x4E3B;&#x7684;&#x533A;&#x57DF;&#xFF0C;&#x53E6;&#x5916;&#x6839;&#x636E;&#x90AE;&#x653F;&#x7F16;&#x7801;&#x8FD8;&#x548C;&#x5BCC;&#x88D5;&#x7A0B;&#x5EA6;&#x76F8;&#x5173;&#xFF08;&#x5728;&#x7F8E;&#x56FD;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF09;&#x3002;&#x4F46;&#x5728;&#x5176;&#x5B83;&#x56FD;&#x5BB6;&#x4E5F;&#x53EF;&#x80FD;&#x4F53;&#x73B0;&#x51FA;&#x9644;&#x8FD1;&#x5B66;&#x6821;&#x7684;&#x6C34;&#x5E73;&#x6709;&#x591A;&#x597D;&#x3002;</p>
<p><img src="../images/d900d26b850d55abce36d4c8daf71327.png" alt=""></p>
<p>&#x5728;&#x56FE;&#x4E0A;&#x6BCF;&#x4E00;&#x4E2A;&#x753B;&#x7684;&#x5C0F;&#x5706;&#x5708;&#x90FD;&#x53EF;&#x4EE5;&#x662F;<strong>ReLU</strong>&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6307;&#x4FEE;&#x6B63;&#x7EBF;&#x6027;&#x5355;&#x5143;&#xFF0C;&#x6216;&#x8005;&#x5176;&#x5B83;&#x7A0D;&#x5FAE;&#x975E;&#x7EBF;&#x6027;&#x7684;&#x51FD;&#x6570;&#x3002;&#x57FA;&#x4E8E;&#x623F;&#x5C4B;&#x9762;&#x79EF;&#x548C;&#x5367;&#x5BA4;&#x6570;&#x91CF;&#xFF0C;&#x53EF;&#x4EE5;&#x4F30;&#x7B97;&#x5BB6;&#x5EAD;&#x4EBA;&#x53E3;&#xFF0C;&#x57FA;&#x4E8E;&#x90AE;&#x7F16;&#xFF0C;&#x53EF;&#x4EE5;&#x4F30;&#x6D4B;&#x6B65;&#x884C;&#x5316;&#x7A0B;&#x5EA6;&#x6216;&#x8005;&#x5B66;&#x6821;&#x7684;&#x8D28;&#x91CF;&#x3002;&#x6700;&#x540E;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x8FD9;&#x6837;&#x60F3;&#xFF0C;&#x8FD9;&#x4E9B;&#x51B3;&#x5B9A;&#x4EBA;&#x4EEC;&#x4E50;&#x610F;&#x82B1;&#x8D39;&#x591A;&#x5C11;&#x94B1;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x623F;&#x5B50;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x4E0E;&#x5B83;&#x606F;&#x606F;&#x76F8;&#x5173;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x60C5;&#x666F;&#x91CC;&#xFF0C;&#x5BB6;&#x5EAD;&#x4EBA;&#x53E3;&#x3001;&#x6B65;&#x884C;&#x5316;&#x7A0B;&#x5EA6;&#x4EE5;&#x53CA;&#x5B66;&#x6821;&#x7684;&#x8D28;&#x91CF;&#x90FD;&#x80FD;&#x5E2E;&#x52A9;&#x4F60;&#x9884;&#x6D4B;&#x623F;&#x5C4B;&#x7684;&#x4EF7;&#x683C;&#x3002;&#x4EE5;&#x6B64;&#x4E3A;&#x4F8B;&#xFF0C;$x$ &#x662F;&#x6240;&#x6709;&#x7684;&#x8FD9;&#x56DB;&#x4E2A;&#x8F93;&#x5165;&#xFF0C;$y$ &#x662F;&#x4F60;&#x5C1D;&#x8BD5;&#x9884;&#x6D4B;&#x7684;&#x4EF7;&#x683C;&#xFF0C;&#x628A;&#x8FD9;&#x4E9B;&#x5355;&#x4E2A;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x53E0;&#x52A0;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x7A0D;&#x5FAE;&#x5927;&#x4E00;&#x70B9;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;&#x8FD9;&#x663E;&#x793A;&#x4E86;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x795E;&#x5947;&#x4E4B;&#x5904;&#xFF0C;&#x867D;&#x7136;&#x6211;&#x5DF2;&#x7ECF;&#x63CF;&#x8FF0;&#x4E86;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x9700;&#x8981;&#x4F60;&#x5F97;&#x5230;&#x623F;&#x5C4B;&#x9762;&#x79EF;&#x3001;&#x6B65;&#x884C;&#x5316;&#x7A0B;&#x5EA6;&#x548C;&#x5B66;&#x6821;&#x7684;&#x8D28;&#x91CF;&#xFF0C;&#x6216;&#x8005;&#x5176;&#x5B83;&#x5F71;&#x54CD;&#x4EF7;&#x683C;&#x7684;&#x56E0;&#x7D20;&#x3002;
<img src="../images/7a0e0d40f4ba80a0466f0bd7aa9f8537.png" alt="">
&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x795E;&#x5947;&#x4E4B;&#x5904;&#x5728;&#x4E8E;&#xFF0C;&#x5F53;&#x4F60;&#x5B9E;&#x73B0;&#x5B83;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x8981;&#x505A;&#x7684;&#x53EA;&#x662F;&#x8F93;&#x5165;$x$&#xFF0C;&#x5C31;&#x80FD;&#x5F97;&#x5230;&#x8F93;&#x51FA;$y$&#x3002;&#x56E0;&#x4E3A;&#x5B83;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x8BA1;&#x7B97;&#x4F60;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#x6837;&#x672C;&#x7684;&#x6570;&#x76EE;&#x4EE5;&#x53CA;&#x6240;&#x6709;&#x7684;&#x4E2D;&#x95F4;&#x8FC7;&#x7A0B;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x4F60;&#x5B9E;&#x9645;&#x4E0A;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#xFF1A;&#x8FD9;&#x91CC;&#x6709;&#x56DB;&#x4E2A;&#x8F93;&#x5165;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x8FD9;&#x8F93;&#x5165;&#x7684;&#x7279;&#x5F81;&#x53EF;&#x80FD;&#x662F;&#x623F;&#x5C4B;&#x7684;&#x5927;&#x5C0F;&#x3001;&#x5367;&#x5BA4;&#x7684;&#x6570;&#x91CF;&#x3001;&#x90AE;&#x653F;&#x7F16;&#x7801;&#x548C;&#x533A;&#x57DF;&#x7684;&#x5BCC;&#x88D5;&#x7A0B;&#x5EA6;&#x3002;&#x7ED9;&#x51FA;&#x8FD9;&#x4E9B;&#x8F93;&#x5165;&#x7684;&#x7279;&#x5F81;&#x4E4B;&#x540E;&#xFF0C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x5DE5;&#x4F5C;&#x5C31;&#x662F;&#x9884;&#x6D4B;&#x5BF9;&#x5E94;&#x7684;&#x4EF7;&#x683C;&#x3002;&#x540C;&#x65F6;&#x4E5F;&#x6CE8;&#x610F;&#x5230;&#x8FD9;&#x4E9B;&#x88AB;&#x53EB;&#x505A;&#x9690;&#x85CF;&#x5355;&#x5143;&#x5706;&#x5708;&#xFF0C;&#x5728;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#xFF0C;&#x5B83;&#x4EEC;&#x6BCF;&#x4E2A;&#x90FD;&#x4ECE;&#x8F93;&#x5165;&#x7684;&#x56DB;&#x4E2A;&#x7279;&#x5F81;&#x83B7;&#x5F97;&#x81EA;&#x8EAB;&#x8F93;&#x5165;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x7ED3;&#x70B9;&#x4EE3;&#x8868;&#x5BB6;&#x5EAD;&#x4EBA;&#x53E3;&#xFF0C;&#x800C;&#x5BB6;&#x5EAD;&#x4EBA;&#x53E3;&#x4EC5;&#x4EC5;&#x53D6;&#x51B3;&#x4E8E;$x_1$&#x548C;$x_2$&#x7279;&#x5F81;&#xFF0C;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5728;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#xFF0C;&#x4F60;&#x51B3;&#x5B9A;&#x5728;&#x8FD9;&#x4E2A;&#x7ED3;&#x70B9;&#x4E2D;&#x60F3;&#x8981;&#x5F97;&#x5230;&#x4EC0;&#x4E48;&#xFF0C;&#x7136;&#x540E;&#x7528;&#x6240;&#x6709;&#x7684;&#x56DB;&#x4E2A;&#x8F93;&#x5165;&#x6765;&#x8BA1;&#x7B97;&#x60F3;&#x8981;&#x5F97;&#x5230;&#x7684;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x8BF4;&#x8F93;&#x5165;&#x5C42;&#x548C;&#x4E2D;&#x95F4;&#x5C42;&#x88AB;&#x7D27;&#x5BC6;&#x7684;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#x4E86;&#x3002;</p>
<p>&#x503C;&#x5F97;&#x6CE8;&#x610F;&#x7684;&#x662F;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7ED9;&#x4E88;&#x4E86;&#x8DB3;&#x591F;&#x591A;&#x7684;&#x5173;&#x4E8E;$x$&#x548C;$y$&#x7684;&#x6570;&#x636E;&#xFF0C;&#x7ED9;&#x4E88;&#x4E86;&#x8DB3;&#x591F;&#x7684;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#x6709;&#x5173;$x$&#x548C;$y$&#x3002;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x975E;&#x5E38;&#x64C5;&#x957F;&#x8BA1;&#x7B97;&#x4ECE;$x$&#x5230;$y$&#x7684;&#x7CBE;&#x51C6;&#x6620;&#x5C04;&#x51FD;&#x6570;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x57FA;&#x7840;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;&#x4F60;&#x53EF;&#x80FD;&#x53D1;&#x73B0;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5728;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x7684;&#x73AF;&#x5883;&#x4E0B;&#x662F;&#x5982;&#x6B64;&#x7684;&#x6709;&#x6548;&#x548C;&#x5F3A;&#x5927;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x4F60;&#x53EA;&#x8981;&#x5C1D;&#x8BD5;&#x8F93;&#x5165;&#x4E00;&#x4E2A;$x$&#xFF0C;&#x5373;&#x53EF;&#x628A;&#x5B83;&#x6620;&#x5C04;&#x6210;$y$&#xFF0C;&#x5C31;&#x597D;&#x50CF;&#x6211;&#x4EEC;&#x5728;&#x521A;&#x624D;&#x623F;&#x4EF7;&#x9884;&#x6D4B;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#x770B;&#x5230;&#x7684;&#x6548;&#x679C;&#x3002;</p>
<p>&#x5728;&#x4E0B;&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#x4E2D;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x590D;&#x4E60;&#x4E00;&#x4E0B;&#x66F4;&#x591A;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x6709;&#x4E9B;&#x4F8B;&#x5B50;&#x4F1A;&#x8BA9;&#x4F60;&#x89C9;&#x5F97;&#x4F60;&#x7684;&#x7F51;&#x7EDC;&#x4F1A;&#x5341;&#x5206;&#x6709;&#x7528;&#xFF0C;&#x5E76;&#x4E14;&#x4F60;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x8D77;&#x6765;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#x3002;</p>
<h3 id="13-&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x76D1;&#x7763;&#x5B66;&#x4E60;supervised-learning-with-neural-networks">1.3 &#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x76D1;&#x7763;&#x5B66;&#x4E60;(Supervised Learning with Neural Networks)</h3>
<p>&#x5173;&#x4E8E;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E5F;&#x6709;&#x5F88;&#x591A;&#x7684;&#x79CD;&#x7C7B;&#xFF0C;&#x8003;&#x8651;&#x5230;&#x5B83;&#x4EEC;&#x7684;&#x4F7F;&#x7528;&#x6548;&#x679C;&#xFF0C;&#x6709;&#x4E9B;&#x4F7F;&#x7528;&#x8D77;&#x6765;&#x6070;&#x5230;&#x597D;&#x5904;&#xFF0C;&#x4F46;&#x4E8B;&#x5B9E;&#x8868;&#x660E;&#xFF0C;&#x5230;&#x76EE;&#x524D;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x7531;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x521B;&#x9020;&#x7684;&#x7ECF;&#x6D4E;&#x4EF7;&#x503C;&#xFF0C;&#x672C;&#x8D28;&#x4E0A;&#x90FD;&#x79BB;&#x4E0D;&#x5F00;&#x4E00;&#x79CD;&#x53EB;&#x505A;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7C7B;&#x522B;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x4E3E;&#x4F8B;&#x770B;&#x770B;&#x3002;</p>
<p>&#x5728;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x4E2D;&#x4F60;&#x6709;&#x4E00;&#x4E9B;&#x8F93;&#x5165;$x$&#xFF0C;&#x4F60;&#x60F3;&#x5B66;&#x4E60;&#x5230;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x6765;&#x6620;&#x5C04;&#x5230;&#x4E00;&#x4E9B;&#x8F93;&#x51FA;$y$&#xFF0C;&#x6BD4;&#x5982;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x63D0;&#x5230;&#x7684;&#x623F;&#x4EF7;&#x9884;&#x6D4B;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x4F60;&#x53EA;&#x8981;&#x8F93;&#x5165;&#x6709;&#x5173;&#x623F;&#x5C4B;&#x7684;&#x4E00;&#x4E9B;&#x7279;&#x5F81;&#xFF0C;&#x8BD5;&#x7740;&#x53BB;&#x8F93;&#x51FA;&#x6216;&#x8005;&#x4F30;&#x8BA1;&#x4EF7;&#x683C;$y$&#x3002;&#x6211;&#x4EEC;&#x4E3E;&#x4E00;&#x4E9B;&#x5176;&#x5B83;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x6765;&#x8BF4;&#x660E;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5DF2;&#x7ECF;&#x88AB;&#x9AD8;&#x6548;&#x5E94;&#x7528;&#x5230;&#x5176;&#x5B83;&#x5730;&#x65B9;&#x3002;</p>
<p><img src="../images/ec9f15da25c4072eeedc9ba7fa363f80.png" alt=""></p>
<p>&#x5982;&#x4ECA;&#x5E94;&#x7528;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x83B7;&#x5229;&#x6700;&#x591A;&#x7684;&#x4E00;&#x4E2A;&#x9886;&#x57DF;&#xFF0C;&#x5C31;&#x662F;&#x5728;&#x7EBF;&#x5E7F;&#x544A;&#x3002;&#x8FD9;&#x4E5F;&#x8BB8;&#x4E0D;&#x662F;&#x6700;&#x9F13;&#x821E;&#x4EBA;&#x5FC3;&#x7684;&#xFF0C;&#x4F46;&#x771F;&#x7684;&#x5F88;&#x8D5A;&#x94B1;&#x3002;&#x5177;&#x4F53;&#x5C31;&#x662F;&#x901A;&#x8FC7;&#x5728;&#x7F51;&#x7AD9;&#x4E0A;&#x8F93;&#x5165;&#x4E00;&#x4E2A;&#x5E7F;&#x544A;&#x7684;&#x76F8;&#x5173;&#x4FE1;&#x606F;&#xFF0C;&#x56E0;&#x4E3A;&#x4E5F;&#x8F93;&#x5165;&#x4E86;&#x7528;&#x6237;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x4E8E;&#x662F;&#x7F51;&#x7AD9;&#x5C31;&#x4F1A;&#x8003;&#x8651;&#x662F;&#x5426;&#x5411;&#x4F60;&#x5C55;&#x793A;&#x5E7F;&#x544A;&#x3002;</p>
<p>&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5DF2;&#x7ECF;&#x975E;&#x5E38;&#x64C5;&#x957F;&#x9884;&#x6D4B;&#x4F60;&#x662F;&#x5426;&#x4F1A;&#x70B9;&#x5F00;&#x8FD9;&#x4E2A;&#x5E7F;&#x544A;&#xFF0C;&#x901A;&#x8FC7;&#x5411;&#x7528;&#x6237;&#x5C55;&#x793A;&#x6700;&#x6709;&#x53EF;&#x80FD;&#x70B9;&#x5F00;&#x7684;&#x5E7F;&#x544A;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5728;&#x5F88;&#x591A;&#x5BB6;&#x516C;&#x53F8;&#x96BE;&#x4EE5;&#x7F6E;&#x4FE1;&#x5730;&#x63D0;&#x9AD8;&#x83B7;&#x5229;&#x7684;&#x4E00;&#x79CD;&#x5E94;&#x7528;&#x3002;&#x56E0;&#x4E3A;&#x6709;&#x4E86;&#x8FD9;&#x79CD;&#x5411;&#x4F60;&#x5C55;&#x793A;&#x4F60;&#x6700;&#x6709;&#x53EF;&#x80FD;&#x70B9;&#x51FB;&#x7684;&#x5E7F;&#x544A;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x800C;&#x8FD9;&#x4E00;&#x70B9;&#x51FB;&#x7684;&#x884C;&#x4E3A;&#x7684;&#x6539;&#x53D8;&#x4F1A;&#x76F4;&#x63A5;&#x5F71;&#x54CD;&#x5230;&#x4E00;&#x4E9B;&#x5927;&#x578B;&#x7684;&#x5728;&#x7EBF;&#x5E7F;&#x544A;&#x516C;&#x53F8;&#x7684;&#x6536;&#x5165;&#x3002;</p>
<p>&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x5728;&#x8FC7;&#x53BB;&#x7684;&#x51E0;&#x5E74;&#x91CC;&#x4E5F;&#x53D6;&#x5F97;&#x4E86;&#x957F;&#x8DB3;&#x7684;&#x8FDB;&#x6B65;&#xFF0C;&#x8FD9;&#x4E5F;&#x591A;&#x4E8F;&#x4E86;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x8F93;&#x5165;&#x4E00;&#x4E2A;&#x56FE;&#x50CF;&#xFF0C;&#x7136;&#x540E;&#x60F3;&#x8F93;&#x51FA;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#xFF0C;&#x8303;&#x56F4;&#x4ECE;1&#x5230;1000&#x6765;&#x8BD5;&#x7740;&#x544A;&#x8BC9;&#x4F60;&#x8FD9;&#x5F20;&#x7167;&#x7247;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x662F;&#xFF0C;&#x6BD4;&#x65B9;&#x8BF4;&#xFF0C;1000&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x56FE;&#x50CF;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x9009;&#x62E9;&#x7528;&#x5B83;&#x6765;&#x7ED9;&#x7167;&#x7247;&#x6253;&#x6807;&#x7B7E;&#x3002;</p>
<p>&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x6700;&#x8FD1;&#x5728;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#x65B9;&#x9762;&#x7684;&#x8FDB;&#x6B65;&#x4E5F;&#x662F;&#x975E;&#x5E38;&#x4EE4;&#x4EBA;&#x5174;&#x594B;&#x7684;&#xFF0C;&#x4F60;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x5C06;&#x97F3;&#x9891;&#x7247;&#x6BB5;&#x8F93;&#x5165;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x7136;&#x540E;&#x8BA9;&#x5B83;&#x8F93;&#x51FA;&#x6587;&#x672C;&#x8BB0;&#x5F55;&#x3002;&#x5F97;&#x76CA;&#x4E8E;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#xFF0C;&#x673A;&#x5668;&#x7FFB;&#x8BD1;&#x4E5F;&#x6709;&#x5F88;&#x5927;&#x7684;&#x53D1;&#x5C55;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8F93;&#x5165;&#x82F1;&#x8BED;&#x53E5;&#x5B50;&#xFF0C;&#x63A5;&#x7740;&#x8F93;&#x51FA;&#x4E00;&#x4E2A;&#x4E2D;&#x6587;&#x53E5;&#x5B50;&#x3002;</p>
<p>&#x5728;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x6280;&#x672F;&#x4E2D;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8F93;&#x5165;&#x4E00;&#x5E45;&#x56FE;&#x50CF;&#xFF0C;&#x5C31;&#x597D;&#x50CF;&#x4E00;&#x4E2A;&#x4FE1;&#x606F;&#x96F7;&#x8FBE;&#x5C55;&#x793A;&#x6C7D;&#x8F66;&#x524D;&#x65B9;&#x6709;&#x4EC0;&#x4E48;&#xFF0C;&#x636E;&#x6B64;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x6765;&#x544A;&#x8BC9;&#x6C7D;&#x8F66;&#x5728;&#x9A6C;&#x8DEF;&#x4E0A;&#x9762;&#x5177;&#x4F53;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5728;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x6210;&#x5206;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7CFB;&#x7EDF;&#x5DF2;&#x7ECF;&#x53EF;&#x4EE5;&#x521B;&#x9020;&#x5982;&#x6B64;&#x591A;&#x7684;&#x4EF7;&#x503C;&#xFF0C;&#x901A;&#x8FC7;&#x667A;&#x80FD;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x54EA;&#x4E9B;&#x4F5C;&#x4E3A;$x$&#x54EA;&#x4E9B;&#x4F5C;&#x4E3A;$y$&#xFF0C;&#x6765;&#x9488;&#x5BF9;&#x4E8E;&#x4F60;&#x5F53;&#x524D;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x7136;&#x540E;&#x62DF;&#x5408;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x90E8;&#x5206;&#xFF0C;&#x5F80;&#x5F80;&#x662F;&#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x6BD4;&#x5982;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x3002;&#x8FD9;&#x8868;&#x660E;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7C7B;&#x578B;&#x7684;&#x8F7B;&#x5FAE;&#x4E0D;&#x540C;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4EA7;&#x751F;&#x4E0D;&#x540C;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x5E94;&#x7528;&#x5230;&#x6211;&#x4EEC;&#x5728;&#x4E0A;&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#x63D0;&#x5230;&#x7684;&#x623F;&#x5730;&#x4EA7;&#x9886;&#x57DF;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x5C31;&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x666E;&#x904D;&#x6807;&#x51C6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x67B6;&#x6784;&#x5417;&#xFF1F;</p>
<p>&#x4E5F;&#x8BB8;&#x5BF9;&#x4E8E;&#x623F;&#x5730;&#x4EA7;&#x548C;&#x5728;&#x7EBF;&#x5E7F;&#x544A;&#x6765;&#x8BF4;&#x53EF;&#x80FD;&#x662F;&#x76F8;&#x5BF9;&#x7684;&#x6807;&#x51C6;&#x4E00;&#x4E9B;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x89C1;&#x5230;&#x7684;&#x3002;&#x5BF9;&#x4E8E;&#x56FE;&#x50CF;&#x5E94;&#x7528;&#xFF0C;&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x5728;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E0A;&#x4F7F;&#x7528;&#x5377;&#x79EF;&#xFF08;<strong>Convolutional Neural Network</strong>&#xFF09;&#xFF0C;&#x901A;&#x5E38;&#x7F29;&#x5199;&#x4E3A;<strong>CNN</strong>&#x3002;&#x5BF9;&#x4E8E;&#x5E8F;&#x5217;&#x6570;&#x636E;&#xFF0C;&#x4F8B;&#x5982;&#x97F3;&#x9891;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x7EC4;&#x4EF6;&#xFF0C;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#xFF0C;&#x97F3;&#x9891;&#x88AB;&#x64AD;&#x653E;&#x51FA;&#x6765;&#xFF0C;&#x6240;&#x4EE5;&#x97F3;&#x9891;&#x662F;&#x6700;&#x81EA;&#x7136;&#x7684;&#x8868;&#x73B0;&#x3002;&#x4F5C;&#x4E3A;&#x4E00;&#x7EF4;&#x65F6;&#x95F4;&#x5E8F;&#x5217;&#xFF08;&#x4E24;&#x79CD;&#x82F1;&#x6587;&#x8BF4;&#x6CD5;<strong>one-dimensional time series / temporal sequence</strong>&#xFF09;.&#x5BF9;&#x4E8E;&#x5E8F;&#x5217;&#x6570;&#x636E;&#xFF0C;&#x7ECF;&#x5E38;&#x4F7F;&#x7528;<strong>RNN</strong>&#xFF0C;&#x4E00;&#x79CD;&#x9012;&#x5F52;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF08;<strong>Recurrent Neural Network</strong>&#xFF09;&#xFF0C;&#x8BED;&#x8A00;&#xFF0C;&#x82F1;&#x8BED;&#x548C;&#x6C49;&#x8BED;&#x5B57;&#x6BCD;&#x8868;&#x6216;&#x5355;&#x8BCD;&#x90FD;&#x662F;&#x9010;&#x4E2A;&#x51FA;&#x73B0;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x8BED;&#x8A00;&#x4E5F;&#x662F;&#x6700;&#x81EA;&#x7136;&#x7684;&#x5E8F;&#x5217;&#x6570;&#x636E;&#xFF0C;&#x56E0;&#x6B64;&#x66F4;&#x590D;&#x6742;&#x7684;<strong>RNNs</strong>&#x7248;&#x672C;&#x7ECF;&#x5E38;&#x7528;&#x4E8E;&#x8FD9;&#x4E9B;&#x5E94;&#x7528;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x66F4;&#x590D;&#x6742;&#x7684;&#x5E94;&#x7528;&#x6BD4;&#x5982;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#xFF0C;&#x4F60;&#x6709;&#x4E00;&#x5F20;&#x56FE;&#x7247;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x663E;&#x793A;&#x66F4;&#x591A;&#x7684;<strong>CNN</strong>&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7ED3;&#x6784;&#xFF0C;&#x5176;&#x4E2D;&#x7684;&#x96F7;&#x8FBE;&#x4FE1;&#x606F;&#x662F;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x7684;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x66F4;&#x5B9A;&#x5236;&#x7684;&#xFF0C;&#x6216;&#x8005;&#x4E00;&#x4E9B;&#x66F4;&#x590D;&#x6742;&#x7684;&#x6DF7;&#x5408;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7ED3;&#x6784;&#x3002;&#x6240;&#x4EE5;&#x4E3A;&#x4E86;&#x66F4;&#x5177;&#x4F53;&#x5730;&#x8BF4;&#x660E;&#x4EC0;&#x4E48;&#x662F;&#x6807;&#x51C6;&#x7684;<strong>CNN</strong>&#x548C;<strong>RNN</strong>&#x7ED3;&#x6784;&#xFF0C;&#x5728;&#x6587;&#x732E;&#x4E2D;&#x4F60;&#x53EF;&#x80FD;&#x89C1;&#x8FC7;&#x8FD9;&#x6837;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x6807;&#x51C6;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;</p>
<p><img src="../images/6cda3361ce142b4347593db842d95ef0.png" alt=""></p>
<p>&#x4F60;&#x4E5F;&#x53EF;&#x80FD;&#x89C1;&#x8FC7;&#x8FD9;&#x6837;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x4F8B;&#x5B50;&#x3002;</p>
<p><img src="../images/1bebe0ac41715ef8132f2d802968495c.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x4F1A;&#x5728;&#x540E;&#x9762;&#x7684;&#x8BFE;&#x7A0B;&#x4E86;&#x89E3;&#x8FD9;&#x5E45;&#x56FE;&#x7684;&#x539F;&#x7406;&#x548C;&#x5B9E;&#x73B0;&#xFF0C;&#x5377;&#x79EF;&#x7F51;&#x7EDC;(<strong>CNN</strong>)&#x901A;&#x5E38;&#x7528;&#x4E8E;&#x56FE;&#x50CF;&#x6570;&#x636E;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x80FD;&#x4E5F;&#x4F1A;&#x770B;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x800C;&#x4E14;&#x4F60;&#x5C06;&#x5728;&#x4EE5;&#x540E;&#x7684;&#x8BFE;&#x7A0B;&#x4E2D;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x5B83;&#x3002;</p>
<p><img src="../images/4656617e30e7ad44490fe605b2e49e56.png" alt=""></p>
<p>&#x9012;&#x5F52;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;(<strong>RNN</strong>)&#x975E;&#x5E38;&#x9002;&#x5408;&#x8FD9;&#x79CD;&#x4E00;&#x7EF4;&#x5E8F;&#x5217;&#xFF0C;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x80FD;&#x4E5F;&#x542C;&#x8BF4;&#x8FC7;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5BF9;&#x4E8E;&#x7ED3;&#x6784;&#x5316;&#x6570;&#x636E;&#x548C;&#x975E;&#x7ED3;&#x6784;&#x5316;&#x6570;&#x636E;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x7ED3;&#x6784;&#x5316;&#x6570;&#x636E;&#x610F;&#x5473;&#x7740;&#x6570;&#x636E;&#x7684;&#x57FA;&#x672C;&#x6570;&#x636E;&#x5E93;&#x3002;&#x4F8B;&#x5982;&#x5728;&#x623F;&#x4EF7;&#x9884;&#x6D4B;&#x4E2D;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x6709;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x6709;&#x4E13;&#x95E8;&#x7684;&#x51E0;&#x5217;&#x6570;&#x636E;&#x544A;&#x8BC9;&#x4F60;&#x5367;&#x5BA4;&#x7684;&#x5927;&#x5C0F;&#x548C;&#x6570;&#x91CF;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x7ED3;&#x6784;&#x5316;&#x6570;&#x636E;&#x3002;&#x6216;&#x9884;&#x6D4B;&#x7528;&#x6237;&#x662F;&#x5426;&#x4F1A;&#x70B9;&#x51FB;&#x5E7F;&#x544A;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x5F97;&#x5230;&#x5173;&#x4E8E;&#x7528;&#x6237;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x6BD4;&#x5982;&#x5E74;&#x9F84;&#x4EE5;&#x53CA;&#x5173;&#x4E8E;&#x5E7F;&#x544A;&#x7684;&#x4E00;&#x4E9B;&#x4FE1;&#x606F;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x4F60;&#x7684;&#x9884;&#x6D4B;&#x5206;&#x7C7B;&#x6807;&#x6CE8;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x7ED3;&#x6784;&#x5316;&#x6570;&#x636E;&#xFF0C;&#x610F;&#x601D;&#x662F;&#x6BCF;&#x4E2A;&#x7279;&#x5F81;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x623F;&#x5C4B;&#x5927;&#x5C0F;&#x5367;&#x5BA4;&#x6570;&#x91CF;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x7684;&#x5E74;&#x9F84;&#xFF0C;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x5B9A;&#x4E49;&#x3002;</p>
<p>&#x76F8;&#x53CD;&#x975E;&#x7ED3;&#x6784;&#x5316;&#x6570;&#x636E;&#x662F;&#x6307;&#x6BD4;&#x5982;&#x97F3;&#x9891;&#xFF0C;&#x539F;&#x59CB;&#x97F3;&#x9891;&#x6216;&#x8005;&#x4F60;&#x60F3;&#x8981;&#x8BC6;&#x522B;&#x7684;&#x56FE;&#x50CF;&#x6216;&#x6587;&#x672C;&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x7279;&#x5F81;&#x53EF;&#x80FD;&#x662F;&#x56FE;&#x50CF;&#x4E2D;&#x7684;&#x50CF;&#x7D20;&#x503C;&#x6216;&#x6587;&#x672C;&#x4E2D;&#x7684;&#x5355;&#x4E2A;&#x5355;&#x8BCD;&#x3002;</p>
<p><img src="../images/86a39d40cb13842cd6c06463cd9b4a83.png" alt=""></p>
<p>&#x4ECE;&#x5386;&#x53F2;&#x7ECF;&#x9A8C;&#x4E0A;&#x770B;&#xFF0C;&#x5904;&#x7406;&#x975E;&#x7ED3;&#x6784;&#x5316;&#x6570;&#x636E;&#x662F;&#x5F88;&#x96BE;&#x7684;&#xFF0C;&#x4E0E;&#x7ED3;&#x6784;&#x5316;&#x6570;&#x636E;&#x6BD4;&#x8F83;&#xFF0C;&#x8BA9;&#x8BA1;&#x7B97;&#x673A;&#x7406;&#x89E3;&#x975E;&#x7ED3;&#x6784;&#x5316;&#x6570;&#x636E;&#x5F88;&#x96BE;&#xFF0C;&#x800C;&#x4EBA;&#x7C7B;&#x8FDB;&#x5316;&#x5F97;&#x975E;&#x5E38;&#x5584;&#x4E8E;&#x7406;&#x89E3;&#x97F3;&#x9891;&#x4FE1;&#x53F7;&#x548C;&#x56FE;&#x50CF;&#xFF0C;&#x6587;&#x672C;&#x662F;&#x4E00;&#x4E2A;&#x66F4;&#x8FD1;&#x4EE3;&#x7684;&#x53D1;&#x660E;&#xFF0C;&#x4F46;&#x662F;&#x4EBA;&#x4EEC;&#x771F;&#x7684;&#x5F88;&#x64C5;&#x957F;&#x89E3;&#x8BFB;&#x975E;&#x7ED3;&#x6784;&#x5316;&#x6570;&#x636E;&#x3002;</p>
<p>&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x5174;&#x8D77;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x6700;&#x4EE4;&#x4EBA;&#x5174;&#x594B;&#x7684;&#x4E8B;&#x60C5;&#x4E4B;&#x4E00;&#xFF0C;&#x591A;&#x4E8F;&#x4E86;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x548C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x73B0;&#x5728;&#x80FD;&#x66F4;&#x597D;&#x5730;&#x89E3;&#x91CA;&#x975E;&#x7ED3;&#x6784;&#x5316;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x662F;&#x4E0E;&#x51E0;&#x5E74;&#x524D;&#x76F8;&#x6BD4;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x8FD9;&#x4E3A;&#x6211;&#x4EEC;&#x521B;&#x9020;&#x4E86;&#x673A;&#x4F1A;&#x3002;&#x8BB8;&#x591A;&#x65B0;&#x7684;&#x4EE4;&#x4EBA;&#x5174;&#x594B;&#x7684;&#x5E94;&#x7528;&#x88AB;&#x4F7F;&#x7528;&#xFF0C;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#x3001;&#x56FE;&#x50CF;&#x8BC6;&#x522B;&#x3001;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x6587;&#x5B57;&#x5904;&#x7406;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x80FD;&#x6BD4;&#x4E24;&#x4E09;&#x5E74;&#x524D;&#x7684;&#x8FD8;&#x8981;&#x591A;&#x3002;&#x56E0;&#x4E3A;&#x4EBA;&#x4EEC;&#x5929;&#x751F;&#x5C31;&#x6709;&#x672C;&#x9886;&#x53BB;&#x7406;&#x89E3;&#x975E;&#x7ED3;&#x6784;&#x5316;&#x6570;&#x636E;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x542C;&#x8BF4;&#x4E86;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x66F4;&#x591A;&#x5728;&#x5A92;&#x4F53;&#x975E;&#x7ED3;&#x6784;&#x5316;&#x6570;&#x636E;&#x7684;&#x6210;&#x529F;&#xFF0C;&#x5F53;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8BC6;&#x522B;&#x4E86;&#x4E00;&#x53EA;&#x732B;&#x65F6;&#x90A3;&#x771F;&#x7684;&#x5F88;&#x9177;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x77E5;&#x9053;&#x90A3;&#x610F;&#x5473;&#x7740;&#x4EC0;&#x4E48;&#x3002;</p>
<p>&#x4F46;&#x7ED3;&#x679C;&#x4E5F;&#x8868;&#x660E;&#xFF0C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5728;&#x8BB8;&#x591A;&#x77ED;&#x671F;&#x7ECF;&#x6D4E;&#x4EF7;&#x503C;&#x7684;&#x521B;&#x9020;&#xFF0C;&#x4E5F;&#x662F;&#x57FA;&#x4E8E;&#x7ED3;&#x6784;&#x5316;&#x6570;&#x636E;&#x7684;&#x3002;&#x6BD4;&#x5982;&#x66F4;&#x597D;&#x7684;&#x5E7F;&#x544A;&#x7CFB;&#x7EDF;&#x3001;&#x66F4;&#x597D;&#x7684;&#x5229;&#x6DA6;&#x5EFA;&#x8BAE;&#xFF0C;&#x8FD8;&#x6709;&#x66F4;&#x597D;&#x7684;&#x5904;&#x7406;&#x5927;&#x6570;&#x636E;&#x7684;&#x80FD;&#x529B;&#x3002;&#x8BB8;&#x591A;&#x516C;&#x53F8;&#x4E0D;&#x5F97;&#x4E0D;&#x6839;&#x636E;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x505A;&#x51FA;&#x51C6;&#x786E;&#x7684;&#x9884;&#x6D4B;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#x5728;&#x8FD9;&#x95E8;&#x8BFE;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8981;&#x8BA8;&#x8BBA;&#x7684;&#x8BB8;&#x591A;&#x6280;&#x672F;&#x90FD;&#x5C06;&#x9002;&#x7528;&#xFF0C;&#x4E0D;&#x8BBA;&#x662F;&#x5BF9;&#x7ED3;&#x6784;&#x5316;&#x6570;&#x636E;&#x8FD8;&#x662F;&#x975E;&#x7ED3;&#x6784;&#x5316;&#x6570;&#x636E;&#x3002;&#x4E3A;&#x4E86;&#x89E3;&#x91CA;&#x7B97;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x4F7F;&#x7528;&#x975E;&#x7ED3;&#x6784;&#x5316;&#x6570;&#x636E;&#x7684;&#x793A;&#x4F8B;&#x4E2D;&#x591A;&#x753B;&#x4E00;&#x70B9;&#x56FE;&#x7247;&#xFF0C;&#x4F46;&#x6B63;&#x5982;&#x4F60;&#x6240;&#x60F3;&#x7684;&#xFF0C;&#x4F60;&#x81EA;&#x5DF1;&#x56E2;&#x961F;&#x91CC;&#x901A;&#x8FC7;&#x8FD0;&#x7528;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x6211;&#x5E0C;&#x671B;&#x4F60;&#x80FD;&#x53D1;&#x73B0;&#xFF0C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7B97;&#x6CD5;&#x5BF9;&#x4E8E;&#x7ED3;&#x6784;&#x5316;&#x548C;&#x975E;&#x7ED3;&#x6784;&#x5316;&#x6570;&#x636E;&#x90FD;&#x6709;&#x7528;&#x5904;&#x3002;</p>
<p>&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5DF2;&#x7ECF;&#x6539;&#x53D8;&#x4E86;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#xFF0C;&#x6B63;&#x521B;&#x9020;&#x7740;&#x5DE8;&#x5927;&#x7684;&#x7ECF;&#x6D4E;&#x4EF7;&#x503C;&#xFF0C;&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#xFF0C;&#x57FA;&#x672C;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x80CC;&#x540E;&#x7684;&#x6280;&#x672F;&#x7406;&#x5FF5;&#x5927;&#x90E8;&#x5206;&#x90FD;&#x79BB;&#x6211;&#x4EEC;&#x4E0D;&#x9065;&#x8FDC;&#xFF0C;&#x6709;&#x7684;&#x662F;&#x51E0;&#x5341;&#x5E74;&#xFF0C;&#x90A3;&#x4E48;&#x4E3A;&#x4EC0;&#x4E48;&#x4ED6;&#x4EEC;&#x73B0;&#x5728;&#x624D;&#x521A;&#x521A;&#x8D77;&#x6B65;&#xFF0C;&#x6548;&#x679C;&#x90A3;&#x4E48;&#x597D;&#xFF0C;&#x4E0B;&#x4E00;&#x96C6;&#x89C6;&#x9891;&#x4E2D;&#x6211;&#x4EEC;&#x5C06;&#x8BA8;&#x8BBA;&#x4E3A;&#x4EC0;&#x4E48;&#x6700;&#x8FD1;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5DF2;&#x7ECF;&#x6210;&#x4E3A;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7684;&#x5F3A;&#x5927;&#x5DE5;&#x5177;&#x3002;</p>
<h3 id="14-&#x4E3A;&#x4EC0;&#x4E48;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x4F1A;&#x5174;&#x8D77;&#xFF1F;why-is-deep-learning-taking-off">1.4 &#x4E3A;&#x4EC0;&#x4E48;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x4F1A;&#x5174;&#x8D77;&#xFF1F;(Why is Deep Learning taking off?)</h3>
<p>&#x672C;&#x8282;&#x89C6;&#x9891;&#x4E3B;&#x8981;&#x8BB2;&#x4E86;&#x63A8;&#x52A8;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x53D8;&#x5F97;&#x5982;&#x6B64;&#x70ED;&#x95E8;&#x7684;&#x4E3B;&#x8981;&#x56E0;&#x7D20;&#x3002;&#x5305;&#x62EC;&#x6570;&#x636E;&#x89C4;&#x6A21;&#x3001;&#x8BA1;&#x7B97;&#x91CF;&#x53CA;&#x7B97;&#x6CD5;&#x7684;&#x521B;&#x65B0;&#x3002;</p>
<p>&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x548C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E4B;&#x524D;&#x7684;&#x57FA;&#x7840;&#x6280;&#x672F;&#x7406;&#x5FF5;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x5927;&#x6982;&#x51E0;&#x5341;&#x5E74;&#x4E86;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x5B83;&#x4EEC;&#x73B0;&#x5728;&#x624D;&#x7A81;&#x7136;&#x6D41;&#x884C;&#x8D77;&#x6765;&#x5462;&#xFF1F;&#x672C;&#x8282;&#x8BFE;&#x7A0B;&#x4E3B;&#x8981;&#x8BB2;&#x8FF0;&#x4E00;&#x4E9B;&#x4F7F;&#x5F97;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x53D8;&#x5F97;&#x5982;&#x6B64;&#x70ED;&#x95E8;&#x7684;&#x4E3B;&#x8981;&#x9A71;&#x52A8;&#x56E0;&#x7D20;&#xFF0C;&#x8FD9;&#x5C06;&#x4F1A;&#x5E2E;&#x52A9;&#x4F60;&#x5728;&#x4F60;&#x7684;&#x7EC4;&#x7EC7;&#x673A;&#x6784;&#x5185;&#x53D1;&#x73B0;&#x6700;&#x597D;&#x7684;&#x65F6;&#x673A;&#x6765;&#x5E94;&#x7528;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x3002;</p>
<p>&#x5728;&#x8FC7;&#x53BB;&#x7684;&#x51E0;&#x5E74;&#x91CC;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x95EE;&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x80FD;&#x591F;&#x5982;&#x6B64;&#x6709;&#x6548;&#x3002;&#x5F53;&#x6211;&#x56DE;&#x7B54;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x6211;&#x901A;&#x5E38;&#x7ED9;&#x4ED6;&#x4EEC;&#x753B;&#x4E2A;&#x56FE;&#xFF0C;&#x5728;&#x6C34;&#x5E73;&#x8F74;&#x4E0A;&#x753B;&#x4E00;&#x4E2A;&#x5F62;&#x72B6;&#xFF0C;&#x5728;&#x6B64;&#x7ED8;&#x5236;&#x51FA;&#x6240;&#x6709;&#x4EFB;&#x52A1;&#x7684;&#x6570;&#x636E;&#x91CF;&#xFF0C;&#x800C;&#x5728;&#x5782;&#x76F4;&#x8F74;&#x4E0A;&#xFF0C;&#x753B;&#x51FA;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x7684;&#x6027;&#x80FD;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#x51C6;&#x786E;&#x7387;&#x4F53;&#x73B0;&#x5728;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x8FC7;&#x6EE4;&#x6216;&#x8005;&#x5E7F;&#x544A;&#x70B9;&#x51FB;&#x9884;&#x6D4B;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5728;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x6C7D;&#x8F66;&#x65F6;&#x5224;&#x65AD;&#x4F4D;&#x7F6E;&#x7684;&#x51C6;&#x786E;&#x6027;&#xFF0C;&#x6839;&#x636E;&#x56FE;&#x50CF;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x628A;&#x4E00;&#x4E2A;&#x4F20;&#x7EDF;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x7684;&#x6027;&#x80FD;&#x753B;&#x51FA;&#x6765;&#xFF0C;&#x4F5C;&#x4E3A;&#x6570;&#x636E;&#x91CF;&#x7684;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x5F2F;&#x66F2;&#x7684;&#x7EBF;&#xFF0C;&#x5C31;&#x50CF;&#x56FE;&#x4E2D;&#x8FD9;&#x6837;&#xFF0C;&#x5B83;&#x7684;&#x6027;&#x80FD;&#x4E00;&#x5F00;&#x59CB;&#x5728;&#x589E;&#x52A0;&#x66F4;&#x591A;&#x6570;&#x636E;&#x65F6;&#x4F1A;&#x4E0A;&#x5347;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x6BB5;&#x53D8;&#x5316;&#x540E;&#x5B83;&#x7684;&#x6027;&#x80FD;&#x5C31;&#x4F1A;&#x50CF;&#x4E00;&#x4E2A;&#x9AD8;&#x539F;&#x4E00;&#x6837;&#x3002;&#x5047;&#x8BBE;&#x4F60;&#x7684;&#x6C34;&#x5E73;&#x8F74;&#x62C9;&#x7684;&#x5F88;&#x957F;&#x5F88;&#x957F;&#xFF0C;&#x5B83;&#x4EEC;&#x4E0D;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x5904;&#x7406;&#x89C4;&#x6A21;&#x5DE8;&#x5927;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x800C;&#x8FC7;&#x53BB;&#x5341;&#x5E74;&#x7684;&#x793E;&#x4F1A;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x9047;&#x5230;&#x7684;&#x5F88;&#x591A;&#x95EE;&#x9898;&#x53EA;&#x6709;&#x76F8;&#x5BF9;&#x8F83;&#x5C11;&#x7684;&#x6570;&#x636E;&#x91CF;&#x3002;</p>
<p><img src="../images/7a9a642c6c709d19eb0dd2b241f1ebaf.png" alt=""></p>
<p>&#x591A;&#x4E8F;&#x6570;&#x5B57;&#x5316;&#x793E;&#x4F1A;&#x7684;&#x6765;&#x4E34;&#xFF0C;&#x73B0;&#x5728;&#x7684;&#x6570;&#x636E;&#x91CF;&#x90FD;&#x975E;&#x5E38;&#x5DE8;&#x5927;&#xFF0C;&#x6211;&#x4EEC;&#x82B1;&#x4E86;&#x5F88;&#x591A;&#x65F6;&#x95F4;&#x6D3B;&#x52A8;&#x5728;&#x8FD9;&#x4E9B;&#x6570;&#x5B57;&#x7684;&#x9886;&#x57DF;&#xFF0C;&#x6BD4;&#x5982;&#x5728;&#x7535;&#x8111;&#x7F51;&#x7AD9;&#x4E0A;&#x3001;&#x5728;&#x624B;&#x673A;&#x8F6F;&#x4EF6;&#x4E0A;&#x4EE5;&#x53CA;&#x5176;&#x5B83;&#x6570;&#x5B57;&#x5316;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x80FD;&#x521B;&#x5EFA;&#x6570;&#x636E;&#xFF0C;&#x540C;&#x65F6;&#x4FBF;&#x5B9C;&#x7684;&#x76F8;&#x673A;&#x88AB;&#x914D;&#x7F6E;&#x5230;&#x79FB;&#x52A8;&#x7535;&#x8BDD;&#xFF0C;&#x8FD8;&#x6709;&#x52A0;&#x901F;&#x4EEA;&#x53CA;&#x5404;&#x7C7B;&#x5404;&#x6837;&#x7684;&#x4F20;&#x611F;&#x5668;&#xFF0C;&#x540C;&#x65F6;&#x5728;&#x7269;&#x8054;&#x7F51;&#x9886;&#x57DF;&#x6211;&#x4EEC;&#x4E5F;&#x6536;&#x96C6;&#x5230;&#x4E86;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x6570;&#x636E;&#x3002;&#x4EC5;&#x4EC5;&#x5728;&#x8FC7;&#x53BB;&#x7684;20&#x5E74;&#x91CC;&#x5BF9;&#x4E8E;&#x5F88;&#x591A;&#x5E94;&#x7528;&#xFF0C;&#x6211;&#x4EEC;&#x4FBF;&#x6536;&#x96C6;&#x5230;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8FDC;&#x8D85;&#x8FC7;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x80FD;&#x591F;&#x9AD8;&#x6548;&#x53D1;&#x6325;&#x5B83;&#x4EEC;&#x4F18;&#x52BF;&#x7684;&#x89C4;&#x6A21;&#x3002;</p>
<p>&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5C55;&#x73B0;&#x51FA;&#x7684;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x5C0F;&#x578B;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x6027;&#x80FD;&#x53EF;&#x80FD;&#x4F1A;&#x50CF;&#x4E0B;&#x56FE;&#x9EC4;&#x8272;&#x66F2;&#x7EBF;&#x8868;&#x793A;&#x90A3;&#x6837;&#xFF1B;&#x5982;&#x679C;&#x4F60;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x7A0D;&#x5FAE;&#x5927;&#x4E00;&#x70B9;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x4E00;&#x4E2A;&#x4E2D;&#x7B49;&#x89C4;&#x6A21;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF08;&#x4E0B;&#x56FE;&#x84DD;&#x8272;&#x66F2;&#x7EBF;&#xFF09;&#xFF0C;&#x5B83;&#x5728;&#x67D0;&#x4E9B;&#x6570;&#x636E;&#x4E0A;&#x9762;&#x7684;&#x6027;&#x80FD;&#x4E5F;&#x4F1A;&#x66F4;&#x597D;&#x4E00;&#x4E9B;&#xFF1B;&#x5982;&#x679C;&#x4F60;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x5927;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x5B83;&#x5C31;&#x4F1A;&#x53D8;&#x6210;&#x4E0B;&#x56FE;&#x7EFF;&#x8272;&#x66F2;&#x7EBF;&#x90A3;&#x6837;&#xFF0C;&#x5E76;&#x4E14;&#x4FDD;&#x6301;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x597D;&#x3002;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x6CE8;&#x610F;&#x5230;&#x4E24;&#x70B9;&#xFF1A;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8981;&#x83B7;&#x5F97;&#x8F83;&#x9AD8;&#x7684;&#x6027;&#x80FD;&#x4F53;&#x73B0;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x6709;&#x4E24;&#x4E2A;&#x6761;&#x4EF6;&#x8981;&#x5B8C;&#x6210;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x662F;&#x4F60;&#x9700;&#x8981;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x89C4;&#x6A21;&#x8DB3;&#x591F;&#x5927;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x4EE5;&#x53D1;&#x6325;&#x6570;&#x636E;&#x89C4;&#x6A21;&#x91CF;&#x5DE8;&#x5927;&#x7684;&#x4F18;&#x70B9;&#xFF0C;&#x53E6;&#x5916;&#x4F60;&#x9700;&#x8981;&#x80FD;&#x753B;&#x5230;$x$&#x8F74;&#x7684;&#x8FD9;&#x4E2A;&#x4F4D;&#x7F6E;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x9700;&#x8981;&#x5F88;&#x591A;&#x7684;&#x6570;&#x636E;&#x3002;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x8BF4;&#x89C4;&#x6A21;&#x4E00;&#x76F4;&#x5728;&#x63A8;&#x52A8;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x8FDB;&#x6B65;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x89C4;&#x6A21;&#x6307;&#x7684;&#x4E5F;&#x540C;&#x65F6;&#x662F;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x89C4;&#x6A21;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x5E26;&#x6709;&#x8BB8;&#x591A;&#x9690;&#x85CF;&#x5355;&#x5143;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x4E5F;&#x6709;&#x8BB8;&#x591A;&#x7684;&#x53C2;&#x6570;&#x53CA;&#x5173;&#x8054;&#x6027;&#xFF0C;&#x5C31;&#x5982;&#x540C;&#x9700;&#x8981;&#x5927;&#x89C4;&#x6A21;&#x7684;&#x6570;&#x636E;&#x4E00;&#x6837;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#x5982;&#x4ECA;&#x6700;&#x53EF;&#x9760;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x5728;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E0A;&#x83B7;&#x5F97;&#x66F4;&#x597D;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x5F80;&#x5F80;&#x5C31;&#x662F;<strong>&#x8981;&#x4E48;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x8981;&#x4E48;&#x6295;&#x5165;&#x66F4;&#x591A;&#x7684;&#x6570;&#x636E;</strong>&#xFF0C;&#x8FD9;&#x53EA;&#x80FD;&#x5728;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x8D77;&#x4F5C;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x6700;&#x7EC8;&#x4F60;&#x8017;&#x5C3D;&#x4E86;&#x6570;&#x636E;&#xFF0C;&#x6216;&#x8005;&#x6700;&#x7EC8;&#x4F60;&#x7684;&#x7F51;&#x7EDC;&#x662F;&#x5982;&#x6B64;&#x5927;&#x89C4;&#x6A21;&#x5BFC;&#x81F4;&#x5C06;&#x8981;&#x7528;&#x592A;&#x4E45;&#x7684;&#x65F6;&#x95F4;&#x53BB;&#x8BAD;&#x7EC3;&#xFF0C;&#x4F46;&#x662F;&#x4EC5;&#x4EC5;&#x63D0;&#x5347;&#x89C4;&#x6A21;&#x7684;&#x7684;&#x786E;&#x786E;&#x5730;&#x8BA9;&#x6211;&#x4EEC;&#x5728;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x4E16;&#x754C;&#x4E2D;&#x6478;&#x7D22;&#x4E86;&#x5F88;&#x591A;&#x65F6;&#x95F4;&#x3002;&#x4E3A;&#x4E86;&#x4F7F;&#x8FD9;&#x4E2A;&#x56FE;&#x66F4;&#x52A0;&#x4ECE;&#x6280;&#x672F;&#x4E0A;&#x8BB2;&#x66F4;&#x7CBE;&#x786E;&#x4E00;&#x70B9;&#xFF0C;&#x6211;&#x5728;$x$&#x8F74;&#x4E0B;&#x9762;&#x5DF2;&#x7ECF;&#x5199;&#x660E;&#x7684;&#x6570;&#x636E;&#x91CF;&#xFF0C;&#x8FD9;&#x513F;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&#x6807;&#x7B7E;&#xFF08;label&#xFF09;&#x91CF;&#xFF0C;&#x901A;&#x8FC7;&#x6DFB;&#x52A0;&#x8FD9;&#x4E2A;&#x6807;&#x7B7E;&#x91CF;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6307;&#x5728;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x540C;&#x65F6;&#x8F93;&#x5165;$x$&#x548C;&#x6807;&#x7B7E;$y$&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x5F15;&#x5165;&#x4E00;&#x70B9;&#x7B26;&#x53F7;&#xFF0C;&#x4F7F;&#x7528;&#x5C0F;&#x5199;&#x7684;&#x5B57;&#x6BCD;$m$&#x8868;&#x793A;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x89C4;&#x6A21;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x8FD9;&#x4E2A;&#x5C0F;&#x5199;&#x5B57;&#x6BCD;$m$&#x5C31;&#x6A2A;&#x8F74;&#x7ED3;&#x5408;&#x5176;&#x4ED6;&#x4E00;&#x4E9B;&#x7EC6;&#x8282;&#x5230;&#x8FD9;&#x4E2A;&#x56FE;&#x50CF;&#x4E2D;&#x3002;</p>
<p><img src="../images/2b14edfcb21235115fca05879f8d9de2.png" alt=""></p>
<p>&#x5728;&#x8FD9;&#x4E2A;&#x5C0F;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#xFF0C;&#x5404;&#x79CD;&#x7B97;&#x6CD5;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x4E8B;&#x5B9E;&#x4E0A;&#x5B9A;&#x4E49;&#x7684;&#x4E5F;&#x4E0D;&#x662F;&#x5F88;&#x660E;&#x786E;&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x4F60;&#x6CA1;&#x6709;&#x5927;&#x91CF;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x90A3;&#x6548;&#x679C;&#x4F1A;&#x53D6;&#x51B3;&#x4E8E;&#x4F60;&#x7684;&#x7279;&#x5F81;&#x5DE5;&#x7A0B;&#x80FD;&#x529B;&#xFF0C;&#x90A3;&#x5C06;&#x51B3;&#x5B9A;&#x6700;&#x7EC8;&#x7684;&#x6027;&#x80FD;&#x3002;&#x5047;&#x8BBE;&#x6709;&#x4E9B;&#x4EBA;&#x8BAD;&#x7EC3;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;<strong>SVM</strong>&#xFF08;&#x652F;&#x6301;&#x5411;&#x91CF;&#x673A;&#xFF09;&#x8868;&#x73B0;&#x7684;&#x66F4;&#x63A5;&#x8FD1;&#x6B63;&#x786E;&#x7279;&#x5F81;&#xFF0C;&#x7136;&#x800C;&#x6709;&#x4E9B;&#x4EBA;&#x8BAD;&#x7EC3;&#x7684;&#x89C4;&#x6A21;&#x5927;&#x4E00;&#x4E9B;&#xFF0C;&#x53EF;&#x80FD;&#x5728;&#x8FD9;&#x4E2A;&#x5C0F;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;<strong>SVM</strong>&#x7B97;&#x6CD5;&#x53EF;&#x4EE5;&#x505A;&#x7684;&#x66F4;&#x597D;&#x3002;&#x56E0;&#x6B64;&#x4F60;&#x77E5;&#x9053;&#x5728;&#x8FD9;&#x4E2A;&#x56FE;&#x5F62;&#x533A;&#x57DF;&#x7684;&#x5DE6;&#x8FB9;&#xFF0C;&#x5404;&#x79CD;&#x7B97;&#x6CD5;&#x4E4B;&#x95F4;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x5E76;&#x4E0D;&#x662F;&#x5B9A;&#x4E49;&#x7684;&#x5F88;&#x660E;&#x786E;&#xFF0C;&#x6700;&#x7EC8;&#x7684;&#x6027;&#x80FD;&#x66F4;&#x591A;&#x7684;&#x662F;&#x53D6;&#x51B3;&#x4E8E;&#x4F60;&#x5728;&#x7528;&#x5DE5;&#x7A0B;&#x9009;&#x62E9;&#x7279;&#x5F81;&#x65B9;&#x9762;&#x7684;&#x80FD;&#x529B;&#x4EE5;&#x53CA;&#x7B97;&#x6CD5;&#x5904;&#x7406;&#x65B9;&#x9762;&#x7684;&#x4E00;&#x4E9B;&#x7EC6;&#x8282;&#xFF0C;&#x53EA;&#x662F;&#x5728;&#x67D0;&#x4E9B;&#x5927;&#x6570;&#x636E;&#x89C4;&#x6A21;&#x975E;&#x5E38;&#x5E9E;&#x5927;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5728;&#x53F3;&#x8FB9;&#x8FD9;&#x4E2A;$m$&#x4F1A;&#x975E;&#x5E38;&#x7684;&#x5927;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x80FD;&#x66F4;&#x52A0;&#x6301;&#x7EED;&#x5730;&#x770B;&#x5230;&#x66F4;&#x5927;&#x7684;&#x7531;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x63A7;&#x5236;&#x7684;&#x5176;&#x5B83;&#x65B9;&#x6CD5;&#xFF0C;&#x56E0;&#x6B64;&#x5982;&#x679C;&#x4F60;&#x7684;&#x4EFB;&#x4F55;&#x67D0;&#x4E2A;&#x670B;&#x53CB;&#x95EE;&#x4F60;&#x4E3A;&#x4EC0;&#x4E48;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8FD9;&#x4E48;&#x6D41;&#x884C;&#xFF0C;&#x6211;&#x4F1A;&#x9F13;&#x52B1;&#x4F60;&#x4E5F;&#x66FF;&#x4ED6;&#x4EEC;&#x753B;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x56FE;&#x5F62;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x8FD9;&#x4E48;&#x8BF4;&#xFF0C;&#x5728;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x840C;&#x82BD;&#x7684;&#x521D;&#x671F;&#xFF0C;&#x6570;&#x636E;&#x7684;&#x89C4;&#x6A21;&#x4EE5;&#x53CA;&#x8BA1;&#x7B97;&#x91CF;&#xFF0C;&#x5C40;&#x9650;&#x5728;&#x6211;&#x4EEC;&#x5BF9;&#x4E8E;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x7279;&#x522B;&#x5927;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x5728;CPU&#x8FD8;&#x662F;GPU&#x4E0A;&#x9762;&#xFF0C;&#x90A3;&#x90FD;&#x4F7F;&#x5F97;&#x6211;&#x4EEC;&#x53D6;&#x5F97;&#x4E86;&#x5DE8;&#x5927;&#x7684;&#x8FDB;&#x6B65;&#x3002;&#x4F46;&#x662F;&#x6E10;&#x6E10;&#x5730;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5728;&#x6700;&#x8FD1;&#x8FD9;&#x51E0;&#x5E74;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x89C1;&#x8BC1;&#x4E86;&#x7B97;&#x6CD5;&#x65B9;&#x9762;&#x7684;&#x6781;&#x5927;&#x521B;&#x65B0;&#x3002;&#x8BB8;&#x591A;&#x7B97;&#x6CD5;&#x65B9;&#x9762;&#x7684;&#x521B;&#x65B0;&#xFF0C;&#x4E00;&#x76F4;&#x662F;&#x5728;&#x5C1D;&#x8BD5;&#x7740;&#x4F7F;&#x5F97;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8FD0;&#x884C;&#x7684;&#x66F4;&#x5FEB;&#x3002;</p>
<p>&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x65B9;&#x9762;&#x7684;&#x4E00;&#x4E2A;&#x5DE8;&#x5927;&#x7A81;&#x7834;&#x662F;&#x4ECE;<strong>sigmoid</strong>&#x51FD;&#x6570;&#x8F6C;&#x6362;&#x5230;&#x4E00;&#x4E2A;<strong>ReLU</strong>&#x51FD;&#x6570;&#xFF0C;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x6211;&#x4EEC;&#x5728;&#x4E4B;&#x524D;&#x7684;&#x8BFE;&#x7A0B;&#x91CC;&#x63D0;&#x5230;&#x8FC7;&#x3002;</p>
<p><img src="../images/1a3d288dc243ca9c5a70a69799180c4a.png" alt=""></p>
<p>&#x5982;&#x679C;&#x4F60;&#x65E0;&#x6CD5;&#x7406;&#x89E3;&#x521A;&#x624D;&#x6211;&#x8BF4;&#x7684;&#x67D0;&#x4E2A;&#x7EC6;&#x8282;&#xFF0C;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x62C5;&#x5FC3;&#xFF0C;&#x53EF;&#x4EE5;&#x77E5;&#x9053;&#x7684;&#x4E00;&#x4E2A;&#x4F7F;&#x7528;<strong>sigmoid</strong>&#x51FD;&#x6570;&#x548C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x533A;&#x57DF;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;<strong>sigmoid</strong>&#x51FD;&#x6570;&#x7684;&#x68AF;&#x5EA6;&#x4F1A;&#x63A5;&#x8FD1;&#x96F6;&#xFF0C;&#x6240;&#x4EE5;&#x5B66;&#x4E60;&#x7684;&#x901F;&#x5EA6;&#x4F1A;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x7F13;&#x6162;&#xFF0C;&#x56E0;&#x4E3A;&#x5F53;&#x4F60;&#x5B9E;&#x73B0;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x4EE5;&#x53CA;&#x68AF;&#x5EA6;&#x63A5;&#x8FD1;&#x96F6;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53C2;&#x6570;&#x4F1A;&#x66F4;&#x65B0;&#x7684;&#x5F88;&#x6162;&#xFF0C;&#x6240;&#x4EE5;&#x5B66;&#x4E60;&#x7684;&#x901F;&#x7387;&#x4E5F;&#x4F1A;&#x53D8;&#x7684;&#x5F88;&#x6162;&#xFF0C;&#x800C;&#x901A;&#x8FC7;&#x6539;&#x53D8;&#x8FD9;&#x4E2A;&#x88AB;&#x53EB;&#x505A;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6362;&#x7528;&#x8FD9;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x53EB;&#x505A;<strong>ReLU</strong>&#x7684;&#x51FD;&#x6570;&#xFF08;&#x4FEE;&#x6B63;&#x7EBF;&#x6027;&#x5355;&#x5143;&#xFF09;&#xFF0C;<strong>ReLU</strong>&#x5B83;&#x7684;&#x68AF;&#x5EA6;&#x5BF9;&#x4E8E;&#x6240;&#x6709;&#x8F93;&#x5165;&#x7684;&#x8D1F;&#x503C;&#x90FD;&#x662F;&#x96F6;&#xFF0C;&#x56E0;&#x6B64;&#x68AF;&#x5EA6;&#x66F4;&#x52A0;&#x4E0D;&#x4F1A;&#x8D8B;&#x5411;&#x9010;&#x6E10;&#x51CF;&#x5C11;&#x5230;&#x96F6;&#x3002;&#x800C;&#x8FD9;&#x91CC;&#x7684;&#x68AF;&#x5EA6;&#xFF0C;&#x8FD9;&#x6761;&#x7EBF;&#x7684;&#x659C;&#x7387;&#x5728;&#x8FD9;&#x5DE6;&#x8FB9;&#x662F;&#x96F6;&#xFF0C;&#x4EC5;&#x4EC5;&#x901A;&#x8FC7;&#x5C06;<strong>Sigmod</strong>&#x51FD;&#x6570;&#x8F6C;&#x6362;&#x6210;<strong>ReLU</strong>&#x51FD;&#x6570;&#xFF0C;&#x4FBF;&#x80FD;&#x591F;&#x4F7F;&#x5F97;&#x4E00;&#x4E2A;&#x53EB;&#x505A;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#xFF08;<strong>gradient descent</strong>&#xFF09;&#x7684;&#x7B97;&#x6CD5;&#x8FD0;&#x884C;&#x7684;&#x66F4;&#x5FEB;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x6216;&#x8BB8;&#x76F8;&#x5BF9;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#x7684;&#x7B97;&#x6CD5;&#x521B;&#x65B0;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x4F46;&#x662F;&#x6839;&#x672C;&#x4E0A;&#x7B97;&#x6CD5;&#x521B;&#x65B0;&#x6240;&#x5E26;&#x6765;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x5BF9;&#x8BA1;&#x7B97;&#x5E26;&#x6765;&#x7684;&#x4F18;&#x5316;&#xFF0C;&#x6240;&#x4EE5;&#x6709;&#x5F88;&#x591A;&#x50CF;&#x8FD9;&#x6837;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x6539;&#x53D8;&#x7B97;&#x6CD5;&#xFF0C;&#x4F7F;&#x5F97;&#x4EE3;&#x7801;&#x8FD0;&#x884C;&#x7684;&#x66F4;&#x5FEB;&#xFF0C;&#x8FD9;&#x4E5F;&#x4F7F;&#x5F97;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x8BAD;&#x7EC3;&#x89C4;&#x6A21;&#x66F4;&#x5927;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x591A;&#x7AEF;&#x53E3;&#x7684;&#x7F51;&#x7EDC;&#x3002;&#x5373;&#x4F7F;&#x6211;&#x4EEC;&#x4ECE;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x4E2D;&#x62E5;&#x6709;&#x4E86;&#x5927;&#x89C4;&#x6A21;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x5FEB;&#x901F;&#x8BA1;&#x7B97;&#x663E;&#x5F97;&#x66F4;&#x52A0;&#x91CD;&#x8981;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#x662F;&#xFF0C;&#x8BAD;&#x7EC3;&#x4F60;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x662F;&#x51ED;&#x501F;&#x76F4;&#x89C9;&#x7684;&#xFF0C;&#x5F80;&#x5F80;&#x4F60;&#x5BF9;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x67B6;&#x6784;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x60F3;&#x6CD5;&#xFF0C;&#x4E8E;&#x662F;&#x4F60;&#x5C1D;&#x8BD5;&#x5199;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;&#x4F60;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x7136;&#x540E;&#x8BA9;&#x4F60;&#x8FD0;&#x884C;&#x4E00;&#x4E2A;&#x8BD5;&#x9A8C;&#x73AF;&#x5883;&#x6765;&#x544A;&#x8BC9;&#x4F60;&#xFF0C;&#x4F60;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6548;&#x679C;&#x6709;&#x591A;&#x597D;&#xFF0C;&#x901A;&#x8FC7;&#x53C2;&#x8003;&#x8FD9;&#x4E2A;&#x7ED3;&#x679C;&#x518D;&#x8FD4;&#x56DE;&#x53BB;&#x4FEE;&#x6539;&#x4F60;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x91CC;&#x9762;&#x7684;&#x4E00;&#x4E9B;&#x7EC6;&#x8282;&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x4E0D;&#x65AD;&#x7684;&#x91CD;&#x590D;&#x4E0A;&#x9762;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x5F53;&#x4F60;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x9700;&#x8981;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#x53BB;&#x8BAD;&#x7EC3;&#xFF0C;&#x9700;&#x8981;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#x91CD;&#x590D;&#x8FD9;&#x4E00;&#x5FAA;&#x73AF;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x5C31;&#x6709;&#x5F88;&#x5927;&#x7684;&#x533A;&#x522B;&#xFF0C;&#x6839;&#x636E;&#x4F60;&#x7684;&#x751F;&#x4EA7;&#x6548;&#x7387;&#x53BB;&#x6784;&#x5EFA;&#x66F4;&#x9AD8;&#x6548;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;&#x5F53;&#x4F60;&#x80FD;&#x591F;&#x6709;&#x4E00;&#x4E2A;&#x60F3;&#x6CD5;&#xFF0C;&#x8BD5;&#x4E00;&#x8BD5;&#xFF0C;&#x770B;&#x6548;&#x679C;&#x5982;&#x4F55;&#x3002;&#x5728;10&#x5206;&#x949F;&#x5185;&#xFF0C;&#x6216;&#x8005;&#x4E5F;&#x8BB8;&#x8981;&#x82B1;&#x4E0A;&#x4E00;&#x6574;&#x5929;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8BAD;&#x7EC3;&#x4F60;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x6708;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x53D1;&#x751F;&#x8FD9;&#x6837;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4E5F;&#x662F;&#x503C;&#x5F97;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x5F88;&#x5FEB;&#x5F97;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x7ED3;&#x679C;&#x3002;&#x5728;10&#x5206;&#x949F;&#x5185;&#x6216;&#x8005;&#x4E00;&#x5929;&#x5185;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x5C1D;&#x8BD5;&#x66F4;&#x591A;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x90A3;&#x6781;&#x6709;&#x53EF;&#x80FD;&#x4F7F;&#x5F97;&#x4F60;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5728;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x65B9;&#x9762;&#x5DE5;&#x4F5C;&#x7684;&#x66F4;&#x597D;&#x3001;&#x66F4;&#x5FEB;&#x7684;&#x8BA1;&#x7B97;&#xFF0C;&#x5728;&#x63D0;&#x9AD8;&#x901F;&#x5EA6;&#x65B9;&#x9762;&#x771F;&#x7684;&#x6709;&#x5E2E;&#x52A9;&#xFF0C;&#x90A3;&#x6837;&#x4F60;&#x5C31;&#x80FD;&#x66F4;&#x5FEB;&#x5730;&#x5F97;&#x5230;&#x4F60;&#x7684;&#x5B9E;&#x9A8C;&#x7ED3;&#x679C;&#x3002;&#x8FD9;&#x4E5F;&#x540C;&#x65F6;&#x5E2E;&#x52A9;&#x4E86;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x5B9E;&#x9A8C;&#x4EBA;&#x5458;&#x548C;&#x6709;&#x5173;&#x9879;&#x76EE;&#x7684;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x5728;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x5DE5;&#x4F5C;&#x4E2D;&#x8FED;&#x4EE3;&#x7684;&#x66F4;&#x5FEB;&#xFF0C;&#x4E5F;&#x80FD;&#x591F;&#x66F4;&#x5FEB;&#x7684;&#x6539;&#x8FDB;&#x4F60;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x90FD;&#x4F7F;&#x5F97;&#x6574;&#x4E2A;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x7814;&#x7A76;&#x793E;&#x7FA4;&#x53D8;&#x7684;&#x5982;&#x6B64;&#x7E41;&#x8363;&#xFF0C;&#x5305;&#x62EC;&#x4EE4;&#x4EBA;&#x96BE;&#x4EE5;&#x7F6E;&#x4FE1;&#x5730;&#x53D1;&#x660E;&#x65B0;&#x7684;&#x7B97;&#x6CD5;&#x548C;&#x53D6;&#x5F97;&#x4E0D;&#x95F4;&#x65AD;&#x7684;&#x8FDB;&#x6B65;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x5F00;&#x62D3;&#x8005;&#x5728;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x8FD9;&#x4E9B;&#x529B;&#x91CF;&#x4F7F;&#x5F97;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x4E0D;&#x65AD;&#x58EE;&#x5927;&#x3002;</p>
<p><img src="../images/e26d18a882cfc48837118572dca51c56.png" alt=""></p>
<p>&#x597D;&#x6D88;&#x606F;&#x662F;&#x8FD9;&#x4E9B;&#x529B;&#x91CF;&#x76EE;&#x524D;&#x4E5F;&#x6B63;&#x5E38;&#x4E0D;&#x65AD;&#x7684;&#x594F;&#x6548;&#xFF0C;&#x4F7F;&#x5F97;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x8D8A;&#x6765;&#x8D8A;&#x597D;&#x3002;&#x7814;&#x7A76;&#x8868;&#x660E;&#x6211;&#x4EEC;&#x7684;&#x793E;&#x4F1A;&#x4ECD;&#x7136;&#x6B63;&#x5728;&#x629B;&#x51FA;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x6570;&#x5B57;&#x5316;&#x6570;&#x636E;&#xFF0C;&#x6216;&#x8005;&#x7528;&#x4E00;&#x4E9B;&#x7279;&#x6B8A;&#x7684;&#x786C;&#x4EF6;&#x6765;&#x8FDB;&#x884C;&#x8BA1;&#x7B97;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;<strong>GPU</strong>&#xFF0C;&#x4EE5;&#x53CA;&#x66F4;&#x5FEB;&#x7684;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x5404;&#x79CD;&#x786C;&#x4EF6;&#x3002;&#x6211;&#x975E;&#x5E38;&#x6709;&#x4FE1;&#x5FC3;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x505A;&#x4E00;&#x4E2A;&#x8D85;&#x7EA7;&#x5927;&#x89C4;&#x6A21;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x800C;&#x8BA1;&#x7B97;&#x7684;&#x80FD;&#x529B;&#x4E5F;&#x4F1A;&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x5F97;&#x5230;&#x6539;&#x5584;&#xFF0C;&#x8FD8;&#x6709;&#x7B97;&#x6CD5;&#x76F8;&#x5BF9;&#x7684;&#x5B66;&#x4E60;&#x7814;&#x7A76;&#x793E;&#x533A;&#x8FDE;&#x7EED;&#x4E0D;&#x65AD;&#x7684;&#x5728;&#x7B97;&#x6CD5;&#x524D;&#x6CBF;&#x4EA7;&#x751F;&#x975E;&#x51E1;&#x7684;&#x521B;&#x65B0;&#x3002;&#x6839;&#x636E;&#x8FD9;&#x4E9B;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4E50;&#x89C2;&#x5730;&#x56DE;&#x7B54;&#xFF0C;&#x540C;&#x65F6;&#x5BF9;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x4FDD;&#x6301;&#x4E50;&#x89C2;&#x6001;&#x5EA6;&#xFF0C;&#x5728;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x8FD9;&#x4E9B;&#x5E74;&#x5B83;&#x90FD;&#x4F1A;&#x53D8;&#x7684;&#x8D8A;&#x6765;&#x8D8A;&#x597D;&#x3002;</p>
<h3 id="15-&#x5173;&#x4E8E;&#x8FD9;&#x95E8;&#x8BFE;about-this-course">1.5 &#x5173;&#x4E8E;&#x8FD9;&#x95E8;&#x8BFE;(About this Course)</h3>
<p>&#x4F60;&#x7684;&#x5B66;&#x4E60;&#x8FDB;&#x5EA6;&#x5DF2;&#x7ECF;&#x5FEB;&#x63A5;&#x8FD1;&#x8FD9;&#x4E2A;&#x4E13;&#x9879;&#x8BFE;&#x7A0B;&#x7684;&#x7B2C;&#x4E00;&#x95E8;&#x8BFE;&#x7684;&#x7B2C;&#x4E00;&#x5468;&#x7ED3;&#x5C3E;&#x4E86;&#xFF0C;&#x9996;&#x5148;&#xFF0C;&#x5FEB;&#x901F;&#x5730;&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B;&#x4E0B;&#x5468;&#x7684;&#x5B66;&#x4E60;&#x5185;&#x5BB9;&#xFF1A;</p>
<p><img src="../images/4bb4483c80727af15108a2c4a200f378.png" alt=""></p>
<p>&#x5728;&#x7B2C;&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#x5DF2;&#x7ECF;&#x63D0;&#x5230;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E13;&#x9879;&#x6709;&#x4E94;&#x95E8;&#x8BFE;&#x7A0B;&#xFF0C;&#x76EE;&#x524D;&#x6B63;&#x5904;&#x4E8E;&#x7B2C;&#x4E00;&#x95E8;&#x8BFE;&#xFF1A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E0E;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x3002;&#x5728;&#x8FD9;&#x95E8;&#x8BFE;&#x4E2D;&#x5C06;&#x6559;&#x4F1A;&#x4F60;&#x6700;&#x91CD;&#x8981;&#x7684;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x3002;&#x5F53;&#x5B66;&#x4E60;&#x5230;&#x7B2C;&#x4E00;&#x95E8;&#x8BFE;&#x672B;&#x5C3E;&#xFF0C;&#x4F60;&#x5C06;&#x5B66;&#x5230;&#x5982;&#x4F55;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5E76;&#x4E14;&#x4F7F;&#x4E4B;&#x594F;&#x6548;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x5173;&#x4E8E;&#x7B2C;&#x4E00;&#x95E8;&#x8BFE;&#x7684;&#x4E00;&#x4E9B;&#x7EC6;&#x8282;&#xFF0C;&#x8FD9;&#x95E8;&#x8BFE;&#x6709;&#x56DB;&#x5468;&#x7684;&#x5B66;&#x4E60;&#x8D44;&#x6599;&#xFF1A;</p>
<p>&#x7B2C;&#x4E00;&#x5468;&#xFF1A;&#x5173;&#x4E8E;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x4ECB;&#x7ECD;&#x3002;&#x5728;&#x6BCF;&#x4E00;&#x5468;&#x7684;&#x7ED3;&#x5C3E;&#x4E5F;&#x4F1A;&#x6709;&#x5341;&#x4E2A;&#x591A;&#x9009;&#x9898;&#x7528;&#x6765;&#x68C0;&#x9A8C;&#x81EA;&#x5DF1;&#x5BF9;&#x6750;&#x6599;&#x7684;&#x7406;&#x89E3;&#xFF1B;</p>
<p>&#x7B2C;&#x4E8C;&#x5468;&#xFF1A;&#x5173;&#x4E8E;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x7F16;&#x7A0B;&#x77E5;&#x8BC6;&#xFF0C;&#x4E86;&#x89E3;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x7ED3;&#x6784;&#xFF0C;&#x9010;&#x6B65;&#x5B8C;&#x5584;&#x7B97;&#x6CD5;&#x5E76;&#x601D;&#x8003;&#x5982;&#x4F55;&#x4F7F;&#x5F97;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x9AD8;&#x6548;&#x5730;&#x5B9E;&#x73B0;&#x3002;&#x4ECE;&#x7B2C;&#x4E8C;&#x5468;&#x5F00;&#x59CB;&#x505A;&#x4E00;&#x4E9B;&#x7F16;&#x7A0B;&#x8BAD;&#x7EC3;&#xFF08;&#x4ED8;&#x8D39;&#x9879;&#x76EE;&#xFF09;&#xFF0C;&#x81EA;&#x5DF1;&#x5B9E;&#x73B0;&#x7B97;&#x6CD5;&#xFF1B;</p>
<p>&#x7B2C;&#x4E09;&#x5468;&#xFF1A;&#x5728;&#x5B66;&#x4E60;&#x4E86;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7F16;&#x7A0B;&#x7684;&#x6846;&#x67B6;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x5C06;&#x53EF;&#x4EE5;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x9690;&#x85CF;&#x5C42;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x6240;&#x4EE5;&#x9700;&#x8981;&#x5B66;&#x4E60;&#x6240;&#x6709;&#x5FC5;&#x987B;&#x7684;&#x5173;&#x952E;&#x6982;&#x5FF5;&#x6765;&#x5B9E;&#x73B0;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x5DE5;&#x4F5C;&#xFF1B;</p>
<p>&#x7B2C;&#x56DB;&#x5468;&#xFF1A;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x6DF1;&#x5C42;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;</p>
<p>&#x8FD9;&#x6BB5;&#x89C6;&#x9891;&#x5373;&#x5C06;&#x7ED3;&#x675F;&#xFF0C;&#x5E0C;&#x671B;&#x5728;&#x8FD9;&#x6BB5;&#x89C6;&#x9891;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x770B;&#x8BFE;&#x7A0B;&#x7F51;&#x7AD9;&#x7684;&#x5341;&#x9053;&#x9009;&#x62E9;&#x9898;&#x6765;&#x68C0;&#x67E5;&#x81EA;&#x5DF1;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x4E0D;&#x5FC5;&#x590D;&#x4E60;&#x524D;&#x9762;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x6709;&#x7684;&#x77E5;&#x8BC6;&#x662F;&#x4F60;&#x73B0;&#x5728;&#x4E0D;&#x77E5;&#x9053;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x4E0D;&#x65AD;&#x5C1D;&#x8BD5;&#xFF0C;&#x76F4;&#x5230;&#x5168;&#x90E8;&#x505A;&#x5BF9;&#x4EE5;&#x7406;&#x89E3;&#x5168;&#x90E8;&#x6982;&#x5FF5;&#x3002;</p>
<h3 id="16-&#x8BFE;&#x7A0B;&#x8D44;&#x6E90;course-resources">1.6 &#x8BFE;&#x7A0B;&#x8D44;&#x6E90;(Course Resources)</h3>
<p>&#x6211;&#x5E0C;&#x671B;&#x4F60;&#x4EEC;&#x559C;&#x6B22;&#x8FD9;&#x95E8;&#x8BFE;&#x7A0B;&#xFF0C;&#x4E3A;&#x4E86;&#x5E2E;&#x52A9;&#x4F60;&#x4EEC;&#x5B8C;&#x6210;&#x8BFE;&#x7A0B;&#xFF0C;&#x672C;&#x6B21;&#x8BFE;&#x7A0B;&#x5C06;&#x5217;&#x4E3E;&#x4E00;&#x4E9B;&#x8BFE;&#x7A0B;&#x8D44;&#x6E90;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;&#x4EFB;&#x4F55;&#x7591;&#x95EE;&#xFF0C;&#x6216;&#x662F;&#x60F3;&#x548C;&#x5176;&#x4ED6;&#x540C;&#x5B66;&#x8BA8;&#x8BBA;&#x95EE;&#x9898;&#xFF0C;&#x6216;&#x662F;&#x60F3;&#x548C;&#x5305;&#x62EC;&#x6211;&#x5728;&#x5185;&#x7684;&#x6559;&#x5B66;&#x4EBA;&#x5458;&#x8BA8;&#x8BBA;&#x4EFB;&#x4F55;&#x95EE;&#x9898;&#xFF0C;&#x6216;&#x662F;&#x60F3;&#x8981;&#x5F52;&#x6863;&#x4E00;&#x4E2A;&#x9519;&#x8BEF;&#xFF0C;&#x8BBA;&#x575B;&#x662F;&#x6700;&#x597D;&#x7684;&#x53BB;&#x5904;&#xFF0C;&#x6211;&#x548C;&#x5176;&#x4ED6;&#x6559;&#x5B66;&#x4EBA;&#x5458;&#x5C06;&#x5B9A;&#x671F;&#x5173;&#x6CE8;&#x8BBA;&#x575B;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x8BBA;&#x575B;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x4F60;&#x4ECE;&#x540C;&#x5B66;&#x90A3;&#x91CC;&#x5F97;&#x5230;&#x95EE;&#x9898;&#x7B54;&#x6848;&#x7684;&#x597D;&#x5730;&#x65B9;&#xFF0C;&#x5982;&#x679C;&#x60F3;&#x8981;&#x56DE;&#x7B54;&#x540C;&#x5B66;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x53EF;&#x4EE5;&#x4ECE;&#x8BFE;&#x7A0B;&#x9996;&#x9875;&#x6765;&#x5230;&#x8BBA;&#x575B;&#xFF1A;</p>
<p><img src="../images/ef98dcd467a603cf9050b887a8dbf91b.png" alt=""></p>
<p><strong>&#x70B9;&#x51FB;&#x8BBA;&#x575B;&#x6807;&#x7B7E;&#x53EF;&#x4EE5;&#x8FDB;&#x5165;&#x8BBA;&#x575B;</strong></p>
<p>&#x5728;&#x8BBA;&#x575B;&#x4E0A;&#x662F;&#x63D0;&#x95EE;&#x7684;&#x6700;&#x4F73;&#x9014;&#x5F84;&#xFF0C;&#x4F46;&#x662F;&#x51FA;&#x4E8E;&#x4E00;&#x4E9B;&#x539F;&#x56E0;&#xFF0C;&#x53EF;&#x80FD;&#x8981;&#x76F4;&#x63A5;&#x8054;&#x7CFB;&#x6211;&#x4EEC;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x90AE;&#x4EF6;&#x53D1;&#x9001;&#x5230;&#x8FD9;&#x4E2A;&#x5730;&#x5740;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x5C3D;&#x529B;&#x9605;&#x8BFB;&#x6BCF;&#x4E00;&#x4EFD;&#x90AE;&#x4EF6;&#x5E76;&#x5C1D;&#x8BD5;&#x89E3;&#x51B3;&#x666E;&#x904D;&#x51FA;&#x73B0;&#x7684;&#x95EE;&#x3002;&#x7531;&#x4E8E;&#x90AE;&#x4EF6;&#x6570;&#x91CF;&#x5E9E;&#x5927;&#xFF0C;&#x4E0D;&#x4E00;&#x5B9A;&#x80FD;&#x8FC5;&#x901F;&#x56DE;&#x590D;&#x6BCF;&#x4E00;&#x5C01;&#x90AE;&#x4EF6;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x4E00;&#x4E9B;&#x516C;&#x53F8;&#x4F1A;&#x5C1D;&#x8BD5;&#x7ED9;&#x5458;&#x5DE5;&#x505A;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x57F9;&#x8BAD;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4EEC;&#x60F3;&#x5BF9;&#x5458;&#x5DE5;&#x8D1F;&#x8D23;&#xFF0C;&#x8058;&#x8BF7;&#x4E13;&#x5BB6;&#x57F9;&#x8BAD;&#x4E0A;&#x767E;&#x751A;&#x81F3;&#x66F4;&#x591A;&#x5458;&#x5DE5;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#xFF0C;&#x8BF7;&#x7528;&#x4F01;&#x4E1A;&#x90AE;&#x7BB1;&#x4E0E;&#x6211;&#x4EEC;&#x8054;&#x7CFB;&#x3002;&#x6211;&#x4EEC;&#x5904;&#x5728;&#x5927;&#x5B66;&#x5B66;&#x672F;&#x5F00;&#x53D1;&#x7684;&#x521D;&#x59CB;&#x9636;&#x6BB5;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x662F;&#x5927;&#x5B66;&#x9886;&#x5BFC;&#x6216;&#x8005;&#x662F;&#x7BA1;&#x7406;&#x4EBA;&#x5458;&#xFF0C;&#x5E76;&#x4E14;&#x5E0C;&#x671B;&#x5728;&#x4F60;&#x4EEC;&#x5B66;&#x6821;&#x5F00;&#x8BBE;&#x4E00;&#x95E8;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x8BFE;&#x7A0B;&#xFF0C;&#x8BF7;&#x901A;&#x8FC7;&#x5927;&#x5B66;&#x90AE;&#x7BB1;&#x8054;&#x7CFB;&#x6211;&#x4EEC;&#x3002;&#x90AE;&#x7BB1;&#x5730;&#x5740;&#x5982;&#x4E0B;&#xFF0C;&#x795D;&#x4F60;&#x4EEC;&#x597D;&#x8FD0;&#xFF01;</p>
<p>Contact us: <a href="mailto:feedback@deeplearning.ai" target="_blank">feedback@deeplearning.ai</a></p>
<p>Companies: <a href="mailto:enterprise@deeplearning.ai" target="_blank">enterprise@deeplearning.ai</a></p>
<p>Universities: <a href="mailto:academic@deeplearning.ai" target="_blank">academic@deeplearning.ai</a></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: Introduction">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="lesson1-week2.html" class="navigation navigation-next " aria-label="Next page: 第二周：神经网络的编程基础">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第一周：深度学习引言","level":"1.2","depth":1,"next":{"title":"第二周：神经网络的编程基础","level":"1.3","depth":1,"path":"lesson1-week2.md","ref":"lesson1-week2.md","articles":[]},"previous":{"title":"Introduction","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"plugins":["fontsettings","sharing","-lunr","-search","search-pro","highlight","livereload","back-to-top-button","cdn"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"cdn":{"url":"//cdn.jsdelivr.net/gh/zhepama/C-Sharp-Playground@gh-pages/","img_url":"//cdn.jsdelivr.net/gh/zhepama/C-Sharp-Playground@gh-pages/"},"fontsettings":{"family":"sans","size":2,"theme":"white"},"sharing":{"all":["facebook","google","twitter","weibo","instapaper"],"facebook":true,"google":false,"instapaper":false,"twitter":true,"vk":false,"weibo":false},"search-pro":{},"highlight":{},"livereload":{},"back-to-top-button":{},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"深度学习教程","language":"zh-hans","links":{"sidebar":{"编程网":"https://www.editcode.net"}},"gitbook":"*"},"file":{"path":"lesson1-week1.md","mtime":"2020-11-28T01:34:16.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-05-09T13:30:39.812Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook.js"></script>
    <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/theme.js"></script>
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    

    </body>
</html>

