
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第一周：机器学习策略 · 深度学习教程</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/style.css">

    
            
                
                <link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-back-to-top-button/plugin.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="lesson3-week2.html" />
    
    
    <link rel="prev" href="lesson2-week3.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://www.editcode.net" target="_blank" class="custom-link">编程网</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        <li class="header">第一门课 神经网络和深度学习</li>
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="lesson1-week1.html">
            
                <a href="lesson1-week1.html">
            
                    
                    第一周：深度学习引言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="lesson1-week2.html">
            
                <a href="lesson1-week2.html">
            
                    
                    第二周：神经网络的编程基础
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="lesson1-week3.html">
            
                <a href="lesson1-week3.html">
            
                    
                    第三周：浅层神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="lesson1-week4.html">
            
                <a href="lesson1-week4.html">
            
                    
                    第四周：深层神经网络
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第二门课 改善深层神经网络</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="lesson2-week1.html">
            
                <a href="lesson2-week1.html">
            
                    
                    第一周：深度学习的实践层面
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="lesson2-week2.html">
            
                <a href="lesson2-week2.html">
            
                    
                    第二周：优化算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="lesson2-week3.html">
            
                <a href="lesson2-week3.html">
            
                    
                    第三周超参数调试，batch正则化和程序框架
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第三门课 结构化机器学习项目</li>
        
        
    
        <li class="chapter active" data-level="3.1" data-path="lesson3-week1.html">
            
                <a href="lesson3-week1.html">
            
                    
                    第一周：机器学习策略
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="lesson3-week2.html">
            
                <a href="lesson3-week2.html">
            
                    
                    第二周：机器学习策略
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第四门课 卷积神经网络</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="lesson4-week1.html">
            
                <a href="lesson4-week1.html">
            
                    
                    第一周 卷积神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="lesson4-week2.html">
            
                <a href="lesson4-week2.html">
            
                    
                    第二周 深度卷积网络：实例探究
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.3" data-path="lesson4-week3.html">
            
                <a href="lesson4-week3.html">
            
                    
                    第三周 目标检测
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.4" data-path="lesson4-week4.html">
            
                <a href="lesson4-week4.html">
            
                    
                    第四周 特殊应用：人脸识别和神经风格转换
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第五门课 序列模型</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="lesson5-week1.html">
            
                <a href="lesson5-week1.html">
            
                    
                    第一周 循环序列模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.2" data-path="lesson5-week2.html">
            
                <a href="lesson5-week2.html">
            
                    
                    第二周 自然语言处理与词嵌入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.3" data-path="lesson5-week3.html">
            
                <a href="lesson5-week3.html">
            
                    
                    第三周 序列模型和注意力机制
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">附件</li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="interview.html">
            
                <a href="interview.html">
            
                    
                    人工智能大师访谈
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.2" data-path="notation.html">
            
                <a href="notation.html">
            
                    
                    深度学习符号指南（原课程翻译）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.3" data-path="notation.html">
            
                <a href="notation.html">
            
                    
                    机器学习的数学基础
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第一周：机器学习策略</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;&#x4E09;&#x95E8;&#x8BFE;-&#x7ED3;&#x6784;&#x5316;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x9879;&#x76EE;&#xFF08;structuring-machine-learning-projects&#xFF09;">&#x7B2C;&#x4E09;&#x95E8;&#x8BFE; &#x7ED3;&#x6784;&#x5316;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x9879;&#x76EE;&#xFF08;Structuring Machine Learning Projects&#xFF09;</h1>
<h2 id="&#x7B2C;&#x4E00;&#x5468;-&#x673A;&#x5668;&#x5B66;&#x4E60;&#xFF08;ml&#xFF09;&#x7B56;&#x7565;&#xFF08;1&#xFF09;&#xFF08;ml-strategy&#xFF08;1&#xFF09;&#xFF09;">&#x7B2C;&#x4E00;&#x5468; &#x673A;&#x5668;&#x5B66;&#x4E60;&#xFF08;ML&#xFF09;&#x7B56;&#x7565;&#xFF08;1&#xFF09;&#xFF08;ML strategy&#xFF08;1&#xFF09;&#xFF09;</h2>
<p>[TOC]</p>
<h3 id="11-&#x4E3A;&#x4EC0;&#x4E48;&#x662F;ml&#x7B56;&#x7565;&#xFF1F;&#xFF08;why-ml-strategy&#xFF09;">1.1 &#x4E3A;&#x4EC0;&#x4E48;&#x662F;ML&#x7B56;&#x7565;&#xFF1F;&#xFF08;Why ML Strategy?&#xFF09;</h3>
<p>&#x5927;&#x5BB6;&#x597D;&#xFF0C;&#x6B22;&#x8FCE;&#x6536;&#x542C;&#x672C;&#x8BFE;&#xFF0C;&#x5982;&#x4F55;&#x6784;&#x5EFA;&#x4F60;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x9879;&#x76EE;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x7B56;&#x7565;&#x3002;&#x6211;&#x5E0C;&#x671B;&#x901A;&#x8FC7;&#x8FD9;&#x95E8;&#x8BFE;&#x7A0B;&#x4F60;&#x4EEC;&#x80FD;&#x591F;&#x5B66;&#x5230;&#x5982;&#x4F55;&#x66F4;&#x5FEB;&#x901F;&#x9AD8;&#x6548;&#x5730;&#x4F18;&#x5316;&#x4F60;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7CFB;&#x7EDF;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x4EC0;&#x4E48;&#x662F;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B56;&#x7565;&#x5462;&#xFF1F;</p>
<p><img src="../images/640a89ae465a58f1d19e05895ef31606.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x4ECE;&#x4E00;&#x4E2A;&#x542F;&#x53D1;&#x6027;&#x7684;&#x4F8B;&#x5B50;&#x5F00;&#x59CB;&#x8BB2;&#xFF0C;&#x5047;&#x8BBE;&#x4F60;&#x6B63;&#x5728;&#x8C03;&#x8BD5;&#x4F60;&#x7684;&#x732B;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x7ECF;&#x8FC7;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x7684;&#x8C03;&#x6574;&#xFF0C;&#x4F60;&#x7684;&#x7CFB;&#x7EDF;&#x8FBE;&#x5230;&#x4E86;90%&#x51C6;&#x786E;&#x7387;&#xFF0C;&#x4F46;&#x5BF9;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6765;&#x8BF4;&#x8FD8;&#x4E0D;&#x591F;&#x597D;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x80FD;&#x6709;&#x5F88;&#x591A;&#x60F3;&#x6CD5;&#x53BB;&#x6539;&#x5584;&#x4F60;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x60F3;&#x6211;&#x4EEC;&#x53BB;&#x6536;&#x96C6;&#x66F4;&#x591A;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x5427;&#x3002;&#x6216;&#x8005;&#x4F60;&#x4F1A;&#x8BF4;&#xFF0C;&#x53EF;&#x80FD;&#x4F60;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x591A;&#x6837;&#x6027;&#x8FD8;&#x4E0D;&#x591F;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x6536;&#x96C6;&#x66F4;&#x591A;&#x4E0D;&#x540C;&#x59FF;&#x52BF;&#x7684;&#x732B;&#x54AA;&#x56FE;&#x7247;&#xFF0C;&#x6216;&#x8005;&#x66F4;&#x591A;&#x6837;&#x5316;&#x7684;&#x53CD;&#x4F8B;&#x96C6;&#x3002;&#x6216;&#x8005;&#x4F60;&#x60F3;&#x518D;&#x7528;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x8BAD;&#x7EC3;&#x7B97;&#x6CD5;&#xFF0C;&#x8BAD;&#x7EC3;&#x4E45;&#x4E00;&#x70B9;&#x3002;&#x6216;&#x8005;&#x4F60;&#x60F3;&#x5C1D;&#x8BD5;&#x7528;&#x4E00;&#x4E2A;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x7684;&#x4F18;&#x5316;&#x7B97;&#x6CD5;&#xFF0C;&#x6BD4;&#x5982;<strong>Adam</strong>&#x4F18;&#x5316;&#x7B97;&#x6CD5;&#x3002;&#x6216;&#x8005;&#x5C1D;&#x8BD5;&#x4F7F;&#x7528;&#x89C4;&#x6A21;&#x66F4;&#x5927;&#x6216;&#x8005;&#x66F4;&#x5C0F;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;&#x6216;&#x8005;&#x4F60;&#x60F3;&#x8BD5;&#x8BD5;<strong>dropout</strong>&#x6216;&#x8005;$L2$&#x6B63;&#x5219;&#x5316;&#x3002;&#x6216;&#x8005;&#x4F60;&#x60F3;&#x4FEE;&#x6539;&#x7F51;&#x7EDC;&#x7684;&#x67B6;&#x6784;&#xFF0C;&#x6BD4;&#x5982;&#x4FEE;&#x6539;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF0C;&#x6539;&#x53D8;&#x9690;&#x85CF;&#x5355;&#x5143;&#x7684;&#x6570;&#x76EE;&#x4E4B;&#x7C7B;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x5F53;&#x4F60;&#x5C1D;&#x8BD5;&#x4F18;&#x5316;&#x4E00;&#x4E2A;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7CFB;&#x7EDF;&#x65F6;&#xFF0C;&#x4F60;&#x901A;&#x5E38;&#x53EF;&#x4EE5;&#x6709;&#x5F88;&#x591A;&#x60F3;&#x6CD5;&#x53EF;&#x4EE5;&#x53BB;&#x8BD5;&#xFF0C;&#x95EE;&#x9898;&#x5728;&#x4E8E;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x505A;&#x51FA;&#x4E86;&#x9519;&#x8BEF;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x4F60;&#x5B8C;&#x5168;&#x6709;&#x53EF;&#x80FD;&#x767D;&#x8D39;6&#x4E2A;&#x6708;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x5F80;&#x9519;&#x8BEF;&#x7684;&#x65B9;&#x5411;&#x524D;&#x8FDB;&#xFF0C;&#x5728;6&#x4E2A;&#x6708;&#x4E4B;&#x540E;&#x624D;&#x610F;&#x8BC6;&#x5230;&#x8FD9;&#x65B9;&#x6CD5;&#x6839;&#x672C;&#x4E0D;&#x7BA1;&#x7528;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x6211;&#x89C1;&#x8FC7;&#x4E00;&#x4E9B;&#x56E2;&#x961F;&#x82B1;&#x4E86;6&#x4E2A;&#x6708;&#x65F6;&#x95F4;&#x6536;&#x96C6;&#x66F4;&#x591A;&#x6570;&#x636E;&#xFF0C;&#x5374;&#x5728;6&#x4E2A;&#x6708;&#x4E4B;&#x540E;&#x53D1;&#x73B0;&#xFF0C;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x6539;&#x5584;&#x4ED6;&#x4EEC;&#x7CFB;&#x7EDF;&#x7684;&#x6027;&#x80FD;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5047;&#x8BBE;&#x4F60;&#x7684;&#x9879;&#x76EE;&#x6CA1;&#x6709;6&#x4E2A;&#x6708;&#x7684;&#x65F6;&#x95F4;&#x53EF;&#x4EE5;&#x6D6A;&#x8D39;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x5FEB;&#x901F;&#x6709;&#x6548;&#x7684;&#x65B9;&#x6CD5;&#x80FD;&#x591F;&#x5224;&#x65AD;&#x54EA;&#x4E9B;&#x60F3;&#x6CD5;&#x662F;&#x9760;&#x8C31;&#x7684;&#xFF0C;&#x6216;&#x8005;&#x751A;&#x81F3;&#x63D0;&#x51FA;&#x65B0;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x5224;&#x65AD;&#x54EA;&#x4E9B;&#x662F;&#x503C;&#x5F97;&#x4E00;&#x8BD5;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x54EA;&#x4E9B;&#x662F;&#x53EF;&#x4EE5;&#x653E;&#x5FC3;&#x820D;&#x5F03;&#x7684;&#x3002;</p>
<p>&#x6211;&#x5E0C;&#x671B;&#x5728;&#x8FD9;&#x95E8;&#x8BFE;&#x7A0B;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x6559;&#x7ED9;&#x4F60;&#x4EEC;&#x4E00;&#x4E9B;&#x7B56;&#x7565;&#xFF0C;&#x4E00;&#x4E9B;&#x5206;&#x6790;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x53EF;&#x4EE5;&#x6307;&#x5F15;&#x4F60;&#x4EEC;&#x671D;&#x7740;&#x6700;&#x6709;&#x5E0C;&#x671B;&#x7684;&#x65B9;&#x5411;&#x524D;&#x8FDB;&#x3002;&#x8FD9;&#x95E8;&#x8BFE;&#x4E2D;&#xFF0C;&#x6211;&#x4F1A;&#x548C;&#x4F60;&#x4EEC;&#x5206;&#x4EAB;&#x6211;&#x5728;&#x642D;&#x5EFA;&#x548C;&#x90E8;&#x7F72;&#x5927;&#x91CF;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x4EA7;&#x54C1;&#x65F6;&#x5B66;&#x5230;&#x7684;&#x7ECF;&#x9A8C;&#x548C;&#x6559;&#x8BAD;&#xFF0C;&#x6211;&#x60F3;&#x8FD9;&#x4E9B;&#x5185;&#x5BB9;&#x662F;&#x8FD9;&#x95E8;&#x8BFE;&#x7A0B;&#x72EC;&#x6709;&#x7684;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x5F88;&#x591A;&#x5927;&#x5B66;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x8BFE;&#x7A0B;&#x5F88;&#x5C11;&#x63D0;&#x5230;&#x8FD9;&#x4E9B;&#x7B56;&#x7565;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B56;&#x7565;&#x5728;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x65F6;&#x4EE3;&#x4E5F;&#x5728;&#x53D8;&#x5316;&#xFF0C;&#x56E0;&#x4E3A;&#x73B0;&#x5728;&#x5BF9;&#x4E8E;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x6765;&#x8BF4;&#x80FD;&#x591F;&#x505A;&#x5230;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6BD4;&#x4E0A;&#x4E00;&#x4EE3;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x5927;&#x4E0D;&#x4E00;&#x6837;&#x3002;&#x6211;&#x5E0C;&#x671B;&#x8FD9;&#x4E9B;&#x7B56;&#x7565;&#x80FD;&#x5E2E;&#x52A9;&#x4F60;&#x4EEC;&#x63D0;&#x9AD8;&#x6548;&#x7387;&#xFF0C;&#x8BA9;&#x4F60;&#x4EEC;&#x7684;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7CFB;&#x7EDF;&#x66F4;&#x5FEB;&#x6295;&#x5165;&#x5B9E;&#x7528;&#x3002;</p>
<h3 id="12-&#x6B63;&#x4EA4;&#x5316;&#xFF08;orthogonalization&#xFF09;">1.2 &#x6B63;&#x4EA4;&#x5316;&#xFF08;Orthogonalization&#xFF09;</h3>
<p>&#x642D;&#x5EFA;&#x5EFA;&#x7ACB;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7CFB;&#x7EDF;&#x7684;&#x6311;&#x6218;&#x4E4B;&#x4E00;&#x662F;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x548C;&#x6539;&#x53D8;&#x7684;&#x4E1C;&#x897F;&#x592A;&#x591A;&#x592A;&#x591A;&#x4E86;&#x3002;&#x5305;&#x62EC;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x6709;&#x90A3;&#x4E48;&#x591A;&#x7684;&#x8D85;&#x53C2;&#x6570;&#x53EF;&#x4EE5;&#x8C03;&#x3002;&#x6211;&#x7559;&#x610F;&#x5230;&#xFF0C;&#x90A3;&#x4E9B;&#x6548;&#x7387;&#x5F88;&#x9AD8;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4E13;&#x5BB6;&#x6709;&#x4E2A;&#x7279;&#x70B9;&#xFF0C;&#x4ED6;&#x4EEC;&#x601D;&#x7EF4;&#x6E05;&#x6670;&#xFF0C;&#x5BF9;&#x4E8E;&#x8981;&#x8C03;&#x6574;&#x4EC0;&#x4E48;&#x6765;&#x8FBE;&#x5230;&#x67D0;&#x4E2A;&#x6548;&#x679C;&#xFF0C;&#x975E;&#x5E38;&#x6E05;&#x695A;&#xFF0C;&#x8FD9;&#x4E2A;&#x6B65;&#x9AA4;&#x6211;&#x4EEC;&#x79F0;&#x4E4B;&#x4E3A;&#x6B63;&#x4EA4;&#x5316;&#xFF0C;&#x8BA9;&#x6211;&#x544A;&#x8BC9;&#x4F60;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#x5427;&#x3002;</p>
<p><img src="../images/7f5034517a97e2091be6f5095fdcb978.png" alt=""></p>
<p>&#x8FD9;&#x662F;&#x4E00;&#x5F20;&#x8001;&#x5F0F;&#x7535;&#x89C6;&#x56FE;&#x7247;&#xFF0C;&#x6709;&#x5F88;&#x591A;&#x65CB;&#x94AE;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x8C03;&#x6574;&#x56FE;&#x50CF;&#x7684;&#x5404;&#x79CD;&#x6027;&#x8D28;&#xFF0C;&#x6240;&#x4EE5;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E9B;&#x65E7;&#x5F0F;&#x7535;&#x89C6;&#xFF0C;&#x53EF;&#x80FD;&#x6709;&#x4E00;&#x4E2A;&#x65CB;&#x94AE;&#x7528;&#x6765;&#x8C03;&#x56FE;&#x50CF;&#x5782;&#x76F4;&#x65B9;&#x5411;&#x7684;&#x9AD8;&#x5EA6;&#xFF0C;&#x53E6;&#x5916;&#x6709;&#x4E00;&#x4E2A;&#x65CB;&#x94AE;&#x7528;&#x6765;&#x8C03;&#x56FE;&#x50CF;&#x5BBD;&#x5EA6;&#xFF0C;&#x4E5F;&#x8BB8;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x65CB;&#x94AE;&#x7528;&#x6765;&#x8C03;&#x68AF;&#x5F62;&#x89D2;&#x5EA6;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x65CB;&#x94AE;&#x7528;&#x6765;&#x8C03;&#x6574;&#x56FE;&#x50CF;&#x5DE6;&#x53F3;&#x504F;&#x79FB;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x65CB;&#x94AE;&#x7528;&#x6765;&#x8C03;&#x56FE;&#x50CF;&#x65CB;&#x8F6C;&#x89D2;&#x5EA6;&#x4E4B;&#x7C7B;&#x7684;&#x3002;&#x7535;&#x89C6;&#x8BBE;&#x8BA1;&#x5E08;&#x82B1;&#x4E86;&#x5927;&#x91CF;&#x65F6;&#x95F4;&#x8BBE;&#x8BA1;&#x7535;&#x8DEF;&#xFF0C;&#x90A3;&#x65F6;&#x901A;&#x5E38;&#x90FD;&#x662F;&#x6A21;&#x62DF;&#x7535;&#x8DEF;&#x6765;&#x786E;&#x4FDD;&#x6BCF;&#x4E2A;&#x65CB;&#x94AE;&#x90FD;&#x6709;&#x76F8;&#x5BF9;&#x660E;&#x786E;&#x7684;&#x529F;&#x80FD;&#x3002;&#x5982;&#x4E00;&#x4E2A;&#x65CB;&#x94AE;&#x6765;&#x8C03;&#x6574;&#x8FD9;&#x4E2A;&#xFF08;&#x9AD8;&#x5EA6;&#xFF09;&#xFF0C;&#x4E00;&#x4E2A;&#x65CB;&#x94AE;&#x8C03;&#x6574;&#x8FD9;&#x4E2A;&#xFF08;&#x5BBD;&#x5EA6;&#xFF09;&#xFF0C;&#x4E00;&#x4E2A;&#x65CB;&#x94AE;&#x8C03;&#x6574;&#x8FD9;&#x4E2A;&#xFF08;&#x68AF;&#x5F62;&#x89D2;&#x5EA6;&#xFF09;&#xFF0C;&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#x3002;</p>
<p>&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;&#x4E00;&#x4E2A;&#x65CB;&#x94AE;&#x8C03;&#x7684;&#x662F;$0.1x$&#x8868;&#x793A;&#x56FE;&#x50CF;&#x9AD8;&#x5EA6;&#xFF0C;$+0.3x$&#x8868;&#x793A;&#x56FE;&#x50CF;&#x5BBD;&#x5EA6;&#xFF0C;$-1.7x$&#x8868;&#x793A;&#x68AF;&#x5F62;&#x89D2;&#x5EA6;&#xFF0C;$+0.8x$&#x8868;&#x793A;&#x56FE;&#x50CF;&#x5728;&#x6C34;&#x5E73;&#x8F74;&#x4E0A;&#x7684;&#x5750;&#x6807;&#x4E4B;&#x7C7B;&#x7684;&#x3002;&#x5982;&#x679C;&#x4F60;&#x8C03;&#x6574;&#x8FD9;&#x4E2A;&#xFF08;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#xFF09;&#x65CB;&#x94AE;&#xFF0C;&#x90A3;&#x4E48;&#x56FE;&#x50CF;&#x7684;&#x9AD8;&#x5EA6;&#x3001;&#x5BBD;&#x5EA6;&#x3001;&#x68AF;&#x5F62;&#x89D2;&#x5EA6;&#x3001;&#x5E73;&#x79FB;&#x4F4D;&#x7F6E;&#x5168;&#x90E8;&#x90FD;&#x4F1A;&#x540C;&#x65F6;&#x6539;&#x53D8;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x65CB;&#x94AE;&#xFF0C;&#x90A3;&#x51E0;&#x4E4E;&#x4E0D;&#x53EF;&#x80FD;&#x628A;&#x7535;&#x89C6;&#x8C03;&#x597D;&#xFF0C;&#x8BA9;&#x56FE;&#x50CF;&#x663E;&#x793A;&#x5728;&#x533A;&#x57DF;&#x6B63;&#x4E2D;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6B63;&#x4EA4;&#x5316;&#x6307;&#x7684;&#x662F;&#x7535;&#x89C6;&#x8BBE;&#x8BA1;&#x5E08;&#x8BBE;&#x8BA1;&#x8FD9;&#x6837;&#x7684;&#x65CB;&#x94AE;&#xFF0C;&#x4F7F;&#x5F97;&#x6BCF;&#x4E2A;&#x65CB;&#x94AE;&#x90FD;&#x53EA;&#x8C03;&#x6574;&#x4E00;&#x4E2A;&#x6027;&#x8D28;&#xFF0C;&#x8FD9;&#x6837;&#x8C03;&#x6574;&#x7535;&#x89C6;&#x56FE;&#x50CF;&#x5C31;&#x5BB9;&#x6613;&#x5F97;&#x591A;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x628A;&#x56FE;&#x50CF;&#x8C03;&#x5230;&#x6B63;&#x4E2D;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x662F;&#x53E6;&#x4E00;&#x4E2A;&#x6B63;&#x4EA4;&#x5316;&#x4F8B;&#x5B50;&#xFF0C;&#x4F60;&#x60F3;&#x60F3;&#x5B66;&#x8F66;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E00;&#x8F86;&#x8F66;&#x6709;&#x4E09;&#x4E2A;&#x4E3B;&#x8981;&#x63A7;&#x5236;&#xFF0C;&#x7B2C;&#x4E00;&#x662F;&#x65B9;&#x5411;&#x76D8;&#xFF0C;&#x65B9;&#x5411;&#x76D8;&#x51B3;&#x5B9A;&#x4F60;&#x5F80;&#x5DE6;&#x53F3;&#x504F;&#x591A;&#x5C11;&#xFF0C;&#x8FD8;&#x6709;&#x6CB9;&#x95E8;&#x548C;&#x5239;&#x8F66;&#x3002;&#x5C31;&#x662F;&#x8FD9;&#x4E09;&#x4E2A;&#x63A7;&#x5236;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x63A7;&#x5236;&#x65B9;&#x5411;&#xFF0C;&#x53E6;&#x5916;&#x4E24;&#x4E2A;&#x63A7;&#x5236;&#x4F60;&#x7684;&#x901F;&#x5EA6;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x6BD4;&#x8F83;&#x5BB9;&#x6613;&#x89E3;&#x8BFB;&#x3002;&#x77E5;&#x9053;&#x4E0D;&#x540C;&#x63A7;&#x5236;&#x7684;&#x4E0D;&#x540C;&#x52A8;&#x4F5C;&#x4F1A;&#x5BF9;&#x8F66;&#x5B50;&#x8FD0;&#x52A8;&#x6709;&#x4EC0;&#x4E48;&#x5F71;&#x54CD;&#x3002;</p>
<p><img src="../images/d5a5576cc7a8ecdd070b7d699a9fef43.png" alt=""></p>
<p>&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x4EBA;&#x8FD9;&#x4E48;&#x9020;&#x8F66;&#xFF0C;&#x9020;&#x4E86;&#x4E2A;&#x6E38;&#x620F;&#x624B;&#x67C4;&#xFF0C;&#x624B;&#x67C4;&#x7684;&#x4E00;&#x4E2A;&#x8F74;&#x63A7;&#x5236;&#x7684;&#x662F;$0.3&#xD7;$&#x8F6C;&#x5411;&#x89D2;-&#x901F;&#x5EA6;&#xFF0C;&#x7136;&#x540E;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x8F74;&#x63A7;&#x5236;&#x7684;&#x662F;$2&#xD7;$&#x8F6C;&#x5411;&#x89D2;$+0.9&#xD7;$&#x8F66;&#x901F;&#xFF0C;&#x7406;&#x8BBA;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x901A;&#x8FC7;&#x8C03;&#x6574;&#x8FD9;&#x4E24;&#x4E2A;&#x65CB;&#x94AE;&#x4F60;&#x662F;&#x53EF;&#x4EE5;&#x5C06;&#x8F66;&#x5B50;&#x8C03;&#x6574;&#x5230;&#x4F60;&#x5E0C;&#x671B;&#x5F97;&#x5230;&#x7684;&#x89D2;&#x5EA6;&#x548C;&#x901F;&#x5EA6;&#xFF0C;&#x4F46;&#x8FD9;&#x6837;&#x6BD4;&#x5355;&#x72EC;&#x63A7;&#x5236;&#x8F6C;&#x5411;&#x89D2;&#x5EA6;&#xFF0C;&#x5206;&#x5F00;&#x72EC;&#x7ACB;&#x7684;&#x901F;&#x5EA6;&#x63A7;&#x5236;&#x8981;&#x96BE;&#x5F97;&#x591A;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x6B63;&#x4EA4;&#x5316;&#x7684;&#x6982;&#x5FF5;&#x662F;&#x6307;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x60F3;&#x51FA;&#x4E00;&#x4E2A;&#x7EF4;&#x5EA6;&#xFF0C;&#x8FD9;&#x4E2A;&#x7EF4;&#x5EA6;&#x4F60;&#x60F3;&#x505A;&#x7684;&#x662F;&#x63A7;&#x5236;&#x8F6C;&#x5411;&#x89D2;&#xFF0C;&#x8FD8;&#x6709;&#x53E6;&#x4E00;&#x4E2A;&#x7EF4;&#x5EA6;&#x6765;&#x63A7;&#x5236;&#x4F60;&#x7684;&#x901F;&#x5EA6;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x5C31;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x65CB;&#x94AE;&#x5C3D;&#x91CF;&#x53EA;&#x63A7;&#x5236;&#x8F6C;&#x5411;&#x89D2;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x65CB;&#x94AE;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x5F00;&#x8F66;&#x7684;&#x4F8B;&#x5B50;&#x91CC;&#x5176;&#x5B9E;&#x662F;&#x6CB9;&#x95E8;&#x548C;&#x5239;&#x8F66;&#x63A7;&#x5236;&#x4E86;&#x4F60;&#x7684;&#x901F;&#x5EA6;&#x3002;&#x4F46;&#x5982;&#x679C;&#x4F60;&#x6709;&#x4E00;&#x4E2A;&#x63A7;&#x5236;&#x65CB;&#x94AE;&#x5C06;&#x4E24;&#x8005;&#x6DF7;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x63A7;&#x5236;&#x88C5;&#x7F6E;&#x540C;&#x65F6;&#x5F71;&#x54CD;&#x4F60;&#x7684;&#x8F6C;&#x5411;&#x89D2;&#x548C;&#x901F;&#x5EA6;&#xFF0C;&#x540C;&#x65F6;&#x6539;&#x53D8;&#x4E86;&#x4E24;&#x4E2A;&#x6027;&#x8D28;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x5F88;&#x96BE;&#x4EE4;&#x4F60;&#x7684;&#x8F66;&#x5B50;&#x4EE5;&#x60F3;&#x8981;&#x7684;&#x901F;&#x5EA6;&#x548C;&#x89D2;&#x5EA6;&#x524D;&#x8FDB;&#x3002;&#x7136;&#x800C;&#x6B63;&#x4EA4;&#x5316;&#x4E4B;&#x540E;&#xFF0C;&#x6B63;&#x4EA4;&#x610F;&#x5473;&#x7740;&#x4E92;&#x6210;90&#x5EA6;&#x3002;&#x8BBE;&#x8BA1;&#x51FA;&#x6B63;&#x4EA4;&#x5316;&#x7684;&#x63A7;&#x5236;&#x88C5;&#x7F6E;&#xFF0C;&#x6700;&#x7406;&#x60F3;&#x7684;&#x60C5;&#x51B5;&#x662F;&#x548C;&#x4F60;&#x5B9E;&#x9645;&#x60F3;&#x63A7;&#x5236;&#x7684;&#x6027;&#x8D28;&#x4E00;&#x81F4;&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x8C03;&#x6574;&#x53C2;&#x6570;&#x65F6;&#x5C31;&#x5BB9;&#x6613;&#x5F97;&#x591A;&#x3002;&#x53EF;&#x4EE5;&#x5355;&#x72EC;&#x8C03;&#x6574;&#x8F6C;&#x5411;&#x89D2;&#xFF0C;&#x8FD8;&#x6709;&#x4F60;&#x7684;&#x6CB9;&#x95E8;&#x548C;&#x5239;&#x8F66;&#xFF0C;&#x4EE4;&#x8F66;&#x5B50;&#x4EE5;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x65B9;&#x5F0F;&#x8FD0;&#x52A8;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x8FD9;&#x4E0E;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6709;&#x4EC0;&#x4E48;&#x5173;&#x7CFB;&#x5462;&#xFF1F;&#x8981;&#x5F04;&#x597D;&#x4E00;&#x4E2A;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F60;&#x901A;&#x5E38;&#x9700;&#x8981;&#x8C03;&#x4F60;&#x7684;&#x7CFB;&#x7EDF;&#x7684;&#x65CB;&#x94AE;&#x3002;</p>
<p>&#x786E;&#x4FDD;&#x56DB;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x9996;&#x5148;&#xFF0C;&#x4F60;&#x901A;&#x5E38;&#x5FC5;&#x987B;&#x786E;&#x4FDD;&#x81F3;&#x5C11;&#x7CFB;&#x7EDF;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x5F97;&#x5230;&#x7684;&#x7ED3;&#x679C;&#x4E0D;&#x9519;&#xFF0C;&#x6240;&#x4EE5;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x7684;&#x8868;&#x73B0;&#x5FC5;&#x987B;&#x901A;&#x8FC7;&#x67D0;&#x79CD;&#x8BC4;&#x4F30;&#xFF0C;&#x8FBE;&#x5230;&#x80FD;&#x63A5;&#x53D7;&#x7684;&#x7A0B;&#x5EA6;&#xFF0C;&#x5BF9;&#x4E8E;&#x67D0;&#x4E9B;&#x5E94;&#x7528;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x610F;&#x5473;&#x7740;&#x8FBE;&#x5230;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x4F46;&#x8FD9;&#x53D6;&#x51B3;&#x4E8E;&#x4F60;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x4E0B;&#x5468;&#x66F4;&#x591A;&#x5730;&#x8C08;&#x8C08;&#x5982;&#x4F55;&#x4E0E;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x7684;&#x8868;&#x73B0;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x8868;&#x73B0;&#x4E0D;&#x9519;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x5C31;&#x5E0C;&#x671B;&#x7CFB;&#x7EDF;&#x4E5F;&#x80FD;&#x5728;&#x5F00;&#x53D1;&#x96C6;&#x4E0A;&#x6709;&#x597D;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x5E0C;&#x671B;&#x7CFB;&#x7EDF;&#x5728;&#x6D4B;&#x8BD5;&#x96C6;&#x4E0A;&#x4E5F;&#x6709;&#x597D;&#x7684;&#x8868;&#x73B0;&#x3002;&#x5728;&#x6700;&#x540E;&#xFF0C;&#x4F60;&#x5E0C;&#x671B;&#x7CFB;&#x7EDF;&#x5728;&#x6D4B;&#x8BD5;&#x96C6;&#x4E0A;&#x7CFB;&#x7EDF;&#x7684;&#x6210;&#x672C;&#x51FD;&#x6570;&#x5728;&#x5B9E;&#x9645;&#x4F7F;&#x7528;&#x4E2D;&#x8868;&#x73B0;&#x4EE4;&#x4EBA;&#x6EE1;&#x610F;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x4F60;&#x5E0C;&#x671B;&#x8FD9;&#x4E9B;&#x732B;&#x56FE;&#x7247;&#x5E94;&#x7528;&#x7684;&#x7528;&#x6237;&#x6EE1;&#x610F;&#x3002;</p>
<p><img src="../images/e43a775bf7328d50e9efd02f5ea8b43d.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x56DE;&#x5230;&#x7535;&#x89C6;&#x8C03;&#x8282;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7684;&#x7535;&#x89C6;&#x56FE;&#x50CF;&#x592A;&#x5BBD;&#x6216;&#x592A;&#x7A84;&#xFF0C;&#x4F60;&#x60F3;&#x8981;&#x4E00;&#x4E2A;&#x65CB;&#x94AE;&#x53BB;&#x8C03;&#x6574;&#xFF0C;&#x4F60;&#x53EF;&#x4E0D;&#x60F3;&#x8981;&#x4ED4;&#x7EC6;&#x8C03;&#x8282;&#x4E94;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x65CB;&#x94AE;&#xFF0C;&#x5B83;&#x4EEC;&#x4E5F;&#x4F1A;&#x5F71;&#x54CD;&#x522B;&#x7684;&#x56FE;&#x50CF;&#x6027;&#x8D28;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x65CB;&#x94AE;&#x53BB;&#x6539;&#x53D8;&#x7535;&#x89C6;&#x56FE;&#x50CF;&#x7684;&#x5BBD;&#x5EA6;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x7C7B;&#x4F3C;&#x5730;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7684;&#x7B97;&#x6CD5;&#x5728;&#x6210;&#x672C;&#x51FD;&#x6570;&#x4E0A;&#x4E0D;&#x80FD;&#x5F88;&#x597D;&#x5730;&#x62DF;&#x5408;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x4F60;&#x60F3;&#x8981;&#x4E00;&#x4E2A;&#x65CB;&#x94AE;&#xFF0C;&#x662F;&#x7684;&#x6211;&#x753B;&#x8FD9;&#x4E1C;&#x897F;&#x8868;&#x793A;&#x65CB;&#x94AE;&#xFF0C;&#x6216;&#x8005;&#x4E00;&#x7EC4;&#x7279;&#x5B9A;&#x7684;&#x65CB;&#x94AE;&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x786E;&#x4FDD;&#x4F60;&#x7684;&#x53EF;&#x4EE5;&#x8C03;&#x6574;&#x4F60;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x8BA9;&#x5B83;&#x5F88;&#x597D;&#x5730;&#x62DF;&#x5408;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x7528;&#x6765;&#x8C03;&#x8BD5;&#x7684;&#x65CB;&#x94AE;&#x662F;&#x4F60;&#x53EF;&#x80FD;&#x53EF;&#x4EE5;&#x8BAD;&#x7EC3;&#x66F4;&#x5927;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x6216;&#x8005;&#x53EF;&#x4EE5;&#x5207;&#x6362;&#x5230;&#x66F4;&#x597D;&#x7684;&#x4F18;&#x5316;&#x7B97;&#x6CD5;&#xFF0C;&#x6BD4;&#x5982;<strong>Adam</strong>&#x4F18;&#x5316;&#x7B97;&#x6CD5;&#xFF0C;&#x7B49;&#x7B49;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x672C;&#x5468;&#x548C;&#x4E0B;&#x5468;&#x8BA8;&#x8BBA;&#x4E00;&#x4E9B;&#x5176;&#x4ED6;&#x9009;&#x9879;&#x3002;</p>
<p>&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x53D1;&#x73B0;&#x7B97;&#x6CD5;&#x5BF9;&#x5F00;&#x53D1;&#x96C6;&#x7684;&#x62DF;&#x5408;&#x5F88;&#x5DEE;&#xFF0C;&#x90A3;&#x4E48;&#x5E94;&#x8BE5;&#x6709;&#x72EC;&#x7ACB;&#x7684;&#x4E00;&#x7EC4;&#x65CB;&#x94AE;&#xFF0C;&#x662F;&#x7684;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x753B;&#x5F97;&#x6BDB;&#x6BDB;&#x8E81;&#x8E81;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x65CB;&#x94AE;&#xFF0C;&#x4F60;&#x5E0C;&#x671B;&#x6709;&#x4E00;&#x7EC4;&#x72EC;&#x7ACB;&#x7684;&#x65CB;&#x94AE;&#x53BB;&#x8C03;&#x8BD5;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x4F60;&#x7684;&#x7B97;&#x6CD5;&#x5728;&#x5F00;&#x53D1;&#x96C6;&#x4E0A;&#x505A;&#x7684;&#x4E0D;&#x597D;&#xFF0C;&#x5B83;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x505A;&#x5F97;&#x5F88;&#x597D;&#xFF0C;&#x4F46;&#x5F00;&#x53D1;&#x96C6;&#x4E0D;&#x884C;&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x6709;&#x4E00;&#x7EC4;&#x6B63;&#x5219;&#x5316;&#x7684;&#x65CB;&#x94AE;&#x53EF;&#x4EE5;&#x8C03;&#x8282;&#xFF0C;&#x5C1D;&#x8BD5;&#x8BA9;&#x7CFB;&#x7EDF;&#x6EE1;&#x8DB3;&#x7B2C;&#x4E8C;&#x4E2A;&#x6761;&#x4EF6;&#x3002;&#x7C7B;&#x6BD4;&#x5230;&#x7535;&#x89C6;&#xFF0C;&#x5C31;&#x662F;&#x73B0;&#x5728;&#x4F60;&#x8C03;&#x597D;&#x4E86;&#x7535;&#x89C6;&#x7684;&#x5BBD;&#x5EA6;&#xFF0C;&#x5982;&#x679C;&#x56FE;&#x50CF;&#x7684;&#x9AD8;&#x5EA6;&#x4E0D;&#x592A;&#x5BF9;&#xFF0C;&#x4F60;&#x5C31;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x65CB;&#x94AE;&#x6765;&#x8C03;&#x8282;&#x7535;&#x89C6;&#x56FE;&#x50CF;&#x7684;&#x9AD8;&#x5EA6;&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x5E0C;&#x671B;&#x8FD9;&#x4E2A;&#x65CB;&#x94AE;&#x5C3D;&#x91CF;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x5230;&#x7535;&#x89C6;&#x7684;&#x5BBD;&#x5EA6;&#x3002;&#x589E;&#x5927;&#x8BAD;&#x7EC3;&#x96C6;&#x53EF;&#x4EE5;&#x662F;&#x53E6;&#x4E00;&#x4E2A;&#x53EF;&#x7528;&#x7684;&#x65CB;&#x94AE;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x4F60;&#x7684;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x66F4;&#x597D;&#x5730;&#x5F52;&#x7EB3;&#x5F00;&#x53D1;&#x96C6;&#x7684;&#x89C4;&#x5F8B;&#xFF0C;&#x73B0;&#x5728;&#x8C03;&#x597D;&#x4E86;&#x7535;&#x89C6;&#x56FE;&#x50CF;&#x7684;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#x3002;</p>
<p>&#x5982;&#x679C;&#x5B83;&#x4E0D;&#x7B26;&#x5408;&#x7B2C;&#x4E09;&#x4E2A;&#x6807;&#x51C6;&#x5462;&#xFF1F;&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x5728;&#x5F00;&#x53D1;&#x96C6;&#x4E0A;&#x505A;&#x7684;&#x5F88;&#x597D;&#xFF0C;&#x4F46;&#x6D4B;&#x8BD5;&#x96C6;&#x4E0A;&#x505A;&#x5F97;&#x4E0D;&#x597D;&#x5462;&#xFF1F;&#x5982;&#x679C;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x9700;&#x8981;&#x8C03;&#x7684;&#x65CB;&#x94AE;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x66F4;&#x5927;&#x7684;&#x5F00;&#x53D1;&#x96C6;&#x3002;&#x56E0;&#x4E3A;&#x5982;&#x679C;&#x5B83;&#x5728;&#x5F00;&#x53D1;&#x96C6;&#x4E0A;&#x505A;&#x7684;&#x4E0D;&#x9519;&#xFF0C;&#x4F46;&#x6D4B;&#x8BD5;&#x96C6;&#x4E0D;&#x884C;&#x8FD9;&#x53EF;&#x80FD;&#x610F;&#x5473;&#x7740;&#x4F60;&#x5BF9;&#x5F00;&#x53D1;&#x96C6;&#x8FC7;&#x62DF;&#x5408;&#x4E86;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x5F80;&#x56DE;&#x9000;&#x4E00;&#x6B65;&#xFF0C;&#x4F7F;&#x7528;&#x66F4;&#x5927;&#x7684;&#x5F00;&#x53D1;&#x96C6;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x5982;&#x679C;&#x5B83;&#x5728;&#x6D4B;&#x8BD5;&#x96C6;&#x4E0A;&#x505A;&#x5F97;&#x5F88;&#x597D;&#xFF0C;&#x4F46;&#x65E0;&#x6CD5;&#x7ED9;&#x4F60;&#x7684;&#x732B;&#x56FE;&#x7247;&#x5E94;&#x7528;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x826F;&#x597D;&#x7684;&#x4F53;&#x9A8C;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4F60;&#x9700;&#x8981;&#x56DE;&#x53BB;&#xFF0C;&#x6539;&#x53D8;&#x5F00;&#x53D1;&#x96C6;&#x6216;&#x6210;&#x672C;&#x51FD;&#x6570;&#x3002;&#x56E0;&#x4E3A;&#x5982;&#x679C;&#x6839;&#x636E;&#x67D0;&#x4E2A;&#x6210;&#x672C;&#x51FD;&#x6570;&#xFF0C;&#x7CFB;&#x7EDF;&#x5728;&#x6D4B;&#x8BD5;&#x96C6;&#x4E0A;&#x505A;&#x7684;&#x5F88;&#x597D;&#xFF0C;&#x4F46;&#x5B83;&#x65E0;&#x6CD5;&#x53CD;&#x6620;&#x4F60;&#x7684;&#x7B97;&#x6CD5;&#x5728;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x4E2D;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x8981;&#x4E48;&#x4F60;&#x7684;&#x5F00;&#x53D1;&#x96C6;&#x5206;&#x5E03;&#x8BBE;&#x7F6E;&#x4E0D;&#x6B63;&#x786E;&#xFF0C;&#x8981;&#x4E48;&#x4F60;&#x7684;&#x6210;&#x672C;&#x51FD;&#x6570;&#x6D4B;&#x91CF;&#x7684;&#x6307;&#x6807;&#x4E0D;&#x5BF9;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5F88;&#x5FEB;&#x4F1A;&#x9010;&#x4E00;&#x8BB2;&#x5230;&#x8FD9;&#x4E9B;&#x4F8B;&#x5B50;&#xFF0C;&#x6211;&#x4EEC;&#x4EE5;&#x540E;&#x4F1A;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x8FD9;&#x4E9B;&#x7279;&#x5B9A;&#x7684;&#x65CB;&#x94AE;&#xFF0C;&#x5728;&#x672C;&#x5468;&#x548C;&#x4E0B;&#x5468;&#x665A;&#x4E9B;&#x65F6;&#x5019;&#x4F1A;&#x4ECB;&#x7ECD;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x73B0;&#x5728;&#x4F60;&#x65E0;&#x6CD5;&#x7406;&#x89E3;&#x5168;&#x90E8;&#x7EC6;&#x8282;&#xFF0C;&#x522B;&#x62C5;&#x5FC3;&#xFF0C;&#x4F46;&#x6211;&#x5E0C;&#x671B;&#x4F60;&#x4EEC;&#x5BF9;&#x8FD9;&#x79CD;&#x6B63;&#x4EA4;&#x5316;&#x8FC7;&#x7A0B;&#x6709;&#x4E2A;&#x6982;&#x5FF5;&#x3002;&#x4F60;&#x8981;&#x975E;&#x5E38;&#x6E05;&#x695A;&#xFF0C;&#x5230;&#x5E95;&#x662F;&#x56DB;&#x4E2A;&#x95EE;&#x9898;&#x4E2D;&#x7684;&#x54EA;&#x4E00;&#x4E2A;&#xFF0C;&#x77E5;&#x9053;&#x4F60;&#x53EF;&#x4EE5;&#x8C03;&#x8282;&#x54EA;&#x4E9B;&#x4E0D;&#x540C;&#x7684;&#x4E1C;&#x897F;&#x5C1D;&#x8BD5;&#x89E3;&#x51B3;&#x90A3;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<p><img src="../images/227cb967edc12a61a8c62e50f759fa64.png" alt=""></p>
<p>&#x5F53;&#x6211;&#x8BAD;&#x7EC3;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x65F6;&#xFF0C;&#x6211;&#x4E00;&#x822C;&#x4E0D;&#x7528;<strong>early stopping</strong>&#xFF0C;&#x8FD9;&#x4E2A;&#x6280;&#x5DE7;&#x4E5F;&#x8FD8;&#x4E0D;&#x9519;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x8FD9;&#x4E48;&#x5E72;&#x3002;&#x4F46;&#x4E2A;&#x4EBA;&#x800C;&#x8A00;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x7528;<strong>early stopping</strong>&#x6709;&#x70B9;&#x96BE;&#x4EE5;&#x5206;&#x6790;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x65CB;&#x94AE;&#x4F1A;&#x540C;&#x65F6;&#x5F71;&#x54CD;&#x4F60;&#x5BF9;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x62DF;&#x5408;&#xFF0C;&#x56E0;&#x4E3A;&#x5982;&#x679C;&#x4F60;&#x65E9;&#x671F;&#x505C;&#x6B62;&#xFF0C;&#x90A3;&#x4E48;&#x5BF9;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x62DF;&#x5408;&#x5C31;&#x4E0D;&#x592A;&#x597D;&#xFF0C;&#x4F46;&#x5B83;&#x540C;&#x65F6;&#x4E5F;&#x7528;&#x6765;&#x6539;&#x5584;&#x5F00;&#x53D1;&#x96C6;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x65CB;&#x94AE;&#x6CA1;&#x90A3;&#x4E48;&#x6B63;&#x4EA4;&#x5316;&#x3002;&#x56E0;&#x4E3A;&#x5B83;&#x540C;&#x65F6;&#x5F71;&#x54CD;&#x4E24;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x5C31;&#x50CF;&#x4E00;&#x4E2A;&#x65CB;&#x94AE;&#x540C;&#x65F6;&#x5F71;&#x54CD;&#x7535;&#x89C6;&#x56FE;&#x50CF;&#x7684;&#x5BBD;&#x5EA6;&#x548C;&#x9AD8;&#x5EA6;&#x3002;&#x4E0D;&#x662F;&#x8BF4;&#x8FD9;&#x6837;&#x5C31;&#x4E0D;&#x8981;&#x7528;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x7528;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#x3002;&#x4F46;&#x5982;&#x679C;&#x4F60;&#x6709;&#x66F4;&#x591A;&#x7684;&#x6B63;&#x4EA4;&#x5316;&#x63A7;&#x5236;&#xFF0C;&#x6BD4;&#x5982;&#x6211;&#x8FD9;&#x91CC;&#x5199;&#x51FA;&#x7684;&#x5176;&#x4ED6;&#x624B;&#x6BB5;&#xFF0C;&#x7528;&#x8FD9;&#x4E9B;&#x624B;&#x6BB5;&#x8C03;&#x7F51;&#x7EDC;&#x4F1A;&#x7B80;&#x5355;&#x4E0D;&#x5C11;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x6211;&#x5E0C;&#x671B;&#x4F60;&#x4EEC;&#x5BF9;&#x6B63;&#x4EA4;&#x5316;&#x7684;&#x610F;&#x4E49;&#x6709;&#x70B9;&#x6982;&#x5FF5;&#xFF0C;&#x5C31;&#x50CF;&#x4F60;&#x770B;&#x7535;&#x89C6;&#x56FE;&#x50CF;&#x4E00;&#x6837;&#x3002;&#x5982;&#x679C;&#x4F60;&#x8BF4;&#xFF0C;&#x6211;&#x7684;&#x7535;&#x89C6;&#x56FE;&#x50CF;&#x592A;&#x5BBD;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x8981;&#x8C03;&#x6574;&#x8FD9;&#x4E2A;&#x65CB;&#x94AE;&#xFF08;&#x5BBD;&#x5EA6;&#x65CB;&#x94AE;&#xFF09;&#x3002;&#x6216;&#x8005;&#x5B83;&#x592A;&#x9AD8;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x8981;&#x8C03;&#x6574;&#x90A3;&#x4E2A;&#x65CB;&#x94AE;&#xFF08;&#x9AD8;&#x5EA6;&#x65CB;&#x94AE;&#xFF09;&#x3002;&#x6216;&#x8005;&#x5B83;&#x592A;&#x68AF;&#x5F62;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x8981;&#x8C03;&#x6574;&#x8FD9;&#x4E2A;&#x65CB;&#x94AE;&#xFF08;&#x68AF;&#x5F62;&#x89D2;&#x5EA6;&#x65CB;&#x94AE;&#xFF09;&#xFF0C;&#x8FD9;&#x5C31;&#x5F88;&#x597D;&#x3002;</p>
<p>&#x5728;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x53EF;&#x4EE5;&#x89C2;&#x5BDF;&#x4F60;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x7136;&#x540E;&#x8BF4;&#x8FD9;&#x4E00;&#x90E8;&#x5206;&#x662F;&#x9519;&#x7684;&#xFF0C;&#x5B83;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x505A;&#x7684;&#x4E0D;&#x597D;&#x3001;&#x5728;&#x5F00;&#x53D1;&#x96C6;&#x4E0A;&#x505A;&#x7684;&#x4E0D;&#x597D;&#x3001;&#x5B83;&#x5728;&#x6D4B;&#x8BD5;&#x96C6;&#x4E0A;&#x505A;&#x7684;&#x4E0D;&#x597D;&#xFF0C;&#x6216;&#x8005;&#x5B83;&#x5728;&#x6D4B;&#x8BD5;&#x96C6;&#x4E0A;&#x505A;&#x7684;&#x4E0D;&#x9519;&#xFF0C;&#x4F46;&#x5728;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x4E2D;&#x4E0D;&#x597D;&#xFF0C;&#x8FD9;&#x5C31;&#x5F88;&#x597D;&#x3002;&#x5FC5;&#x987B;&#x5F04;&#x6E05;&#x695A;&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#x5730;&#x65B9;&#x51FA;&#x95EE;&#x9898;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x521A;&#x597D;&#x6709;&#x5BF9;&#x5E94;&#x7684;&#x65CB;&#x94AE;&#xFF0C;&#x6216;&#x8005;&#x4E00;&#x7EC4;&#x5BF9;&#x5E94;&#x7684;&#x65CB;&#x94AE;&#xFF0C;&#x521A;&#x597D;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x90A3;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x90A3;&#x4E2A;&#x9650;&#x5236;&#x4E86;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7CFB;&#x7EDF;&#x6027;&#x80FD;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x8FD9;&#x5468;&#x548C;&#x4E0B;&#x5468;&#x8981;&#x8BB2;&#x5230;&#x7684;&#xFF0C;&#x5982;&#x4F55;&#x8BCA;&#x65AD;&#x51FA;&#x7CFB;&#x7EDF;&#x6027;&#x80FD;&#x74F6;&#x9888;&#x5230;&#x5E95;&#x5728;&#x54EA;&#x3002;&#x8FD8;&#x6709;&#x627E;&#x5230;&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x7684;&#x4E00;&#x7EC4;&#x7279;&#x5B9A;&#x7684;&#x65CB;&#x94AE;&#x6765;&#x8C03;&#x6574;&#x4F60;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x6765;&#x6539;&#x5584;&#x5B83;&#x7279;&#x5B9A;&#x65B9;&#x9762;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x8BE6;&#x7EC6;&#x8BB2;&#x8BB2;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x5427;&#x3002;</p>
<h3 id="13-&#x5355;&#x4E00;&#x6570;&#x5B57;&#x8BC4;&#x4F30;&#x6307;&#x6807;&#xFF08;single-number-evaluation-metric&#xFF09;">1.3 &#x5355;&#x4E00;&#x6570;&#x5B57;&#x8BC4;&#x4F30;&#x6307;&#x6807;&#xFF08;Single number evaluation metric&#xFF09;</h3>
<p>&#x65E0;&#x8BBA;&#x4F60;&#x662F;&#x8C03;&#x6574;&#x8D85;&#x53C2;&#x6570;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x5C1D;&#x8BD5;&#x4E0D;&#x540C;&#x7684;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#xFF0C;&#x6216;&#x8005;&#x5728;&#x642D;&#x5EFA;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7CFB;&#x7EDF;&#x65F6;&#x5C1D;&#x8BD5;&#x4E0D;&#x540C;&#x624B;&#x6BB5;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;&#x4E00;&#x4E2A;&#x5355;&#x5B9E;&#x6570;&#x8BC4;&#x4F30;&#x6307;&#x6807;&#xFF0C;&#x4F60;&#x7684;&#x8FDB;&#x5C55;&#x4F1A;&#x5FEB;&#x5F97;&#x591A;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x544A;&#x8BC9;&#x4F60;&#xFF0C;&#x65B0;&#x5C1D;&#x8BD5;&#x7684;&#x624B;&#x6BB5;&#x6BD4;&#x4E4B;&#x524D;&#x7684;&#x624B;&#x6BB5;&#x597D;&#x8FD8;&#x662F;&#x5DEE;&#x3002;&#x6240;&#x4EE5;&#x5F53;&#x56E2;&#x961F;&#x5F00;&#x59CB;&#x8FDB;&#x884C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x9879;&#x76EE;&#x65F6;&#xFF0C;&#x6211;&#x7ECF;&#x5E38;&#x63A8;&#x8350;&#x4ED6;&#x4EEC;&#x4E3A;&#x95EE;&#x9898;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x5355;&#x5B9E;&#x6570;&#x8BC4;&#x4F30;&#x6307;&#x6807;&#x3002;</p>
<p><img src="../images/24144bd15bb01226dc596457e6e6cfcb.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x4F60;&#x4E4B;&#x524D;&#x542C;&#x8FC7;&#x6211;&#x8BF4;&#x8FC7;&#xFF0C;&#x5E94;&#x7528;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x7ECF;&#x9A8C;&#x6027;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x6709;&#x4E00;&#x4E2A;&#x60F3;&#x6CD5;&#xFF0C;&#x7F16;&#x7A0B;&#x5E8F;&#xFF0C;&#x8DD1;&#x5B9E;&#x9A8C;&#xFF0C;&#x770B;&#x770B;&#x6548;&#x679C;&#x5982;&#x4F55;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x5B9E;&#x9A8C;&#x7ED3;&#x679C;&#x6765;&#x6539;&#x5584;&#x4F60;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x7136;&#x540E;&#x7EE7;&#x7EED;&#x8D70;&#x8FD9;&#x4E2A;&#x5FAA;&#x73AF;&#xFF0C;&#x4E0D;&#x65AD;&#x6539;&#x8FDB;&#x4F60;&#x7684;&#x7B97;&#x6CD5;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x8BF4;&#x5BF9;&#x4E8E;&#x4F60;&#x7684;&#x732B;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x4E4B;&#x524D;&#x4F60;&#x642D;&#x5EFA;&#x4E86;&#x67D0;&#x4E2A;&#x5206;&#x7C7B;&#x5668;$A$&#xFF0C;&#x901A;&#x8FC7;&#x6539;&#x53D8;&#x8D85;&#x53C2;&#x6570;&#xFF0C;&#x8FD8;&#x6709;&#x6539;&#x53D8;&#x8BAD;&#x7EC3;&#x96C6;&#x7B49;&#x624B;&#x6BB5;&#xFF0C;&#x4F60;&#x73B0;&#x5728;&#x8BAD;&#x7EC3;&#x51FA;&#x6765;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5206;&#x7C7B;&#x5668;B&#xFF0C;&#x6240;&#x4EE5;&#x8BC4;&#x4F30;&#x4F60;&#x7684;&#x5206;&#x7C7B;&#x5668;&#x7684;&#x4E00;&#x4E2A;&#x5408;&#x7406;&#x65B9;&#x5F0F;&#x662F;&#x89C2;&#x5BDF;&#x5B83;&#x7684;&#x67E5;&#x51C6;&#x7387;&#xFF08;<strong>precision</strong>&#xFF09;&#x548C;&#x67E5;&#x5168;&#x7387;&#xFF08;<strong>recall</strong>&#xFF09;&#x3002;</p>
<p><img src="../images/e75299b34b8ccb565a1566d2a515f597.png" alt=""></p>
<p>&#x67E5;&#x51C6;&#x7387;&#x548C;&#x67E5;&#x5168;&#x7387;&#x7684;&#x786E;&#x5207;&#x7EC6;&#x8282;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x6765;&#x8BF4;&#x4E0D;&#x592A;&#x91CD;&#x8981;&#x3002;&#x4F46;&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x67E5;&#x51C6;&#x7387;&#x7684;&#x5B9A;&#x4E49;&#x662F;&#x5728;&#x4F60;&#x7684;&#x5206;&#x7C7B;&#x5668;&#x6807;&#x8BB0;&#x4E3A;&#x732B;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6709;&#x591A;&#x5C11;&#x771F;&#x7684;&#x662F;&#x732B;&#x3002;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x5206;&#x7C7B;&#x5668;$A$&#x6709;95%&#x7684;&#x67E5;&#x51C6;&#x7387;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4F60;&#x7684;&#x5206;&#x7C7B;&#x5668;&#x8BF4;&#x8FD9;&#x56FE;&#x6709;&#x732B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6709;95%&#x7684;&#x673A;&#x4F1A;&#x771F;&#x7684;&#x662F;&#x732B;&#x3002;</p>
<p>&#x67E5;&#x5168;&#x7387;&#x5C31;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;&#x6240;&#x6709;&#x771F;&#x732B;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x4F60;&#x7684;&#x5206;&#x7C7B;&#x5668;&#x6B63;&#x786E;&#x8BC6;&#x522B;&#x51FA;&#x4E86;&#x591A;&#x5C11;&#x767E;&#x5206;&#x6BD4;&#x3002;&#x5B9E;&#x9645;&#x4E3A;&#x732B;&#x7684;&#x56FE;&#x7247;&#x4E2D;&#xFF0C;&#x6709;&#x591A;&#x5C11;&#x88AB;&#x7CFB;&#x7EDF;&#x8BC6;&#x522B;&#x51FA;&#x6765;&#xFF1F;&#x5982;&#x679C;&#x5206;&#x7C7B;&#x5668;$A$&#x67E5;&#x5168;&#x7387;&#x662F;90%&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5BF9;&#x4E8E;&#x6240;&#x6709;&#x7684;&#x56FE;&#x50CF;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x4F60;&#x7684;&#x5F00;&#x53D1;&#x96C6;&#x90FD;&#x662F;&#x771F;&#x7684;&#x732B;&#x56FE;&#xFF0C;&#x5206;&#x7C7B;&#x5668;$A$&#x51C6;&#x786E;&#x5730;&#x5206;&#x8FA8;&#x51FA;&#x4E86;&#x5176;&#x4E2D;&#x7684;90%&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x5173;&#x4E8E;&#x67E5;&#x51C6;&#x7387;&#x548C;&#x67E5;&#x5168;&#x7387;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x4E0D;&#x7528;&#x60F3;&#x592A;&#x591A;&#x3002;&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#xFF0C;&#x67E5;&#x51C6;&#x7387;&#x548C;&#x67E5;&#x5168;&#x7387;&#x4E4B;&#x95F4;&#x5F80;&#x5F80;&#x9700;&#x8981;&#x6298;&#x8877;&#xFF0C;&#x4E24;&#x4E2A;&#x6307;&#x6807;&#x90FD;&#x8981;&#x987E;&#x53CA;&#x5230;&#x3002;&#x4F60;&#x5E0C;&#x671B;&#x5F97;&#x5230;&#x7684;&#x6548;&#x679C;&#x662F;&#xFF0C;&#x5F53;&#x4F60;&#x7684;&#x5206;&#x7C7B;&#x5668;&#x8BF4;&#x67D0;&#x4E2A;&#x4E1C;&#x897F;&#x662F;&#x732B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6709;&#x5F88;&#x5927;&#x7684;&#x673A;&#x4F1A;&#x5B83;&#x771F;&#x7684;&#x662F;&#x4E00;&#x53EA;&#x732B;&#xFF0C;&#x4F46;&#x5BF9;&#x4E8E;&#x6240;&#x6709;&#x662F;&#x732B;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x4F60;&#x4E5F;&#x5E0C;&#x671B;&#x7CFB;&#x7EDF;&#x80FD;&#x591F;&#x5C06;&#x5927;&#x90E8;&#x5206;&#x5206;&#x7C7B;&#x4E3A;&#x732B;&#xFF0C;&#x6240;&#x4EE5;&#x7528;&#x67E5;&#x51C6;&#x7387;&#x548C;&#x67E5;&#x5168;&#x7387;&#x6765;&#x8BC4;&#x4F30;&#x5206;&#x7C7B;&#x5668;&#x662F;&#x6BD4;&#x8F83;&#x5408;&#x7406;&#x7684;&#x3002;</p>
<p>&#x4F46;&#x4F7F;&#x7528;&#x67E5;&#x51C6;&#x7387;&#x548C;&#x67E5;&#x5168;&#x7387;&#x4F5C;&#x4E3A;&#x8BC4;&#x4F30;&#x6307;&#x6807;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6709;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x679C;&#x5206;&#x7C7B;&#x5668;$A$&#x5728;&#x67E5;&#x5168;&#x7387;&#x4E0A;&#x8868;&#x73B0;&#x66F4;&#x597D;&#xFF0C;&#x5206;&#x7C7B;&#x5668;$B$&#x5728;&#x67E5;&#x51C6;&#x7387;&#x4E0A;&#x8868;&#x73B0;&#x66F4;&#x597D;&#xFF0C;&#x4F60;&#x5C31;&#x65E0;&#x6CD5;&#x5224;&#x65AD;&#x54EA;&#x4E2A;&#x5206;&#x7C7B;&#x5668;&#x66F4;&#x597D;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5C1D;&#x8BD5;&#x4E86;&#x5F88;&#x591A;&#x4E0D;&#x540C;&#x60F3;&#x6CD5;&#xFF0C;&#x5F88;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x8D85;&#x53C2;&#x6570;&#xFF0C;&#x4F60;&#x5E0C;&#x671B;&#x80FD;&#x591F;&#x5FEB;&#x901F;&#x8BD5;&#x9A8C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x4E24;&#x4E2A;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x4E5F;&#x8BB8;&#x662F;&#x5341;&#x51E0;&#x4E2A;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x5FEB;&#x901F;&#x9009;&#x51FA;&#x201C;&#x6700;&#x597D;&#x7684;&#x201D;&#x90A3;&#x4E2A;&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x53EF;&#x4EE5;&#x4ECE;&#x90A3;&#x91CC;&#x51FA;&#x53D1;&#x518D;&#x8FED;&#x4EE3;&#x3002;&#x5982;&#x679C;&#x6709;&#x4E24;&#x4E2A;&#x8BC4;&#x4F30;&#x6307;&#x6807;&#xFF0C;&#x5C31;&#x5F88;&#x96BE;&#x53BB;&#x5FEB;&#x901F;&#x5730;&#x4E8C;&#x4E2D;&#x9009;&#x4E00;&#x6216;&#x8005;&#x5341;&#x4E2D;&#x9009;&#x4E00;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x5E76;&#x4E0D;&#x63A8;&#x8350;&#x4F7F;&#x7528;&#x4E24;&#x4E2A;&#x8BC4;&#x4F30;&#x6307;&#x6807;&#xFF0C;&#x67E5;&#x51C6;&#x7387;&#x548C;&#x67E5;&#x5168;&#x7387;&#x6765;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x5206;&#x7C7B;&#x5668;&#x3002;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x8BC4;&#x4F30;&#x6307;&#x6807;&#xFF0C;&#x80FD;&#x591F;&#x7ED3;&#x5408;&#x67E5;&#x51C6;&#x7387;&#x548C;&#x67E5;&#x5168;&#x7387;&#x3002;</p>
<p><img src="../images/02f4810d07913df9cf8b80e455c7d3aa.png" alt=""></p>
<p>&#x5728;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6587;&#x732E;&#x4E2D;&#xFF0C;&#x7ED3;&#x5408;&#x67E5;&#x51C6;&#x7387;&#x548C;&#x67E5;&#x5168;&#x7387;&#x7684;&#x6807;&#x51C6;&#x65B9;&#x6CD5;&#x662F;&#x6240;&#x8C13;&#x7684;$F_1$&#x5206;&#x6570;&#xFF0C;$F_1$&#x5206;&#x6570;&#x7684;&#x7EC6;&#x8282;&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#x3002;&#x4F46;&#x975E;&#x6B63;&#x5F0F;&#x7684;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x8FD9;&#x662F;&#x67E5;&#x51C6;&#x7387;$P$&#x548C;&#x67E5;&#x5168;&#x7387;$R$&#x7684;&#x5E73;&#x5747;&#x503C;&#x3002;&#x6B63;&#x5F0F;&#x6765;&#x770B;&#xFF0C;$F_1$&#x5206;&#x6570;&#x7684;&#x5B9A;&#x4E49;&#x662F;&#x8FD9;&#x4E2A;&#x516C;&#x5F0F;&#xFF1A;$\frac{2}{\frac{1}{P} + \frac{1}{R}}$</p>
<p>&#x5728;&#x6570;&#x5B66;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x53EB;&#x505A;&#x67E5;&#x51C6;&#x7387;$P$&#x548C;&#x67E5;&#x5168;&#x7387;$R$&#x7684;&#x8C03;&#x548C;&#x5E73;&#x5747;&#x6570;&#x3002;&#x4F46;&#x975E;&#x6B63;&#x5F0F;&#x6765;&#x8BF4;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x5B83;&#x770B;&#x6210;&#x662F;&#x67D0;&#x79CD;&#x67E5;&#x51C6;&#x7387;&#x548C;&#x67E5;&#x5168;&#x7387;&#x7684;&#x5E73;&#x5747;&#x503C;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x4F60;&#x7B97;&#x7684;&#x4E0D;&#x662F;&#x76F4;&#x63A5;&#x7684;&#x7B97;&#x672F;&#x5E73;&#x5747;&#xFF0C;&#x800C;&#x662F;&#x7528;&#x8FD9;&#x4E2A;&#x516C;&#x5F0F;&#x5B9A;&#x4E49;&#x7684;&#x8C03;&#x548C;&#x5E73;&#x5747;&#x3002;&#x8FD9;&#x4E2A;&#x6307;&#x6807;&#x5728;&#x6743;&#x8861;&#x67E5;&#x51C6;&#x7387;&#x548C;&#x67E5;&#x5168;&#x7387;&#x65F6;&#x6709;&#x4E00;&#x4E9B;&#x4F18;&#x52BF;&#x3002;</p>
<p><img src="../images/e6c1e59416b60745145b91e87fda5ecf.png" alt=""></p>
<p>&#x4F46;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x9A6C;&#x4E0A;&#x770B;&#x51FA;&#xFF0C;&#x5206;&#x7C7B;&#x5668;$A$&#x7684;$F_1$&#x5206;&#x6570;&#x66F4;&#x9AD8;&#x3002;&#x5047;&#x8BBE;$F_1$&#x5206;&#x6570;&#x662F;&#x7ED3;&#x5408;&#x67E5;&#x51C6;&#x7387;&#x548C;&#x67E5;&#x5168;&#x7387;&#x7684;&#x5408;&#x7406;&#x65B9;&#x5F0F;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x9009;&#x51FA;&#x5206;&#x7C7B;&#x5668;$A$&#xFF0C;&#x6DD8;&#x6C70;&#x5206;&#x7C7B;&#x5668;$B$&#x3002;</p>
<p><img src="../images/1430998715d7053c88e32a35e495574b.png" alt=""></p>
<p>&#x6211;&#x53D1;&#x73B0;&#x5F88;&#x591A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x56E2;&#x961F;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x5B9A;&#x4E49;&#x660E;&#x786E;&#x7684;&#x5F00;&#x53D1;&#x96C6;&#x7528;&#x6765;&#x6D4B;&#x91CF;&#x67E5;&#x51C6;&#x7387;&#x548C;&#x67E5;&#x5168;&#x7387;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x5355;&#x4E00;&#x6570;&#x503C;&#x8BC4;&#x4F30;&#x6307;&#x6807;&#xFF0C;&#x6709;&#x65F6;&#x6211;&#x53EB;&#x5355;&#x5B9E;&#x6570;&#x8BC4;&#x4F30;&#x6307;&#x6807;&#xFF0C;&#x80FD;&#x8BA9;&#x4F60;&#x5FEB;&#x901F;&#x5224;&#x65AD;&#x5206;&#x7C7B;&#x5668;$A$&#x6216;&#x8005;&#x5206;&#x7C7B;&#x5668;$B$&#x66F4;&#x597D;&#x3002;&#x6240;&#x4EE5;&#x6709;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x5F00;&#x53D1;&#x96C6;&#xFF0C;&#x52A0;&#x4E0A;&#x5355;&#x5B9E;&#x6570;&#x8BC4;&#x4F30;&#x6307;&#x6807;&#xFF0C;&#x4F60;&#x7684;&#x8FED;&#x4EE3;&#x901F;&#x5EA6;&#x80AF;&#x5B9A;&#x4F1A;&#x5F88;&#x5FEB;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x52A0;&#x901F;&#x6539;&#x8FDB;&#x60A8;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x7684;&#x8FED;&#x4EE3;&#x8FC7;&#x7A0B;&#x3002;</p>
<p><img src="../images/cb92cdcf31720499a96ef39447bc80f3.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x6765;&#x770B;&#x53E6;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5047;&#x8BBE;&#x4F60;&#x5728;&#x5F00;&#x53D1;&#x4E00;&#x4E2A;&#x732B;&#x5E94;&#x7528;&#x6765;&#x670D;&#x52A1;&#x56DB;&#x4E2A;&#x5730;&#x7406;&#x5927;&#x533A;&#x7684;&#x7231;&#x732B;&#x4EBA;&#x58EB;&#xFF0C;&#x7F8E;&#x56FD;&#x3001;&#x4E2D;&#x56FD;&#x3001;&#x5370;&#x5EA6;&#x8FD8;&#x6709;&#x4E16;&#x754C;&#x5176;&#x4ED6;&#x5730;&#x533A;&#x3002;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x4F60;&#x7684;&#x4E24;&#x4E2A;&#x5206;&#x7C7B;&#x5668;&#x5728;&#x6765;&#x81EA;&#x56DB;&#x4E2A;&#x5730;&#x7406;&#x5927;&#x533A;&#x7684;&#x6570;&#x636E;&#x4E2D;&#x5F97;&#x5230;&#x4E86;&#x4E0D;&#x540C;&#x7684;&#x9519;&#x8BEF;&#x7387;&#xFF0C;&#x6BD4;&#x5982;&#x7B97;&#x6CD5;$A$&#x5728;&#x7F8E;&#x56FD;&#x7528;&#x6237;&#x4E0A;&#x4F20;&#x7684;&#x56FE;&#x7247;&#x4E2D;&#x8FBE;&#x5230;&#x4E86;3%&#x9519;&#x8BEF;&#x7387;&#xFF0C;&#x7B49;&#x7B49;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x8DDF;&#x8E2A;&#x4E00;&#x4E0B;&#xFF0C;&#x4F60;&#x7684;&#x5206;&#x7C7B;&#x5668;&#x5728;&#x4E0D;&#x540C;&#x5E02;&#x573A;&#x548C;&#x5730;&#x7406;&#x5927;&#x533A;&#x4E2D;&#x7684;&#x8868;&#x73B0;&#x5E94;&#x8BE5;&#x662F;&#x6709;&#x7528;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x901A;&#x8FC7;&#x8DDF;&#x8E2A;&#x56DB;&#x4E2A;&#x6570;&#x5B57;&#xFF0C;&#x5F88;&#x96BE;&#x626B;&#x4E00;&#x773C;&#x8FD9;&#x4E9B;&#x6570;&#x503C;&#x5C31;&#x5FEB;&#x901F;&#x5224;&#x65AD;&#x7B97;&#x6CD5;$A$&#x6216;&#x7B97;&#x6CD5;$B$&#x54EA;&#x4E2A;&#x66F4;&#x597D;&#x3002;&#x5982;&#x679C;&#x4F60;&#x6D4B;&#x8BD5;&#x5F88;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x90A3;&#x4E48;&#x770B;&#x7740;&#x90A3;&#x4E48;&#x591A;&#x6570;&#x5B57;&#xFF0C;&#x7136;&#x540E;&#x5FEB;&#x901F;&#x9009;&#x4E00;&#x4E2A;&#x6700;&#x4F18;&#x662F;&#x5F88;&#x96BE;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6211;&#x5EFA;&#x8BAE;&#xFF0C;&#x9664;&#x4E86;&#x8DDF;&#x8E2A;&#x5206;&#x7C7B;&#x5668;&#x5728;&#x56DB;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x5730;&#x7406;&#x5927;&#x533A;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x4E5F;&#x8981;&#x7B97;&#x7B97;&#x5E73;&#x5747;&#x503C;&#x3002;&#x5047;&#x8BBE;&#x5E73;&#x5747;&#x8868;&#x73B0;&#x662F;&#x4E00;&#x4E2A;&#x5408;&#x7406;&#x7684;&#x5355;&#x5B9E;&#x6570;&#x8BC4;&#x4F30;&#x6307;&#x6807;&#xFF0C;&#x901A;&#x8FC7;&#x8BA1;&#x7B97;&#x5E73;&#x5747;&#x503C;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x5224;&#x65AD;&#x3002;</p>
<p><img src="../images/d16788ba017b04733720dfe7969ef838.png" alt=""></p>
<p>&#x770B;&#x8D77;&#x6765;&#x7B97;&#x6CD5;$C$&#x7684;&#x5E73;&#x5747;&#x9519;&#x8BEF;&#x7387;&#x6700;&#x4F4E;&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x7528;&#x90A3;&#x4E2A;&#x7B97;&#x6CD5;&#x3002;&#x4F60;&#x5FC5;&#x987B;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x7B97;&#x6CD5;&#xFF0C;&#x7136;&#x540E;&#x4E0D;&#x65AD;&#x8FED;&#x4EE3;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#x5F80;&#x5F80;&#x662F;&#x4F60;&#x6709;&#x4E00;&#x4E2A;&#x60F3;&#x6CD5;&#xFF0C;&#x4F60;&#x5C1D;&#x8BD5;&#x5B9E;&#x73B0;&#x5B83;&#xFF0C;&#x770B;&#x770B;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x597D;&#x4E0D;&#x597D;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x672C;&#x89C6;&#x9891;&#x4ECB;&#x7ECD;&#x7684;&#x662F;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x5355;&#x5B9E;&#x6570;&#x8BC4;&#x4F30;&#x6307;&#x6807;&#x771F;&#x7684;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x4F60;&#x7684;&#x6548;&#x7387;&#xFF0C;&#x6216;&#x8005;&#x63D0;&#x9AD8;&#x4F60;&#x7684;&#x56E2;&#x961F;&#x505A;&#x51FA;&#x8FD9;&#x4E9B;&#x51B3;&#x7B56;&#x7684;&#x6548;&#x7387;&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x8FD8;&#x6CA1;&#x6709;&#x5B8C;&#x6574;&#x8BA8;&#x8BBA;&#x5982;&#x4F55;&#x6709;&#x6548;&#x5730;&#x5EFA;&#x7ACB;&#x8BC4;&#x4F30;&#x6307;&#x6807;&#x3002;&#x5728;&#x4E0B;&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#x4E2D;&#xFF0C;&#x6211;&#x4F1A;&#x6559;&#x4F60;&#x4EEC;&#x5982;&#x4F55;&#x8BBE;&#x7F6E;&#x4F18;&#x5316;&#x4EE5;&#x53CA;&#x6EE1;&#x8DB3;&#x6307;&#x6807;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E0B;&#x4E00;&#x6BB5;&#x89C6;&#x9891;&#x3002;</p>
<h3 id="14-&#x6EE1;&#x8DB3;&#x548C;&#x4F18;&#x5316;&#x6307;&#x6807;&#xFF08;satisficing-and-optimizing-metrics&#xFF09;">1.4 &#x6EE1;&#x8DB3;&#x548C;&#x4F18;&#x5316;&#x6307;&#x6807;&#xFF08;Satisficing and optimizing metrics&#xFF09;</h3>
<p>&#x8981;&#x628A;&#x4F60;&#x987E;&#x53CA;&#x5230;&#x7684;&#x6240;&#x6709;&#x4E8B;&#x60C5;&#x7EC4;&#x5408;&#x6210;&#x5355;&#x5B9E;&#x6570;&#x8BC4;&#x4F30;&#x6307;&#x6807;&#x6709;&#x65F6;&#x5E76;&#x4E0D;&#x5BB9;&#x6613;&#xFF0C;&#x5728;&#x90A3;&#x4E9B;&#x60C5;&#x51B5;&#x91CC;&#xFF0C;&#x6211;&#x53D1;&#x73B0;&#x6709;&#x65F6;&#x5019;&#x8BBE;&#x7ACB;&#x6EE1;&#x8DB3;&#x548C;&#x4F18;&#x5316;&#x6307;&#x6807;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x8BA9;&#x6211;&#x544A;&#x8BC9;&#x4F60;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#x5427;&#x3002;</p>
<p><img src="../images/f4574276832597fbc9d5977401896d15.png" alt=""></p>
<p>&#x5047;&#x8BBE;&#x4F60;&#x5DF2;&#x7ECF;&#x51B3;&#x5B9A;&#x4F60;&#x5F88;&#x770B;&#x91CD;&#x732B;&#x5206;&#x7C7B;&#x5668;&#x7684;&#x5206;&#x7C7B;&#x51C6;&#x786E;&#x5EA6;&#xFF0C;&#x8FD9;&#x53EF;&#x4EE5;&#x662F;$F_1$&#x5206;&#x6570;&#x6216;&#x8005;&#x7528;&#x5176;&#x4ED6;&#x8861;&#x91CF;&#x51C6;&#x786E;&#x5EA6;&#x7684;&#x6307;&#x6807;&#x3002;&#x4F46;&#x9664;&#x4E86;&#x51C6;&#x786E;&#x5EA6;&#x4E4B;&#x5916;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x9700;&#x8981;&#x8003;&#x8651;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#xFF0C;&#x5C31;&#x662F;&#x9700;&#x8981;&#x591A;&#x957F;&#x65F6;&#x95F4;&#x6765;&#x5206;&#x7C7B;&#x4E00;&#x5F20;&#x56FE;&#x3002;&#x5206;&#x7C7B;&#x5668;$A$&#x9700;&#x8981;80&#x6BEB;&#x79D2;&#xFF0C;$B$&#x9700;&#x8981;95&#x6BEB;&#x79D2;&#xFF0C;$C$&#x9700;&#x8981;1500&#x6BEB;&#x79D2;&#xFF0C;&#x5C31;&#x662F;&#x8BF4;&#x9700;&#x8981;1.5&#x79D2;&#x6765;&#x5206;&#x7C7B;&#x56FE;&#x50CF;&#x3002;</p>
<p><img src="../images/2909dd41d5ade1e310f86c5d2206f295.png" alt=""></p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x8FD9;&#x4E48;&#x505A;&#xFF0C;&#x5C06;&#x51C6;&#x786E;&#x5EA6;&#x548C;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#x7EC4;&#x5408;&#x6210;&#x4E00;&#x4E2A;&#x6574;&#x4F53;&#x8BC4;&#x4F30;&#x6307;&#x6807;&#x3002;&#x6240;&#x4EE5;&#x6210;&#x672C;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x603B;&#x4F53;&#x6210;&#x672C;&#x662F;$cost= accuracy - 0.5 \times\text{runningTime}$&#xFF0C;&#x8FD9;&#x79CD;&#x7EC4;&#x5408;&#x65B9;&#x5F0F;&#x53EF;&#x80FD;&#x592A;&#x523B;&#x610F;&#xFF0C;&#x53EA;&#x7528;&#x8FD9;&#x6837;&#x7684;&#x516C;&#x5F0F;&#x6765;&#x7EC4;&#x5408;&#x51C6;&#x786E;&#x5EA6;&#x548C;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#xFF0C;&#x4E24;&#x4E2A;&#x6570;&#x503C;&#x7684;&#x7EBF;&#x6027;&#x52A0;&#x6743;&#x6C42;&#x548C;&#x3002;</p>
<p>&#x4F60;&#x8FD8;&#x53EF;&#x4EE5;&#x505A;&#x5176;&#x4ED6;&#x4E8B;&#x60C5;&#xFF0C;&#x5C31;&#x662F;&#x4F60;&#x53EF;&#x80FD;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x80FD;&#x591F;&#x6700;&#x5927;&#x9650;&#x5EA6;&#x63D0;&#x9AD8;&#x51C6;&#x786E;&#x5EA6;&#xFF0C;&#x4F46;&#x5FC5;&#x987B;&#x6EE1;&#x8DB3;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#x8981;&#x6C42;&#xFF0C;&#x5C31;&#x662F;&#x5BF9;&#x56FE;&#x50CF;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#x6240;&#x9700;&#x7684;&#x65F6;&#x95F4;&#x5FC5;&#x987B;&#x5C0F;&#x4E8E;&#x7B49;&#x4E8E;100&#x6BEB;&#x79D2;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x8BF4;&#x51C6;&#x786E;&#x5EA6;&#x662F;&#x4E00;&#x4E2A;&#x4F18;&#x5316;&#x6307;&#x6807;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x60F3;&#x8981;&#x51C6;&#x786E;&#x5EA6;&#x6700;&#x5927;&#x5316;&#xFF0C;&#x4F60;&#x60F3;&#x505A;&#x7684;&#x5C3D;&#x53EF;&#x80FD;&#x51C6;&#x786E;&#xFF0C;&#x4F46;&#x662F;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x6240;&#x8BF4;&#x7684;&#x6EE1;&#x8DB3;&#x6307;&#x6807;&#xFF0C;&#x610F;&#x601D;&#x662F;&#x5B83;&#x5FC5;&#x987B;&#x8DB3;&#x591F;&#x597D;&#xFF0C;&#x5B83;&#x53EA;&#x9700;&#x8981;&#x5C0F;&#x4E8E;100&#x6BEB;&#x79D2;&#xFF0C;&#x8FBE;&#x5230;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x4E0D;&#x5728;&#x4E4E;&#x8FD9;&#x6307;&#x6807;&#x6709;&#x591A;&#x597D;&#xFF0C;&#x6216;&#x8005;&#x81F3;&#x5C11;&#x4F60;&#x4E0D;&#x4F1A;&#x90A3;&#x4E48;&#x5728;&#x4E4E;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x76F8;&#x5F53;&#x5408;&#x7406;&#x7684;&#x6743;&#x8861;&#x65B9;&#x5F0F;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x5C06;&#x51C6;&#x786E;&#x5EA6;&#x548C;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#x7ED3;&#x5408;&#x8D77;&#x6765;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#x53EF;&#x80FD;&#x662F;&#xFF0C;&#x53EA;&#x8981;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#x5C11;&#x4E8E;100&#x6BEB;&#x79D2;&#xFF0C;&#x4F60;&#x7684;&#x7528;&#x6237;&#x5C31;&#x4E0D;&#x4F1A;&#x5728;&#x4E4E;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#x662F;100&#x6BEB;&#x79D2;&#x8FD8;&#x662F;50&#x6BEB;&#x79D2;&#xFF0C;&#x751A;&#x81F3;&#x66F4;&#x5FEB;&#x3002;</p>
<p><img src="../images/e318e78d4afa310502a4f49d19d08aa3.png" alt=""></p>
<p>&#x901A;&#x8FC7;&#x5B9A;&#x4E49;&#x4F18;&#x5316;&#x548C;&#x6EE1;&#x8DB3;&#x6307;&#x6807;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x7ED9;&#x4F60;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x660E;&#x786E;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x53BB;&#x9009;&#x62E9;&#x201C;&#x6700;&#x597D;&#x7684;&#x201D;&#x5206;&#x7C7B;&#x5668;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x5206;&#x7C7B;&#x5668;B&#x6700;&#x597D;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x6240;&#x6709;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#x90FD;&#x5C0F;&#x4E8E;100&#x6BEB;&#x79D2;&#x7684;&#x5206;&#x7C7B;&#x5668;&#x4E2D;&#xFF0C;&#x5B83;&#x7684;&#x51C6;&#x786E;&#x5EA6;&#x6700;&#x597D;&#x3002;</p>
<p><img src="../images/5a32842a5d619a22bd1d6fe8b96e8d62.png" alt=""></p>
<p>&#x6240;&#x4EE5;&#x66F4;&#x4E00;&#x822C;&#x5730;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8981;&#x8003;&#x8651;$N$&#x4E2A;&#x6307;&#x6807;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x9009;&#x62E9;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x6307;&#x6807;&#x505A;&#x4E3A;&#x4F18;&#x5316;&#x6307;&#x6807;&#x662F;&#x5408;&#x7406;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x4F60;&#x60F3;&#x5C3D;&#x91CF;&#x4F18;&#x5316;&#x90A3;&#x4E2A;&#x6307;&#x6807;&#xFF0C;&#x7136;&#x540E;&#x5269;&#x4E0B;$N-1$&#x4E2A;&#x6307;&#x6807;&#x90FD;&#x662F;&#x6EE1;&#x8DB3;&#x6307;&#x6807;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x53EA;&#x8981;&#x5B83;&#x4EEC;&#x8FBE;&#x5230;&#x4E00;&#x5B9A;&#x9608;&#x503C;&#xFF0C;&#x4F8B;&#x5982;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#x5FEB;&#x4E8E;100&#x6BEB;&#x79D2;&#xFF0C;&#x4F46;&#x53EA;&#x8981;&#x8FBE;&#x5230;&#x4E00;&#x5B9A;&#x7684;&#x9608;&#x503C;&#xFF0C;&#x4F60;&#x4E0D;&#x5728;&#x4E4E;&#x5B83;&#x8D85;&#x8FC7;&#x90A3;&#x4E2A;&#x95E8;&#x69DB;&#x4E4B;&#x540E;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x5FC5;&#x987B;&#x8FBE;&#x5230;&#x8FD9;&#x4E2A;&#x95E8;&#x69DB;&#x3002;</p>
<p><img src="../images/5238b9315a275321ba74d28b79201891.png" alt=""></p>
<p>&#x8FD9;&#x91CC;&#x662F;&#x53E6;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5047;&#x8BBE;&#x4F60;&#x6B63;&#x5728;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x6765;&#x68C0;&#x6D4B;&#x5524;&#x9192;&#x8BED;&#xFF0C;&#x4E5F;&#x53EB;&#x89E6;&#x53D1;&#x8BCD;&#xFF0C;&#x8FD9;&#x6307;&#x7684;&#x662F;&#x8BED;&#x97F3;&#x63A7;&#x5236;&#x8BBE;&#x5907;&#x3002;&#x6BD4;&#x5982;&#x4E9A;&#x9A6C;&#x900A;<strong>Echo</strong>&#xFF0C;&#x4F60;&#x4F1A;&#x8BF4;&#x201C;<strong>Alexa</strong>&#x201D;&#xFF0C;&#x6216;&#x8005;&#x7528;&#x201C;<strong>Okay Google</strong>&#x201D;&#x6765;&#x5524;&#x9192;&#x8C37;&#x6B4C;&#x8BBE;&#x5907;&#xFF0C;&#x6216;&#x8005;&#x5BF9;&#x4E8E;&#x82F9;&#x679C;&#x8BBE;&#x5907;&#xFF0C;&#x4F60;&#x4F1A;&#x8BF4;&#x201C;<strong>Hey Siri</strong>&#x201D;&#xFF0C;&#x6216;&#x8005;&#x5BF9;&#x4E8E;&#x67D0;&#x4E9B;&#x767E;&#x5EA6;&#x8BBE;&#x5907;&#xFF0C;&#x6211;&#x4EEC;&#x7528;&#x201C;&#x4F60;&#x597D;&#x767E;&#x5EA6;&#x201D;&#x5524;&#x9192;&#x3002;</p>
<p>&#x5BF9;&#x7684;&#xFF0C;&#x8FD9;&#x4E9B;&#x5C31;&#x662F;&#x5524;&#x9192;&#x8BCD;&#xFF0C;&#x53EF;&#x4EE5;&#x5524;&#x9192;&#x8FD9;&#x4E9B;&#x8BED;&#x97F3;&#x63A7;&#x5236;&#x8BBE;&#x5907;&#xFF0C;&#x7136;&#x540E;&#x76D1;&#x542C;&#x4F60;&#x60F3;&#x8BF4;&#x7684;&#x8BDD;&#x3002;&#x6240;&#x4EE5;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x5728;&#x4E4E;&#x89E6;&#x53D1;&#x5B57;&#x68C0;&#x6D4B;&#x7CFB;&#x7EDF;&#x7684;&#x51C6;&#x786E;&#x6027;&#xFF0C;&#x6240;&#x4EE5;&#x5F53;&#x6709;&#x4EBA;&#x8BF4;&#x51FA;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x89E6;&#x53D1;&#x8BCD;&#x65F6;&#xFF0C;&#x6709;&#x591A;&#x5927;&#x6982;&#x7387;&#x53EF;&#x4EE5;&#x5524;&#x9192;&#x4F60;&#x7684;&#x8BBE;&#x5907;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x80FD;&#x4E5F;&#x9700;&#x8981;&#x987E;&#x53CA;&#x5047;&#x9633;&#x6027;&#xFF08;<strong>false positive</strong>&#xFF09;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x5C31;&#x662F;&#x6CA1;&#x6709;&#x4EBA;&#x5728;&#x8BF4;&#x8FD9;&#x4E2A;&#x89E6;&#x53D1;&#x8BCD;&#x65F6;&#xFF0C;&#x5B83;&#x88AB;&#x968F;&#x673A;&#x5524;&#x9192;&#x7684;&#x6982;&#x7387;&#x6709;&#x591A;&#x5927;&#xFF1F;&#x6240;&#x4EE5;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7EC4;&#x5408;&#x8FD9;&#x4E24;&#x79CD;&#x8BC4;&#x4F30;&#x6307;&#x6807;&#x7684;&#x5408;&#x7406;&#x65B9;&#x5F0F;&#x53EF;&#x80FD;&#x662F;&#x6700;&#x5927;&#x5316;&#x7CBE;&#x786E;&#x5EA6;&#x3002;&#x6240;&#x4EE5;&#x5F53;&#x67D0;&#x4EBA;&#x8BF4;&#x51FA;&#x5524;&#x9192;&#x8BCD;&#x65F6;&#xFF0C;&#x4F60;&#x7684;&#x8BBE;&#x5907;&#x88AB;&#x5524;&#x9192;&#x7684;&#x6982;&#x7387;&#x6700;&#x5927;&#x5316;&#xFF0C;&#x7136;&#x540E;&#x5FC5;&#x987B;&#x6EE1;&#x8DB3;24&#x5C0F;&#x65F6;&#x5185;&#x6700;&#x591A;&#x53EA;&#x80FD;&#x6709;1&#x6B21;&#x5047;&#x9633;&#x6027;&#xFF0C;&#x5BF9;&#x5427;&#xFF1F;&#x6240;&#x4EE5;&#x4F60;&#x7684;&#x8BBE;&#x5907;&#x5E73;&#x5747;&#x6BCF;&#x5929;&#x53EA;&#x4F1A;&#x6CA1;&#x6709;&#x4EBA;&#x771F;&#x7684;&#x5728;&#x8BF4;&#x8BDD;&#x65F6;&#x968F;&#x673A;&#x5524;&#x9192;&#x4E00;&#x6B21;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x51C6;&#x786E;&#x5EA6;&#x662F;&#x4F18;&#x5316;&#x6307;&#x6807;&#xFF0C;&#x7136;&#x540E;&#x6BCF;24&#x5C0F;&#x65F6;&#x53D1;&#x751F;&#x4E00;&#x6B21;&#x5047;&#x9633;&#x6027;&#x662F;&#x6EE1;&#x8DB3;&#x6307;&#x6807;&#xFF0C;&#x4F60;&#x53EA;&#x8981;&#x6BCF;24&#x5C0F;&#x65F6;&#x6700;&#x591A;&#x6709;&#x4E00;&#x6B21;&#x5047;&#x9633;&#x6027;&#x5C31;&#x6EE1;&#x8DB3;&#x4E86;&#x3002;</p>
<p><img src="../images/21e6a2d4c44c748c706142d4bfb3a2e4.png" alt=""></p>
<p>&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x9700;&#x8981;&#x987E;&#x53CA;&#x591A;&#x4E2A;&#x6307;&#x6807;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x4F18;&#x5316;&#x6307;&#x6807;&#xFF0C;&#x4F60;&#x60F3;&#x5C3D;&#x53EF;&#x80FD;&#x4F18;&#x5316;&#x7684;&#xFF0C;&#x7136;&#x540E;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x6EE1;&#x8DB3;&#x6307;&#x6807;&#xFF0C;&#x9700;&#x8981;&#x6EE1;&#x8DB3;&#x7684;&#xFF0C;&#x9700;&#x8981;&#x8FBE;&#x5230;&#x4E00;&#x5B9A;&#x7684;&#x95E8;&#x69DB;&#x3002;&#x73B0;&#x5728;&#x4F60;&#x5C31;&#x6709;&#x4E00;&#x4E2A;&#x5168;&#x81EA;&#x52A8;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5728;&#x89C2;&#x5BDF;&#x591A;&#x4E2A;&#x6210;&#x672C;&#x5927;&#x5C0F;&#x65F6;&#xFF0C;&#x9009;&#x51FA;&quot;&#x6700;&#x597D;&#x7684;&quot;&#x90A3;&#x4E2A;&#x3002;&#x73B0;&#x5728;&#x8FD9;&#x4E9B;&#x8BC4;&#x4F30;&#x6307;&#x6807;&#x5FC5;&#x987B;&#x662F;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x6216;&#x5F00;&#x53D1;&#x96C6;&#x6216;&#x6D4B;&#x8BD5;&#x96C6;&#x4E0A;&#x8BA1;&#x7B97;&#x6216;&#x6C42;&#x51FA;&#x6765;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x4F60;&#x8FD8;&#x9700;&#x8981;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;&#xFF0C;&#x5C31;&#x662F;&#x8BBE;&#x7ACB;&#x8BAD;&#x7EC3;&#x96C6;&#x3001;&#x5F00;&#x53D1;&#x96C6;&#xFF0C;&#x8FD8;&#x6709;&#x6D4B;&#x8BD5;&#x96C6;&#x3002;&#x5728;&#x4E0B;&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#x91CC;&#xFF0C;&#x6211;&#x60F3;&#x548C;&#x5927;&#x5BB6;&#x5206;&#x4EAB;&#x4E00;&#x4E9B;&#x5982;&#x4F55;&#x8BBE;&#x7F6E;&#x8BAD;&#x7EC3;&#x3001;&#x5F00;&#x53D1;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x7684;&#x6307;&#x5BFC;&#x65B9;&#x9488;&#xFF0C;&#x6211;&#x4EEC;&#x4E0B;&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#x7EE7;&#x7EED;&#x3002;</p>
<h3 id="15-&#x8BAD;&#x7EC3;&#x5F00;&#x53D1;&#x6D4B;&#x8BD5;&#x96C6;&#x5212;&#x5206;&#xFF08;traindevtest-distributions&#xFF09;">1.5 &#x8BAD;&#x7EC3;/&#x5F00;&#x53D1;/&#x6D4B;&#x8BD5;&#x96C6;&#x5212;&#x5206;&#xFF08;Train/dev/test distributions&#xFF09;</h3>
<p>&#x8BBE;&#x7ACB;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x5F00;&#x53D1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x7684;&#x65B9;&#x5F0F;&#x5927;&#x5927;&#x5F71;&#x54CD;&#x4E86;&#x4F60;&#x6216;&#x8005;&#x4F60;&#x7684;&#x56E2;&#x961F;&#x5728;&#x5EFA;&#x7ACB;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5E94;&#x7528;&#x65B9;&#x9762;&#x53D6;&#x5F97;&#x8FDB;&#x5C55;&#x7684;&#x901F;&#x5EA6;&#x3002;&#x540C;&#x6837;&#x7684;&#x56E2;&#x961F;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x5927;&#x516C;&#x53F8;&#x91CC;&#x7684;&#x56E2;&#x961F;&#xFF0C;&#x5728;&#x8BBE;&#x7ACB;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x96C6;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x771F;&#x7684;&#x4F1A;&#x8BA9;&#x56E2;&#x961F;&#x7684;&#x8FDB;&#x5C55;&#x53D8;&#x6162;&#x800C;&#x4E0D;&#x662F;&#x52A0;&#x5FEB;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x5E94;&#x8BE5;&#x5982;&#x4F55;&#x8BBE;&#x7ACB;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x8BA9;&#x4F60;&#x7684;&#x56E2;&#x961F;&#x6548;&#x7387;&#x6700;&#x5927;&#x5316;&#x3002;</p>
<p><img src="../images/9b58410d52dcff1e7b7e18d4dc684a6f.png" alt=""></p>
<p>&#x5728;&#x8FD9;&#x4E2A;&#x89C6;&#x9891;&#x4E2D;&#xFF0C;&#x6211;&#x60F3;&#x96C6;&#x4E2D;&#x8BA8;&#x8BBA;&#x5982;&#x4F55;&#x8BBE;&#x7ACB;&#x5F00;&#x53D1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#xFF0C;&#x5F00;&#x53D1;&#xFF08;<strong>dev</strong>&#xFF09;&#x96C6;&#x4E5F;&#x53EB;&#x505A;&#x5F00;&#x53D1;&#x96C6;&#xFF08;<strong>development set</strong>&#xFF09;&#xFF0C;&#x6709;&#x65F6;&#x79F0;&#x4E3A;&#x4FDD;&#x7559;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x96C6;&#xFF08;<strong>hold out cross validation set</strong>&#xFF09;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4E2D;&#x7684;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#x662F;&#xFF0C;&#x4F60;&#x5C1D;&#x8BD5;&#x5F88;&#x591A;&#x601D;&#x8DEF;&#xFF0C;&#x7528;&#x8BAD;&#x7EC3;&#x96C6;&#x8BAD;&#x7EC3;&#x4E0D;&#x540C;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x5F00;&#x53D1;&#x96C6;&#x6765;&#x8BC4;&#x4F30;&#x4E0D;&#x540C;&#x7684;&#x601D;&#x8DEF;&#xFF0C;&#x7136;&#x540E;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#xFF0C;&#x7136;&#x540E;&#x4E0D;&#x65AD;&#x8FED;&#x4EE3;&#x53BB;&#x6539;&#x5584;&#x5F00;&#x53D1;&#x96C6;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x76F4;&#x5230;&#x6700;&#x540E;&#x4F60;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x4EE4;&#x4F60;&#x6EE1;&#x610F;&#x7684;&#x6210;&#x672C;&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x518D;&#x7528;&#x6D4B;&#x8BD5;&#x96C6;&#x53BB;&#x8BC4;&#x4F30;&#x3002;</p>
<p>&#x73B0;&#x5728;&#xFF0C;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x4F60;&#x8981;&#x5F00;&#x53D1;&#x4E00;&#x4E2A;&#x732B;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x5728;&#x8FD9;&#x4E9B;&#x533A;&#x57DF;&#x91CC;&#x8FD0;&#x8425;&#xFF0C;&#x7F8E;&#x56FD;&#x3001;&#x82F1;&#x56FD;&#x3001;&#x5176;&#x4ED6;&#x6B27;&#x6D32;&#x56FD;&#x5BB6;&#xFF0C;&#x5357;&#x7F8E;&#x6D32;&#x3001;&#x5370;&#x5EA6;&#x3001;&#x4E2D;&#x56FD;&#xFF0C;&#x5176;&#x4ED6;&#x4E9A;&#x6D32;&#x56FD;&#x5BB6;&#x548C;&#x6FB3;&#x5927;&#x5229;&#x4E9A;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x5E94;&#x8BE5;&#x5982;&#x4F55;&#x8BBE;&#x7ACB;&#x5F00;&#x53D1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x5462;&#xFF1F;</p>
<p><img src="../images/d4bfa539f88a0b3fa5cd128340d0670b.png" alt=""></p>
<p>&#x5176;&#x4E2D;&#x4E00;&#x79CD;&#x505A;&#x6CD5;&#x662F;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x5176;&#x4E2D;4&#x4E2A;&#x533A;&#x57DF;&#xFF0C;&#x6211;&#x6253;&#x7B97;&#x4F7F;&#x7528;&#x8FD9;&#x56DB;&#x4E2A;&#xFF08;&#x524D;&#x56DB;&#x4E2A;&#xFF09;&#xFF0C;&#x4F46;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x968F;&#x673A;&#x9009;&#x7684;&#x533A;&#x57DF;&#xFF0C;&#x7136;&#x540E;&#x8BF4;&#xFF0C;&#x6765;&#x81EA;&#x8FD9;&#x56DB;&#x4E2A;&#x533A;&#x57DF;&#x7684;&#x6570;&#x636E;&#x6784;&#x6210;&#x5F00;&#x53D1;&#x96C6;&#x3002;&#x7136;&#x540E;&#x5176;&#x4ED6;&#x56DB;&#x4E2A;&#x533A;&#x57DF;&#xFF0C;&#x6211;&#x6253;&#x7B97;&#x7528;&#x8FD9;&#x56DB;&#x4E2A;&#xFF08;&#x540E;&#x56DB;&#x4E2A;&#xFF09;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x968F;&#x673A;&#x9009;&#x62E9;4&#x4E2A;&#xFF0C;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x6784;&#x6210;&#x6D4B;&#x8BD5;&#x96C6;&#x3002;</p>
<p>&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#xFF0C;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x975E;&#x5E38;&#x7CDF;&#x7CD5;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x4F60;&#x7684;&#x5F00;&#x53D1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x6765;&#x81EA;&#x4E0D;&#x540C;&#x7684;&#x5206;&#x5E03;&#x3002;&#x6211;&#x5EFA;&#x8BAE;&#x4F60;&#x4EEC;&#x4E0D;&#x8981;&#x8FD9;&#x6837;&#xFF0C;&#x800C;&#x662F;&#x8BA9;&#x4F60;&#x7684;&#x5F00;&#x53D1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x6765;&#x81EA;&#x540C;&#x4E00;&#x5206;&#x5E03;&#x3002;&#x6211;&#x7684;&#x610F;&#x601D;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x4F60;&#x4EEC;&#x8981;&#x8BB0;&#x4F4F;&#xFF0C;&#x6211;&#x60F3;&#x5C31;&#x662F;&#x8BBE;&#x7ACB;&#x4F60;&#x7684;&#x5F00;&#x53D1;&#x96C6;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&#x5355;&#x5B9E;&#x6570;&#x8BC4;&#x4F30;&#x6307;&#x6807;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x50CF;&#x662F;&#x5B9A;&#x4E0B;&#x76EE;&#x6807;&#xFF0C;&#x7136;&#x540E;&#x544A;&#x8BC9;&#x4F60;&#x7684;&#x56E2;&#x961F;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x4F60;&#x8981;&#x7784;&#x51C6;&#x7684;&#x9776;&#x5FC3;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x4E00;&#x65E6;&#x5EFA;&#x7ACB;&#x4E86;&#x8FD9;&#x6837;&#x7684;&#x5F00;&#x53D1;&#x96C6;&#x548C;&#x6307;&#x6807;&#xFF0C;&#x56E2;&#x961F;&#x5C31;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x8FED;&#x4EE3;&#xFF0C;&#x5C1D;&#x8BD5;&#x4E0D;&#x540C;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x8DD1;&#x5B9E;&#x9A8C;&#xFF0C;&#x53EF;&#x4EE5;&#x5F88;&#x5FEB;&#x5730;&#x4F7F;&#x7528;&#x5F00;&#x53D1;&#x96C6;&#x548C;&#x6307;&#x6807;&#x53BB;&#x8BC4;&#x4F30;&#x4E0D;&#x540C;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x7136;&#x540E;&#x5C1D;&#x8BD5;&#x9009;&#x51FA;&#x6700;&#x597D;&#x7684;&#x90A3;&#x4E2A;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x56E2;&#x961F;&#x4E00;&#x822C;&#x90FD;&#x5F88;&#x64C5;&#x957F;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x65B9;&#x6CD5;&#x53BB;&#x903C;&#x8FD1;&#x76EE;&#x6807;&#xFF0C;&#x7136;&#x540E;&#x4E0D;&#x65AD;&#x8FED;&#x4EE3;&#xFF0C;&#x4E0D;&#x65AD;&#x903C;&#x8FD1;&#x9776;&#x5FC3;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x9488;&#x5BF9;&#x5F00;&#x53D1;&#x96C6;&#x4E0A;&#x7684;&#x6307;&#x6807;&#x4F18;&#x5316;&#x3002;</p>
<p><img src="../images/48bcf6f09684edc2ed1850ece7feef44.png" alt=""></p>
<p>&#x7136;&#x540E;&#x5728;&#x5DE6;&#x8FB9;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x8BBE;&#x7ACB;&#x5F00;&#x53D1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x65F6;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4F60;&#x7684;&#x56E2;&#x961F;&#x53EF;&#x80FD;&#x4F1A;&#x82B1;&#x4E0A;&#x51E0;&#x4E2A;&#x6708;&#x65F6;&#x95F4;&#x5728;&#x5F00;&#x53D1;&#x96C6;&#x4E0A;&#x8FED;&#x4EE3;&#x4F18;&#x5316;&#xFF0C;&#x7ED3;&#x679C;&#x53D1;&#x73B0;&#xFF0C;&#x5F53;&#x4F60;&#x4EEC;&#x6700;&#x7EC8;&#x5728;&#x6D4B;&#x8BD5;&#x96C6;&#x4E0A;&#x6D4B;&#x8BD5;&#x7CFB;&#x7EDF;&#x65F6;&#xFF0C;&#x6765;&#x81EA;&#x8FD9;&#x56DB;&#x4E2A;&#x56FD;&#x5BB6;&#x6216;&#x8005;&#x8BF4;&#x4E0B;&#x9762;&#x8FD9;&#x56DB;&#x4E2A;&#x5730;&#x533A;&#x7684;&#x6570;&#x636E;&#xFF08;&#x5373;&#x6D4B;&#x8BD5;&#x96C6;&#x6570;&#x636E;&#xFF09;&#x548C;&#x5F00;&#x53D1;&#x96C6;&#x91CC;&#x7684;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x5DEE;&#x5F02;&#x5F88;&#x5927;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x6536;&#x83B7;&quot;&#x610F;&#x5916;&#x60CA;&#x559C;&quot;&#xFF0C;&#x5E76;&#x53D1;&#x73B0;&#xFF0C;&#x82B1;&#x4E86;&#x90A3;&#x4E48;&#x591A;&#x4E2A;&#x6708;&#x7684;&#x65F6;&#x95F4;&#x53BB;&#x9488;&#x5BF9;&#x5F00;&#x53D1;&#x96C6;&#x4F18;&#x5316;&#xFF0C;&#x5728;&#x6D4B;&#x8BD5;&#x96C6;&#x4E0A;&#x7684;&#x8868;&#x73B0;&#x5374;&#x4E0D;&#x4F73;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7684;&#x5F00;&#x53D1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x6765;&#x81EA;&#x4E0D;&#x540C;&#x7684;&#x5206;&#x5E03;&#xFF0C;&#x5C31;&#x50CF;&#x4F60;&#x8BBE;&#x4E86;&#x4E00;&#x4E2A;&#x76EE;&#x6807;&#xFF0C;&#x8BA9;&#x4F60;&#x7684;&#x56E2;&#x961F;&#x82B1;&#x51E0;&#x4E2A;&#x6708;&#x5C1D;&#x8BD5;&#x903C;&#x8FD1;&#x9776;&#x5FC3;&#xFF0C;&#x7ED3;&#x679C;&#x5728;&#x51E0;&#x4E2A;&#x6708;&#x5DE5;&#x4F5C;&#x4E4B;&#x540E;&#x53D1;&#x73B0;&#xFF0C;&#x4F60;&#x8BF4;&#x201C;&#x7B49;&#x7B49;&#x201D;&#xFF0C;&#x6D4B;&#x8BD5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&quot;&#x6211;&#x8981;&#x628A;&#x76EE;&#x6807;&#x79FB;&#x5230;&#x8FD9;&#x91CC;&quot;&#xFF0C;&#x7136;&#x540E;&#x56E2;&#x961F;&#x53EF;&#x80FD;&#x4F1A;&#x8BF4;&quot;&#x597D;&#x5427;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4F60;&#x8BA9;&#x6211;&#x4EEC;&#x82B1;&#x90A3;&#x4E48;&#x591A;&#x4E2A;&#x6708;&#x7684;&#x65F6;&#x95F4;&#x53BB;&#x903C;&#x8FD1;&#x90A3;&#x4E2A;&#x9776;&#x5FC3;&#xFF0C;&#x7136;&#x540E;&#x7A81;&#x7136;&#x95F4;&#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x9776;&#x5FC3;&#x79FB;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x4F4D;&#x7F6E;&#xFF1F;&quot;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x6211;&#x5EFA;&#x8BAE;&#x7684;&#x662F;&#x4F60;&#x5C06;&#x6240;&#x6709;&#x6570;&#x636E;&#x968F;&#x673A;&#x6D17;&#x724C;&#xFF0C;&#x653E;&#x5165;&#x5F00;&#x53D1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#xFF0C;&#x6240;&#x4EE5;&#x5F00;&#x53D1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x90FD;&#x6709;&#x6765;&#x81EA;&#x516B;&#x4E2A;&#x5730;&#x533A;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x4E14;&#x5F00;&#x53D1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x90FD;&#x6765;&#x81EA;&#x540C;&#x4E00;&#x5206;&#x5E03;&#xFF0C;&#x8FD9;&#x5206;&#x5E03;&#x5C31;&#x662F;&#x4F60;&#x7684;&#x6240;&#x6709;&#x6570;&#x636E;&#x6DF7;&#x5728;&#x4E00;&#x8D77;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x6709;&#x53E6;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x8FD9;&#x662F;&#x4E2A;&#x771F;&#x5B9E;&#x7684;&#x6545;&#x4E8B;&#xFF0C;&#x4F46;&#x6709;&#x4E00;&#x4E9B;&#x7EC6;&#x8282;&#x53D8;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x77E5;&#x9053;&#x6709;&#x4E00;&#x4E2A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x56E2;&#x961F;&#xFF0C;&#x82B1;&#x4E86;&#x597D;&#x51E0;&#x4E2A;&#x6708;&#x5728;&#x5F00;&#x53D1;&#x96C6;&#x4E0A;&#x4F18;&#x5316;&#xFF0C;&#x5F00;&#x53D1;&#x96C6;&#x91CC;&#x9762;&#x6709;&#x4E2D;&#x7B49;&#x6536;&#x5165;&#x90AE;&#x653F;&#x7F16;&#x7801;&#x7684;&#x8D37;&#x6B3E;&#x5BA1;&#x6279;&#x6570;&#x636E;&#x3002;&#x90A3;&#x4E48;&#x5177;&#x4F53;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x8F93;&#x5165;$x$&#x4E3A;&#x8D37;&#x6B3E;&#x7533;&#x8BF7;&#xFF0C;&#x4F60;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x9884;&#x6D4B;&#x8F93;&#x51FA;$y$&#xFF0C;$y$&#x662F;&#x4ED6;&#x4EEC;&#x6709;&#x6CA1;&#x6709;&#x8FD8;&#x8D37;&#x80FD;&#x529B;&#xFF1F;&#x6240;&#x4EE5;&#x8FD9;&#x7CFB;&#x7EDF;&#x80FD;&#x5E2E;&#x52A9;&#x94F6;&#x884C;&#x5224;&#x65AD;&#x662F;&#x5426;&#x6279;&#x51C6;&#x8D37;&#x6B3E;&#x3002;&#x6240;&#x4EE5;&#x5F00;&#x53D1;&#x96C6;&#x6765;&#x81EA;&#x8D37;&#x6B3E;&#x7533;&#x8BF7;&#xFF0C;&#x8FD9;&#x4E9B;&#x8D37;&#x6B3E;&#x7533;&#x8BF7;&#x6765;&#x81EA;&#x4E2D;&#x7B49;&#x6536;&#x5165;&#x90AE;&#x653F;&#x7F16;&#x7801;&#xFF0C;<strong>zip code</strong>&#x5C31;&#x662F;&#x7F8E;&#x56FD;&#x7684;&#x90AE;&#x653F;&#x7F16;&#x7801;&#x3002;&#x4F46;&#x662F;&#x5728;&#x8FD9;&#x4E0A;&#x9762;&#x8BAD;&#x7EC3;&#x4E86;&#x51E0;&#x4E2A;&#x6708;&#x4E4B;&#x540E;&#xFF0C;&#x56E2;&#x961F;&#x7A81;&#x7136;&#x51B3;&#x5B9A;&#x8981;&#x5728;&#xFF0C;&#x4F4E;&#x6536;&#x5165;&#x90AE;&#x653F;&#x7F16;&#x7801;&#x6570;&#x636E;&#x4E0A;&#x6D4B;&#x8BD5;&#x4E00;&#x4E0B;&#x3002;&#x5F53;&#x7136;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x5206;&#x5E03;&#x6570;&#x636E;&#x91CC;&#x9762;&#x4E2D;&#x7B49;&#x6536;&#x5165;&#x548C;&#x4F4E;&#x6536;&#x5165;&#x90AE;&#x653F;&#x7F16;&#x7801;&#x6570;&#x636E;&#x662F;&#x5F88;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x4ED6;&#x4EEC;&#x82B1;&#x4E86;&#x5927;&#x91CF;&#x65F6;&#x95F4;&#x9488;&#x5BF9;&#x524D;&#x9762;&#x90A3;&#x7EC4;&#x6570;&#x636E;&#x4F18;&#x5316;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x5BFC;&#x81F4;&#x7CFB;&#x7EDF;&#x5728;&#x540E;&#x9762;&#x90A3;&#x7EC4;&#x6570;&#x636E;&#x4E2D;&#x6548;&#x679C;&#x5F88;&#x5DEE;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x7279;&#x5B9A;&#x56E2;&#x961F;&#x5B9E;&#x9645;&#x4E0A;&#x6D6A;&#x8D39;&#x4E86;3&#x4E2A;&#x6708;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x4E0D;&#x5F97;&#x4E0D;&#x9000;&#x56DE;&#x53BB;&#x91CD;&#x65B0;&#x505A;&#x5F88;&#x591A;&#x5DE5;&#x4F5C;&#x3002;</p>
<p><img src="../images/4027ba175f24c511bc282ccc8a91f75b.png" alt=""></p>
<p>&#x8FD9;&#x91CC;&#x5B9E;&#x9645;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x60C5;&#x662F;&#xFF0C;&#x8FD9;&#x4E2A;&#x56E2;&#x961F;&#x82B1;&#x4E86;&#x4E09;&#x4E2A;&#x6708;&#x7784;&#x51C6;&#x4E00;&#x4E2A;&#x76EE;&#x6807;&#xFF0C;&#x4E09;&#x4E2A;&#x6708;&#x4E4B;&#x540E;&#x7ECF;&#x7406;&#x7A81;&#x7136;&#x95EE;&quot;&#x4F60;&#x4EEC;&#x8BD5;&#x8BD5;&#x7784;&#x51C6;&#x90A3;&#x4E2A;&#x76EE;&#x6807;&#x5982;&#x4F55;&#xFF1F;&quot;&#xFF0C;&#x8FD9;&#x65B0;&#x76EE;&#x6807;&#x4F4D;&#x7F6E;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4EF6;&#x4E8B;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x56E2;&#x961F;&#x6765;&#x8BF4;&#x975E;&#x5E38;&#x5D29;&#x6E83;&#x3002;</p>
<p><img src="../images/20a976e5fd70b357fedb38ff13111830.png" alt=""></p>
<p>&#x6240;&#x4EE5;&#x6211;&#x5EFA;&#x8BAE;&#x4F60;&#x4EEC;&#x5728;&#x8BBE;&#x7ACB;&#x5F00;&#x53D1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x65F6;&#xFF0C;&#x8981;&#x9009;&#x62E9;&#x8FD9;&#x6837;&#x7684;&#x5F00;&#x53D1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#xFF0C;&#x80FD;&#x591F;&#x53CD;&#x6620;&#x4F60;&#x672A;&#x6765;&#x4F1A;&#x5F97;&#x5230;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8BA4;&#x4E3A;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5FC5;&#x987B;&#x5F97;&#x5230;&#x597D;&#x7ED3;&#x679C;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x7279;&#x522B;&#x662F;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x5F00;&#x53D1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x53EF;&#x80FD;&#x6765;&#x81EA;&#x540C;&#x4E00;&#x4E2A;&#x5206;&#x5E03;&#x3002;&#x6240;&#x4EE5;&#x4E0D;&#x7BA1;&#x4F60;&#x672A;&#x6765;&#x4F1A;&#x5F97;&#x5230;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4E00;&#x65E6;&#x4F60;&#x7684;&#x7B97;&#x6CD5;&#x6548;&#x679C;&#x4E0D;&#x9519;&#xFF0C;&#x8981;&#x5C1D;&#x8BD5;&#x6536;&#x96C6;&#x7C7B;&#x4F3C;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x800C;&#x4E14;&#xFF0C;&#x4E0D;&#x7BA1;&#x90A3;&#x4E9B;&#x6570;&#x636E;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x90FD;&#x8981;&#x968F;&#x673A;&#x5206;&#x914D;&#x5230;&#x5F00;&#x53D1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x4E0A;&#x3002;&#x56E0;&#x4E3A;&#x8FD9;&#x6837;&#xFF0C;&#x4F60;&#x624D;&#x80FD;&#x5C06;&#x7784;&#x51C6;&#x60F3;&#x8981;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x8BA9;&#x4F60;&#x7684;&#x56E2;&#x961F;&#x9AD8;&#x6548;&#x8FED;&#x4EE3;&#x6765;&#x903C;&#x8FD1;&#x540C;&#x4E00;&#x4E2A;&#x76EE;&#x6807;&#xFF0C;&#x5E0C;&#x671B;&#x6700;&#x597D;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x76EE;&#x6807;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x8FD8;&#x6CA1;&#x63D0;&#x5230;&#x5982;&#x4F55;&#x8BBE;&#x7ACB;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x5728;&#x4E4B;&#x540E;&#x7684;&#x89C6;&#x9891;&#x91CC;&#x8C08;&#x8C08;&#x5982;&#x4F55;&#x8BBE;&#x7ACB;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x4F46;&#x8FD9;&#x4E2A;&#x89C6;&#x9891;&#x7684;&#x91CD;&#x70B9;&#x5728;&#x4E8E;&#xFF0C;&#x8BBE;&#x7ACB;&#x5F00;&#x53D1;&#x96C6;&#x4EE5;&#x53CA;&#x8BC4;&#x4F30;&#x6307;&#x6807;&#xFF0C;&#x771F;&#x7684;&#x5C31;&#x5B9A;&#x4E49;&#x4E86;&#x4F60;&#x8981;&#x7784;&#x51C6;&#x7684;&#x76EE;&#x6807;&#x3002;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x901A;&#x8FC7;&#x5728;&#x540C;&#x4E00;&#x5206;&#x5E03;&#x4E2D;&#x8BBE;&#x7ACB;&#x5F00;&#x53D1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x7784;&#x51C6;&#x4F60;&#x6240;&#x5E0C;&#x671B;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x56E2;&#x961F;&#x7784;&#x51C6;&#x7684;&#x76EE;&#x6807;&#x3002;&#x800C;&#x8BBE;&#x7ACB;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x65B9;&#x5F0F;&#x5219;&#x4F1A;&#x5F71;&#x54CD;&#x4F60;&#x903C;&#x8FD1;&#x90A3;&#x4E2A;&#x76EE;&#x6807;&#x6709;&#x591A;&#x5FEB;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x8BB2;&#x5EA7;&#x91CC;&#x63D0;&#x5230;&#x3002;&#x6211;&#x77E5;&#x9053;&#x6709;&#x4E00;&#x4E9B;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x56E2;&#x961F;&#xFF0C;&#x4ED6;&#x4EEC;&#x5982;&#x679C;&#x80FD;&#x9075;&#x5FAA;&#x8FD9;&#x4E2A;&#x65B9;&#x9488;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x7701;&#x4E0B;&#x51E0;&#x4E2A;&#x6708;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x5E0C;&#x671B;&#x8FD9;&#x4E9B;&#x65B9;&#x9488;&#x4E5F;&#x80FD;&#x5E2E;&#x5230;&#x4F60;&#x4EEC;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x4F60;&#x7684;&#x5F00;&#x53D1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x7684;&#x89C4;&#x6A21;&#xFF0C;&#x5982;&#x4F55;&#x9009;&#x62E9;&#x5B83;&#x4EEC;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x5728;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x65F6;&#x4EE3;&#x4E5F;&#x5728;&#x53D8;&#x5316;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x5728;&#x4E0B;&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#x91CC;&#x63D0;&#x5230;&#x8FD9;&#x4E9B;&#x5185;&#x5BB9;&#x3002;</p>
<h3 id="16-&#x5F00;&#x53D1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x7684;&#x5927;&#x5C0F;&#xFF08;size-of-dev-and-test-sets&#xFF09;">1.6 &#x5F00;&#x53D1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x7684;&#x5927;&#x5C0F;&#xFF08;Size of dev and test sets&#xFF09;</h3>
<p>&#x5728;&#x4E0A;&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#x4E2D;&#x4F60;&#x4EEC;&#x77E5;&#x9053;&#x4E86;&#x4F60;&#x7684;&#x5F00;&#x53D1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x4E3A;&#x4EC0;&#x4E48;&#x5FC5;&#x987B;&#x6765;&#x81EA;&#x540C;&#x4E00;&#x5206;&#x5E03;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x89C4;&#x6A21;&#x5E94;&#x8BE5;&#x591A;&#x5927;&#xFF1F;&#x5728;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x65F6;&#x4EE3;&#xFF0C;&#x8BBE;&#x7ACB;&#x5F00;&#x53D1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x7684;&#x65B9;&#x9488;&#x4E5F;&#x5728;&#x53D8;&#x5316;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;&#x4E00;&#x4E9B;&#x6700;&#x4F73;&#x505A;&#x6CD5;&#x3002;</p>
<p><img src="../images/9945f6b55d1285342ef08bbbbb0a3d11.png" alt=""></p>
<p>&#x4F60;&#x53EF;&#x80FD;&#x542C;&#x8BF4;&#x8FC7;&#x4E00;&#x6761;&#x7ECF;&#x9A8C;&#x6CD5;&#x5219;&#xFF0C;&#x5728;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4E2D;&#xFF0C;&#x628A;&#x4F60;&#x53D6;&#x5F97;&#x7684;&#x5168;&#x90E8;&#x6570;&#x636E;&#x7528;70/30&#x6BD4;&#x4F8B;&#x5206;&#x6210;&#x8BAD;&#x7EC3;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x3002;&#x6216;&#x8005;&#x5982;&#x679C;&#x4F60;&#x5FC5;&#x987B;&#x8BBE;&#x7ACB;&#x8BAD;&#x7EC3;&#x96C6;&#x3001;&#x5F00;&#x53D1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#xFF0C;&#x4F60;&#x4F1A;&#x8FD9;&#x4E48;&#x5206;60%&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;20%&#x5F00;&#x53D1;&#x96C6;&#xFF0C;20%&#x6D4B;&#x8BD5;&#x96C6;&#x3002;&#x5728;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x65E9;&#x671F;&#xFF0C;&#x8FD9;&#x6837;&#x5206;&#x662F;&#x76F8;&#x5F53;&#x5408;&#x7406;&#x7684;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x4EE5;&#x524D;&#x7684;&#x6570;&#x636E;&#x96C6;&#x5927;&#x5C0F;&#x8981;&#x5C0F;&#x5F97;&#x591A;&#x3002;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x4F60;&#x603B;&#x5171;&#x6709;100&#x4E2A;&#x6837;&#x672C;&#xFF0C;&#x8FD9;&#x6837;70/30&#x6216;&#x8005;60/20/20&#x5206;&#x7684;&#x7ECF;&#x9A8C;&#x6CD5;&#x5219;&#x662F;&#x76F8;&#x5F53;&#x5408;&#x7406;&#x7684;&#x3002;&#x5982;&#x679C;&#x4F60;&#x6709;&#x51E0;&#x5343;&#x4E2A;&#x6837;&#x672C;&#x6216;&#x8005;&#x6709;&#x4E00;&#x4E07;&#x4E2A;&#x6837;&#x672C;&#xFF0C;&#x8FD9;&#x4E9B;&#x505A;&#x6CD5;&#x4E5F;&#x8FD8;&#x662F;&#x5408;&#x7406;&#x7684;&#x3002;</p>
<p>&#x4F46;&#x5728;&#x73B0;&#x4EE3;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x66F4;&#x4E60;&#x60EF;&#x64CD;&#x4F5C;&#x89C4;&#x6A21;&#x5927;&#x5F97;&#x591A;&#x7684;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x4F60;&#x6709;1&#x767E;&#x4E07;&#x4E2A;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#xFF0C;&#x8FD9;&#x6837;&#x5206;&#x53EF;&#x80FD;&#x66F4;&#x5408;&#x7406;&#xFF0C;98%&#x4F5C;&#x4E3A;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;1%&#x5F00;&#x53D1;&#x96C6;&#xFF0C;1%&#x6D4B;&#x8BD5;&#x96C6;&#xFF0C;&#x6211;&#x4EEC;&#x7528;$D$&#x548C;$T$&#x7F29;&#x5199;&#x6765;&#x8868;&#x793A;&#x5F00;&#x53D1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x3002;&#x56E0;&#x4E3A;&#x5982;&#x679C;&#x4F60;&#x6709;1&#x767E;&#x4E07;&#x4E2A;&#x6837;&#x672C;&#xFF0C;&#x90A3;&#x4E48;1%&#x5C31;&#x662F;10,000&#x4E2A;&#x6837;&#x672C;&#xFF0C;&#x8FD9;&#x5BF9;&#x4E8E;&#x5F00;&#x53D1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x6765;&#x8BF4;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x591F;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x73B0;&#x4EE3;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x65F6;&#x4EE3;&#xFF0C;&#x6709;&#x65F6;&#x6211;&#x4EEC;&#x62E5;&#x6709;&#x5927;&#x5F97;&#x591A;&#x7684;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x6240;&#x4EE5;&#x4F7F;&#x7528;&#x5C0F;&#x4E8E;20%&#x7684;&#x6BD4;&#x4F8B;&#x6216;&#x8005;&#x5C0F;&#x4E8E;30%&#x6BD4;&#x4F8B;&#x7684;&#x6570;&#x636E;&#x4F5C;&#x4E3A;&#x5F00;&#x53D1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x4E5F;&#x662F;&#x5408;&#x7406;&#x7684;&#x3002;&#x800C;&#x4E14;&#x56E0;&#x4E3A;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x5BF9;&#x6570;&#x636E;&#x7684;&#x80C3;&#x53E3;&#x5F88;&#x5927;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x90A3;&#x4E9B;&#x6709;&#x6D77;&#x91CF;&#x6570;&#x636E;&#x96C6;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6709;&#x66F4;&#x9AD8;&#x6BD4;&#x4F8B;&#x7684;&#x6570;&#x636E;&#x5212;&#x5206;&#x5230;&#x8BAD;&#x7EC3;&#x96C6;&#x91CC;&#xFF0C;&#x90A3;&#x4E48;&#x6D4B;&#x8BD5;&#x96C6;&#x5462;&#xFF1F;</p>
<p>&#x8981;&#x8BB0;&#x4F4F;&#xFF0C;&#x6D4B;&#x8BD5;&#x96C6;&#x7684;&#x76EE;&#x7684;&#x662F;&#x5B8C;&#x6210;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x4E4B;&#x540E;&#xFF0C;&#x6D4B;&#x8BD5;&#x96C6;&#x53EF;&#x4EE5;&#x5E2E;&#x4F60;&#x8BC4;&#x4F30;&#x6295;&#x4EA7;&#x7CFB;&#x7EDF;&#x7684;&#x6027;&#x80FD;&#x3002;&#x65B9;&#x9488;&#x5C31;&#x662F;&#xFF0C;&#x4EE4;&#x4F60;&#x7684;&#x6D4B;&#x8BD5;&#x96C6;&#x8DB3;&#x591F;&#x5927;&#xFF0C;&#x80FD;&#x591F;&#x4EE5;&#x9AD8;&#x7F6E;&#x4FE1;&#x5EA6;&#x8BC4;&#x4F30;&#x7CFB;&#x7EDF;&#x6574;&#x4F53;&#x6027;&#x80FD;&#x3002;&#x6240;&#x4EE5;&#x9664;&#x975E;&#x4F60;&#x9700;&#x8981;&#x5BF9;&#x6700;&#x7EC8;&#x6295;&#x4EA7;&#x7CFB;&#x7EDF;&#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x7CBE;&#x786E;&#x7684;&#x6307;&#x6807;&#xFF0C;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#x6D4B;&#x8BD5;&#x96C6;&#x4E0D;&#x9700;&#x8981;&#x4E0A;&#x767E;&#x4E07;&#x4E2A;&#x4F8B;&#x5B50;&#x3002;&#x5BF9;&#x4E8E;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x4E5F;&#x8BB8;&#x4F60;&#x60F3;&#xFF0C;&#x6709;10,000&#x4E2A;&#x4F8B;&#x5B50;&#x5C31;&#x80FD;&#x7ED9;&#x4F60;&#x8DB3;&#x591F;&#x7684;&#x7F6E;&#x4FE1;&#x5EA6;&#x6765;&#x7ED9;&#x51FA;&#x6027;&#x80FD;&#x6307;&#x6807;&#x4E86;&#xFF0C;&#x4E5F;&#x8BB8;100,000&#x4E2A;&#x4E4B;&#x7C7B;&#x7684;&#x53EF;&#x80FD;&#x5C31;&#x591F;&#x4E86;&#xFF0C;&#x8FD9;&#x6570;&#x76EE;&#x53EF;&#x80FD;&#x8FDC;&#x8FDC;&#x5C0F;&#x4E8E;&#x6BD4;&#x5982;&#x8BF4;&#x6574;&#x4F53;&#x6570;&#x636E;&#x96C6;&#x7684;30%&#xFF0C;&#x53D6;&#x51B3;&#x4E8E;&#x4F60;&#x6709;&#x591A;&#x5C11;&#x6570;&#x636E;&#x3002;</p>
<p><img src="../images/0ca43733e2fbdb778b6846717397e50f.png" alt=""></p>
<p>&#x5BF9;&#x4E8E;&#x67D0;&#x4E9B;&#x5E94;&#x7528;&#xFF0C;&#x4F60;&#x4E5F;&#x8BB8;&#x4E0D;&#x9700;&#x8981;&#x5BF9;&#x7CFB;&#x7EDF;&#x6027;&#x80FD;&#x6709;&#x7F6E;&#x4FE1;&#x5EA6;&#x5F88;&#x9AD8;&#x7684;&#x8BC4;&#x4F30;&#xFF0C;&#x4E5F;&#x8BB8;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x8BAD;&#x7EC3;&#x96C6;&#x548C;&#x5F00;&#x53D1;&#x96C6;&#x3002;&#x6211;&#x8BA4;&#x4E3A;&#xFF0C;&#x4E0D;&#x5355;&#x72EC;&#x5206;&#x51FA;&#x4E00;&#x4E2A;&#x6D4B;&#x8BD5;&#x96C6;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x6709;&#x65F6;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x6709;&#x4E9B;&#x4EBA;&#x4F1A;&#x53EA;&#x5206;&#x6210;&#x8BAD;&#x7EC3;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#xFF0C;&#x4ED6;&#x4EEC;&#x5B9E;&#x9645;&#x4E0A;&#x5728;&#x6D4B;&#x8BD5;&#x96C6;&#x4E0A;&#x8FED;&#x4EE3;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x6CA1;&#x6709;&#x6D4B;&#x8BD5;&#x96C6;&#xFF0C;&#x4ED6;&#x4EEC;&#x6709;&#x7684;&#x662F;&#x8BAD;&#x7EC3;&#x96C6;&#x548C;&#x5F00;&#x53D1;&#x96C6;&#xFF0C;&#x4F46;&#x6CA1;&#x6709;&#x6D4B;&#x8BD5;&#x96C6;&#x3002;&#x5982;&#x679C;&#x4F60;&#x771F;&#x7684;&#x5728;&#x8C03;&#x8BD5;&#x8FD9;&#x4E2A;&#x96C6;&#xFF0C;&#x8FD9;&#x4E2A;&#x5F00;&#x53D1;&#x96C6;&#x6216;&#x8FD9;&#x4E2A;&#x6D4B;&#x8BD5;&#x96C6;&#xFF0C;&#x8FD9;&#x6700;&#x597D;&#x79F0;&#x4E3A;&#x5F00;&#x53D1;&#x96C6;&#x3002;</p>
<p>&#x4E0D;&#x8FC7;&#x5728;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x5386;&#x53F2;&#x91CC;&#xFF0C;&#x4E0D;&#x662F;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x628A;&#x672F;&#x8BED;&#x5B9A;&#x4E49;&#x5206;&#x5F97;&#x5F88;&#x6E05;&#x7684;&#xFF0C;&#x6709;&#x65F6;&#x4EBA;&#x4EEC;&#x8BF4;&#x7684;&#x5F00;&#x53D1;&#x96C6;&#xFF0C;&#x5176;&#x5B9E;&#x5E94;&#x8BE5;&#x770B;&#x4F5C;&#x6D4B;&#x8BD5;&#x96C6;&#x3002;&#x4F46;&#x5982;&#x679C;&#x4F60;&#x53EA;&#x8981;&#x6709;&#x6570;&#x636E;&#x53BB;&#x8BAD;&#x7EC3;&#xFF0C;&#x6709;&#x6570;&#x636E;&#x53BB;&#x8C03;&#x8BD5;&#x5C31;&#x591F;&#x4E86;&#x3002;&#x4F60;&#x6253;&#x7B97;&#x4E0D;&#x7BA1;&#x6D4B;&#x8BD5;&#x96C6;&#xFF0C;&#x76F4;&#x63A5;&#x90E8;&#x7F72;&#x6700;&#x7EC8;&#x7CFB;&#x7EDF;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x7528;&#x592A;&#x62C5;&#x5FC3;&#x5B83;&#x7684;&#x5B9E;&#x9645;&#x8868;&#x73B0;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x4E5F;&#x662F;&#x5F88;&#x597D;&#x7684;&#xFF0C;&#x5C31;&#x5C06;&#x5B83;&#x4EEC;&#x79F0;&#x4E3A;&#x8BAD;&#x7EC3;&#x96C6;&#x3001;&#x5F00;&#x53D1;&#x96C6;&#x5C31;&#x597D;&#x3002;&#x7136;&#x540E;&#x8BF4;&#x6E05;&#x695A;&#x4F60;&#x6CA1;&#x6709;&#x6D4B;&#x8BD5;&#x96C6;&#xFF0C;&#x8FD9;&#x662F;&#x4E0D;&#x662F;&#x6709;&#x70B9;&#x4E0D;&#x6B63;&#x5E38;&#xFF1F;&#x6211;&#x7EDD;&#x5BF9;&#x4E0D;&#x5EFA;&#x8BAE;&#x5728;&#x642D;&#x5EFA;&#x7CFB;&#x7EDF;&#x65F6;&#x7701;&#x7565;&#x6D4B;&#x8BD5;&#x96C6;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x6D4B;&#x8BD5;&#x96C6;&#x6BD4;&#x8F83;&#x4EE4;&#x6211;&#x5B89;&#x5FC3;&#x3002;&#x56E0;&#x4E3A;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8FD9;&#x7EC4;&#x4E0D;&#x5E26;&#x504F;&#x5DEE;&#x7684;&#x6570;&#x636E;&#x6765;&#x6D4B;&#x91CF;&#x7CFB;&#x7EDF;&#x7684;&#x6027;&#x80FD;&#x3002;&#x4F46;&#x5982;&#x679C;&#x4F60;&#x7684;&#x5F00;&#x53D1;&#x96C6;&#x975E;&#x5E38;&#x5927;&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x5C31;&#x4E0D;&#x4F1A;&#x5BF9;&#x5F00;&#x53D1;&#x96C6;&#x8FC7;&#x62DF;&#x5408;&#x5F97;&#x592A;&#x5389;&#x5BB3;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x53EA;&#x6709;&#x8BAD;&#x7EC3;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x4E5F;&#x4E0D;&#x662F;&#x5B8C;&#x5168;&#x4E0D;&#x5408;&#x7406;&#x7684;&#x3002;&#x4E0D;&#x8FC7;&#x6211;&#x4E00;&#x822C;&#x4E0D;&#x5EFA;&#x8BAE;&#x8FD9;&#x4E48;&#x505A;&#x3002;</p>
<p>&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#xFF0C;&#x5728;&#x5927;&#x6570;&#x636E;&#x65F6;&#x4EE3;&#x65E7;&#x7684;&#x7ECF;&#x9A8C;&#x89C4;&#x5219;&#xFF0C;&#x8FD9;&#x4E2A;70/30&#x4E0D;&#x518D;&#x9002;&#x7528;&#x4E86;&#x3002;&#x73B0;&#x5728;&#x6D41;&#x884C;&#x7684;&#x662F;&#x628A;&#x5927;&#x91CF;&#x6570;&#x636E;&#x5206;&#x5230;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x7136;&#x540E;&#x5C11;&#x91CF;&#x6570;&#x636E;&#x5206;&#x5230;&#x5F00;&#x53D1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5F53;&#x4F60;&#x6709;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x5927;&#x7684;&#x6570;&#x636E;&#x96C6;&#x65F6;&#x3002;&#x4EE5;&#x524D;&#x7684;&#x7ECF;&#x9A8C;&#x6CD5;&#x5219;&#x5176;&#x5B9E;&#x662F;&#x4E3A;&#x4E86;&#x786E;&#x4FDD;&#x5F00;&#x53D1;&#x96C6;&#x8DB3;&#x591F;&#x5927;&#xFF0C;&#x80FD;&#x591F;&#x8FBE;&#x5230;&#x5B83;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x5C31;&#x662F;&#x5E2E;&#x4F60;&#x8BC4;&#x4F30;&#x4E0D;&#x540C;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x7136;&#x540E;&#x9009;&#x51FA;$A$&#x8FD8;&#x662F;$B$&#x66F4;&#x597D;&#x3002;&#x6D4B;&#x8BD5;&#x96C6;&#x7684;&#x76EE;&#x7684;&#x662F;&#x8BC4;&#x4F30;&#x4F60;&#x6700;&#x7EC8;&#x7684;&#x6210;&#x672C;&#x504F;&#x5DEE;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x8BBE;&#x7ACB;&#x8DB3;&#x591F;&#x5927;&#x7684;&#x6D4B;&#x8BD5;&#x96C6;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x8FD9;&#x4E48;&#x8BC4;&#x4F30;&#x5C31;&#x884C;&#x4E86;&#xFF0C;&#x53EF;&#x80FD;&#x53EA;&#x9700;&#x8981;&#x8FDC;&#x8FDC;&#x5C0F;&#x4E8E;&#x603B;&#x4F53;&#x6570;&#x636E;&#x91CF;&#x7684;30%&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x6211;&#x5E0C;&#x671B;&#x672C;&#x89C6;&#x9891;&#x80FD;&#x7ED9;&#x4F60;&#x4EEC;&#x4E00;&#x70B9;&#x6307;&#x5BFC;&#x548C;&#x5EFA;&#x8BAE;&#xFF0C;&#x8BA9;&#x4F60;&#x4EEC;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x5728;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x65F6;&#x4EE3;&#x8BBE;&#x7ACB;&#x5F00;&#x53D1;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x5728;&#x7814;&#x7A76;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x95EE;&#x9898;&#x9014;&#x4E2D;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x66F4;&#x6539;&#x8BC4;&#x4F30;&#x6307;&#x6807;&#xFF0C;&#x6216;&#x8005;&#x6539;&#x52A8;&#x4F60;&#x7684;&#x5F00;&#x53D1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x8BB2;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x9700;&#x8981;&#x8FD9;&#x6837;&#x505A;&#x3002;</p>
<h3 id="17-&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x8BE5;&#x6539;&#x53D8;&#x5F00;&#x53D1;&#x6D4B;&#x8BD5;&#x96C6;&#x548C;&#x6307;&#x6807;&#xFF1F;&#xFF08;when-to-change-devtest-sets-and-metrics&#xFF09;">1.7 &#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x8BE5;&#x6539;&#x53D8;&#x5F00;&#x53D1;/&#x6D4B;&#x8BD5;&#x96C6;&#x548C;&#x6307;&#x6807;&#xFF1F;&#xFF08;When to change dev/test sets and metrics&#xFF09;</h3>
<p>&#x4F60;&#x5DF2;&#x7ECF;&#x5B66;&#x8FC7;&#x5982;&#x4F55;&#x8BBE;&#x7F6E;&#x5F00;&#x53D1;&#x96C6;&#x548C;&#x8BC4;&#x4F30;&#x6307;&#x6807;&#xFF0C;&#x5C31;&#x50CF;&#x662F;&#x628A;&#x76EE;&#x6807;&#x5B9A;&#x5728;&#x67D0;&#x4E2A;&#x4F4D;&#x7F6E;&#xFF0C;&#x8BA9;&#x4F60;&#x7684;&#x56E2;&#x961F;&#x7784;&#x51C6;&#x3002;&#x4F46;&#x6709;&#x65F6;&#x5019;&#x5728;&#x9879;&#x76EE;&#x8FDB;&#x884C;&#x9014;&#x4E2D;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x610F;&#x8BC6;&#x5230;&#xFF0C;&#x76EE;&#x6807;&#x7684;&#x4F4D;&#x7F6E;&#x653E;&#x9519;&#x4E86;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x79FB;&#x52A8;&#x4F60;&#x7684;&#x76EE;&#x6807;&#x3002;</p>
<p><img src="../images/a946c85f961f3dbf0a3324535076a78a.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5047;&#x8BBE;&#x4F60;&#x5728;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x732B;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x8BD5;&#x56FE;&#x627E;&#x5230;&#x5F88;&#x591A;&#x732B;&#x7684;&#x7167;&#x7247;&#xFF0C;&#x5411;&#x4F60;&#x7684;&#x7231;&#x732B;&#x4EBA;&#x58EB;&#x7528;&#x6237;&#x5C55;&#x793A;&#xFF0C;&#x4F60;&#x51B3;&#x5B9A;&#x4F7F;&#x7528;&#x7684;&#x6307;&#x6807;&#x662F;&#x5206;&#x7C7B;&#x9519;&#x8BEF;&#x7387;&#x3002;&#x6240;&#x4EE5;&#x7B97;&#x6CD5;$A$&#x548C;$B$&#x5206;&#x522B;&#x6709;3&#xFF05;&#x9519;&#x8BEF;&#x7387;&#x548C;5&#xFF05;&#x9519;&#x8BEF;&#x7387;&#xFF0C;&#x6240;&#x4EE5;&#x7B97;&#x6CD5;$A$&#x4F3C;&#x4E4E;&#x505A;&#x5F97;&#x66F4;&#x597D;&#x3002;</p>
<p>&#x4F46;&#x6211;&#x4EEC;&#x5B9E;&#x9645;&#x8BD5;&#x4E00;&#x4E0B;&#x8FD9;&#x4E9B;&#x7B97;&#x6CD5;&#xFF0C;&#x4F60;&#x89C2;&#x5BDF;&#x4E00;&#x4E0B;&#x8FD9;&#x4E9B;&#x7B97;&#x6CD5;&#xFF0C;&#x7B97;&#x6CD5;$A$&#x7531;&#x4E8E;&#x67D0;&#x4E9B;&#x539F;&#x56E0;&#xFF0C;&#x628A;&#x5F88;&#x591A;&#x8272;&#x60C5;&#x56FE;&#x50CF;&#x5206;&#x7C7B;&#x6210;&#x732B;&#x4E86;&#x3002;&#x5982;&#x679C;&#x4F60;&#x90E8;&#x7F72;&#x7B97;&#x6CD5;$A$&#xFF0C;&#x90A3;&#x4E48;&#x7528;&#x6237;&#x5C31;&#x4F1A;&#x770B;&#x5230;&#x66F4;&#x591A;&#x732B;&#x56FE;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x8BC6;&#x522B;&#x732B;&#x7684;&#x9519;&#x8BEF;&#x7387;&#x53EA;&#x6709;3%&#xFF0C;&#x4F46;&#x5B83;&#x540C;&#x65F6;&#x4E5F;&#x4F1A;&#x7ED9;&#x7528;&#x6237;&#x63A8;&#x9001;&#x4E00;&#x4E9B;&#x8272;&#x60C5;&#x56FE;&#x50CF;&#xFF0C;&#x8FD9;&#x662F;&#x4F60;&#x7684;&#x516C;&#x53F8;&#x5B8C;&#x5168;&#x4E0D;&#x80FD;&#x63A5;&#x53D7;&#x7684;&#xFF0C;&#x4F60;&#x7684;&#x7528;&#x6237;&#x4E5F;&#x5B8C;&#x5168;&#x4E0D;&#x80FD;&#x63A5;&#x53D7;&#x3002;&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x7B97;&#x6CD5;$B$&#x6709;5&#xFF05;&#x7684;&#x9519;&#x8BEF;&#x7387;&#xFF0C;&#x8FD9;&#x6837;&#x5206;&#x7C7B;&#x5668;&#x5C31;&#x5F97;&#x5230;&#x8F83;&#x5C11;&#x7684;&#x56FE;&#x50CF;&#xFF0C;&#x4F46;&#x5B83;&#x4E0D;&#x4F1A;&#x63A8;&#x9001;&#x8272;&#x60C5;&#x56FE;&#x50CF;&#x3002;&#x6240;&#x4EE5;&#x4ECE;&#x4F60;&#x4EEC;&#x516C;&#x53F8;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x4EE5;&#x53CA;&#x4ECE;&#x7528;&#x6237;&#x63A5;&#x53D7;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x7B97;&#x6CD5;$B$&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x4E00;&#x4E2A;&#x66F4;&#x597D;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4E0D;&#x8BA9;&#x4EFB;&#x4F55;&#x8272;&#x60C5;&#x56FE;&#x50CF;&#x901A;&#x8FC7;&#x3002;</p>
<p><img src="../images/f8313f1a0ca63a71d0eb3b3b42453220.png" alt=""></p>
<p>&#x90A3;&#x4E48;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x60C5;&#x5C31;&#x662F;&#xFF0C;&#x7B97;&#x6CD5;A&#x5728;&#x8BC4;&#x4F30;&#x6307;&#x6807;&#x4E0A;&#x505A;&#x5F97;&#x66F4;&#x597D;&#xFF0C;&#x5B83;&#x7684;&#x9519;&#x8BEF;&#x7387;&#x8FBE;&#x5230;3%&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x4E2A;&#x66F4;&#x7CDF;&#x7CD5;&#x7684;&#x7B97;&#x6CD5;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8BC4;&#x4F30;&#x6307;&#x6807;&#x52A0;&#x4E0A;&#x5F00;&#x53D1;&#x96C6;&#x5B83;&#x4EEC;&#x90FD;&#x503E;&#x5411;&#x4E8E;&#x9009;&#x62E9;&#x7B97;&#x6CD5;$A$&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x4F1A;&#x8BF4;&#xFF0C;&#x770B;&#x7B97;&#x6CD5;A&#x7684;&#x9519;&#x8BEF;&#x7387;&#x8F83;&#x4F4E;&#xFF0C;&#x8FD9;&#x662F;&#x4F60;&#x4EEC;&#x81EA;&#x5DF1;&#x5B9A;&#x4E0B;&#x6765;&#x7684;&#x6307;&#x6807;&#x8BC4;&#x4F30;&#x51FA;&#x6765;&#x7684;&#x3002;&#x4F46;&#x4F60;&#x548C;&#x4F60;&#x7684;&#x7528;&#x6237;&#x66F4;&#x503E;&#x5411;&#x4E8E;&#x4F7F;&#x7528;&#x7B97;&#x6CD5;$B$&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4E0D;&#x4F1A;&#x5C06;&#x8272;&#x60C5;&#x56FE;&#x50CF;&#x5206;&#x7C7B;&#x4E3A;&#x732B;&#x3002;&#x6240;&#x4EE5;&#x5F53;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x53D1;&#x751F;&#x65F6;&#xFF0C;&#x5F53;&#x4F60;&#x7684;&#x8BC4;&#x4F30;&#x6307;&#x6807;&#x65E0;&#x6CD5;&#x6B63;&#x786E;&#x8861;&#x91CF;&#x7B97;&#x6CD5;&#x4E4B;&#x95F4;&#x7684;&#x4F18;&#x52A3;&#x6392;&#x5E8F;&#x65F6;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x539F;&#x6765;&#x7684;&#x6307;&#x6807;&#x9519;&#x8BEF;&#x5730;&#x9884;&#x6D4B;&#x7B97;&#x6CD5;A&#x662F;&#x66F4;&#x597D;&#x7684;&#x7B97;&#x6CD5;&#x8FD9;&#x5C31;&#x53D1;&#x51FA;&#x4E86;&#x4FE1;&#x53F7;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x6539;&#x53D8;&#x8BC4;&#x4F30;&#x6307;&#x6807;&#x4E86;&#xFF0C;&#x6216;&#x8005;&#x8981;&#x6539;&#x53D8;&#x5F00;&#x53D1;&#x96C6;&#x6216;&#x6D4B;&#x8BD5;&#x96C6;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F60;&#x7528;&#x7684;&#x5206;&#x7C7B;&#x9519;&#x8BEF;&#x7387;&#x6307;&#x6807;&#x53EF;&#x4EE5;&#x5199;&#x6210;&#x8FD9;&#x6837;&#xFF1A;</p>
<p>$Error = \frac{1}{m<em>&#xFF5B;&#xFF5B;dev}}}\sum</em>{i = 1}^{m<em>&#xFF5B;&#xFF5B;dev}}}{I{ y</em>&#xFF5B;&#xFF5B;pred}}^{(i)} \neq y^{(i)}}}$</p>
<p>$m<em>&#xFF5B;&#xFF5B;dev}}$&#x662F;&#x4F60;&#x7684;&#x5F00;&#x53D1;&#x96C6;&#x4F8B;&#x5B50;&#x6570;&#xFF0C;&#x7528;$y</em>&#xFF5B;&#xFF5B;pred}}^{(i)}$&#x8868;&#x793A;&#x9884;&#x6D4B;&#x503C;&#xFF0C;&#x5176;&#x503C;&#x4E3A;0&#x6216;1&#xFF0C;$I$&#x8FD9;&#x7B26;&#x53F7;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x7EDF;&#x8BA1;&#x51FA;&#x91CC;&#x9762;&#x8FD9;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x4E3A;&#x771F;&#x7684;&#x6837;&#x672C;&#x6570;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x516C;&#x5F0F;&#x5C31;&#x7EDF;&#x8BA1;&#x4E86;&#x5206;&#x7C7B;&#x9519;&#x8BEF;&#x7684;&#x6837;&#x672C;&#x3002;&#x8FD9;&#x4E2A;&#x8BC4;&#x4F30;&#x6307;&#x6807;&#x7684;&#x95EE;&#x9898;&#x5728;&#x4E8E;&#xFF0C;&#x5B83;&#x5BF9;&#x8272;&#x60C5;&#x56FE;&#x7247;&#x548C;&#x975E;&#x8272;&#x60C5;&#x56FE;&#x7247;&#x4E00;&#x89C6;&#x540C;&#x4EC1;&#xFF0C;&#x4F46;&#x4F60;&#x5176;&#x5B9E;&#x771F;&#x7684;&#x5E0C;&#x671B;&#x4F60;&#x7684;&#x5206;&#x7C7B;&#x5668;&#x4E0D;&#x4F1A;&#x9519;&#x8BEF;&#x6807;&#x8BB0;&#x8272;&#x60C5;&#x56FE;&#x50CF;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#x628A;&#x4E00;&#x5F20;&#x8272;&#x60C5;&#x56FE;&#x7247;&#x5206;&#x7C7B;&#x4E3A;&#x732B;&#xFF0C;&#x7136;&#x540E;&#x63A8;&#x9001;&#x7ED9;&#x4E0D;&#x77E5;&#x60C5;&#x7684;&#x7528;&#x6237;&#xFF0C;&#x4ED6;&#x4EEC;&#x770B;&#x5230;&#x8272;&#x60C5;&#x56FE;&#x7247;&#x4F1A;&#x975E;&#x5E38;&#x4E0D;&#x6EE1;&#x3002;</p>
<p><img src="../images/4abef099fe8437efd8aa47c7097e639d.png" alt=""></p>
<p>&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x4FEE;&#x6539;&#x8BC4;&#x4F30;&#x6307;&#x6807;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#xFF0C;&#x8FD9;&#x91CC;&#xFF08;$\frac{1}{m<em>&#xFF5B;&#xFF5B;dev}}}$&#x4E0E;$\sum</em>{i =1}^{m<em>&#xFF5B;&#xFF5B;dev}}}{I{ y</em>&#xFF5B;&#xFF5B;pred}}^{(i)} \neq y^{(i)}}}$&#x4E4B;&#x95F4;&#xFF09;&#x52A0;&#x4E2A;&#x6743;&#x91CD;&#x9879;&#xFF0C;&#x5373;&#xFF1A;</p>
<p>$Error = \frac{1}{m<em>&#xFF5B;&#xFF5B;dev}}}\sum</em>{i = 1}^{m<em>&#xFF5B;&#xFF5B;dev}}}{w^{(i)}I{ y</em>&#xFF5B;&#xFF5B;pred}}^{(i)} \neq y^{(i)}}}$</p>
<p>&#x6211;&#x4EEC;&#x5C06;&#x8FD9;&#x4E2A;&#x79F0;&#x4E3A;$w^{\left( i \right)}$&#xFF0C;&#x5176;&#x4E2D;&#x5982;&#x679C;&#x56FE;&#x7247;$x^{(i)}$&#x4E0D;&#x662F;&#x8272;&#x60C5;&#x56FE;&#x7247;&#xFF0C;&#x5219;$w^{\left( i \right)} = 1$&#x3002;&#x5982;&#x679C;$x^{(i)}$&#x662F;&#x8272;&#x60C5;&#x56FE;&#x7247;&#xFF0C;$w^{(i)}$&#x53EF;&#x80FD;&#x5C31;&#x662F;10&#x751A;&#x81F3;100&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x8D4B;&#x4E88;&#x4E86;&#x8272;&#x60C5;&#x56FE;&#x7247;&#x66F4;&#x5927;&#x7684;&#x6743;&#x91CD;&#xFF0C;&#x8BA9;&#x7B97;&#x6CD5;&#x5C06;&#x8272;&#x60C5;&#x56FE;&#x5206;&#x7C7B;&#x4E3A;&#x732B;&#x56FE;&#x65F6;&#xFF0C;&#x9519;&#x8BEF;&#x7387;&#x8FD9;&#x4E2A;&#x9879;&#x5FEB;&#x901F;&#x53D8;&#x5927;&#x3002;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x91CC;&#xFF0C;&#x4F60;&#x628A;&#x8272;&#x60C5;&#x56FE;&#x7247;&#x5206;&#x7C7B;&#x6210;&#x732B;&#x8FD9;&#x4E00;&#x9519;&#x8BEF;&#x7684;&#x60E9;&#x7F5A;&#x6743;&#x91CD;&#x52A0;&#x5927;10&#x500D;&#x3002;</p>
<p><img src="../images/fabea6c50883bf1afaf630d068a4009f.png" alt=""></p>
<p>&#x5982;&#x679C;&#x4F60;&#x5E0C;&#x671B;&#x5F97;&#x5230;&#x5F52;&#x4E00;&#x5316;&#x5E38;&#x6570;&#xFF0C;&#x5728;&#x6280;&#x672F;&#x4E0A;&#xFF0C;&#x5C31;&#x662F;$w^{(i)}$&#x5BF9;&#x6240;&#x6709;$i$&#x6C42;&#x548C;&#xFF0C;&#x8FD9;&#x6837;&#x9519;&#x8BEF;&#x7387;&#x4ECD;&#x7136;&#x5728;0&#x548C;1&#x4E4B;&#x95F4;&#xFF0C;&#x5373;&#xFF1A;</p>
<p>$Error = \frac{1}{\sum<em>{}^{}w^{(i)}}\sum</em>{i = 1}^{m<em>&#xFF5B;&#xFF5B;dev}}}{w^{(i)}I{ y</em>&#xFF5B;&#xFF5B;pred}}^{(i)} \neq y^{(i)}}}$</p>
<p>&#x52A0;&#x6743;&#x7684;&#x7EC6;&#x8282;&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x8981;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x52A0;&#x6743;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x81EA;&#x5DF1;&#x8FC7;&#x4E00;&#x904D;&#x5F00;&#x53D1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#xFF0C;&#x5728;&#x5F00;&#x53D1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x91CC;&#xFF0C;&#x81EA;&#x5DF1;&#x628A;&#x8272;&#x60C5;&#x56FE;&#x7247;&#x6807;&#x8BB0;&#x51FA;&#x6765;&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x624D;&#x80FD;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x52A0;&#x6743;&#x51FD;&#x6570;&#x3002;</p>
<p>&#x4F46;&#x7C97;&#x7565;&#x7684;&#x7ED3;&#x8BBA;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7684;&#x8BC4;&#x4F30;&#x6307;&#x6807;&#x65E0;&#x6CD5;&#x6B63;&#x786E;&#x8BC4;&#x4F30;&#x597D;&#x7B97;&#x6CD5;&#x7684;&#x6392;&#x540D;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x9700;&#x8981;&#x82B1;&#x65F6;&#x95F4;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x8BC4;&#x4F30;&#x6307;&#x6807;&#x3002;&#x8FD9;&#x662F;&#x5B9A;&#x4E49;&#x8BC4;&#x4F30;&#x6307;&#x6807;&#x7684;&#x5176;&#x4E2D;&#x4E00;&#x79CD;&#x53EF;&#x80FD;&#x65B9;&#x5F0F;&#xFF08;&#x4E0A;&#x8FF0;&#x52A0;&#x6743;&#x6CD5;&#xFF09;&#x3002;&#x8BC4;&#x4F30;&#x6307;&#x6807;&#x7684;&#x610F;&#x4E49;&#x5728;&#x4E8E;&#xFF0C;&#x51C6;&#x786E;&#x544A;&#x8BC9;&#x4F60;&#x5DF2;&#x77E5;&#x4E24;&#x4E2A;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x54EA;&#x4E00;&#x4E2A;&#x66F4;&#x9002;&#x5408;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x3002;&#x5C31;&#x8FD9;&#x4E2A;&#x89C6;&#x9891;&#x7684;&#x5185;&#x5BB9;&#x800C;&#x8A00;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x592A;&#x6CE8;&#x91CD;&#x65B0;&#x9519;&#x8BEF;&#x7387;&#x6307;&#x6807;&#x662F;&#x600E;&#x4E48;&#x5B9A;&#x4E49;&#x7684;&#xFF0C;&#x5173;&#x952E;&#x5728;&#x4E8E;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x65E7;&#x7684;&#x9519;&#x8BEF;&#x7387;&#x6307;&#x6807;&#x4E0D;&#x6EE1;&#x610F;&#xFF0C;&#x90A3;&#x5C31;&#x4E0D;&#x8981;&#x4E00;&#x76F4;&#x6CBF;&#x7528;&#x4F60;&#x4E0D;&#x6EE1;&#x610F;&#x7684;&#x9519;&#x8BEF;&#x7387;&#x6307;&#x6807;&#xFF0C;&#x800C;&#x5E94;&#x8BE5;&#x5C1D;&#x8BD5;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x6307;&#x6807;&#xFF0C;&#x80FD;&#x591F;&#x66F4;&#x52A0;&#x7B26;&#x5408;&#x4F60;&#x7684;&#x504F;&#x597D;&#xFF0C;&#x5B9A;&#x4E49;&#x51FA;&#x5B9E;&#x9645;&#x66F4;&#x9002;&#x5408;&#x7684;&#x7B97;&#x6CD5;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x80FD;&#x6CE8;&#x610F;&#x5230;&#x4E86;&#xFF0C;&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x6211;&#x4EEC;&#x53EA;&#x8BA8;&#x8BBA;&#x4E86;&#x5982;&#x4F55;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x6307;&#x6807;&#x53BB;&#x8BC4;&#x4F30;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x8BC4;&#x4F30;&#x6307;&#x6807;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x66F4;&#x597D;&#x7684;&#x628A;&#x5206;&#x7C7B;&#x5668;&#x6392;&#x5E8F;&#xFF0C;&#x80FD;&#x591F;&#x533A;&#x5206;&#x51FA;&#x5B83;&#x4EEC;&#x5728;&#x8BC6;&#x522B;&#x8272;&#x60C5;&#x56FE;&#x7247;&#x7684;&#x4E0D;&#x540C;&#x6C34;&#x5E73;&#xFF0C;&#x8FD9;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x4E00;&#x4E2A;&#x6B63;&#x4EA4;&#x5316;&#x7684;&#x4F8B;&#x5B50;&#x3002;</p>
<p><img src="../images/12c7390dfc8b80057483de00d0d2c7b7.png" alt=""></p>
<p>&#x6211;&#x60F3;&#x4F60;&#x5904;&#x7406;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x5E94;&#x8BE5;&#x628A;&#x5B83;&#x5207;&#x5206;&#x6210;&#x72EC;&#x7ACB;&#x7684;&#x6B65;&#x9AA4;&#x3002;&#x4E00;&#x6B65;&#x662F;&#x5F04;&#x6E05;&#x695A;&#x5982;&#x4F55;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x6307;&#x6807;&#x6765;&#x8861;&#x91CF;&#x4F60;&#x60F3;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5206;&#x5F00;&#x8003;&#x8651;&#x5982;&#x4F55;&#x6539;&#x5584;&#x7CFB;&#x7EDF;&#x5728;&#x8FD9;&#x4E2A;&#x6307;&#x6807;&#x4E0A;&#x7684;&#x8868;&#x73B0;&#x3002;&#x4F60;&#x4EEC;&#x8981;&#x628A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4EFB;&#x52A1;&#x770B;&#x6210;&#x4E24;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x6B65;&#x9AA4;&#xFF0C;&#x7528;&#x76EE;&#x6807;&#x8FD9;&#x4E2A;&#x6BD4;&#x55BB;&#xFF0C;&#x7B2C;&#x4E00;&#x6B65;&#x5C31;&#x662F;&#x8BBE;&#x5B9A;&#x76EE;&#x6807;&#x3002;&#x6240;&#x4EE5;&#x8981;&#x5B9A;&#x4E49;&#x4F60;&#x8981;&#x7784;&#x51C6;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x8FD9;&#x662F;&#x5B8C;&#x5168;&#x72EC;&#x7ACB;&#x7684;&#x4E00;&#x6B65;&#xFF0C;&#x8FD9;&#x662F;&#x4F60;&#x53EF;&#x4EE5;&#x8C03;&#x8282;&#x7684;&#x4E00;&#x4E2A;&#x65CB;&#x94AE;&#x3002;&#x5982;&#x4F55;&#x8BBE;&#x7ACB;&#x76EE;&#x6807;&#x662F;&#x4E00;&#x4E2A;&#x5B8C;&#x5168;&#x72EC;&#x7ACB;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x628A;&#x5B83;&#x770B;&#x6210;&#x662F;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x65CB;&#x94AE;&#xFF0C;&#x53EF;&#x4EE5;&#x8C03;&#x8BD5;&#x7B97;&#x6CD5;&#x8868;&#x73B0;&#x7684;&#x65CB;&#x94AE;&#xFF0C;&#x5982;&#x4F55;&#x7CBE;&#x786E;&#x7784;&#x51C6;&#xFF0C;&#x5982;&#x4F55;&#x547D;&#x4E2D;&#x76EE;&#x6807;&#xFF0C;&#x5B9A;&#x4E49;&#x6307;&#x6807;&#x662F;&#x7B2C;&#x4E00;&#x6B65;&#x3002;</p>
<p><img src="../images/96140fe852c219ca5307026abc7bdd4e.png" alt=""></p>
<p>&#x7136;&#x540E;&#x7B2C;&#x4E8C;&#x6B65;&#x8981;&#x505A;&#x522B;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5728;&#x903C;&#x8FD1;&#x76EE;&#x6807;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E5F;&#x8BB8;&#x4F60;&#x7684;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x9488;&#x5BF9;&#x67D0;&#x4E2A;&#x957F;&#x8FD9;&#x6837;&#x7684;&#x6210;&#x672C;&#x51FD;&#x6570;&#x4F18;&#x5316;&#xFF0C;$J=\frac{1}{m}\sum\limits_{i=1}^{m}{L(&#xFF5B;&#xFF5B;\hat y}^{(i)}},&#xFF5B;&#xFF5B;y}^{(i)}})}$&#xFF0C;&#x4F60;&#x8981;&#x6700;&#x5C0F;&#x5316;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x7684;&#x635F;&#x5931;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x505A;&#x7684;&#x5176;&#x4E2D;&#x4E00;&#x4EF6;&#x4E8B;&#x662F;&#xFF0C;&#x4FEE;&#x6539;&#x8FD9;&#x4E2A;&#xFF0C;&#x4E3A;&#x4E86;&#x5F15;&#x5165;&#x8FD9;&#x4E9B;&#x6743;&#x91CD;&#xFF0C;&#x4E5F;&#x8BB8;&#x6700;&#x540E;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x8FD9;&#x4E2A;&#x5F52;&#x4E00;&#x5316;&#x5E38;&#x6570;&#xFF0C;&#x5373;&#xFF1A;</p>
<p>$J=\frac{1}{\sum&#xFF5B;&#xFF5B;{w}^{(i)}}}}\sum\limits_{i=1}^{m}&#xFF5B;&#xFF5B;{w}^{(i)}}L(&#xFF5B;&#xFF5B;\hat y}^{(i)}},&#xFF5B;&#xFF5B;y}^{(i)}})}$</p>
<p>&#x518D;&#x6B21;&#xFF0C;&#x5982;&#x4F55;&#x5B9A;&#x4E49;$J$&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x5173;&#x952E;&#x5728;&#x4E8E;&#x6B63;&#x4EA4;&#x5316;&#x7684;&#x601D;&#x8DEF;&#xFF0C;&#x628A;&#x8BBE;&#x7ACB;&#x76EE;&#x6807;&#x5B9A;&#x4E3A;&#x7B2C;&#x4E00;&#x6B65;&#xFF0C;&#x7136;&#x540E;&#x7784;&#x51C6;&#x548C;&#x5C04;&#x51FB;&#x76EE;&#x6807;&#x662F;&#x72EC;&#x7ACB;&#x7684;&#x7B2C;&#x4E8C;&#x6B65;&#x3002;&#x6362;&#x79CD;&#x8BF4;&#x6CD5;&#xFF0C;&#x6211;&#x9F13;&#x52B1;&#x4F60;&#x4EEC;&#x5C06;&#x5B9A;&#x4E49;&#x6307;&#x6807;&#x770B;&#x6210;&#x4E00;&#x6B65;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x5B9A;&#x4E49;&#x4E86;&#x6307;&#x6807;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x624D;&#x80FD;&#x60F3;&#x5982;&#x4F55;&#x4F18;&#x5316;&#x7CFB;&#x7EDF;&#x6765;&#x63D0;&#x9AD8;&#x8FD9;&#x4E2A;&#x6307;&#x6807;&#x8BC4;&#x5206;&#x3002;&#x6BD4;&#x5982;&#x6539;&#x53D8;&#x4F60;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8981;&#x4F18;&#x5316;&#x7684;&#x6210;&#x672C;&#x51FD;&#x6570;$J$&#x3002;</p>
<p>&#x5728;&#x7EE7;&#x7EED;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x518D;&#x8BB2;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x3002;&#x5047;&#x8BBE;&#x4F60;&#x7684;&#x4E24;&#x4E2A;&#x732B;&#x5206;&#x7C7B;&#x5668;$A$&#x548C;$B$&#xFF0C;&#x5206;&#x522B;&#x6709;&#x7528;&#x5F00;&#x53D1;&#x96C6;&#x8BC4;&#x4F30;&#x5F97;&#x5230;3%&#x7684;&#x9519;&#x8BEF;&#x7387;&#x548C;5%&#x7684;&#x9519;&#x8BEF;&#x7387;&#x3002;&#x6216;&#x8005;&#x751A;&#x81F3;&#x7528;&#x5728;&#x7F51;&#x4E0A;&#x4E0B;&#x8F7D;&#x7684;&#x56FE;&#x7247;&#x6784;&#x6210;&#x7684;&#x6D4B;&#x8BD5;&#x96C6;&#x4E0A;&#xFF0C;&#x8FD9;&#x4E9B;&#x662F;&#x9AD8;&#x8D28;&#x91CF;&#xFF0C;&#x53D6;&#x666F;&#x6846;&#x5F88;&#x4E13;&#x4E1A;&#x7684;&#x56FE;&#x50CF;&#x3002;&#x4F46;&#x4E5F;&#x8BB8;&#x4F60;&#x5728;&#x90E8;&#x7F72;&#x7B97;&#x6CD5;&#x4EA7;&#x54C1;&#x65F6;&#xFF0C;&#x4F60;&#x53D1;&#x73B0;&#x7B97;&#x6CD5;$B$&#x770B;&#x8D77;&#x6765;&#x8868;&#x73B0;&#x66F4;&#x597D;&#xFF0C;&#x5373;&#x4F7F;&#x5B83;&#x5728;&#x5F00;&#x53D1;&#x96C6;&#x4E0A;&#x8868;&#x73B0;&#x4E0D;&#x9519;&#xFF0C;&#x4F60;&#x53D1;&#x73B0;&#x4F60;&#x4E00;&#x76F4;&#x5728;&#x7528;&#x4ECE;&#x7F51;&#x4E0A;&#x4E0B;&#x8F7D;&#x7684;&#x9AD8;&#x8D28;&#x91CF;&#x56FE;&#x7247;&#x8BAD;&#x7EC3;&#xFF0C;&#x4F46;&#x5F53;&#x4F60;&#x90E8;&#x7F72;&#x5230;&#x624B;&#x673A;&#x5E94;&#x7528;&#x65F6;&#xFF0C;&#x7B97;&#x6CD5;&#x4F5C;&#x7528;&#x5230;&#x7528;&#x6237;&#x4E0A;&#x4F20;&#x7684;&#x56FE;&#x7247;&#x65F6;&#xFF0C;&#x90A3;&#x4E9B;&#x56FE;&#x7247;&#x53D6;&#x666F;&#x4E0D;&#x4E13;&#x4E1A;&#xFF0C;&#x6CA1;&#x6709;&#x628A;&#x732B;&#x5B8C;&#x6574;&#x62CD;&#x4E0B;&#x6765;&#xFF0C;&#x6216;&#x8005;&#x732B;&#x7684;&#x8868;&#x60C5;&#x5F88;&#x53E4;&#x602A;&#xFF0C;&#x4E5F;&#x8BB8;&#x56FE;&#x50CF;&#x5F88;&#x6A21;&#x7CCA;&#xFF0C;&#x5F53;&#x4F60;&#x5B9E;&#x9645;&#x6D4B;&#x8BD5;&#x7B97;&#x6CD5;&#x65F6;&#xFF0C;&#x4F60;&#x53D1;&#x73B0;&#x7B97;&#x6CD5;$B$&#x8868;&#x73B0;&#x5176;&#x5B9E;&#x66F4;&#x597D;&#x3002;</p>
<p><img src="../images/2a10911b9711830e17a491d7c20526c5.png" alt=""></p>
<p>&#x8FD9;&#x662F;&#x53E6;&#x4E00;&#x4E2A;&#x6307;&#x6807;&#x548C;&#x5F00;&#x53D1;&#x96C6;&#x6D4B;&#x8BD5;&#x96C6;&#x51FA;&#x95EE;&#x9898;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x95EE;&#x9898;&#x5728;&#x4E8E;&#xFF0C;&#x4F60;&#x505A;&#x8BC4;&#x4F30;&#x7528;&#x7684;&#x662F;&#x5F88;&#x6F02;&#x4EAE;&#x7684;&#x9AD8;&#x5206;&#x8FA8;&#x7387;&#x7684;&#x5F00;&#x53D1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#xFF0C;&#x56FE;&#x7247;&#x53D6;&#x666F;&#x5F88;&#x4E13;&#x4E1A;&#x3002;&#x4F46;&#x4F60;&#x7684;&#x7528;&#x6237;&#x771F;&#x6B63;&#x5173;&#x5FC3;&#x7684;&#x662F;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E0A;&#x4F20;&#x7684;&#x56FE;&#x7247;&#x80FD;&#x4E0D;&#x80FD;&#x88AB;&#x6B63;&#x786E;&#x8BC6;&#x522B;&#x3002;&#x90A3;&#x4E9B;&#x56FE;&#x7247;&#x53EF;&#x80FD;&#x662F;&#x6CA1;&#x90A3;&#x4E48;&#x4E13;&#x4E1A;&#x7684;&#x7167;&#x7247;&#xFF0C;&#x6709;&#x70B9;&#x6A21;&#x7CCA;&#xFF0C;&#x53D6;&#x666F;&#x5F88;&#x4E1A;&#x4F59;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x65B9;&#x9488;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5728;&#x6307;&#x6807;&#x4E0A;&#x8868;&#x73B0;&#x5F88;&#x597D;&#xFF0C;&#x5728;&#x5F53;&#x524D;&#x5F00;&#x53D1;&#x96C6;&#x6216;&#x8005;&#x5F00;&#x53D1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x5206;&#x5E03;&#x4E2D;&#x8868;&#x73B0;&#x5F88;&#x597D;&#xFF0C;&#x4F46;&#x4F60;&#x7684;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F60;&#x771F;&#x6B63;&#x5173;&#x6CE8;&#x7684;&#x5730;&#x65B9;&#x8868;&#x73B0;&#x4E0D;&#x597D;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x6307;&#x6807;&#x6216;&#x8005;&#x4F60;&#x7684;&#x5F00;&#x53D1;&#x6D4B;&#x8BD5;&#x96C6;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x53D1;&#x73B0;&#x4F60;&#x7684;&#x5F00;&#x53D1;&#x6D4B;&#x8BD5;&#x96C6;&#x90FD;&#x662F;&#x8FD9;&#x4E9B;&#x9AD8;&#x8D28;&#x91CF;&#x56FE;&#x50CF;&#xFF0C;&#x4F46;&#x5728;&#x5F00;&#x53D1;&#x6D4B;&#x8BD5;&#x96C6;&#x4E0A;&#x505A;&#x7684;&#x8BC4;&#x4F30;&#x65E0;&#x6CD5;&#x9884;&#x6D4B;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x5B9E;&#x9645;&#x7684;&#x8868;&#x73B0;&#x3002;&#x56E0;&#x4E3A;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x5904;&#x7406;&#x7684;&#x662F;&#x4F4E;&#x8D28;&#x91CF;&#x56FE;&#x50CF;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x5E94;&#x8BE5;&#x6539;&#x53D8;&#x4F60;&#x7684;&#x5F00;&#x53D1;&#x6D4B;&#x8BD5;&#x96C6;&#xFF0C;&#x8BA9;&#x4F60;&#x7684;&#x6570;&#x636E;&#x66F4;&#x80FD;&#x53CD;&#x6620;&#x4F60;&#x5B9E;&#x9645;&#x9700;&#x8981;&#x5904;&#x7406;&#x597D;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<p>&#x4F46;&#x603B;&#x4F53;&#x65B9;&#x9488;&#x5C31;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5F53;&#x524D;&#x7684;&#x6307;&#x6807;&#x548C;&#x5F53;&#x524D;&#x7528;&#x6765;&#x8BC4;&#x4F30;&#x7684;&#x6570;&#x636E;&#x548C;&#x4F60;&#x771F;&#x6B63;&#x5173;&#x5FC3;&#x5FC5;&#x987B;&#x505A;&#x597D;&#x7684;&#x4E8B;&#x60C5;&#x5173;&#x7CFB;&#x4E0D;&#x5927;&#xFF0C;&#x90A3;&#x5C31;&#x5E94;&#x8BE5;&#x66F4;&#x6539;&#x4F60;&#x7684;&#x6307;&#x6807;&#x6216;&#x8005;&#x4F60;&#x7684;&#x5F00;&#x53D1;&#x6D4B;&#x8BD5;&#x96C6;&#xFF0C;&#x8BA9;&#x5B83;&#x4EEC;&#x80FD;&#x66F4;&#x591F;&#x597D;&#x5730;&#x53CD;&#x6620;&#x4F60;&#x7684;&#x7B97;&#x6CD5;&#x9700;&#x8981;&#x5904;&#x7406;&#x597D;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<p>&#x6709;&#x4E00;&#x4E2A;&#x8BC4;&#x4F30;&#x6307;&#x6807;&#x548C;&#x5F00;&#x53D1;&#x96C6;&#x8BA9;&#x4F60;&#x53EF;&#x4EE5;&#x66F4;&#x5FEB;&#x505A;&#x51FA;&#x51B3;&#x7B56;&#xFF0C;&#x5224;&#x65AD;&#x7B97;&#x6CD5;$A$&#x8FD8;&#x662F;&#x7B97;&#x6CD5;$B$&#x66F4;&#x4F18;&#xFF0C;&#x8FD9;&#x771F;&#x7684;&#x53EF;&#x4EE5;&#x52A0;&#x901F;&#x4F60;&#x548C;&#x4F60;&#x7684;&#x56E2;&#x961F;&#x8FED;&#x4EE3;&#x7684;&#x901F;&#x5EA6;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x7684;&#x5EFA;&#x8BAE;&#x662F;&#xFF0C;&#x5373;&#x4F7F;&#x4F60;&#x65E0;&#x6CD5;&#x5B9A;&#x4E49;&#x51FA;&#x4E00;&#x4E2A;&#x5F88;&#x5B8C;&#x7F8E;&#x7684;&#x8BC4;&#x4F30;&#x6307;&#x6807;&#x548C;&#x5F00;&#x53D1;&#x96C6;&#xFF0C;&#x4F60;&#x76F4;&#x63A5;&#x5FEB;&#x901F;&#x8BBE;&#x7ACB;&#x51FA;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x6765;&#x9A71;&#x52A8;&#x4F60;&#x4EEC;&#x56E2;&#x961F;&#x7684;&#x8FED;&#x4EE3;&#x901F;&#x5EA6;&#x3002;&#x5982;&#x679C;&#x5728;&#x8FD9;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x53D1;&#x73B0;&#x9009;&#x7684;&#x4E0D;&#x597D;&#xFF0C;&#x4F60;&#x6709;&#x66F4;&#x597D;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x90A3;&#x4E48;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x9A6C;&#x4E0A;&#x6539;&#x3002;&#x5BF9;&#x4E8E;&#x5927;&#x591A;&#x6570;&#x56E2;&#x961F;&#xFF0C;&#x6211;&#x5EFA;&#x8BAE;&#x6700;&#x597D;&#x4E0D;&#x8981;&#x5728;&#x6CA1;&#x6709;&#x8BC4;&#x4F30;&#x6307;&#x6807;&#x548C;&#x5F00;&#x53D1;&#x96C6;&#x65F6;&#x8DD1;&#x592A;&#x4E45;&#xFF0C;&#x56E0;&#x4E3A;&#x90A3;&#x6837;&#x53EF;&#x80FD;&#x4F1A;&#x51CF;&#x6162;&#x4F60;&#x7684;&#x56E2;&#x961F;&#x8FED;&#x4EE3;&#x548C;&#x6539;&#x5584;&#x7B97;&#x6CD5;&#x7684;&#x901F;&#x5EA6;&#x3002;&#x672C;&#x89C6;&#x9891;&#x8BB2;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x9700;&#x8981;&#x6539;&#x53D8;&#x4F60;&#x7684;&#x8BC4;&#x4F30;&#x6307;&#x6807;&#x548C;&#x5F00;&#x53D1;&#x6D4B;&#x8BD5;&#x96C6;&#xFF0C;&#x6211;&#x5E0C;&#x671B;&#x8FD9;&#x4E9B;&#x65B9;&#x9488;&#x80FD;&#x8BA9;&#x4F60;&#x7684;&#x6574;&#x4E2A;&#x56E2;&#x961F;&#x8BBE;&#x7ACB;&#x4E00;&#x4E2A;&#x660E;&#x786E;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x4E00;&#x4E2A;&#x4F60;&#x4EEC;&#x53EF;&#x4EE5;&#x9AD8;&#x6548;&#x8FED;&#x4EE3;&#xFF0C;&#x6539;&#x5584;&#x6027;&#x80FD;&#x7684;&#x76EE;&#x6807;&#x3002;</p>
<h3 id="18-&#x4E3A;&#x4EC0;&#x4E48;&#x662F;&#x4EBA;&#x7684;&#x8868;&#x73B0;&#xFF1F;&#xFF08;why-human-level-performance&#xFF09;">1.8 &#x4E3A;&#x4EC0;&#x4E48;&#x662F;&#x4EBA;&#x7684;&#x8868;&#x73B0;&#xFF1F;&#xFF08;Why human-level performance?&#xFF09;</h3>
<p>&#x5728;&#x8FC7;&#x53BB;&#x7684;&#x51E0;&#x5E74;&#x91CC;&#xFF0C;&#x66F4;&#x591A;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x56E2;&#x961F;&#x4E00;&#x76F4;&#x5728;&#x8BA8;&#x8BBA;&#x5982;&#x4F55;&#x6BD4;&#x8F83;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7CFB;&#x7EDF;&#x548C;&#x4EBA;&#x7C7B;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;</p>
<p>&#x6211;&#x8BA4;&#x4E3A;&#x6709;&#x4E24;&#x4E2A;&#x4E3B;&#x8981;&#x539F;&#x56E0;&#xFF0C;&#x9996;&#x5148;&#x662F;&#x56E0;&#x4E3A;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7CFB;&#x7EDF;&#x7684;&#x8FDB;&#x6B65;&#xFF0C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x7A81;&#x7136;&#x53D8;&#x5F97;&#x66F4;&#x597D;&#x4E86;&#x3002;&#x5728;&#x8BB8;&#x591A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x5E94;&#x7528;&#x9886;&#x57DF;&#x5DF2;&#x7ECF;&#x5F00;&#x59CB;&#x89C1;&#x5230;&#x7B97;&#x6CD5;&#x5DF2;&#x7ECF;&#x53EF;&#x4EE5;&#x5A01;&#x80C1;&#x5230;&#x4EBA;&#x7C7B;&#x7684;&#x8868;&#x73B0;&#x4E86;&#x3002;&#x5176;&#x6B21;&#xFF0C;&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#xFF0C;&#x5F53;&#x4F60;&#x8BD5;&#x56FE;&#x8BA9;&#x673A;&#x5668;&#x505A;&#x4EBA;&#x7C7B;&#x80FD;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x7CBE;&#x5FC3;&#x8BBE;&#x8BA1;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7CFB;&#x7EDF;&#x7684;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#xFF0C;&#x8BA9;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#x6548;&#x7387;&#x66F4;&#x9AD8;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x8FD9;&#x4E9B;&#x573A;&#x5408;&#xFF0C;&#x6BD4;&#x8F83;&#x4EBA;&#x7C7B;&#x548C;&#x673A;&#x5668;&#x662F;&#x5F88;&#x81EA;&#x7136;&#x7684;&#xFF0C;&#x6216;&#x8005;&#x4F60;&#x8981;&#x8BA9;&#x673A;&#x5668;&#x6A21;&#x4EFF;&#x4EBA;&#x7C7B;&#x7684;&#x884C;&#x4E3A;&#x3002;</p>
<p><img src="../images/f44d03275801ce5ec97503851eb22ad5.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x6765;&#x770B;&#x51E0;&#x4E2A;&#x8FD9;&#x6837;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x6211;&#x770B;&#x5230;&#x5F88;&#x591A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4EFB;&#x52A1;&#x4E2D;&#xFF0C;&#x5F53;&#x4F60;&#x5728;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x4E0A;&#x4ED8;&#x51FA;&#x4E86;&#x5F88;&#x591A;&#x65F6;&#x95F4;&#x4E4B;&#x540E;&#xFF0C;&#x6240;&#x4EE5;$x$&#x8F74;&#x662F;&#x65F6;&#x95F4;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x662F;&#x5F88;&#x591A;&#x4E2A;&#x6708;&#x751A;&#x81F3;&#x662F;&#x5F88;&#x591A;&#x5E74;&#x3002;&#x5728;&#x8FD9;&#x4E9B;&#x65F6;&#x95F4;&#x91CC;&#xFF0C;&#x4E00;&#x4E9B;&#x56E2;&#x961F;&#x6216;&#x4E00;&#x4E9B;&#x7814;&#x7A76;&#x5C0F;&#x7EC4;&#x6B63;&#x5728;&#x7814;&#x7A76;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5F53;&#x4F60;&#x5F00;&#x59CB;&#x5F80;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x52AA;&#x529B;&#x65F6;&#xFF0C;&#x8FDB;&#x5C55;&#x662F;&#x5F88;&#x5FEB;&#x7684;&#x3002;&#x4F46;&#x662F;&#x8FC7;&#x4E86;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x5F53;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x8868;&#x73B0;&#x6BD4;&#x4EBA;&#x7C7B;&#x66F4;&#x597D;&#x65F6;&#xFF0C;&#x90A3;&#x4E48;&#x8FDB;&#x5C55;&#x548C;&#x7CBE;&#x786E;&#x5EA6;&#x7684;&#x63D0;&#x5347;&#x5C31;&#x53D8;&#x5F97;&#x66F4;&#x6162;&#x4E86;&#x3002;&#x4E5F;&#x8BB8;&#x5B83;&#x8FD8;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x597D;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x8D85;&#x8D8A;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x4E4B;&#x540E;&#xFF0C;&#x5B83;&#x8FD8;&#x53EF;&#x4EE5;&#x53D8;&#x5F97;&#x66F4;&#x597D;&#xFF0C;&#x4F46;&#x6027;&#x80FD;&#x589E;&#x901F;&#xFF0C;&#x51C6;&#x786E;&#x5EA6;&#x4E0A;&#x5347;&#x7684;&#x901F;&#x5EA6;&#x8FD9;&#x4E2A;&#x659C;&#x7387;&#xFF0C;&#x4F1A;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x5E73;&#x7F13;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x5E0C;&#x671B;&#x80FD;&#x8FBE;&#x5230;&#x7406;&#x8BBA;&#x6700;&#x4F73;&#x6027;&#x80FD;&#x6C34;&#x5E73;&#x3002;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#xFF0C;&#x5F53;&#x60A8;&#x7EE7;&#x7EED;&#x8BAD;&#x7EC3;&#x7B97;&#x6CD5;&#x65F6;&#xFF0C;&#x53EF;&#x80FD;&#x6A21;&#x578B;&#x8D8A;&#x6765;&#x8D8A;&#x5927;&#xFF0C;&#x6570;&#x636E;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#xFF0C;&#x4F46;&#x662F;&#x6027;&#x80FD;&#x65E0;&#x6CD5;&#x8D85;&#x8FC7;&#x67D0;&#x4E2A;&#x7406;&#x8BBA;&#x4E0A;&#x9650;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684;&#x8D1D;&#x53F6;&#x65AF;&#x6700;&#x4F18;&#x9519;&#x8BEF;&#x7387;&#xFF08;<strong>Bayes optimal error</strong>&#xFF09;&#x3002;&#x6240;&#x4EE5;&#x8D1D;&#x53F6;&#x65AF;&#x6700;&#x4F18;&#x9519;&#x8BEF;&#x7387;&#x4E00;&#x822C;&#x8BA4;&#x4E3A;&#x662F;&#x7406;&#x8BBA;&#x4E0A;&#x53EF;&#x80FD;&#x8FBE;&#x5230;&#x7684;&#x6700;&#x4F18;&#x9519;&#x8BEF;&#x7387;&#xFF0C;&#x5C31;&#x662F;&#x8BF4;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x529E;&#x6CD5;&#x8BBE;&#x8BA1;&#x51FA;&#x4E00;&#x4E2A;$x$&#x5230;$y$&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x8BA9;&#x5B83;&#x80FD;&#x591F;&#x8D85;&#x8FC7;&#x4E00;&#x5B9A;&#x7684;&#x51C6;&#x786E;&#x5EA6;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x5BF9;&#x4E8E;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#x6765;&#x8BF4;&#xFF0C;&#x5982;&#x679C;$x$&#x662F;&#x97F3;&#x9891;&#x7247;&#x6BB5;&#xFF0C;&#x6709;&#x4E9B;&#x97F3;&#x9891;&#x5C31;&#x662F;&#x8FD9;&#x4E48;&#x5608;&#x6742;&#xFF0C;&#x57FA;&#x672C;&#x4E0D;&#x53EF;&#x80FD;&#x77E5;&#x9053;&#x8BF4;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x6240;&#x4EE5;&#x5B8C;&#x7F8E;&#x7684;&#x51C6;&#x786E;&#x7387;&#x53EF;&#x80FD;&#x4E0D;&#x662F;100%&#x3002;&#x6216;&#x8005;&#x5BF9;&#x4E8E;&#x732B;&#x56FE;&#x8BC6;&#x522B;&#x6765;&#x8BF4;&#xFF0C;&#x4E5F;&#x8BB8;&#x4E00;&#x4E9B;&#x56FE;&#x50CF;&#x975E;&#x5E38;&#x6A21;&#x7CCA;&#xFF0C;&#x4E0D;&#x7BA1;&#x662F;&#x4EBA;&#x7C7B;&#x8FD8;&#x662F;&#x673A;&#x5668;&#xFF0C;&#x90FD;&#x65E0;&#x6CD5;&#x5224;&#x65AD;&#x8BE5;&#x56FE;&#x7247;&#x4E2D;&#x662F;&#x5426;&#x6709;&#x732B;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5B8C;&#x7F8E;&#x7684;&#x51C6;&#x786E;&#x5EA6;&#x53EF;&#x80FD;&#x4E0D;&#x662F;100%&#x3002;</p>
<p>&#x800C;&#x8D1D;&#x53F6;&#x65AF;&#x6700;&#x4F18;&#x9519;&#x8BEF;&#x7387;&#x6709;&#x65F6;&#x5199;&#x4F5C;<strong>Bayesian</strong>&#xFF0C;&#x5373;&#x7701;&#x7565;<strong>optimal</strong>&#xFF0C;&#x5C31;&#x662F;&#x4ECE;$x$&#x5230;$y$&#x6620;&#x5C04;&#x7684;&#x7406;&#x8BBA;&#x6700;&#x4F18;&#x51FD;&#x6570;&#xFF0C;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x88AB;&#x8D85;&#x8D8A;&#x3002;&#x6240;&#x4EE5;&#x4F60;&#x4EEC;&#x5E94;&#x8BE5;&#x4E0D;&#x4F1A;&#x611F;&#x5230;&#x610F;&#x5916;&#xFF0C;&#x8FD9;&#x7D2B;&#x8272;&#x7EBF;&#xFF0C;&#x65E0;&#x8BBA;&#x4F60;&#x5728;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x4E0A;&#x5DE5;&#x4F5C;&#x591A;&#x5C11;&#x5E74;&#xFF0C;&#x4F60;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x8D85;&#x8D8A;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#xFF0C;&#x8D1D;&#x53F6;&#x65AF;&#x6700;&#x4F73;&#x9519;&#x8BEF;&#x7387;&#x3002;</p>
<p><img src="../images/e1ef954731399bb4fbf18f2fb99b863a.png" alt=""></p>
<p>&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#xFF0C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x8FDB;&#x5C55;&#x5F80;&#x5F80;&#x76F8;&#x5F53;&#x5FEB;&#xFF0C;&#x76F4;&#x5230;&#x4F60;&#x8D85;&#x8D8A;&#x4EBA;&#x7C7B;&#x7684;&#x8868;&#x73B0;&#x4E4B;&#x524D;&#x4E00;&#x76F4;&#x5F88;&#x5FEB;&#xFF0C;&#x5F53;&#x4F60;&#x8D85;&#x8D8A;&#x4EBA;&#x7C7B;&#x7684;&#x8868;&#x73B0;&#x65F6;&#xFF0C;&#x6709;&#x65F6;&#x8FDB;&#x5C55;&#x4F1A;&#x53D8;&#x6162;&#x3002;&#x6211;&#x8BA4;&#x4E3A;&#x6709;&#x4E24;&#x4E2A;&#x539F;&#x56E0;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x5F53;&#x4F60;&#x8D85;&#x8D8A;&#x4EBA;&#x7C7B;&#x7684;&#x8868;&#x73B0;&#x65F6;&#xFF0C;&#x8FDB;&#x5C55;&#x4F1A;&#x6162;&#x4E0B;&#x6765;&#x3002;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#x662F;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x5728;&#x5F88;&#x591A;&#x4EFB;&#x52A1;&#x4E2D;&#x79BB;&#x8D1D;&#x53F6;&#x65AF;&#x6700;&#x4F18;&#x9519;&#x8BEF;&#x7387;&#x5DF2;&#x7ECF;&#x4E0D;&#x8FDC;&#x4E86;&#xFF0C;&#x4EBA;&#x4EEC;&#x975E;&#x5E38;&#x64C5;&#x957F;&#x770B;&#x56FE;&#x50CF;&#xFF0C;&#x5206;&#x8FA8;&#x91CC;&#x9762;&#x6709;&#x6CA1;&#x6709;&#x732B;&#x6216;&#x8005;&#x542C;&#x5199;&#x97F3;&#x9891;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5F53;&#x4F60;&#x8D85;&#x8D8A;&#x4EBA;&#x7C7B;&#x7684;&#x8868;&#x73B0;&#x4E4B;&#x540E;&#x4E5F;&#x8BB8;&#x6CA1;&#x6709;&#x592A;&#x591A;&#x7684;&#x7A7A;&#x95F4;&#x7EE7;&#x7EED;&#x6539;&#x5584;&#x4E86;&#x3002;&#x4F46;&#x7B2C;&#x4E8C;&#x4E2A;&#x539F;&#x56E0;&#x662F;&#xFF0C;&#x53EA;&#x8981;&#x4F60;&#x7684;&#x8868;&#x73B0;&#x6BD4;&#x4EBA;&#x7C7B;&#x7684;&#x8868;&#x73B0;&#x66F4;&#x5DEE;&#xFF0C;&#x90A3;&#x4E48;&#x5B9E;&#x9645;&#x4E0A;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x67D0;&#x4E9B;&#x5DE5;&#x5177;&#x6765;&#x63D0;&#x9AD8;&#x6027;&#x80FD;&#x3002;&#x4E00;&#x65E6;&#x4F60;&#x8D85;&#x8D8A;&#x4E86;&#x4EBA;&#x7C7B;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#x5C31;&#x6CA1;&#x90A3;&#x4E48;&#x597D;&#x7528;&#x4E86;&#x3002;</p>
<p>&#x6211;&#x7684;&#x610F;&#x601D;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x5BF9;&#x4E8E;&#x4EBA;&#x7C7B;&#x76F8;&#x5F53;&#x64C5;&#x957F;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x5305;&#x62EC;&#x770B;&#x56FE;&#x8BC6;&#x522B;&#x4E8B;&#x7269;&#xFF0C;&#x542C;&#x5199;&#x97F3;&#x9891;&#xFF0C;&#x6216;&#x9605;&#x8BFB;&#x8BED;&#x8A00;&#xFF0C;&#x4EBA;&#x7C7B;&#x4E00;&#x822C;&#x5F88;&#x64C5;&#x957F;&#x5904;&#x7406;&#x8FD9;&#x4E9B;&#x81EA;&#x7136;&#x6570;&#x636E;&#x3002;&#x5BF9;&#x4E8E;&#x4EBA;&#x7C7B;&#x64C5;&#x957F;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x53EA;&#x8981;&#x4F60;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x6BD4;&#x4EBA;&#x7C7B;&#x5DEE;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x4ECE;&#x8BA9;&#x4EBA;&#x5E2E;&#x4F60;&#x6807;&#x8BB0;&#x6570;&#x636E;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8BA9;&#x4EBA;&#x5E2E;&#x5FD9;&#x6216;&#x8005;&#x82B1;&#x94B1;&#x8BF7;&#x4EBA;&#x5E2E;&#x4F60;&#x6807;&#x8BB0;&#x4F8B;&#x5B50;&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x5C31;&#x6709;&#x66F4;&#x591A;&#x7684;&#x6570;&#x636E;&#x53EF;&#x4EE5;&#x5582;&#x7ED9;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x3002;&#x4E0B;&#x5468;&#x6211;&#x4EEC;&#x4F1A;&#x8BA8;&#x8BBA;&#xFF0C;&#x4EBA;&#x5DE5;&#x9519;&#x8BEF;&#x7387;&#x5206;&#x6790;&#xFF0C;&#x4F46;&#x53EA;&#x8981;&#x4EBA;&#x7C7B;&#x7684;&#x8868;&#x73B0;&#x6BD4;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x7B97;&#x6CD5;&#x90FD;&#x8981;&#x597D;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x8BA9;&#x4EBA;&#x7C7B;&#x770B;&#x770B;&#x4F60;&#x7B97;&#x6CD5;&#x5904;&#x7406;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x77E5;&#x9053;&#x9519;&#x8BEF;&#x51FA;&#x5728;&#x54EA;&#x91CC;&#xFF0C;&#x5E76;&#x5C1D;&#x8BD5;&#x4E86;&#x89E3;&#x4E3A;&#x4EC0;&#x4E48;&#x4EBA;&#x80FD;&#x505A;&#x5BF9;&#xFF0C;&#x7B97;&#x6CD5;&#x505A;&#x9519;&#x3002;&#x4E0B;&#x5468;&#x6211;&#x4EEC;&#x4F1A;&#x770B;&#x5230;&#xFF0C;&#x8FD9;&#x6837;&#x505A;&#x6709;&#x52A9;&#x4E8E;&#x63D0;&#x9AD8;&#x7B97;&#x6CD5;&#x7684;&#x6027;&#x80FD;&#x3002;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x66F4;&#x597D;&#x5730;&#x5206;&#x6790;&#x504F;&#x5DEE;&#x548C;&#x65B9;&#x5DEE;&#xFF0C;&#x6211;&#x4EEC;&#x7A0D;&#x540E;&#x4F1A;&#x8C08;&#x4E00;&#x8C08;&#x3002;&#x4F46;&#x662F;&#x53EA;&#x8981;&#x4F60;&#x7684;&#x7B97;&#x6CD5;&#x4ECD;&#x7136;&#x6BD4;&#x4EBA;&#x7C7B;&#x7CDF;&#x7CD5;&#xFF0C;&#x4F60;&#x5C31;&#x6709;&#x8FD9;&#x4E9B;&#x91CD;&#x8981;&#x7B56;&#x7565;&#x53EF;&#x4EE5;&#x6539;&#x5584;&#x7B97;&#x6CD5;&#x3002;&#x800C;&#x4E00;&#x65E6;&#x4F60;&#x7684;&#x7B97;&#x6CD5;&#x505A;&#x5F97;&#x6BD4;&#x4EBA;&#x7C7B;&#x597D;&#xFF0C;&#x8FD9;&#x4E09;&#x79CD;&#x7B56;&#x7565;&#x5C31;&#x5F88;&#x96BE;&#x5229;&#x7528;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x53EF;&#x80FD;&#x662F;&#x53E6;&#x4E00;&#x4E2A;&#x548C;&#x4EBA;&#x7C7B;&#x8868;&#x73B0;&#x6BD4;&#x8F83;&#x7684;&#x597D;&#x5904;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5728;&#x4EBA;&#x7C7B;&#x505A;&#x5F97;&#x5F88;&#x597D;&#x7684;&#x4EFB;&#x52A1;&#x4E0A;&#x3002;</p>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x5F80;&#x5F80;&#x5F88;&#x64C5;&#x957F;&#x6A21;&#x4EFF;&#x4EBA;&#x7C7B;&#x80FD;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x7136;&#x540E;&#x8D76;&#x4E0A;&#x751A;&#x81F3;&#x8D85;&#x8D8A;&#x4EBA;&#x7C7B;&#x7684;&#x8868;&#x73B0;&#x3002;&#x7279;&#x522B;&#x662F;&#xFF0C;&#x5373;&#x4F7F;&#x4F60;&#x77E5;&#x9053;&#x504F;&#x5DEE;&#x662F;&#x591A;&#x5C11;&#xFF0C;&#x65B9;&#x5DEE;&#x662F;&#x591A;&#x5C11;&#x3002;&#x77E5;&#x9053;&#x4EBA;&#x7C7B;&#x5728;&#x7279;&#x5B9A;&#x4EFB;&#x52A1;&#x4E0A;&#x80FD;&#x505A;&#x591A;&#x597D;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x4F60;&#x66F4;&#x597D;&#x5730;&#x4E86;&#x89E3;&#x4F60;&#x5E94;&#x8BE5;&#x91CD;&#x70B9;&#x5C1D;&#x8BD5;&#x51CF;&#x5C11;&#x504F;&#x5DEE;&#xFF0C;&#x8FD8;&#x662F;&#x51CF;&#x5C11;&#x65B9;&#x5DEE;&#xFF0C;&#x6211;&#x60F3;&#x5728;&#x4E0B;&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#x4E2D;&#x7ED9;&#x4F60;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x3002;</p>
<h3 id="19-&#x53EF;&#x907F;&#x514D;&#x504F;&#x5DEE;&#xFF08;avoidable-bias&#xFF09;">1.9 &#x53EF;&#x907F;&#x514D;&#x504F;&#x5DEE;&#xFF08;Avoidable bias&#xFF09;</h3>
<p>&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x8FC7;&#xFF0C;&#x4F60;&#x5E0C;&#x671B;&#x4F60;&#x7684;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x80FD;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x8868;&#x73B0;&#x826F;&#x597D;&#xFF0C;&#x4F46;&#x6709;&#x65F6;&#x4F60;&#x5B9E;&#x9645;&#x4E0A;&#x5E76;&#x4E0D;&#x60F3;&#x505A;&#x5F97;&#x592A;&#x597D;&#x3002;&#x4F60;&#x5F97;&#x77E5;&#x9053;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x7684;&#x8868;&#x73B0;&#x662F;&#x600E;&#x6837;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x786E;&#x5207;&#x544A;&#x8BC9;&#x4F60;&#x7B97;&#x6CD5;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x7684;&#x8868;&#x73B0;&#x5230;&#x5E95;&#x5E94;&#x8BE5;&#x6709;&#x591A;&#x597D;&#xFF0C;&#x6216;&#x8005;&#x6709;&#x591A;&#x4E0D;&#x597D;&#xFF0C;&#x8BA9;&#x6211;&#x544A;&#x8BC9;&#x4F60;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#x5427;&#x3002;</p>
<p><img src="../images/bbeeddabb1800e91b1460deade38e756.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x4F7F;&#x7528;&#x732B;&#x5206;&#x7C7B;&#x5668;&#x6765;&#x505A;&#x4F8B;&#x5B50;&#xFF0C;&#x6BD4;&#x5982;&#x4EBA;&#x7C7B;&#x5177;&#x6709;&#x8FD1;&#x4E4E;&#x5B8C;&#x7F8E;&#x7684;&#x51C6;&#x786E;&#x5EA6;&#xFF0C;&#x6240;&#x4EE5;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x7684;&#x9519;&#x8BEF;&#x662F;1%&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x7684;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x8FBE;&#x5230;8%&#x7684;&#x8BAD;&#x7EC3;&#x9519;&#x8BEF;&#x7387;&#x548C;10%&#x7684;&#x5F00;&#x53D1;&#x9519;&#x8BEF;&#x7387;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x4E5F;&#x8BB8;&#x60F3;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x5F97;&#x5230;&#x66F4;&#x597D;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x6240;&#x4EE5;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x4F60;&#x7684;&#x7B97;&#x6CD5;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x7684;&#x8868;&#x73B0;&#x548C;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x7684;&#x8868;&#x73B0;&#x6709;&#x5F88;&#x5927;&#x5DEE;&#x8DDD;&#x7684;&#x8BDD;&#xFF0C;&#x8BF4;&#x660E;&#x4F60;&#x7684;&#x7B97;&#x6CD5;&#x5BF9;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x62DF;&#x5408;&#x5E76;&#x4E0D;&#x597D;&#x3002;&#x6240;&#x4EE5;&#x4ECE;&#x51CF;&#x5C11;&#x504F;&#x5DEE;&#x548C;&#x65B9;&#x5DEE;&#x7684;&#x5DE5;&#x5177;&#x8FD9;&#x4E2A;&#x89D2;&#x5EA6;&#x770B;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4F1A;&#x628A;&#x91CD;&#x70B9;&#x653E;&#x5728;&#x51CF;&#x5C11;&#x504F;&#x5DEE;&#x4E0A;&#x3002;&#x4F60;&#x9700;&#x8981;&#x505A;&#x7684;&#x662F;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x8BAD;&#x7EC3;&#x66F4;&#x5927;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x6216;&#x8005;&#x8DD1;&#x4E45;&#x4E00;&#x70B9;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#xFF0C;&#x5C31;&#x8BD5;&#x8BD5;&#x80FD;&#x4E0D;&#x80FD;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x505A;&#x5F97;&#x66F4;&#x597D;&#x3002;</p>
<p><img src="../images/e94444af122172eecf5df8bdca435d1d.png" alt=""></p>
<p>&#x4F46;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x540C;&#x6837;&#x7684;&#x8BAD;&#x7EC3;&#x9519;&#x8BEF;&#x7387;&#x548C;&#x5F00;&#x53D1;&#x9519;&#x8BEF;&#x7387;&#xFF0C;&#x5047;&#x8BBE;&#x4EBA;&#x7C7B;&#x7684;&#x8868;&#x73B0;&#x4E0D;&#x662F;1%&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x628A;&#x5B83;&#x6284;&#x5199;&#x8FC7;&#x6765;&#x3002;&#x4F46;&#x4F60;&#x77E5;&#x9053;&#xFF0C;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5E94;&#x7528;&#x6216;&#x8005;&#x8BF4;&#x7528;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x96C6;&#x4E0A;&#xFF0C;&#x5047;&#x8BBE;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x9519;&#x8BEF;&#x5B9E;&#x9645;&#x4E0A;&#x662F;7.5%&#xFF0C;&#x4E5F;&#x8BB8;&#x4F60;&#x7684;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x7684;&#x56FE;&#x50CF;&#x975E;&#x5E38;&#x6A21;&#x7CCA;&#xFF0C;&#x5373;&#x4F7F;&#x4EBA;&#x7C7B;&#x90FD;&#x65E0;&#x6CD5;&#x5224;&#x65AD;&#x8FD9;&#x5F20;&#x7167;&#x7247;&#x4E2D;&#x6709;&#x6CA1;&#x6709;&#x732B;&#x3002;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x53EF;&#x80FD;&#x7A0D;&#x5FAE;&#x66F4;&#x590D;&#x6742;&#x4E00;&#x4E9B;&#xFF0C;&#x56E0;&#x4E3A;&#x4EBA;&#x7C7B;&#x5176;&#x5B9E;&#x5F88;&#x64C5;&#x957F;&#x770B;&#x7167;&#x7247;&#xFF0C;&#x5206;&#x8FA8;&#x51FA;&#x7167;&#x7247;&#x91CC;&#x6709;&#x6CA1;&#x6709;&#x732B;&#x3002;&#x4F46;&#x5C31;&#x4E3A;&#x4E86;&#x4E3E;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x4F60;&#x7684;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x7684;&#x56FE;&#x50CF;&#x975E;&#x5E38;&#x6A21;&#x7CCA;&#xFF0C;&#x5206;&#x8FA8;&#x7387;&#x5F88;&#x4F4E;&#xFF0C;&#x5373;&#x4F7F;&#x4EBA;&#x7C7B;&#x9519;&#x8BEF;&#x7387;&#x4E5F;&#x8FBE;&#x5230;7.5%&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5373;&#x4F7F;&#x4F60;&#x7684;&#x8BAD;&#x7EC3;&#x9519;&#x8BEF;&#x7387;&#x548C;&#x5F00;&#x53D1;&#x9519;&#x8BEF;&#x7387;&#x548C;&#x5176;&#x4ED6;&#x4F8B;&#x5B50;&#x91CC;&#x4E00;&#x6837;&#xFF0C;&#x4F60;&#x5C31;&#x77E5;&#x9053;&#xFF0C;&#x4E5F;&#x8BB8;&#x4F60;&#x7684;&#x7CFB;&#x7EDF;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x7684;&#x8868;&#x73B0;&#x8FD8;&#x597D;&#xFF0C;&#x5B83;&#x53EA;&#x662F;&#x6BD4;&#x4EBA;&#x7C7B;&#x7684;&#x8868;&#x73B0;&#x5DEE;&#x4E00;&#x70B9;&#x70B9;&#x3002;&#x5728;&#x7B2C;&#x4E8C;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x5E0C;&#x671B;&#x4E13;&#x6CE8;&#x51CF;&#x5C11;&#x8FD9;&#x4E2A;&#x5206;&#x91CF;&#xFF0C;&#x51CF;&#x5C11;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x7684;&#x65B9;&#x5DEE;&#xFF0C;&#x4E5F;&#x8BB8;&#x4F60;&#x53EF;&#x4EE5;&#x8BD5;&#x8BD5;&#x6B63;&#x5219;&#x5316;&#xFF0C;&#x8BA9;&#x4F60;&#x7684;&#x5F00;&#x53D1;&#x9519;&#x8BEF;&#x7387;&#x66F4;&#x63A5;&#x8FD1;&#x4F60;&#x7684;&#x8BAD;&#x7EC3;&#x9519;&#x8BEF;&#x7387;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x5728;&#x4E4B;&#x524D;&#x7684;&#x8BFE;&#x7A0B;&#x5173;&#x4E8E;&#x504F;&#x5DEE;&#x548C;&#x65B9;&#x5DEE;&#x7684;&#x8BA8;&#x8BBA;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4E3B;&#x8981;&#x5047;&#x8BBE;&#x6709;&#x4E00;&#x4E9B;&#x4EFB;&#x52A1;&#x7684;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#x51E0;&#x4E4E;&#x4E3A;0&#x3002;&#x6240;&#x4EE5;&#x8981;&#x89E3;&#x91CA;&#x8FD9;&#x91CC;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x770B;&#x770B;&#x8FD9;&#x4E2A;&#x732B;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x7528;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x7684;&#x9519;&#x8BEF;&#x7387;&#x4F30;&#x8BA1;&#x6216;&#x4EE3;&#x66FF;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#x6216;&#x8D1D;&#x53F6;&#x65AF;&#x6700;&#x4F18;&#x9519;&#x8BEF;&#x7387;&#xFF0C;&#x5BF9;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x4EFB;&#x52A1;&#x800C;&#x8A00;&#xFF0C;&#x8FD9;&#x6837;&#x66FF;&#x4EE3;&#x76F8;&#x5F53;&#x5408;&#x7406;&#xFF0C;&#x56E0;&#x4E3A;&#x4EBA;&#x7C7B;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x975E;&#x5E38;&#x64C5;&#x957F;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x4EFB;&#x52A1;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x4EBA;&#x7C7B;&#x80FD;&#x505A;&#x5230;&#x7684;&#x6C34;&#x5E73;&#x548C;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#x76F8;&#x5DEE;&#x4E0D;&#x8FDC;&#x3002;&#x6839;&#x636E;&#x5B9A;&#x4E49;&#xFF0C;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x9519;&#x8BEF;&#x7387;&#x6BD4;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#x9AD8;&#x4E00;&#x70B9;&#xFF0C;&#x56E0;&#x4E3A;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#x662F;&#x7406;&#x8BBA;&#x4E0A;&#x9650;&#xFF0C;&#x4F46;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x9519;&#x8BEF;&#x7387;&#x79BB;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#x4E0D;&#x4F1A;&#x592A;&#x8FDC;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x6BD4;&#x8F83;&#x610F;&#x5916;&#x7684;&#x662F;&#x53D6;&#x51B3;&#x4E8E;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x9519;&#x8BEF;&#x7387;&#x6709;&#x591A;&#x5C11;&#xFF0C;&#x6216;&#x8005;&#x8FD9;&#x771F;&#x7684;&#x5C31;&#x5F88;&#x63A5;&#x8FD1;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x5B83;&#x5C31;&#x662F;&#xFF0C;&#x4F46;&#x53D6;&#x51B3;&#x4E8E;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x6C34;&#x5E73;&#x662F;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x7684;&#x3002;</p>
<p><img src="../images/ac8eb51425d5dbf663d050398f7e8af8.png" alt=""></p>
<p>&#x5728;&#x8FD9;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5177;&#x6709;&#x540C;&#x6837;&#x7684;&#x8BAD;&#x7EC3;&#x9519;&#x8BEF;&#x7387;&#x548C;&#x5F00;&#x53D1;&#x9519;&#x8BEF;&#x7387;&#xFF0C;&#x6211;&#x4EEC;&#x51B3;&#x5B9A;&#x4E13;&#x6CE8;&#x4E8E;&#x51CF;&#x5C11;&#x504F;&#x5DEE;&#x7684;&#x7B56;&#x7565;&#x6216;&#x8005;&#x51CF;&#x5C11;&#x65B9;&#x5DEE;&#x7684;&#x7B56;&#x7565;&#x3002;&#x90A3;&#x4E48;&#x5DE6;&#x8FB9;&#x7684;&#x4F8B;&#x5B50;&#x53D1;&#x751F;&#x4E86;&#x4EC0;&#x4E48;&#xFF1F;
8%&#x7684;&#x8BAD;&#x7EC3;&#x9519;&#x8BEF;&#x7387;&#x771F;&#x7684;&#x5F88;&#x9AD8;&#xFF0C;&#x4F60;&#x8BA4;&#x4E3A;&#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x5B83;&#x964D;&#x5230;1%&#xFF0C;&#x90A3;&#x4E48;&#x51CF;&#x5C11;&#x504F;&#x5DEE;&#x7684;&#x624B;&#x6BB5;&#x53EF;&#x80FD;&#x6709;&#x6548;&#x3002;&#x800C;&#x5728;&#x53F3;&#x8FB9;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8BA4;&#x4E3A;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#x662F;7.5%&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x9519;&#x8BEF;&#x7387;&#x6765;&#x66FF;&#x4EE3;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x8BA4;&#x4E3A;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#x63A5;&#x8FD1;7.5%&#xFF0C;&#x4F60;&#x5C31;&#x77E5;&#x9053;&#x6CA1;&#x6709;&#x592A;&#x591A;&#x6539;&#x5584;&#x7684;&#x7A7A;&#x95F4;&#x4E86;&#xFF0C;&#x4E0D;&#x80FD;&#x7EE7;&#x7EED;&#x51CF;&#x5C11;&#x4F60;&#x7684;&#x8BAD;&#x7EC3;&#x9519;&#x8BEF;&#x7387;&#x4E86;&#xFF0C;&#x4F60;&#x4E5F;&#x4E0D;&#x4F1A;&#x5E0C;&#x671B;&#x5B83;&#x6BD4;7.5%&#x597D;&#x5F97;&#x591A;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x79CD;&#x76EE;&#x6807;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x66F4;&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x8BAD;&#x7EC3;&#x3002;&#x800C;&#x8FD9;&#x8FB9;&#xFF0C;&#x5C31;&#x8FD8;&#xFF08;&#x8BAD;&#x7EC3;&#x8BEF;&#x5DEE;&#x548C;&#x5F00;&#x53D1;&#x8BEF;&#x5DEE;&#x4E4B;&#x95F4;&#xFF09;&#x6709;&#x66F4;&#x591A;&#x7684;&#x6539;&#x8FDB;&#x7A7A;&#x95F4;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x8FD9;&#x4E2A;2%&#x7684;&#x5DEE;&#x8DDD;&#x7F29;&#x5C0F;&#x4E00;&#x70B9;&#xFF0C;&#x4F7F;&#x7528;&#x51CF;&#x5C11;&#x65B9;&#x5DEE;&#x7684;&#x624B;&#x6BB5;&#x5E94;&#x8BE5;&#x53EF;&#x884C;&#xFF0C;&#x6BD4;&#x5982;&#x6B63;&#x5219;&#x5316;&#xFF0C;&#x6216;&#x8005;&#x6536;&#x96C6;&#x66F4;&#x591A;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x8981;&#x7ED9;&#x8FD9;&#x4E9B;&#x6982;&#x5FF5;&#x547D;&#x540D;&#x4E00;&#x4E0B;&#xFF0C;&#x8FD9;&#x4E0D;&#x662F;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x7684;&#x672F;&#x8BED;&#xFF0C;&#x4F46;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x4E48;&#x8BF4;&#x601D;&#x8003;&#x8D77;&#x6765;&#x6BD4;&#x8F83;&#x6D41;&#x7545;&#x3002;&#x5C31;&#x662F;&#x628A;&#x8FD9;&#x4E2A;&#x5DEE;&#x503C;&#xFF0C;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#x6216;&#x8005;&#x5BF9;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#x7684;&#x4F30;&#x8BA1;&#x548C;&#x8BAD;&#x7EC3;&#x9519;&#x8BEF;&#x7387;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x503C;&#x79F0;&#x4E3A;&#x53EF;&#x907F;&#x514D;&#x504F;&#x5DEE;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x5E0C;&#x671B;&#x4E00;&#x76F4;&#x63D0;&#x9AD8;&#x8BAD;&#x7EC3;&#x96C6;&#x8868;&#x73B0;&#xFF0C;&#x76F4;&#x5230;&#x4F60;&#x63A5;&#x8FD1;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#x4F60;&#x4E5F;&#x4E0D;&#x5E0C;&#x671B;&#x505A;&#x5230;&#x6BD4;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#x66F4;&#x597D;&#xFF0C;&#x8FD9;&#x7406;&#x8BBA;&#x4E0A;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x8D85;&#x8FC7;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#x7684;&#xFF0C;&#x9664;&#x975E;&#x8FC7;&#x62DF;&#x5408;&#x3002;&#x800C;&#x8FD9;&#x4E2A;&#x8BAD;&#x7EC3;&#x9519;&#x8BEF;&#x7387;&#x548C;&#x5F00;&#x53D1;&#x9519;&#x8BEF;&#x7387;&#x4E4B;&#x524D;&#x7684;&#x5DEE;&#x503C;&#xFF0C;&#x5C31;&#x5927;&#x6982;&#x8BF4;&#x660E;&#x4F60;&#x7684;&#x7B97;&#x6CD5;&#x5728;&#x65B9;&#x5DEE;&#x95EE;&#x9898;&#x4E0A;&#x8FD8;&#x6709;&#x591A;&#x5C11;&#x6539;&#x5584;&#x7A7A;&#x95F4;&#x3002;</p>
<p><img src="../images/a582a5304dca46ff2f450d934bf7330a.png" alt=""></p>
<p>&#x53EF;&#x907F;&#x514D;&#x504F;&#x5DEE;&#x8FD9;&#x4E2A;&#x8BCD;&#x8BF4;&#x660E;&#x4E86;&#x6709;&#x4E00;&#x4E9B;&#x522B;&#x7684;&#x504F;&#x5DEE;&#xFF0C;&#x6216;&#x8005;&#x9519;&#x8BEF;&#x7387;&#x6709;&#x4E2A;&#x65E0;&#x6CD5;&#x8D85;&#x8D8A;&#x7684;&#x6700;&#x4F4E;&#x6C34;&#x5E73;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x8BF4;&#x5982;&#x679C;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#x662F;7.5%&#x3002;&#x4F60;&#x5B9E;&#x9645;&#x4E0A;&#x5E76;&#x4E0D;&#x60F3;&#x5F97;&#x5230;&#x4F4E;&#x4E8E;&#x8BE5;&#x7EA7;&#x522B;&#x7684;&#x9519;&#x8BEF;&#x7387;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x4E0D;&#x4F1A;&#x8BF4;&#x4F60;&#x7684;&#x8BAD;&#x7EC3;&#x9519;&#x8BEF;&#x7387;&#x662F;8%&#xFF0C;&#x7136;&#x540E;8%&#x5C31;&#x8861;&#x91CF;&#x4E86;&#x4F8B;&#x5B50;&#x4E2D;&#x7684;&#x504F;&#x5DEE;&#x5927;&#x5C0F;&#x3002;&#x4F60;&#x5E94;&#x8BE5;&#x8BF4;&#xFF0C;&#x53EF;&#x907F;&#x514D;&#x504F;&#x5DEE;&#x53EF;&#x80FD;&#x5728;0.5%&#x5DE6;&#x53F3;&#xFF0C;&#x6216;&#x8005;0.5%&#x662F;&#x53EF;&#x907F;&#x514D;&#x504F;&#x5DEE;&#x7684;&#x6307;&#x6807;&#x3002;&#x800C;&#x8FD9;&#x4E2A;2%&#x662F;&#x65B9;&#x5DEE;&#x7684;&#x6307;&#x6807;&#xFF0C;&#x6240;&#x4EE5;&#x8981;&#x51CF;&#x5C11;&#x8FD9;&#x4E2A;2%&#x6BD4;&#x51CF;&#x5C11;&#x8FD9;&#x4E2A;0.5%&#x7A7A;&#x95F4;&#x8981;&#x5927;&#x5F97;&#x591A;&#x3002;&#x800C;&#x5728;&#x5DE6;&#x8FB9;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x8FD9;7%&#x8861;&#x91CF;&#x4E86;&#x53EF;&#x907F;&#x514D;&#x504F;&#x5DEE;&#x5927;&#x5C0F;&#xFF0C;&#x800C;2%&#x8861;&#x91CF;&#x4E86;&#x65B9;&#x5DEE;&#x5927;&#x5C0F;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x5DE6;&#x8FB9;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x91CC;&#xFF0C;&#x4E13;&#x6CE8;&#x51CF;&#x5C11;&#x53EF;&#x907F;&#x514D;&#x504F;&#x5DEE;&#x53EF;&#x80FD;&#x6F5C;&#x529B;&#x66F4;&#x5927;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x5F53;&#x4F60;&#x7406;&#x89E3;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x9519;&#x8BEF;&#x7387;&#xFF0C;&#x7406;&#x89E3;&#x4F60;&#x5BF9;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#x7684;&#x4F30;&#x8BA1;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x573A;&#x666F;&#x4E2D;&#x4E13;&#x6CE8;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x7B56;&#x7565;&#xFF0C;&#x4F7F;&#x7528;&#x907F;&#x514D;&#x504F;&#x5DEE;&#x7B56;&#x7565;&#x8FD8;&#x662F;&#x907F;&#x514D;&#x65B9;&#x5DEE;&#x7B56;&#x7565;&#x3002;&#x5728;&#x8BAD;&#x7EC3;&#x65F6;&#x5982;&#x4F55;&#x8003;&#x8651;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x8868;&#x73B0;&#x6765;&#x51B3;&#x5B9A;&#x5DE5;&#x4F5C;&#x7740;&#x529B;&#x70B9;&#xFF0C;&#x5177;&#x4F53;&#x600E;&#x4E48;&#x505A;&#x8FD8;&#x6709;&#x66F4;&#x591A;&#x5FAE;&#x5999;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x4E0B;&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x6DF1;&#x5165;&#x4E86;&#x89E3;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x8868;&#x73B0;&#x7684;&#x771F;&#x6B63;&#x610F;&#x4E49;&#x3002;</p>
<h3 id="110-&#x7406;&#x89E3;&#x4EBA;&#x7684;&#x8868;&#x73B0;&#xFF08;understanding-human-level-performance&#xFF09;">1.10 &#x7406;&#x89E3;&#x4EBA;&#x7684;&#x8868;&#x73B0;&#xFF08;Understanding human-level performance&#xFF09;</h3>
<p>&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x8868;&#x73B0;&#x8FD9;&#x4E2A;&#x8BCD;&#x5728;&#x8BBA;&#x6587;&#x91CC;&#x7ECF;&#x5E38;&#x968F;&#x610F;&#x4F7F;&#x7528;&#xFF0C;&#x4F46;&#x6211;&#x73B0;&#x5728;&#x544A;&#x8BC9;&#x4F60;&#x8FD9;&#x4E2A;&#x8BCD;&#x66F4;&#x51C6;&#x786E;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x4F7F;&#x7528;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x8868;&#x73B0;&#x8FD9;&#x4E2A;&#x8BCD;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x4F60;&#x4EEC;&#x63A8;&#x52A8;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x9879;&#x76EE;&#x7684;&#x8FDB;&#x5C55;&#x3002;&#x8FD8;&#x8BB0;&#x5F97;&#x4E0A;&#x4E2A;&#x89C6;&#x9891;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x7528;&#x8FC7;&#x8FD9;&#x4E2A;&#x8BCD;&#x201C;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x9519;&#x8BEF;&#x7387;&#x201D;&#x7528;&#x6765;&#x4F30;&#x8BA1;&#x8D1D;&#x53F6;&#x65AF;&#x8BEF;&#x5DEE;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x7406;&#x8BBA;&#x6700;&#x4F4E;&#x7684;&#x9519;&#x8BEF;&#x7387;&#xFF0C;&#x4EFB;&#x4F55;&#x51FD;&#x6570;&#x4E0D;&#x7BA1;&#x662F;&#x73B0;&#x5728;&#x8FD8;&#x662F;&#x5C06;&#x6765;&#xFF0C;&#x80FD;&#x591F;&#x5230;&#x8FBE;&#x7684;&#x6700;&#x4F4E;&#x503C;&#x3002;&#x6211;&#x4EEC;&#x5148;&#x8BB0;&#x4F4F;&#x8FD9;&#x70B9;&#xFF0C;&#x7136;&#x540E;&#x770B;&#x770B;&#x533B;&#x5B66;&#x56FE;&#x50CF;&#x5206;&#x7C7B;&#x4F8B;&#x5B50;&#x3002;</p>
<p><img src="../images/ee50ed0c91e4e8ad806e38acff0d7440.png" alt=""></p>
<p>&#x5047;&#x8BBE;&#x4F60;&#x8981;&#x89C2;&#x5BDF;&#x8FD9;&#x6837;&#x7684;&#x653E;&#x5C04;&#x79D1;&#x56FE;&#x50CF;&#xFF0C;&#x7136;&#x540E;&#x4F5C;&#x51FA;&#x5206;&#x7C7B;&#x8BCA;&#x65AD;&#xFF0C;&#x5047;&#x8BBE;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x7684;&#x4EBA;&#x7C7B;&#xFF0C;&#x672A;&#x7ECF;&#x8BAD;&#x7EC3;&#x7684;&#x4EBA;&#x7C7B;&#xFF0C;&#x5728;&#x6B64;&#x4EFB;&#x52A1;&#x4E0A;&#x8FBE;&#x5230;3%&#x7684;&#x9519;&#x8BEF;&#x7387;&#x3002;&#x666E;&#x901A;&#x7684;&#x533B;&#x751F;&#xFF0C;&#x4E5F;&#x8BB8;&#x662F;&#x666E;&#x901A;&#x7684;&#x653E;&#x5C04;&#x79D1;&#x533B;&#x751F;&#xFF0C;&#x80FD;&#x8FBE;&#x5230;1%&#x7684;&#x9519;&#x8BEF;&#x7387;&#x3002;&#x7ECF;&#x9A8C;&#x4E30;&#x5BCC;&#x7684;&#x533B;&#x751F;&#x505A;&#x5F97;&#x66F4;&#x597D;&#xFF0C;&#x9519;&#x8BEF;&#x7387;&#x4E3A;0.7%&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x961F;&#x7ECF;&#x9A8C;&#x4E30;&#x5BCC;&#x7684;&#x533B;&#x751F;&#xFF0C;&#x5C31;&#x662F;&#x8BF4;&#x5982;&#x679C;&#x4F60;&#x6709;&#x4E00;&#x4E2A;&#x7ECF;&#x9A8C;&#x4E30;&#x5BCC;&#x7684;&#x533B;&#x751F;&#x56E2;&#x961F;&#xFF0C;&#x8BA9;&#x4ED6;&#x4EEC;&#x90FD;&#x770B;&#x770B;&#x8FD9;&#x4E2A;&#x56FE;&#x50CF;&#xFF0C;&#x7136;&#x540E;&#x8BA8;&#x8BBA;&#x5E76;&#x8FA9;&#x8BBA;&#xFF0C;&#x4ED6;&#x4EEC;&#x8FBE;&#x6210;&#x5171;&#x8BC6;&#x7684;&#x610F;&#x89C1;&#x8FBE;&#x5230;0.5%&#x7684;&#x9519;&#x8BEF;&#x7387;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x60F3;&#x95EE;&#x4F60;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x5982;&#x4F55;&#x754C;&#x5B9A;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x9519;&#x8BEF;&#x7387;&#xFF1F;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x9519;&#x8BEF;&#x7387;3%,1%, 0.7%&#x8FD8;&#x662F;0.5%&#xFF1F;</p>
<p>&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x6682;&#x505C;&#x89C6;&#x9891;&#x601D;&#x8003;&#x4E00;&#x4E0B;&#xFF0C;&#x8981;&#x56DE;&#x7B54;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x60F3;&#x8BF7;&#x4F60;&#x8BB0;&#x4F4F;&#xFF0C;&#x601D;&#x8003;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x9519;&#x8BEF;&#x7387;&#x6700;&#x6709;&#x7528;&#x7684;&#x65B9;&#x5F0F;&#x4E4B;&#x4E00;&#x662F;&#xFF0C;&#x628A;&#x5B83;&#x4F5C;&#x4E3A;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#x7684;&#x66FF;&#x4EE3;&#x6216;&#x4F30;&#x8BA1;&#x3002;&#x5982;&#x679C;&#x4F60;&#x613F;&#x610F;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x6682;&#x505C;&#x89C6;&#x9891;&#xFF0C;&#x601D;&#x8003;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x4F46;&#x8FD9;&#x91CC;&#x6211;&#x5C31;&#x76F4;&#x63A5;&#x7ED9;&#x51FA;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x9519;&#x8BEF;&#x7387;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x5C31;&#x662F;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8981;&#x66FF;&#x4EE3;&#x6216;&#x4F30;&#x8BA1;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#xFF0C;&#x90A3;&#x4E48;&#x4E00;&#x961F;&#x7ECF;&#x9A8C;&#x4E30;&#x5BCC;&#x7684;&#x533B;&#x751F;&#x8BA8;&#x8BBA;&#x548C;&#x8FA9;&#x8BBA;&#x4E4B;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x8FBE;&#x5230;0.5%&#x7684;&#x9519;&#x8BEF;&#x7387;&#x3002;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#x5C0F;&#x4E8E;&#x7B49;&#x4E8E;0.5%&#xFF0C;&#x56E0;&#x4E3A;&#x6709;&#x4E9B;&#x7CFB;&#x7EDF;&#xFF0C;&#x8FD9;&#x4E9B;&#x533B;&#x751F;&#x56E2;&#x961F;&#x53EF;&#x4EE5;&#x8FBE;&#x5230;0.5%&#x7684;&#x9519;&#x8BEF;&#x7387;&#x3002;&#x6240;&#x4EE5;&#x6839;&#x636E;&#x5B9A;&#x4E49;&#xFF0C;&#x6700;&#x4F18;&#x9519;&#x8BEF;&#x7387;&#x5FC5;&#x987B;&#x5728;0.5%&#x4EE5;&#x4E0B;&#x3002;&#x6211;&#x4EEC;&#x4E0D;&#x77E5;&#x9053;&#x591A;&#x5C11;&#x66F4;&#x597D;&#xFF0C;&#x4E5F;&#x8BB8;&#x6709;&#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x7684;&#x56E2;&#x961F;&#xFF0C;&#x66F4;&#x6709;&#x7ECF;&#x9A8C;&#x7684;&#x533B;&#x751F;&#x80FD;&#x505A;&#x5F97;&#x66F4;&#x597D;&#xFF0C;&#x6240;&#x4EE5;&#x4E5F;&#x8BB8;&#x6BD4;0.5%&#x597D;&#x4E00;&#x70B9;&#x3002;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x6700;&#x4F18;&#x9519;&#x8BEF;&#x7387;&#x4E0D;&#x80FD;&#x9AD8;&#x4E8E;0.5%&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x8FD9;&#x4E2A;&#x80CC;&#x666F;&#x4E0B;&#xFF0C;&#x6211;&#x5C31;&#x53EF;&#x4EE5;&#x7528;0.5%&#x4F30;&#x8BA1;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x5C06;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x5B9A;&#x4E49;&#x4E3A;0.5%&#xFF0C;&#x81F3;&#x5C11;&#x5982;&#x679C;&#x4F60;&#x5E0C;&#x671B;&#x4F7F;&#x7528;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x9519;&#x8BEF;&#x6765;&#x5206;&#x6790;&#x504F;&#x5DEE;&#x548C;&#x65B9;&#x5DEE;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x50CF;&#x4E0A;&#x4E2A;&#x89C6;&#x9891;&#x90A3;&#x6837;&#x3002;</p>
<p>&#x73B0;&#x5728;&#xFF0C;&#x4E3A;&#x4E86;&#x53D1;&#x8868;&#x7814;&#x7A76;&#x8BBA;&#x6587;&#x6216;&#x8005;&#x90E8;&#x7F72;&#x7CFB;&#x7EDF;&#xFF0C;&#x4E5F;&#x8BB8;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x9519;&#x8BEF;&#x7387;&#x7684;&#x5B9A;&#x4E49;&#x53EF;&#x4EE5;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;1%&#xFF0C;&#x53EA;&#x8981;&#x4F60;&#x8D85;&#x8D8A;&#x4E86;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x533B;&#x751F;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x5982;&#x679C;&#x80FD;&#x8FBE;&#x5230;&#x8FD9;&#x79CD;&#x6C34;&#x5E73;&#xFF0C;&#x90A3;&#x7CFB;&#x7EDF;&#x5DF2;&#x7ECF;&#x8FBE;&#x5230;&#x5B9E;&#x7528;&#x4E86;&#x3002;&#x4E5F;&#x8BB8;&#x8D85;&#x8FC7;&#x4E00;&#x540D;&#x653E;&#x5C04;&#x79D1;&#x533B;&#x751F;&#xFF0C;&#x4E00;&#x540D;&#x533B;&#x751F;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x7CFB;&#x7EDF;&#x5728;&#x4E00;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x53EF;&#x4EE5;&#x6709;&#x90E8;&#x7F72;&#x4EF7;&#x503C;&#x4E86;&#x3002;</p>
<p>&#x672C;&#x89C6;&#x9891;&#x7684;&#x8981;&#x70B9;&#x662F;&#xFF0C;&#x5728;&#x5B9A;&#x4E49;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x9519;&#x8BEF;&#x7387;&#x65F6;&#xFF0C;&#x8981;&#x5F04;&#x6E05;&#x695A;&#x4F60;&#x7684;&#x76EE;&#x6807;&#x6240;&#x5728;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x8868;&#x660E;&#x4F60;&#x53EF;&#x4EE5;&#x8D85;&#x8D8A;&#x5355;&#x4E2A;&#x4EBA;&#x7C7B;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x6709;&#x7406;&#x7531;&#x5728;&#x67D0;&#x4E9B;&#x573A;&#x5408;&#x90E8;&#x7F72;&#x4F60;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x4E5F;&#x8BB8;&#x8FD9;&#x4E2A;&#x5B9A;&#x4E49;&#x662F;&#x5408;&#x9002;&#x7684;&#x3002;&#x4F46;&#x662F;&#x5982;&#x679C;&#x60A8;&#x7684;&#x76EE;&#x6807;&#x662F;&#x66FF;&#x4EE3;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x5B9A;&#x4E49;&#xFF08;&#x7ECF;&#x9A8C;&#x4E30;&#x5BCC;&#x7684;&#x533B;&#x751F;&#x56E2;&#x961F;&#x2014;&#x2014;0.5%&#xFF09;&#x624D;&#x5408;&#x9002;&#x3002;</p>
<p><img src="../images/2d74f75b5b848b51be08ff4e1b6d7d2a.png" alt=""></p>
<p>&#x8981;&#x4E86;&#x89E3;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4E2A;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E2A;&#x9519;&#x8BEF;&#x7387;&#x5206;&#x6790;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x6BD4;&#x65B9;&#x8BF4;&#xFF0C;&#x5728;&#x533B;&#x5B66;&#x56FE;&#x50CF;&#x8BCA;&#x65AD;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x4F60;&#x7684;&#x8BAD;&#x7EC3;&#x9519;&#x8BEF;&#x7387;&#x662F;5%&#xFF0C;&#x4F60;&#x7684;&#x5F00;&#x53D1;&#x9519;&#x8BEF;&#x7387;&#x662F;6%&#x3002;&#x800C;&#x5728;&#x4E0A;&#x4E00;&#x5F20;&#x5E7B;&#x706F;&#x7247;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x8868;&#x73B0;&#xFF0C;&#x6211;&#x5C06;&#x5B83;&#x770B;&#x6210;&#x662F;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#x7684;&#x66FF;&#x4EE3;&#x54C1;&#xFF0C;&#x53D6;&#x51B3;&#x4E8E;&#x4F60;&#x662F;&#x5426;&#x5C06;&#x5B83;&#x5B9A;&#x4E49;&#x6210;&#x666E;&#x901A;&#x5355;&#x4E2A;&#x533B;&#x751F;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x8FD8;&#x662F;&#x6709;&#x7ECF;&#x9A8C;&#x7684;&#x533B;&#x751F;&#x6216;&#x533B;&#x751F;&#x56E2;&#x961F;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x7528;1%&#x6216;0.7%&#x6216;0.5%&#x3002;&#x540C;&#x65F6;&#x4E5F;&#x56DE;&#x60F3;&#x4E00;&#x4E0B;&#xFF0C;&#x524D;&#x9762;&#x89C6;&#x9891;&#x4E2D;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#x6216;&#x8005;&#x8BF4;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#x7684;&#x4F30;&#x8BA1;&#x548C;&#x8BAD;&#x7EC3;&#x9519;&#x8BEF;&#x7387;&#x76F4;&#x63A5;&#x7684;&#x5DEE;&#x503C;&#x5C31;&#x8861;&#x91CF;&#x4E86;&#x6240;&#x8C13;&#x7684;&#x53EF;&#x907F;&#x514D;&#x504F;&#x5DEE;&#xFF0C;&#x8FD9;&#xFF08;&#x8BAD;&#x7EC3;&#x8BEF;&#x5DEE;&#x4E0E;&#x5F00;&#x53D1;&#x8BEF;&#x5DEE;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x503C;&#xFF09;&#x53EF;&#x4EE5;&#x8861;&#x91CF;&#x6216;&#x8005;&#x4F30;&#x8BA1;&#x4F60;&#x7684;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x7684;&#x65B9;&#x5DEE;&#x95EE;&#x9898;&#x6709;&#x591A;&#x4E25;&#x91CD;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x5728;&#x8FD9;&#x4E2A;&#x7B2C;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x65E0;&#x8BBA;&#x4F60;&#x505A;&#x51FA;&#x54EA;&#x4E9B;&#x9009;&#x62E9;&#xFF0C;&#x53EF;&#x907F;&#x514D;&#x504F;&#x5DEE;&#x5927;&#x6982;&#x662F;4%&#xFF0C;&#x8FD9;&#x4E2A;&#x503C;&#x6211;&#x60F3;&#x4ECB;&#x4E8E;&#x2026;&#x2026;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x53D6;1%&#x5C31;&#x662F;4%&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x53D6;0.5%&#x5C31;&#x662F;4.5%&#xFF0C;&#x800C;&#x8FD9;&#x4E2A;&#x5DEE;&#x8DDD;&#xFF08;&#x8BAD;&#x7EC3;&#x8BEF;&#x5DEE;&#x4E0E;&#x5F00;&#x53D1;&#x8BEF;&#x5DEE;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x503C;&#xFF09;&#x662F;1%&#x3002;&#x6240;&#x4EE5;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6211;&#x5F97;&#x8BF4;&#xFF0C;&#x4E0D;&#x7BA1;&#x4F60;&#x600E;&#x4E48;&#x5B9A;&#x4E49;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x9519;&#x8BEF;&#x7387;&#xFF0C;&#x4F7F;&#x7528;&#x5355;&#x4E2A;&#x666E;&#x901A;&#x533B;&#x751F;&#x7684;&#x9519;&#x8BEF;&#x7387;&#x5B9A;&#x4E49;&#xFF0C;&#x8FD8;&#x662F;&#x5355;&#x4E2A;&#x7ECF;&#x9A8C;&#x4E30;&#x5BCC;&#x533B;&#x751F;&#x7684;&#x9519;&#x8BEF;&#x7387;&#x5B9A;&#x4E49;&#x6216;&#x7ECF;&#x9A8C;&#x4E30;&#x5BCC;&#x7684;&#x533B;&#x751F;&#x56E2;&#x961F;&#x7684;&#x9519;&#x8BEF;&#x7387;&#x5B9A;&#x4E49;&#xFF0C;&#x8FD9;&#x662F;4%&#x8FD8;&#x662F;4.5%&#xFF0C;&#x8FD9;&#x660E;&#x663E;&#x6BD4;&#x90FD;&#x6BD4;&#x65B9;&#x5DEE;&#x95EE;&#x9898;&#x66F4;&#x5927;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x4E13;&#x6CE8;&#x4E8E;&#x51CF;&#x5C11;&#x504F;&#x5DEE;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x4F8B;&#x5982;&#x57F9;&#x8BAD;&#x66F4;&#x5927;&#x7684;&#x7F51;&#x7EDC;&#x3002;</p>
<p><img src="../images/2bbcd885234523921d26848bd165e096.png" alt=""></p>
<p>&#x73B0;&#x5728;&#x6765;&#x770B;&#x770B;&#x7B2C;&#x4E8C;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x4F60;&#x7684;&#x8BAD;&#x7EC3;&#x9519;&#x8BEF;&#x7387;&#x662F;1%&#xFF0C;&#x5F00;&#x53D1;&#x9519;&#x8BEF;&#x7387;&#x662F;5%&#xFF0C;&#x8FD9;&#x5176;&#x5B9E;&#x4E5F;&#x4E0D;&#x600E;&#x4E48;&#x91CD;&#x8981;&#xFF0C;&#x8FD9;&#x79CD;&#x95EE;&#x9898;&#x66F4;&#x50CF;&#x5B66;&#x672F;&#x754C;&#x8BA8;&#x8BBA;&#x7684;&#xFF0C;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x8868;&#x73B0;&#x662F;1%&#x6216;0.7%&#x8FD8;&#x662F;0.5%&#x3002;&#x56E0;&#x4E3A;&#x4E0D;&#x7BA1;&#x4F60;&#x4F7F;&#x7528;&#x54EA;&#x4E00;&#x4E2A;&#x5B9A;&#x4E49;&#xFF0C;&#x4F60;&#x6D4B;&#x91CF;&#x53EF;&#x907F;&#x514D;&#x504F;&#x5DEE;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x7528;&#x90A3;&#x4E2A;&#x503C;&#xFF0C;&#x5C31;&#x662F;0%&#x5230;0.5%&#x4E4B;&#x524D;&#xFF0C;&#x5BF9;&#x5427;&#xFF1F;&#x90A3;&#x5C31;&#x662F;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x548C;&#x8BAD;&#x7EC3;&#x9519;&#x8BEF;&#x7387;&#x4E4B;&#x524D;&#x7684;&#x5DEE;&#x8DDD;&#xFF0C;&#x800C;&#x8FD9;&#x4E2A;&#x5DEE;&#x8DDD;&#x662F;4%&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;4%&#x5DEE;&#x8DDD;&#x6BD4;&#x4EFB;&#x4F55;&#x4E00;&#x79CD;&#x5B9A;&#x4E49;&#x7684;&#x53EF;&#x907F;&#x514D;&#x504F;&#x5DEE;&#x90FD;&#x5927;&#x3002;&#x6240;&#x4EE5;&#x4ED6;&#x4EEC;&#x5C31;&#x5EFA;&#x8BAE;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x4E3B;&#x8981;&#x4F7F;&#x7528;&#x51CF;&#x5C11;&#x65B9;&#x5DEE;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x6BD4;&#x5982;&#x6B63;&#x5219;&#x5316;&#x6216;&#x8005;&#x53BB;&#x83B7;&#x53D6;&#x66F4;&#x5927;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#x3002;</p>
<p>&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x771F;&#x6B63;&#x6709;&#x6548;&#x5462;?</p>
<p>&#x5C31;&#x662F;&#x6BD4;&#x5982;&#x4F60;&#x7684;&#x8BAD;&#x7EC3;&#x9519;&#x8BEF;&#x7387;&#x662F;0.7%&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x505A;&#x5F97;&#x5F88;&#x597D;&#x4E86;&#xFF0C;&#x4F60;&#x7684;&#x5F00;&#x53D1;&#x9519;&#x8BEF;&#x7387;&#x662F;0.8%&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F60;&#x7528;0.5%&#x6765;&#x4F30;&#x8BA1;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#x5173;&#x7CFB;&#x5C31;&#x5F88;&#x5927;&#x3002;&#x56E0;&#x4E3A;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F60;&#x6D4B;&#x91CF;&#x5230;&#x7684;&#x53EF;&#x907F;&#x514D;&#x504F;&#x5DEE;&#x662F;0.2%&#xFF0C;&#x8FD9;&#x662F;&#x4F60;&#x6D4B;&#x91CF;&#x5230;&#x7684;&#x65B9;&#x5DEE;&#x95EE;&#x9898;0.1%&#x7684;&#x4E24;&#x500D;&#xFF0C;&#x8FD9;&#x8868;&#x660E;&#x4E5F;&#x8BB8;&#x504F;&#x5DEE;&#x548C;&#x65B9;&#x5DEE;&#x90FD;&#x5B58;&#x5728;&#x95EE;&#x9898;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x53EF;&#x907F;&#x514D;&#x504F;&#x5DEE;&#x95EE;&#x9898;&#x66F4;&#x4E25;&#x91CD;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x4E0A;&#x4E00;&#x5F20;&#x5E7B;&#x706F;&#x7247;&#x4E2D;&#x8BA8;&#x8BBA;&#x7684;&#x662F;0.5%&#xFF0C;&#x5C31;&#x662F;&#x5BF9;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#x7684;&#x6700;&#x4F73;&#x4F30;&#x8BA1;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x7FA4;&#x4EBA;&#x7C7B;&#x533B;&#x751F;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x8FD9;&#x4E00;&#x76EE;&#x6807;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7528;0.7&#x4EE3;&#x66FF;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#xFF0C;&#x4F60;&#x6D4B;&#x5F97;&#x7684;&#x53EF;&#x907F;&#x514D;&#x504F;&#x5DEE;&#x57FA;&#x672C;&#x4E0A;&#x662F;0%&#xFF0C;&#x90A3;&#x4F60;&#x5C31;&#x53EF;&#x80FD;&#x5FFD;&#x7565;&#x53EF;&#x907F;&#x514D;&#x504F;&#x5DEE;&#x4E86;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#x4F60;&#x5E94;&#x8BE5;&#x8BD5;&#x8BD5;&#x80FD;&#x4E0D;&#x80FD;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x505A;&#x5F97;&#x66F4;&#x597D;&#x3002;</p>
<p>&#x6211;&#x5E0C;&#x671B;&#x8BB2;&#x8FD9;&#x4E2A;&#x80FD;&#x8BA9;&#x4F60;&#x4EEC;&#x6709;&#x70B9;&#x6982;&#x5FF5;&#xFF0C;&#x77E5;&#x9053;&#x4E3A;&#x4EC0;&#x4E48;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x95EE;&#x9898;&#x4E0A;&#x53D6;&#x5F97;&#x8FDB;&#x5C55;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x96BE;&#xFF0C;&#x5F53;&#x4F60;&#x63A5;&#x8FD1;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x65F6;&#x8FDB;&#x5C55;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x96BE;&#x3002;</p>
<p><img src="../images/0e6c143fa42628491f97cbe7213a738d.png" alt=""></p>
<p>&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x4E00;&#x65E6;&#x4F60;&#x63A5;&#x8FD1;0.7%&#x9519;&#x8BEF;&#x7387;&#xFF0C;&#x9664;&#x975E;&#x4F60;&#x975E;&#x5E38;&#x5C0F;&#x5FC3;&#x4F30;&#x8BA1;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x65E0;&#x6CD5;&#x77E5;&#x9053;&#x79BB;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#x6709;&#x591A;&#x8FDC;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x5E94;&#x8BE5;&#x5C3D;&#x91CF;&#x51CF;&#x5C11;&#x53EF;&#x907F;&#x514D;&#x504F;&#x5DEE;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x53EA;&#x77E5;&#x9053;&#x5355;&#x4E2A;&#x666E;&#x901A;&#x533B;&#x751F;&#x80FD;&#x8FBE;&#x5230;1%&#x9519;&#x8BEF;&#x7387;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x5F88;&#x96BE;&#x77E5;&#x9053;&#x662F;&#x4E0D;&#x662F;&#x5E94;&#x8BE5;&#x7EE7;&#x7EED;&#x53BB;&#x62DF;&#x5408;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x8FD9;&#x79CD;&#x95EE;&#x9898;&#x53EA;&#x4F1A;&#x51FA;&#x73B0;&#x5728;&#x4F60;&#x7684;&#x7B97;&#x6CD5;&#x5DF2;&#x7ECF;&#x505A;&#x5F97;&#x5F88;&#x597D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EA;&#x6709;&#x4F60;&#x5DF2;&#x7ECF;&#x505A;&#x5230;0.7%,
0.8%, &#x63A5;&#x8FD1;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x65F6;&#x4F1A;&#x51FA;&#x73B0;&#x3002;</p>
<p>&#x800C;&#x5728;&#x5DE6;&#x8FB9;&#x7684;&#x4E24;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x5F53;&#x4F60;&#x8FDC;&#x79BB;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x65F6;&#xFF0C;&#x5C06;&#x4F18;&#x5316;&#x76EE;&#x6807;&#x653E;&#x5728;&#x504F;&#x5DEE;&#x6216;&#x65B9;&#x5DEE;&#x4E0A;&#x53EF;&#x80FD;&#x66F4;&#x5BB9;&#x6613;&#x4E00;&#x70B9;&#x3002;&#x8FD9;&#x5C31;&#x8BF4;&#x660E;&#x4E86;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x5F53;&#x4F60;&#x4EEC;&#x63A5;&#x8FD1;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x65F6;&#xFF0C;&#x66F4;&#x96BE;&#x5206;&#x8FA8;&#x51FA;&#x95EE;&#x9898;&#x662F;&#x504F;&#x5DEE;&#x8FD8;&#x662F;&#x65B9;&#x5DEE;&#x3002;&#x6240;&#x4EE5;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x9879;&#x76EE;&#x7684;&#x8FDB;&#x5C55;&#x5728;&#x4F60;&#x5DF2;&#x7ECF;&#x505A;&#x5F97;&#x5F88;&#x597D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5F88;&#x96BE;&#x66F4;&#x8FDB;&#x4E00;&#x6B65;&#x3002;</p>
<p><img src="../images/22278fbe6985e418f95f54949b7a456d.png" alt=""></p>
<p>&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#x6211;&#x4EEC;&#x8BB2;&#x5230;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x7406;&#x89E3;&#x504F;&#x5DEE;&#x548C;&#x65B9;&#x5DEE;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x4EBA;&#x7C7B;&#x53EF;&#x4EE5;&#x505A;&#x5F97;&#x5F88;&#x597D;&#x7684;&#x4EFB;&#x52A1;&#x4E2D;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F30;&#x8BA1;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x7684;&#x9519;&#x8BEF;&#x7387;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x9519;&#x8BEF;&#x7387;&#x6765;&#x4F30;&#x8BA1;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#x3002;&#x6240;&#x4EE5;&#x4F60;&#x5230;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#x4F30;&#x8BA1;&#x503C;&#x7684;&#x5DEE;&#x8DDD;&#xFF0C;&#x544A;&#x8BC9;&#x4F60;&#x53EF;&#x907F;&#x514D;&#x504F;&#x5DEE;&#x95EE;&#x9898;&#x6709;&#x591A;&#x5927;&#xFF0C;&#x53EF;&#x907F;&#x514D;&#x504F;&#x5DEE;&#x95EE;&#x9898;&#x6709;&#x591A;&#x4E25;&#x91CD;&#xFF0C;&#x800C;&#x8BAD;&#x7EC3;&#x9519;&#x8BEF;&#x7387;&#x548C;&#x5F00;&#x53D1;&#x9519;&#x8BEF;&#x7387;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x503C;&#x544A;&#x8BC9;&#x4F60;&#x65B9;&#x5DEE;&#x4E0A;&#x7684;&#x95EE;&#x9898;&#x6709;&#x591A;&#x5927;&#xFF0C;&#x4F60;&#x7684;&#x7B97;&#x6CD5;&#x662F;&#x5426;&#x80FD;&#x591F;&#x4ECE;&#x8BAD;&#x7EC3;&#x96C6;&#x6CDB;&#x5316;&#x63A8;&#x5E7F;&#x5230;&#x5F00;&#x53D1;&#x96C6;&#x3002;</p>
<p>&#x4ECA;&#x5929;&#x8BB2;&#x7684;&#x548C;&#x4E4B;&#x524D;&#x8BFE;&#x7A0B;&#x4E2D;&#x89C1;&#x5230;&#x7684;&#x91CD;&#x5927;&#x533A;&#x522B;&#x662F;&#xFF0C;&#x4EE5;&#x524D;&#x4F60;&#x4EEC;&#x6BD4;&#x8F83;&#x7684;&#x662F;&#x8BAD;&#x7EC3;&#x9519;&#x8BEF;&#x7387;&#x548C;0%&#xFF0C;&#x76F4;&#x63A5;&#x7528;&#x8FD9;&#x4E2A;&#x503C;&#x4F30;&#x8BA1;&#x504F;&#x5DEE;&#x3002;&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x89C6;&#x9891;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x4E2A;&#x66F4;&#x5FAE;&#x5999;&#x7684;&#x5206;&#x6790;&#xFF0C;&#x5176;&#x4E2D;&#x5E76;&#x6CA1;&#x6709;&#x5047;&#x8BBE;&#x4F60;&#x5E94;&#x8BE5;&#x5F97;&#x5230;0%&#x9519;&#x8BEF;&#x7387;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;&#x65F6;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#x662F;&#x975E;&#x96F6;&#x7684;&#xFF0C;&#x6709;&#x65F6;&#x57FA;&#x672C;&#x4E0D;&#x53EF;&#x80FD;&#x505A;&#x5230;&#x6BD4;&#x67D0;&#x4E2A;&#x9519;&#x8BEF;&#x7387;&#x9608;&#x503C;&#x66F4;&#x4F4E;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x4E4B;&#x524D;&#x7684;&#x8BFE;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x6D4B;&#x91CF;&#x7684;&#x662F;&#x8BAD;&#x7EC3;&#x9519;&#x8BEF;&#x7387;&#xFF0C;&#x7136;&#x540E;&#x89C2;&#x5BDF;&#x7684;&#x662F;&#x8BAD;&#x7EC3;&#x9519;&#x8BEF;&#x7387;&#x6BD4;0%&#x9AD8;&#x591A;&#x5C11;&#xFF0C;&#x5C31;&#x7528;&#x8FD9;&#x4E2A;&#x5DEE;&#x503C;&#x6765;&#x4F30;&#x8BA1;&#x504F;&#x5DEE;&#x6709;&#x591A;&#x5927;&#x3002;&#x800C;&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#xFF0C;&#x5BF9;&#x4E8E;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#x51E0;&#x4E4E;&#x662F;0%&#x7684;&#x95EE;&#x9898;&#x8FD9;&#x6837;&#x5C31;&#x884C;&#x4E86;&#xFF0C;&#x4F8B;&#x5982;&#x8BC6;&#x522B;&#x732B;&#xFF0C;&#x4EBA;&#x7C7B;&#x8868;&#x73B0;&#x63A5;&#x8FD1;&#x5B8C;&#x7F8E;&#xFF0C;&#x6240;&#x4EE5;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#x4E5F;&#x63A5;&#x8FD1;&#x5B8C;&#x7F8E;&#x3002;&#x6240;&#x4EE5;&#x5F53;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#x51E0;&#x4E4E;&#x4E3A;&#x96F6;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x90A3;&#x4E48;&#x505A;&#x3002;&#x4F46;&#x6570;&#x636E;&#x566A;&#x70B9;&#x5F88;&#x591A;&#x65F6;&#xFF0C;&#x6BD4;&#x5982;&#x80CC;&#x666F;&#x58F0;&#x97F3;&#x5F88;&#x5608;&#x6742;&#x7684;&#x8BED;&#x8A00;&#x8BC6;&#x522B;&#xFF0C;&#x6709;&#x65F6;&#x51E0;&#x4E4E;&#x4E0D;&#x53EF;&#x80FD;&#x542C;&#x6E05;&#x695A;&#x8BF4;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x5E76;&#x6B63;&#x786E;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#x3002;&#x5BF9;&#x4E8E;&#x8FD9;&#x6837;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x66F4;&#x597D;&#x7684;&#x4F30;&#x8BA1;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#x5F88;&#x6709;&#x5FC5;&#x8981;&#xFF0C;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x4F60;&#x66F4;&#x597D;&#x5730;&#x4F30;&#x8BA1;&#x53EF;&#x907F;&#x514D;&#x504F;&#x5DEE;&#x548C;&#x65B9;&#x5DEE;&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x5C31;&#x80FD;&#x66F4;&#x597D;&#x7684;&#x505A;&#x51FA;&#x51B3;&#x7B56;&#xFF0C;&#x9009;&#x62E9;&#x51CF;&#x5C11;&#x504F;&#x5DEE;&#x7684;&#x7B56;&#x7565;&#xFF0C;&#x8FD8;&#x662F;&#x51CF;&#x5C11;&#x65B9;&#x5DEE;&#x7684;&#x7B56;&#x7565;&#x3002;</p>
<p>&#x56DE;&#x987E;&#x4E00;&#x4E0B;&#xFF0C;&#x5BF9;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x6709;&#x5927;&#x6982;&#x7684;&#x4F30;&#x8BA1;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x505A;&#x51FA;&#x5BF9;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#x7684;&#x4F30;&#x8BA1;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x66F4;&#x5FEB;&#x5730;&#x4F5C;&#x51FA;&#x51B3;&#x5B9A;&#x662F;&#x5426;&#x5E94;&#x8BE5;&#x4E13;&#x6CE8;&#x4E8E;&#x51CF;&#x5C11;&#x7B97;&#x6CD5;&#x7684;&#x504F;&#x5DEE;&#xFF0C;&#x6216;&#x8005;&#x51CF;&#x5C11;&#x7B97;&#x6CD5;&#x7684;&#x65B9;&#x5DEE;&#x3002;&#x8FD9;&#x4E2A;&#x51B3;&#x7B56;&#x6280;&#x5DE7;&#x901A;&#x5E38;&#x5F88;&#x6709;&#x6548;&#xFF0C;&#x76F4;&#x5230;&#x4F60;&#x7684;&#x7CFB;&#x7EDF;&#x6027;&#x80FD;&#x5F00;&#x59CB;&#x8D85;&#x8D8A;&#x4EBA;&#x7C7B;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x5BF9;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#x7684;&#x4F30;&#x8BA1;&#x5C31;&#x4E0D;&#x518D;&#x51C6;&#x786E;&#x4E86;&#xFF0C;&#x4F46;&#x8FD9;&#x4E9B;&#x6280;&#x5DE7;&#x8FD8;&#x662F;&#x53EF;&#x4EE5;&#x5E2E;&#x4F60;&#x505A;&#x51FA;&#x660E;&#x786E;&#x7684;&#x51B3;&#x5B9A;&#x3002;</p>
<p>&#x73B0;&#x5728;&#xFF0C;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x4EE4;&#x4EBA;&#x5174;&#x594B;&#x7684;&#x53D1;&#x5C55;&#x4E4B;&#x4E00;&#x5C31;&#x662F;&#x5BF9;&#x4E8E;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x7CFB;&#x7EDF;&#x5B9E;&#x9645;&#x4E0A;&#x53EF;&#x4EE5;&#x8D85;&#x8D8A;&#x4EBA;&#x7C7B;&#x4E86;&#x3002;&#x5728;&#x4E0B;&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#x4E2D;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x7EE7;&#x7EED;&#x8C08;&#x8C08;&#x8D85;&#x8D8A;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p>
<h3 id="111-&#x8D85;&#x8FC7;&#x4EBA;&#x7684;&#x8868;&#x73B0;&#xFF08;surpassing-human--level-performance&#xFF09;">1.11 &#x8D85;&#x8FC7;&#x4EBA;&#x7684;&#x8868;&#x73B0;&#xFF08;Surpassing human- level performance&#xFF09;</h3>
<p>&#x5F88;&#x591A;&#x56E2;&#x961F;&#x4F1A;&#x56E0;&#x4E3A;&#x673A;&#x5668;&#x5728;&#x7279;&#x5B9A;&#x7684;&#x8BC6;&#x522B;&#x5206;&#x7C7B;&#x4EFB;&#x52A1;&#x4E2D;&#x8D85;&#x8D8A;&#x4E86;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x800C;&#x6FC0;&#x52A8;&#x4E0D;&#x5DF2;&#xFF0C;&#x6211;&#x4EEC;&#x8C08;&#x8C08;&#x8FD9;&#x4E9B;&#x60C5;&#x51B5;&#xFF0C;&#x770B;&#x770B;&#x4F60;&#x4EEC;&#x81EA;&#x5DF1;&#x80FD;&#x4E0D;&#x80FD;&#x8FBE;&#x5230;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x8FC7;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x8FDB;&#x5C55;&#xFF0C;&#x4F1A;&#x5728;&#x63A5;&#x8FD1;&#x6216;&#x8005;&#x8D85;&#x8D8A;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x7684;&#x65F6;&#x5019;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x6162;&#x3002;&#x6211;&#x4EEC;&#x4E3E;&#x4F8B;&#x8C08;&#x8C08;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x8FD9;&#x6837;&#x3002;</p>
<p><img src="../images/c628000e1ec9c9153bdbf467e12e9864.png" alt=""></p>
<p>&#x5047;&#x8BBE;&#x4F60;&#x6709;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4E00;&#x7EC4;&#x4EBA;&#x7C7B;&#x4E13;&#x5BB6;&#x5145;&#x5206;&#x8BA8;&#x8BBA;&#x8FA9;&#x8BBA;&#x4E4B;&#x540E;&#xFF0C;&#x8FBE;&#x5230;0.5%&#x7684;&#x9519;&#x8BEF;&#x7387;&#xFF0C;&#x5355;&#x4E2A;&#x4EBA;&#x7C7B;&#x4E13;&#x5BB6;&#x9519;&#x8BEF;&#x7387;&#x662F;1%&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x8BAD;&#x7EC3;&#x51FA;&#x6765;&#x7684;&#x7B97;&#x6CD5;&#x6709;0.6%&#x7684;&#x8BAD;&#x7EC3;&#x9519;&#x8BEF;&#x7387;&#xFF0C;0.8%&#x7684;&#x5F00;&#x53D1;&#x9519;&#x8BEF;&#x7387;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EF;&#x907F;&#x514D;&#x504F;&#x5DEE;&#x662F;&#x591A;&#x5C11;&#xFF1F;&#x8FD9;&#x4E2A;&#x6BD4;&#x8F83;&#x5BB9;&#x6613;&#x56DE;&#x7B54;&#xFF0C;0.5%&#x662F;&#x4F60;&#x5BF9;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#x7684;&#x4F30;&#x8BA1;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x907F;&#x514D;&#x504F;&#x5DEE;&#x5C31;&#x662F;0.1%&#x3002;&#x4F60;&#x4E0D;&#x4F1A;&#x7528;&#x8FD9;&#x4E2A;1%&#x7684;&#x6570;&#x5B57;&#x4F5C;&#x4E3A;&#x53C2;&#x8003;&#xFF0C;&#x4F60;&#x7528;&#x7684;&#x662F;&#x8FD9;&#x4E2A;&#x5DEE;&#x503C;&#xFF0C;&#x6240;&#x4EE5;&#x4E5F;&#x8BB8;&#x4F60;&#x5BF9;&#x53EF;&#x907F;&#x514D;&#x504F;&#x5DEE;&#x7684;&#x4F30;&#x8BA1;&#x662F;&#x81F3;&#x5C11;0.1%&#xFF0C;&#x7136;&#x540E;&#x65B9;&#x5DEE;&#x662F;0.2%&#x3002;&#x548C;&#x51CF;&#x5C11;&#x53EF;&#x907F;&#x514D;&#x504F;&#x5DEE;&#x6BD4;&#x8F83;&#x8D77;&#x6765;&#xFF0C;&#x51CF;&#x5C11;&#x65B9;&#x5DEE;&#x53EF;&#x80FD;&#x7A7A;&#x95F4;&#x66F4;&#x5927;&#x3002;</p>
<p>&#x4F46;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x96BE;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x7C7B;&#x4E13;&#x5BB6;&#x56E2;&#x548C;&#x5355;&#x4E2A;&#x4EBA;&#x7C7B;&#x4E13;&#x5BB6;&#x7684;&#x8868;&#x73B0;&#x548C;&#x4EE5;&#x524D;&#x4E00;&#x6837;&#xFF0C;&#x4F46;&#x4F60;&#x7684;&#x7B97;&#x6CD5;&#x53EF;&#x4EE5;&#x5F97;&#x5230;0.3%&#x8BAD;&#x7EC3;&#x9519;&#x8BEF;&#x7387;&#xFF0C;&#x8FD8;&#x6709;0.4%&#x5F00;&#x53D1;&#x9519;&#x8BEF;&#x7387;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x53EF;&#x907F;&#x514D;&#x504F;&#x5DEE;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x73B0;&#x5728;&#x5176;&#x5B9E;&#x5F88;&#x96BE;&#x56DE;&#x7B54;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#x4F60;&#x7684;&#x8BAD;&#x7EC3;&#x9519;&#x8BEF;&#x7387;&#x662F;0.3%&#xFF0C;&#x8FD9;&#x662F;&#x5426;&#x610F;&#x5473;&#x7740;&#x4F60;&#x8FC7;&#x62DF;&#x5408;&#x4E86;0.2%&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#x5176;&#x5B9E;&#x662F;0.1%&#x5462;&#xFF1F;&#x6216;&#x8005;&#x4E5F;&#x8BB8;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#x662F;0.2%&#xFF1F;&#x6216;&#x8005;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#x662F;0.3%&#x5462;&#xFF1F;&#x4F60;&#x771F;&#x7684;&#x4E0D;&#x77E5;&#x9053;&#x3002;&#x4F46;&#x662F;&#x57FA;&#x4E8E;&#x672C;&#x4F8B;&#x4E2D;&#x7ED9;&#x51FA;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x4F60;&#x5B9E;&#x9645;&#x4E0A;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x4FE1;&#x606F;&#x6765;&#x5224;&#x65AD;&#x4F18;&#x5316;&#x4F60;&#x7684;&#x7B97;&#x6CD5;&#x65F6;&#x5E94;&#x8BE5;&#x4E13;&#x6CE8;&#x51CF;&#x5C11;&#x504F;&#x5DEE;&#x8FD8;&#x662F;&#x51CF;&#x5C11;&#x65B9;&#x5DEE;&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x53D6;&#x5F97;&#x8FDB;&#x5C55;&#x7684;&#x6548;&#x7387;&#x5C31;&#x4F1A;&#x964D;&#x4F4E;&#x3002;&#x8FD8;&#x6709;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7684;&#x9519;&#x8BEF;&#x7387;&#x5DF2;&#x7ECF;&#x6BD4;&#x4E00;&#x7FA4;&#x5145;&#x5206;&#x8BA8;&#x8BBA;&#x8FA9;&#x8BBA;&#x540E;&#x7684;&#x4EBA;&#x7C7B;&#x4E13;&#x5BB6;&#x66F4;&#x4F4E;&#xFF0C;&#x90A3;&#x4E48;&#x4F9D;&#x9760;&#x4EBA;&#x7C7B;&#x76F4;&#x89C9;&#x53BB;&#x5224;&#x65AD;&#x4F60;&#x7684;&#x7B97;&#x6CD5;&#x8FD8;&#x80FD;&#x5F80;&#x4EC0;&#x4E48;&#x65B9;&#x5411;&#x4F18;&#x5316;&#x5C31;&#x5F88;&#x96BE;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x4E00;&#x65E6;&#x4F60;&#x8D85;&#x8FC7;&#x8FD9;&#x4E2A;0.5%&#x7684;&#x95E8;&#x69DB;&#xFF0C;&#x8981;&#x8FDB;&#x4E00;&#x6B65;&#x4F18;&#x5316;&#x4F60;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x95EE;&#x9898;&#x5C31;&#x6CA1;&#x6709;&#x660E;&#x786E;&#x7684;&#x9009;&#x9879;&#x548C;&#x524D;&#x8FDB;&#x7684;&#x65B9;&#x5411;&#x4E86;&#x3002;&#x8FD9;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x4F60;&#x4E0D;&#x80FD;&#x53D6;&#x5F97;&#x8FDB;&#x5C55;&#xFF0C;&#x4F60;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x53D6;&#x5F97;&#x91CD;&#x5927;&#x8FDB;&#x5C55;&#x3002;&#x4F46;&#x73B0;&#x6709;&#x7684;&#x4E00;&#x4E9B;&#x5DE5;&#x5177;&#x5E2E;&#x52A9;&#x4F60;&#x6307;&#x660E;&#x65B9;&#x5411;&#x7684;&#x5DE5;&#x5177;&#x5C31;&#x6CA1;&#x90A3;&#x4E48;&#x597D;&#x7528;&#x4E86;&#x3002;</p>
<p><img src="../images/de2eb0ddc7918f6e9213871e07b8fa56.png" alt=""></p>
<p>&#x73B0;&#x5728;&#xFF0C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6709;&#x5F88;&#x591A;&#x95EE;&#x9898;&#x5DF2;&#x7ECF;&#x53EF;&#x4EE5;&#x5927;&#x5927;&#x8D85;&#x8D8A;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x4E86;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6211;&#x60F3;&#x7F51;&#x7EDC;&#x5E7F;&#x544A;&#xFF0C;&#x4F30;&#x8BA1;&#x67D0;&#x4E2A;&#x7528;&#x6237;&#x70B9;&#x51FB;&#x5E7F;&#x544A;&#x7684;&#x53EF;&#x80FD;&#x6027;&#xFF0C;&#x53EF;&#x80FD;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x505A;&#x5230;&#x7684;&#x6C34;&#x5E73;&#x5DF2;&#x7ECF;&#x8D85;&#x8D8A;&#x4EFB;&#x4F55;&#x4EBA;&#x7C7B;&#x4E86;&#x3002;&#x8FD8;&#x6709;&#x63D0;&#x51FA;&#x4EA7;&#x54C1;&#x5EFA;&#x8BAE;&#xFF0C;&#x5411;&#x4F60;&#x63A8;&#x8350;&#x7535;&#x5F71;&#x6216;&#x4E66;&#x7C4D;&#x4E4B;&#x7C7B;&#x7684;&#x4EFB;&#x52A1;&#x3002;&#x6211;&#x60F3;&#x4ECA;&#x5929;&#x7684;&#x7F51;&#x7AD9;&#x505A;&#x5230;&#x7684;&#x6C34;&#x5E73;&#x5DF2;&#x7ECF;&#x8D85;&#x8D8A;&#x4F60;&#x6700;&#x4EB2;&#x8FD1;&#x7684;&#x670B;&#x53CB;&#x4E86;&#x3002;&#x8FD8;&#x6709;&#x7269;&#x6D41;&#x9884;&#x6D4B;&#xFF0C;&#x4ECE;$A$&#x5230;$B$&#x5F00;&#x8F66;&#x9700;&#x8981;&#x591A;&#x4E45;&#xFF0C;&#x6216;&#x8005;&#x9884;&#x6D4B;&#x5FEB;&#x9012;&#x8F66;&#x4ECE;$A$&#x5F00;&#x5230;$B$&#x9700;&#x8981;&#x591A;&#x5C11;&#x65F6;&#x95F4;&#x3002;&#x6216;&#x8005;&#x9884;&#x6D4B;&#x67D0;&#x4EBA;&#x4F1A;&#x4E0D;&#x4F1A;&#x507F;&#x8FD8;&#x8D37;&#x6B3E;&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x5C31;&#x80FD;&#x5224;&#x65AD;&#x662F;&#x5426;&#x6279;&#x51C6;&#x8FD9;&#x4EBA;&#x7684;&#x8D37;&#x6B3E;&#x3002;&#x6211;&#x60F3;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x90FD;&#x662F;&#x4ECA;&#x5929;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x8FDC;&#x8FDC;&#x8D85;&#x8FC7;&#x4E86;&#x5355;&#x4E2A;&#x4EBA;&#x7C7B;&#x7684;&#x8868;&#x73B0;&#x3002;</p>
<p>&#x8BF7;&#x6CE8;&#x610F;&#x8FD9;&#x56DB;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x6240;&#x6709;&#x8FD9;&#x56DB;&#x4E2A;&#x4F8B;&#x5B50;&#x90FD;&#x662F;&#x4ECE;&#x7ED3;&#x6784;&#x5316;&#x6570;&#x636E;&#x4E2D;&#x5B66;&#x4E60;&#x5F97;&#x6765;&#x7684;&#xFF0C;&#x8FD9;&#x91CC;&#x4F60;&#x53EF;&#x80FD;&#x6709;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x8BB0;&#x5F55;&#x7528;&#x6237;&#x70B9;&#x51FB;&#x7684;&#x5386;&#x53F2;&#xFF0C;&#x4F60;&#x7684;&#x8D2D;&#x7269;&#x5386;&#x53F2;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x6216;&#x8005;&#x4ECE;A&#x5230;B&#x9700;&#x8981;&#x591A;&#x957F;&#x65F6;&#x95F4;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x4EE5;&#x524D;&#x7684;&#x8D37;&#x6B3E;&#x7533;&#x8BF7;&#x53CA;&#x7ED3;&#x679C;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x8FD9;&#x4E9B;&#x5E76;&#x4E0D;&#x662F;&#x81EA;&#x7136;&#x611F;&#x77E5;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E0D;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x95EE;&#x9898;&#xFF0C;&#x6216;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#xFF0C;&#x6216;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x5904;&#x7406;&#x4EFB;&#x52A1;&#x3002;&#x4EBA;&#x7C7B;&#x5728;&#x81EA;&#x7136;&#x611F;&#x77E5;&#x4EFB;&#x52A1;&#x4E2D;&#x5F80;&#x5F80;&#x8868;&#x73B0;&#x975E;&#x5E38;&#x597D;&#xFF0C;&#x6240;&#x4EE5;&#x6709;&#x53EF;&#x80FD;&#x5BF9;&#x8BA1;&#x7B97;&#x673A;&#x6765;&#x8BF4;&#x5728;&#x81EA;&#x7136;&#x611F;&#x77E5;&#x4EFB;&#x52A1;&#x7684;&#x8868;&#x73B0;&#x8981;&#x8D85;&#x8D8A;&#x4EBA;&#x7C7B;&#x8981;&#x66F4;&#x96BE;&#x4E00;&#x4E9B;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x4E2D;&#xFF0C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x56E2;&#x961F;&#x90FD;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x5927;&#x91CF;&#x6570;&#x636E;&#xFF0C;&#x6240;&#x4EE5;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x90A3;&#x56DB;&#x4E2A;&#x5E94;&#x7528;&#x4E2D;&#xFF0C;&#x6700;&#x597D;&#x7684;&#x7CFB;&#x7EDF;&#x770B;&#x5230;&#x7684;&#x6570;&#x636E;&#x91CF;&#x53EF;&#x80FD;&#x6BD4;&#x4EFB;&#x4F55;&#x4EBA;&#x7C7B;&#x80FD;&#x770B;&#x5230;&#x7684;&#x90FD;&#x591A;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x6837;&#x5C31;&#x76F8;&#x5BF9;&#x5BB9;&#x6613;&#x5F97;&#x5230;&#x8D85;&#x8D8A;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x7684;&#x7CFB;&#x7EDF;&#x3002;&#x73B0;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x53EF;&#x4EE5;&#x68C0;&#x7D22;&#x90A3;&#x4E48;&#x591A;&#x6570;&#x636E;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x6BD4;&#x4EBA;&#x7C7B;&#x66F4;&#x654F;&#x9510;&#x5730;&#x8BC6;&#x522B;&#x51FA;&#x6570;&#x636E;&#x4E2D;&#x7684;&#x7EDF;&#x8BA1;&#x89C4;&#x5F8B;&#x3002;</p>
<p>&#x9664;&#x4E86;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x4ECA;&#x5929;&#x5DF2;&#x7ECF;&#x6709;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#x7CFB;&#x7EDF;&#x8D85;&#x8D8A;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x4E86;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x4EFB;&#x52A1;&#xFF0C;&#x4E00;&#x4E9B;&#x56FE;&#x50CF;&#x8BC6;&#x522B;&#x4EFB;&#x52A1;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x5DF2;&#x7ECF;&#x8D85;&#x8D8A;&#x4E86;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x3002;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x4EBA;&#x7C7B;&#x5BF9;&#x8FD9;&#x79CD;&#x81EA;&#x7136;&#x611F;&#x77E5;&#x4EFB;&#x52A1;&#x975E;&#x5E38;&#x64C5;&#x957F;&#xFF0C;&#x6211;&#x60F3;&#x8BA1;&#x7B97;&#x673A;&#x8FBE;&#x5230;&#x90A3;&#x79CD;&#x6C34;&#x5E73;&#x8981;&#x96BE;&#x5F97;&#x591A;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x533B;&#x7597;&#x65B9;&#x9762;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x6BD4;&#x5982;&#x9605;&#x8BFB;<strong>ECG</strong>&#x6216;&#x8BCA;&#x65AD;&#x76AE;&#x80A4;&#x764C;&#xFF0C;&#x6216;&#x8005;&#x67D0;&#x4E9B;&#x7279;&#x5B9A;&#x9886;&#x57DF;&#x7684;&#x653E;&#x5C04;&#x79D1;&#x8BFB;&#x56FE;&#x4EFB;&#x52A1;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EFB;&#x52A1;&#x8BA1;&#x7B97;&#x673A;&#x505A;&#x5F97;&#x975E;&#x5E38;&#x597D;&#x4E86;&#xFF0C;&#x4E5F;&#x8BB8;&#x8D85;&#x8D8A;&#x4E86;&#x5355;&#x4E2A;&#x4EBA;&#x7C7B;&#x7684;&#x6C34;&#x5E73;&#x3002;</p>
<p>&#x5728;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x6700;&#x65B0;&#x8FDB;&#x5C55;&#x4E2D;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x632F;&#x594B;&#x4EBA;&#x5FC3;&#x7684;&#x65B9;&#x9762;&#x662F;&#xFF0C;&#x5373;&#x4F7F;&#x5728;&#x81EA;&#x7136;&#x611F;&#x77E5;&#x4EFB;&#x52A1;&#x4E2D;&#xFF0C;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x5DF2;&#x7ECF;&#x53EF;&#x4EE5;&#x8D85;&#x8D8A;&#x4EBA;&#x7C7B;&#x7684;&#x6C34;&#x5E73;&#x4E86;&#x3002;&#x4E0D;&#x8FC7;&#x73B0;&#x5728;&#x80AF;&#x5B9A;&#x66F4;&#x52A0;&#x56F0;&#x96BE;&#xFF0C;&#x56E0;&#x4E3A;&#x4EBA;&#x7C7B;&#x4E00;&#x822C;&#x5F88;&#x64C5;&#x957F;&#x8FD9;&#x79CD;&#x81EA;&#x7136;&#x611F;&#x77E5;&#x4EFB;&#x52A1;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x8981;&#x8FBE;&#x5230;&#x8D85;&#x8D8A;&#x4EBA;&#x7C7B;&#x7684;&#x8868;&#x73B0;&#x5F80;&#x5F80;&#x4E0D;&#x5BB9;&#x6613;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x6709;&#x8DB3;&#x591F;&#x591A;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5DF2;&#x7ECF;&#x6709;&#x5F88;&#x591A;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7CFB;&#x7EDF;&#xFF0C;&#x5728;&#x5355;&#x4E00;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x95EE;&#x9898;&#x4E0A;&#x5DF2;&#x7ECF;&#x8D85;&#x8D8A;&#x4E86;&#x4EBA;&#x7C7B;&#x7684;&#x6C34;&#x5E73;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x5BF9;&#x4F60;&#x5728;&#x5F00;&#x53D1;&#x7684;&#x5E94;&#x7528;&#x662F;&#x6709;&#x610F;&#x4E49;&#x7684;&#x3002;&#x6211;&#x5E0C;&#x671B;&#x6709;&#x4E00;&#x5929;&#x4F60;&#x4E5F;&#x80FD;&#x591F;&#x642D;&#x5EFA;&#x51FA;&#x8D85;&#x8D8A;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x7684;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7CFB;&#x7EDF;&#x3002;</p>
<h3 id="112-&#x6539;&#x5584;&#x4F60;&#x7684;&#x6A21;&#x578B;&#x7684;&#x8868;&#x73B0;&#xFF08;improving-your-model-performance&#xFF09;">1.12 &#x6539;&#x5584;&#x4F60;&#x7684;&#x6A21;&#x578B;&#x7684;&#x8868;&#x73B0;&#xFF08;Improving your model performance&#xFF09;</h3>
<p>&#x4F60;&#x4EEC;&#x5B66;&#x8FC7;&#x6B63;&#x4EA4;&#x5316;&#xFF0C;&#x5982;&#x4F55;&#x8BBE;&#x7ACB;&#x5F00;&#x53D1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#xFF0C;&#x7528;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x9519;&#x8BEF;&#x7387;&#x6765;&#x4F30;&#x8BA1;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x4F30;&#x8BA1;&#x53EF;&#x907F;&#x514D;&#x504F;&#x5DEE;&#x548C;&#x65B9;&#x5DEE;&#x3002;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x628A;&#x5B83;&#x4EEC;&#x5168;&#x90E8;&#x7EC4;&#x5408;&#x8D77;&#x6765;&#x5199;&#x6210;&#x4E00;&#x5957;&#x6307;&#x5BFC;&#x65B9;&#x9488;&#xFF0C;&#x5982;&#x4F55;&#x63D0;&#x9AD8;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x6027;&#x80FD;&#x7684;&#x6307;&#x5BFC;&#x65B9;&#x9488;&#x3002;</p>
<p><img src="../images/c932bd026edaf04840b78582e89f58f4.png" alt=""></p>
<p>&#x6240;&#x4EE5;&#x6211;&#x60F3;&#x8981;&#x8BA9;&#x4E00;&#x4E2A;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x8FBE;&#x5230;&#x5B9E;&#x7528;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x5E0C;&#x671B;&#x6216;&#x8005;&#x5047;&#x8BBE;&#x4F60;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x4E24;&#x4EF6;&#x4E8B;&#x60C5;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x4F60;&#x7684;&#x7B97;&#x6CD5;&#x5BF9;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x62DF;&#x5408;&#x5F88;&#x597D;&#xFF0C;&#x8FD9;&#x53EF;&#x4EE5;&#x770B;&#x6210;&#x662F;&#x4F60;&#x80FD;&#x505A;&#x5230;&#x53EF;&#x907F;&#x514D;&#x504F;&#x5DEE;&#x5F88;&#x4F4E;&#x3002;&#x8FD8;&#x6709;&#x7B2C;&#x4E8C;&#x4EF6;&#x4E8B;&#x4F60;&#x53EF;&#x4EE5;&#x505A;&#x597D;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#x505A;&#x5F97;&#x5F88;&#x597D;&#xFF0C;&#x7136;&#x540E;&#x63A8;&#x5E7F;&#x5230;&#x5F00;&#x53D1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x4E5F;&#x5F88;&#x597D;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x8BF4;&#x65B9;&#x5DEE;&#x4E0D;&#x662F;&#x592A;&#x5927;&#x3002;</p>
<p>&#x5728;&#x6B63;&#x4EA4;&#x5316;&#x7684;&#x7CBE;&#x795E;&#x4E0B;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x8FD9;&#x91CC;&#x6709;&#x7B2C;&#x4E8C;&#x7EC4;&#x65CB;&#x94AE;&#xFF0C;&#x53EF;&#x4EE5;&#x4FEE;&#x6B63;&#x53EF;&#x907F;&#x514D;&#x504F;&#x5DEE;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#x8BAD;&#x7EC3;&#x66F4;&#x5927;&#x7684;&#x7F51;&#x7EDC;&#x6216;&#x8005;&#x8BAD;&#x7EC3;&#x66F4;&#x4E45;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x5957;&#x72EC;&#x7ACB;&#x7684;&#x6280;&#x5DE7;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x5904;&#x7406;&#x65B9;&#x5DEE;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#x6B63;&#x5219;&#x5316;&#x6216;&#x8005;&#x6536;&#x96C6;&#x66F4;&#x591A;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x3002;</p>
<p>&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#x524D;&#x51E0;&#x6BB5;&#x89C6;&#x9891;&#x6211;&#x4EEC;&#x89C1;&#x5230;&#x7684;&#x6B65;&#x9AA4;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x63D0;&#x5347;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7CFB;&#x7EDF;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x6211;&#x5EFA;&#x8BAE;&#x4F60;&#x4EEC;&#x770B;&#x770B;&#x8BAD;&#x7EC3;&#x9519;&#x8BEF;&#x7387;&#x548C;&#x8D1D;&#x53F6;&#x65AF;&#x9519;&#x8BEF;&#x7387;&#x4F30;&#x8BA1;&#x503C;&#x4E4B;&#x95F4;&#x7684;&#x8DDD;&#x79BB;&#xFF0C;&#x8BA9;&#x4F60;&#x77E5;&#x9053;&#x53EF;&#x907F;&#x514D;&#x504F;&#x5DEE;&#x6709;&#x591A;&#x5927;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5C31;&#x662F;&#x4F60;&#x89C9;&#x5F97;&#x8FD8;&#x80FD;&#x505A;&#x591A;&#x597D;&#xFF0C;&#x4F60;&#x5BF9;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x4F18;&#x5316;&#x8FD8;&#x6709;&#x591A;&#x5C11;&#x7A7A;&#x95F4;&#x3002;&#x7136;&#x540E;&#x770B;&#x770B;&#x4F60;&#x7684;&#x5F00;&#x53D1;&#x9519;&#x8BEF;&#x7387;&#x548C;&#x8BAD;&#x7EC3;&#x9519;&#x8BEF;&#x7387;&#x4E4B;&#x95F4;&#x7684;&#x8DDD;&#x79BB;&#xFF0C;&#x5C31;&#x77E5;&#x9053;&#x4F60;&#x7684;&#x65B9;&#x5DEE;&#x95EE;&#x9898;&#x6709;&#x591A;&#x5927;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x505A;&#x591A;&#x5C11;&#x52AA;&#x529B;&#x8BA9;&#x4F60;&#x7684;&#x7B97;&#x6CD5;&#x8868;&#x73B0;&#x80FD;&#x591F;&#x4ECE;&#x8BAD;&#x7EC3;&#x96C6;&#x63A8;&#x5E7F;&#x5230;&#x5F00;&#x53D1;&#x96C6;&#xFF0C;&#x7B97;&#x6CD5;&#x662F;&#x6CA1;&#x6709;&#x5728;&#x5F00;&#x53D1;&#x96C6;&#x4E0A;&#x8BAD;&#x7EC3;&#x7684;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x60F3;&#x7528;&#x5C3D;&#x4E00;&#x5207;&#x529E;&#x6CD5;&#x51CF;&#x5C11;&#x53EF;&#x907F;&#x514D;&#x504F;&#x5DEE;&#xFF0C;&#x6211;&#x5EFA;&#x8BAE;&#x8BD5;&#x8BD5;&#x8FD9;&#x6837;&#x7684;&#x7B56;&#x7565;&#xFF1A;&#x6BD4;&#x5982;&#x4F7F;&#x7528;&#x89C4;&#x6A21;&#x66F4;&#x5927;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x8FD9;&#x6837;&#x7B97;&#x6CD5;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x7684;&#x8868;&#x73B0;&#x4F1A;&#x66F4;&#x597D;&#xFF0C;&#x6216;&#x8005;&#x8BAD;&#x7EC3;&#x66F4;&#x4E45;&#x3002;&#x4F7F;&#x7528;&#x66F4;&#x597D;&#x7684;&#x4F18;&#x5316;&#x7B97;&#x6CD5;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x52A0;&#x5165;<strong>momentum</strong>&#x6216;&#x8005;<strong>RMSprop</strong>&#xFF0C;&#x6216;&#x8005;&#x4F7F;&#x7528;&#x66F4;&#x597D;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x6BD4;&#x5982;<strong>Adam</strong>&#x3002;&#x4F60;&#x8FD8;&#x53EF;&#x4EE5;&#x8BD5;&#x8BD5;&#x5BFB;&#x627E;&#x66F4;&#x597D;&#x7684;&#x65B0;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x67B6;&#x6784;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x66F4;&#x597D;&#x7684;&#x8D85;&#x53C2;&#x6570;&#x3002;&#x8FD9;&#x4E9B;&#x624B;&#x6BB5;&#x5305;&#x7F57;&#x4E07;&#x6709;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x6539;&#x53D8;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF0C;&#x6539;&#x53D8;&#x5C42;&#x6570;&#x6216;&#x8005;&#x9690;&#x85CF;&#x5355;&#x4F4D;&#x6570;&#xFF0C;&#x867D;&#x7136;&#x4F60;&#x8FD9;&#x4E48;&#x505A;&#x53EF;&#x80FD;&#x4F1A;&#x8BA9;&#x6A21;&#x578B;&#x89C4;&#x6A21;&#x53D8;&#x5927;&#x3002;&#x6216;&#x8005;&#x8BD5;&#x7528;&#x5176;&#x4ED6;&#x6A21;&#x578B;&#xFF0C;&#x5176;&#x4ED6;&#x67B6;&#x6784;&#xFF0C;&#x5982;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x548C;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;&#x5728;&#x4E4B;&#x540E;&#x7684;&#x8BFE;&#x7A0B;&#x91CC;&#x6211;&#x4EEC;&#x4F1A;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x7684;&#xFF0C;&#x65B0;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x67B6;&#x6784;&#x80FD;&#x5426;&#x66F4;&#x597D;&#x5730;&#x62DF;&#x5408;&#x4F60;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x6709;&#x65F6;&#x4E5F;&#x5F88;&#x96BE;&#x9884;&#x5148;&#x5224;&#x65AD;&#xFF0C;&#x4F46;&#x6709;&#x65F6;&#x6362;&#x67B6;&#x6784;&#x53EF;&#x80FD;&#x4F1A;&#x5F97;&#x5230;&#x597D;&#x5F97;&#x591A;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p><img src="../images/c457e3e578f7d5c0f5aaf937f46eb8b7.png" alt=""></p>
<p>&#x53E6;&#x5916;&#x5F53;&#x4F60;&#x53D1;&#x73B0;&#x65B9;&#x5DEE;&#x662F;&#x4E2A;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8BD5;&#x7528;&#x5F88;&#x591A;&#x6280;&#x5DE7;&#xFF0C;&#x5305;&#x62EC;&#x4EE5;&#x4E0B;&#x8FD9;&#x4E9B;&#xFF1A;&#x4F60;&#x53EF;&#x4EE5;&#x6536;&#x96C6;&#x66F4;&#x591A;&#x6570;&#x636E;&#xFF0C;&#x56E0;&#x4E3A;&#x6536;&#x96C6;&#x66F4;&#x591A;&#x6570;&#x636E;&#x53BB;&#x8BAD;&#x7EC3;&#x53EF;&#x4EE5;&#x5E2E;&#x4F60;&#x66F4;&#x597D;&#x5730;&#x63A8;&#x5E7F;&#x5230;&#x7CFB;&#x7EDF;&#x770B;&#x4E0D;&#x5230;&#x7684;&#x5F00;&#x53D1;&#x96C6;&#x6570;&#x636E;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x6B63;&#x5219;&#x5316;&#xFF0C;&#x5305;&#x62EC;$L2$&#x6B63;&#x5219;&#x5316;&#xFF0C;<strong>dropout</strong>&#x6B63;&#x5219;&#x5316;&#x6216;&#x8005;&#x6211;&#x4EEC;&#x5728;&#x4E4B;&#x524D;&#x8BFE;&#x7A0B;&#x4E2D;&#x63D0;&#x5230;&#x7684;&#x6570;&#x636E;&#x589E;&#x5F3A;&#x3002;&#x540C;&#x65F6;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x8BD5;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x67B6;&#x6784;&#xFF0C;&#x8D85;&#x53C2;&#x6570;&#x641C;&#x7D22;&#xFF0C;&#x770B;&#x770B;&#x80FD;&#x4E0D;&#x80FD;&#x5E2E;&#x52A9;&#x4F60;&#xFF0C;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x66F4;&#x9002;&#x5408;&#x4F60;&#x7684;&#x95EE;&#x9898;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x67B6;&#x6784;&#x3002;</p>
<p>&#x6211;&#x60F3;&#x8FD9;&#x4E9B;&#x504F;&#x5DEE;&#x3001;&#x53EF;&#x907F;&#x514D;&#x504F;&#x5DEE;&#x548C;&#x65B9;&#x5DEE;&#x7684;&#x6982;&#x5FF5;&#x662F;&#x5BB9;&#x6613;&#x4E0A;&#x624B;&#xFF0C;&#x96BE;&#x4EE5;&#x7CBE;&#x901A;&#x7684;&#x3002;&#x5982;&#x679C;&#x4F60;&#x80FD;&#x7CFB;&#x7EDF;&#x5168;&#x9762;&#x5730;&#x5E94;&#x7528;&#x672C;&#x5468;&#x8BFE;&#x7A0B;&#x91CC;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x4F60;&#x5B9E;&#x9645;&#x4E0A;&#x4F1A;&#x6BD4;&#x5F88;&#x591A;&#x73B0;&#x6709;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x56E2;&#x961F;&#x66F4;&#x6709;&#x6548;&#x7387;&#x3001;&#x66F4;&#x7CFB;&#x7EDF;&#x3001;&#x66F4;&#x6709;&#x7B56;&#x7565;&#x5730;&#x7CFB;&#x7EDF;&#x63D0;&#x9AD8;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7CFB;&#x7EDF;&#x7684;&#x6027;&#x80FD;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="lesson2-week3.html" class="navigation navigation-prev " aria-label="Previous page: 第三周超参数调试，batch正则化和程序框架">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="lesson3-week2.html" class="navigation navigation-next " aria-label="Next page: 第二周：机器学习策略">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第一周：机器学习策略","level":"3.1","depth":1,"next":{"title":"第二周：机器学习策略","level":"3.2","depth":1,"path":"lesson3-week2.md","ref":"lesson3-week2.md","articles":[]},"previous":{"title":"第三周超参数调试，batch正则化和程序框架","level":"2.3","depth":1,"path":"lesson2-week3.md","ref":"lesson2-week3.md","articles":[]},"dir":"ltr"},"config":{"plugins":["fontsettings","sharing","-lunr","-search","search-pro","highlight","livereload","back-to-top-button","cdn"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"cdn":{"url":"//cdn.jsdelivr.net/gh/zhepama/C-Sharp-Playground@gh-pages/","img_url":"//cdn.jsdelivr.net/gh/zhepama/C-Sharp-Playground@gh-pages/"},"fontsettings":{"family":"sans","size":2,"theme":"white"},"sharing":{"all":["facebook","google","twitter","weibo","instapaper"],"facebook":true,"google":false,"instapaper":false,"twitter":true,"vk":false,"weibo":false},"search-pro":{},"highlight":{},"livereload":{},"back-to-top-button":{},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"深度学习教程","language":"zh-hans","links":{"sidebar":{"编程网":"https://www.editcode.net"}},"gitbook":"*"},"file":{"path":"lesson3-week1.md","mtime":"2021-05-09T12:44:38.270Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-05-09T13:30:39.812Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook.js"></script>
    <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/theme.js"></script>
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    

    </body>
</html>

