
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第一周 卷积神经网络 · 深度学习教程</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/style.css">

    
            
                
                <link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-back-to-top-button/plugin.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="lesson4-week2.html" />
    
    
    <link rel="prev" href="lesson3-week2.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://www.editcode.net" target="_blank" class="custom-link">编程网</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        <li class="header">第一门课 神经网络和深度学习</li>
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="lesson1-week1.html">
            
                <a href="lesson1-week1.html">
            
                    
                    第一周：深度学习引言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="lesson1-week2.html">
            
                <a href="lesson1-week2.html">
            
                    
                    第二周：神经网络的编程基础
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="lesson1-week3.html">
            
                <a href="lesson1-week3.html">
            
                    
                    第三周：浅层神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="lesson1-week4.html">
            
                <a href="lesson1-week4.html">
            
                    
                    第四周：深层神经网络
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第二门课 改善深层神经网络</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="lesson2-week1.html">
            
                <a href="lesson2-week1.html">
            
                    
                    第一周：深度学习的实践层面
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="lesson2-week2.html">
            
                <a href="lesson2-week2.html">
            
                    
                    第二周：优化算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="lesson2-week3.html">
            
                <a href="lesson2-week3.html">
            
                    
                    第三周超参数调试，batch正则化和程序框架
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第三门课 结构化机器学习项目</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="lesson3-week1.html">
            
                <a href="lesson3-week1.html">
            
                    
                    第一周：机器学习策略
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="lesson3-week2.html">
            
                <a href="lesson3-week2.html">
            
                    
                    第二周：机器学习策略
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第四门课 卷积神经网络</li>
        
        
    
        <li class="chapter active" data-level="4.1" data-path="lesson4-week1.html">
            
                <a href="lesson4-week1.html">
            
                    
                    第一周 卷积神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="lesson4-week2.html">
            
                <a href="lesson4-week2.html">
            
                    
                    第二周 深度卷积网络：实例探究
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.3" data-path="lesson4-week3.html">
            
                <a href="lesson4-week3.html">
            
                    
                    第三周 目标检测
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.4" data-path="lesson4-week4.html">
            
                <a href="lesson4-week4.html">
            
                    
                    第四周 特殊应用：人脸识别和神经风格转换
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第五门课 序列模型</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="lesson5-week1.html">
            
                <a href="lesson5-week1.html">
            
                    
                    第一周 循环序列模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.2" data-path="lesson5-week2.html">
            
                <a href="lesson5-week2.html">
            
                    
                    第二周 自然语言处理与词嵌入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.3" data-path="lesson5-week3.html">
            
                <a href="lesson5-week3.html">
            
                    
                    第三周 序列模型和注意力机制
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">附件</li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="interview.html">
            
                <a href="interview.html">
            
                    
                    人工智能大师访谈
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.2" data-path="notation.html">
            
                <a href="notation.html">
            
                    
                    深度学习符号指南（原课程翻译）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.3" data-path="notation.html">
            
                <a href="notation.html">
            
                    
                    机器学习的数学基础
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第一周 卷积神经网络</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;&#x56DB;&#x95E8;&#x8BFE;-&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF08;convolutional-neural-networks&#xFF09;">&#x7B2C;&#x56DB;&#x95E8;&#x8BFE; &#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF08;Convolutional Neural Networks&#xFF09;</h1>
<h2 id="&#x7B2C;&#x4E00;&#x5468;-&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF08;foundations-of-convolutional-neural-networks&#xFF09;">&#x7B2C;&#x4E00;&#x5468; &#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF08;Foundations of Convolutional Neural Networks&#xFF09;</h2>
<p>[TOC]</p>
<h3 id="11-&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#xFF08;computer-vision&#xFF09;">1.1 &#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#xFF08;Computer vision&#xFF09;</h3>
<p>&#x6B22;&#x8FCE;&#x53C2;&#x52A0;&#x8FD9;&#x6B21;&#x7684;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8BFE;&#x7A0B;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x662F;&#x4E00;&#x4E2A;&#x98DE;&#x901F;&#x53D1;&#x5C55;&#x7684;&#x4E00;&#x4E2A;&#x9886;&#x57DF;&#xFF0C;&#x8FD9;&#x591A;&#x4E8F;&#x4E86;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x3002;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x4E0E;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x6C7D;&#x8F66;&#xFF0C;&#x67E5;&#x660E;&#x5468;&#x56F4;&#x7684;&#x884C;&#x4EBA;&#x548C;&#x6C7D;&#x8F66;&#xFF0C;&#x5E76;&#x5E2E;&#x52A9;&#x6C7D;&#x8F66;&#x907F;&#x5F00;&#x5B83;&#x4EEC;&#x3002;&#x8FD8;&#x4F7F;&#x5F97;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x6280;&#x672F;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x6548;&#x7387;&#x548C;&#x7CBE;&#x51C6;&#xFF0C;&#x4F60;&#x4EEC;&#x5373;&#x5C06;&#x80FD;&#x591F;&#x4F53;&#x9A8C;&#x5230;&#x6216;&#x65E9;&#x5DF2;&#x4F53;&#x9A8C;&#x8FC7;&#x4EC5;&#x4EC5;&#x901A;&#x8FC7;&#x5237;&#x8138;&#x5C31;&#x80FD;&#x89E3;&#x9501;&#x624B;&#x673A;&#x6216;&#x8005;&#x95E8;&#x9501;&#x3002;&#x5F53;&#x4F60;&#x89E3;&#x9501;&#x4E86;&#x624B;&#x673A;&#xFF0C;&#x6211;&#x731C;&#x624B;&#x673A;&#x4E0A;&#x4E00;&#x5B9A;&#x6709;&#x5F88;&#x591A;&#x5206;&#x4EAB;&#x56FE;&#x7247;&#x7684;&#x5E94;&#x7528;&#x3002;&#x5728;&#x4E0A;&#x9762;&#xFF0C;&#x4F60;&#x80FD;&#x770B;&#x5230;&#x7F8E;&#x98DF;&#xFF0C;&#x9152;&#x5E97;&#x6216;&#x7F8E;&#x4E3D;&#x98CE;&#x666F;&#x7684;&#x56FE;&#x7247;&#x3002;&#x6709;&#x4E9B;&#x516C;&#x53F8;&#x5728;&#x8FD9;&#x4E9B;&#x5E94;&#x7528;&#x4E0A;&#x4F7F;&#x7528;&#x4E86;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x6280;&#x672F;&#x6765;&#x5411;&#x4F60;&#x5C55;&#x793A;&#x6700;&#x4E3A;&#x751F;&#x52A8;&#x7F8E;&#x4E3D;&#x4EE5;&#x53CA;&#x4E0E;&#x4F60;&#x6700;&#x4E3A;&#x76F8;&#x5173;&#x7684;&#x56FE;&#x7247;&#x3002;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x751A;&#x81F3;&#x8FD8;&#x50AC;&#x751F;&#x4E86;&#x65B0;&#x7684;&#x827A;&#x672F;&#x7C7B;&#x578B;&#x3002;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x4E4B;&#x6240;&#x4EE5;&#x8BA9;&#x6211;&#x5174;&#x594B;&#x6709;&#x4E0B;&#x9762;&#x4E24;&#x4E2A;&#x539F;&#x56E0;&#xFF0C;&#x6211;&#x60F3;&#x4F60;&#x4EEC;&#x4E5F;&#x662F;&#x8FD9;&#x4E48;&#x60F3;&#x7684;&#x3002;</p>
<p>&#x7B2C;&#x4E00;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x7684;&#x9AD8;&#x901F;&#x53D1;&#x5C55;&#x6807;&#x5FD7;&#x7740;&#x65B0;&#x578B;&#x5E94;&#x7528;&#x4EA7;&#x751F;&#x7684;&#x53EF;&#x80FD;&#xFF0C;&#x8FD9;&#x662F;&#x51E0;&#x5E74;&#x524D;&#xFF0C;&#x4EBA;&#x4EEC;&#x6240;&#x4E0D;&#x6562;&#x60F3;&#x8C61;&#x7684;&#x3002;&#x901A;&#x8FC7;&#x5B66;&#x4E60;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#xFF0C;&#x4F60;&#x4E5F;&#x8BB8;&#x80FD;&#x591F;&#x521B;&#x9020;&#x51FA;&#x65B0;&#x7684;&#x4EA7;&#x54C1;&#x548C;&#x5E94;&#x7528;&#x3002;</p>
<p>&#x5176;&#x6B21;&#xFF0C;&#x5373;&#x4F7F;&#x5230;&#x5934;&#x6765;&#x4F60;&#x672A;&#x80FD;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x4E0A;&#x6709;&#x6240;&#x5EFA;&#x6811;&#xFF0C;&#x4F46;&#x6211;&#x53D1;&#x73B0;&#xFF0C;&#x4EBA;&#x4EEC;&#x5BF9;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x7684;&#x7814;&#x7A76;&#x662F;&#x5982;&#x6B64;&#x5BCC;&#x6709;&#x60F3;&#x8C61;&#x529B;&#x548C;&#x521B;&#x9020;&#x529B;&#xFF0C;&#x7531;&#x6B64;&#x884D;&#x751F;&#x51FA;&#x65B0;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7ED3;&#x6784;&#x4E0E;&#x7B97;&#x6CD5;&#xFF0C;&#x8FD9;&#x5B9E;&#x9645;&#x4E0A;&#x542F;&#x53D1;&#x4EBA;&#x4EEC;&#x53BB;&#x521B;&#x9020;&#x51FA;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x4E0E;&#x5176;&#x4ED6;&#x9886;&#x57DF;&#x7684;&#x4EA4;&#x53C9;&#x6210;&#x679C;&#x3002;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x4E4B;&#x524D;&#x6211;&#x5728;&#x505A;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x7ECF;&#x5E38;&#x4ECE;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x9886;&#x57DF;&#x4E2D;&#x5BFB;&#x627E;&#x7075;&#x611F;&#xFF0C;
&#x5E76;&#x5C06;&#x5176;&#x5E94;&#x7528;&#x4E8E;&#x6211;&#x7684;&#x6587;&#x732E;&#x5F53;&#x4E2D;&#x3002;&#x6240;&#x4EE5;&#x5373;&#x4F7F;&#x4F60;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x65B9;&#x9762;&#x6CA1;&#x6709;&#x505A;&#x51FA;&#x6210;&#x679C;&#xFF0C;&#x6211;&#x4E5F;&#x5E0C;&#x671B;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x5C06;&#x6240;&#x5B66;&#x7684;&#x77E5;&#x8BC6;&#x5E94;&#x7528;&#x5230;&#x5176;&#x4ED6;&#x7B97;&#x6CD5;&#x548C;&#x7ED3;&#x6784;&#x3002;&#x5C31;&#x4ECB;&#x7ECD;&#x5230;&#x8FD9;&#x513F;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x5B66;&#x4E60;&#x5427;&#x3002;</p>
<p><img src="../images/373615de4e30035c662958ce39115fb4.png" alt=""></p>
<p>&#x8FD9;&#x662F;&#x6211;&#x4EEC;&#x672C;&#x8282;&#x8BFE;&#x5C06;&#x8981;&#x5B66;&#x4E60;&#x7684;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x65E9;&#x5C31;&#x542C;&#x8BF4;&#x8FC7;&#x56FE;&#x7247;&#x5206;&#x7C7B;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x56FE;&#x7247;&#x8BC6;&#x522B;&#x3002;&#x6BD4;&#x5982;&#x7ED9;&#x51FA;&#x8FD9;&#x5F20;64&#xD7;64&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x8BA9;&#x8BA1;&#x7B97;&#x673A;&#x53BB;&#x5206;&#x8FA8;&#x51FA;&#x8FD9;&#x662F;&#x4E00;&#x53EA;&#x732B;&#x3002;</p>
<p><img src="../images/f8ff84bc95636d9e37e35daef5149164.png" alt=""></p>
<p>&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x4E2D;&#x6709;&#x4E2A;&#x95EE;&#x9898;&#x53EB;&#x505A;&#x76EE;&#x6807;&#x68C0;&#x6D4B;&#xFF0C;&#x6BD4;&#x5982;&#x5728;&#x4E00;&#x4E2A;&#x65E0;&#x4EBA;&#x9A7E;&#x9A76;&#x9879;&#x76EE;&#x4E2D;&#xFF0C;&#x4F60;&#x4E0D;&#x4E00;&#x5B9A;&#x975E;&#x5F97;&#x8BC6;&#x522B;&#x51FA;&#x56FE;&#x7247;&#x4E2D;&#x7684;&#x7269;&#x4F53;&#x662F;&#x8F66;&#x8F86;&#xFF0C;&#x4F46;&#x4F60;&#x9700;&#x8981;&#x8BA1;&#x7B97;&#x51FA;&#x5176;&#x4ED6;&#x8F66;&#x8F86;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x81EA;&#x5DF1;&#x80FD;&#x591F;&#x907F;&#x5F00;&#x5B83;&#x4EEC;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x76EE;&#x6807;&#x68C0;&#x6D4B;&#x9879;&#x76EE;&#x4E2D;&#xFF0C;&#x9996;&#x5148;&#x9700;&#x8981;&#x8BA1;&#x7B97;&#x51FA;&#x56FE;&#x4E2D;&#x6709;&#x54EA;&#x4E9B;&#x7269;&#x4F53;&#xFF0C;&#x6BD4;&#x5982;&#x6C7D;&#x8F66;&#xFF0C;&#x8FD8;&#x6709;&#x56FE;&#x7247;&#x4E2D;&#x7684;&#x5176;&#x4ED6;&#x4E1C;&#x897F;&#xFF0C;&#x518D;&#x5C06;&#x5B83;&#x4EEC;&#x6A21;&#x62DF;&#x6210;&#x4E00;&#x4E2A;&#x4E2A;&#x76D2;&#x5B50;&#xFF0C;&#x6216;&#x7528;&#x4E00;&#x4E9B;&#x5176;&#x4ED6;&#x7684;&#x6280;&#x672F;&#x8BC6;&#x522B;&#x51FA;&#x5B83;&#x4EEC;&#x5728;&#x56FE;&#x7247;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x6CE8;&#x610F;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x5728;&#x4E00;&#x5F20;&#x56FE;&#x7247;&#x4E2D;&#x540C;&#x65F6;&#x6709;&#x591A;&#x4E2A;&#x8F66;&#x8F86;&#xFF0C;&#x6BCF;&#x8F86;&#x8F66;&#x76F8;&#x5BF9;&#x4E0E;&#x4F60;&#x6765;&#x8BF4;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x786E;&#x5207;&#x7684;&#x8DDD;&#x79BB;&#x3002;</p>
<p><img src="../images/bf57536975bce32f78c9e66a2360e8a1.png" alt=""></p>
<p>&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x66F4;&#x6709;&#x8DA3;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5C31;&#x662F;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5B9E;&#x73B0;&#x7684;&#x56FE;&#x7247;&#x98CE;&#x683C;&#x8FC1;&#x79FB;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x4F60;&#x6709;&#x4E00;&#x5F20;&#x56FE;&#x7247;&#xFF0C;&#x4F46;&#x4F60;&#x60F3;&#x5C06;&#x8FD9;&#x5F20;&#x56FE;&#x7247;&#x8F6C;&#x6362;&#x4E3A;&#x53E6;&#x5916;&#x4E00;&#x79CD;&#x98CE;&#x683C;&#x3002;&#x6240;&#x4EE5;&#x56FE;&#x7247;&#x98CE;&#x683C;&#x8FC1;&#x79FB;&#xFF0C;&#x5C31;&#x662F;&#x4F60;&#x6709;&#x4E00;&#x5F20;&#x6EE1;&#x610F;&#x7684;&#x56FE;&#x7247;&#x548C;&#x4E00;&#x5F20;&#x98CE;&#x683C;&#x56FE;&#x7247;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x53F3;&#x8FB9;&#x8FD9;&#x5E45;&#x753B;&#x662F;&#x6BD5;&#x52A0;&#x7D22;&#x7684;&#x753B;&#x4F5C;&#xFF0C;&#x800C;&#x4F60;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5C06;&#x5B83;&#x4EEC;&#x878D;&#x5408;&#x5230;&#x4E00;&#x8D77;&#xFF0C;&#x63CF;&#x7ED8;&#x51FA;&#x4E00;&#x5F20;&#x65B0;&#x7684;&#x56FE;&#x7247;&#x3002;&#x5B83;&#x7684;&#x6574;&#x4F53;&#x8F6E;&#x5ED3;&#x6765;&#x81EA;&#x4E8E;&#x5DE6;&#x8FB9;&#xFF0C;&#x5374;&#x662F;&#x53F3;&#x8FB9;&#x7684;&#x98CE;&#x683C;&#xFF0C;&#x6700;&#x540E;&#x751F;&#x6210;&#x4E0B;&#x9762;&#x8FD9;&#x5F20;&#x56FE;&#x7247;&#x3002;&#x8FD9;&#x79CD;&#x795E;&#x5947;&#x7684;&#x7B97;&#x6CD5;&#x521B;&#x9020;&#x51FA;&#x4E86;&#x65B0;&#x7684;&#x827A;&#x672F;&#x98CE;&#x683C;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x8FD9;&#x95E8;&#x8BFE;&#x7A0B;&#x4E2D;&#xFF0C;&#x4F60;&#x4E5F;&#x80FD;&#x901A;&#x8FC7;&#x5B66;&#x4E60;&#x505A;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x4F46;&#x5728;&#x5E94;&#x7528;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x65F6;&#x8981;&#x9762;&#x4E34;&#x4E00;&#x4E2A;&#x6311;&#x6218;&#xFF0C;&#x5C31;&#x662F;&#x6570;&#x636E;&#x7684;&#x8F93;&#x5165;&#x53EF;&#x80FD;&#x4F1A;&#x975E;&#x5E38;&#x5927;&#x3002;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5728;&#x8FC7;&#x53BB;&#x7684;&#x8BFE;&#x7A0B;&#x4E2D;&#xFF0C;&#x4F60;&#x4EEC;&#x4E00;&#x822C;&#x64CD;&#x4F5C;&#x7684;&#x90FD;&#x662F;64&#xD7;64&#x7684;&#x5C0F;&#x56FE;&#x7247;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5B83;&#x7684;&#x6570;&#x636E;&#x91CF;&#x662F;64&#xD7;64&#xD7;3&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x5F20;&#x56FE;&#x7247;&#x90FD;&#x6709;3&#x4E2A;&#x989C;&#x8272;&#x901A;&#x9053;&#x3002;&#x5982;&#x679C;&#x8BA1;&#x7B97;&#x4E00;&#x4E0B;&#x7684;&#x8BDD;&#xFF0C;&#x53EF;&#x5F97;&#x77E5;&#x6570;&#x636E;&#x91CF;&#x4E3A;12288&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x7684;&#x7279;&#x5F81;&#x5411;&#x91CF;$x$&#x7EF4;&#x5EA6;&#x4E3A;12288&#x3002;&#x8FD9;&#x5176;&#x5B9E;&#x8FD8;&#x597D;&#xFF0C;&#x56E0;&#x4E3A;64&#xD7;64&#x771F;&#x7684;&#x662F;&#x5F88;&#x5C0F;&#x7684;&#x4E00;&#x5F20;&#x56FE;&#x7247;&#x3002;</p>
<p><img src="../images/f126bca19d15f113c0f0371fdf0833d8.png" alt=""></p>
<p>&#x5982;&#x679C;&#x4F60;&#x8981;&#x64CD;&#x4F5C;&#x66F4;&#x5927;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x6BD4;&#x5982;&#x4E00;&#x5F20;1000&#xD7;1000&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x5B83;&#x8DB3;&#x6709;1&#x5146;&#x90A3;&#x4E48;&#x5927;&#xFF0C;&#x4F46;&#x662F;&#x7279;&#x5F81;&#x5411;&#x91CF;&#x7684;&#x7EF4;&#x5EA6;&#x8FBE;&#x5230;&#x4E86;1000&#xD7;1000&#xD7;3&#xFF0C;&#x56E0;&#x4E3A;&#x6709;3&#x4E2A;<strong>RGB</strong>&#x901A;&#x9053;&#xFF0C;&#x6240;&#x4EE5;&#x6570;&#x5B57;&#x5C06;&#x4F1A;&#x662F;300&#x4E07;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5728;&#x5C3A;&#x5BF8;&#x5F88;&#x5C0F;&#x7684;&#x5C4F;&#x5E55;&#x4E0A;&#x89C2;&#x5BDF;&#xFF0C;&#x53EF;&#x80FD;&#x5BDF;&#x89C9;&#x4E0D;&#x51FA;&#x4E0A;&#x9762;&#x7684;&#x56FE;&#x7247;&#x53EA;&#x6709;64&#xD7;64&#x90A3;&#x4E48;&#x5927;&#xFF0C;&#x800C;&#x4E0B;&#x9762;&#x4E00;&#x5F20;&#x662F;1000&#xD7;1000&#x7684;&#x5927;&#x56FE;&#x3002;</p>
<p><img src="../images/9dc51757210398f26ec96d13540beacb.png" alt=""></p>
<p>&#x5982;&#x679C;&#x4F60;&#x8981;&#x8F93;&#x5165;300&#x4E07;&#x7684;&#x6570;&#x636E;&#x91CF;&#xFF0C;&#x8FD9;&#x5C31;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x7279;&#x5F81;&#x5411;&#x91CF;$x$&#x7684;&#x7EF4;&#x5EA6;&#x9AD8;&#x8FBE;300&#x4E07;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x7B2C;&#x4E00;&#x9690;&#x85CF;&#x5C42;&#x4E2D;&#xFF0C;&#x4F60;&#x4E5F;&#x8BB8;&#x4F1A;&#x6709;1000&#x4E2A;&#x9690;&#x85CF;&#x5355;&#x5143;&#xFF0C;&#x800C;&#x6240;&#x6709;&#x7684;&#x6743;&#x503C;&#x7EC4;&#x6210;&#x4E86;&#x77E9;&#x9635; $W^{[1]}$&#x3002;&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;&#x4E86;&#x6807;&#x51C6;&#x7684;&#x5168;&#x8FDE;&#x63A5;&#x7F51;&#x7EDC;&#xFF0C;&#x5C31;&#x50CF;&#x6211;&#x4EEC;&#x5728;&#x7B2C;&#x4E00;&#x95E8;&#x548C;&#x7B2C;&#x4E8C;&#x95E8;&#x7684;&#x8BFE;&#x7A0B;&#x91CC;&#x8BF4;&#x7684;&#xFF0C;&#x8FD9;&#x4E2A;&#x77E9;&#x9635;&#x7684;&#x5927;&#x5C0F;&#x5C06;&#x4F1A;&#x662F;1000&#xD7;300&#x4E07;&#x3002;&#x56E0;&#x4E3A;&#x73B0;&#x5728;$x$&#x7684;&#x7EF4;&#x5EA6;&#x4E3A;$3m$&#xFF0C;$3m$&#x901A;&#x5E38;&#x7528;&#x6765;&#x8868;&#x793A;300&#x4E07;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x77E9;&#x9635;$W^{[1]}$&#x4F1A;&#x6709;30&#x4EBF;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x8FD9;&#x662F;&#x4E2A;&#x975E;&#x5E38;&#x5DE8;&#x5927;&#x7684;&#x6570;&#x5B57;&#x3002;&#x5728;&#x53C2;&#x6570;&#x5982;&#x6B64;&#x5927;&#x91CF;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x96BE;&#x4EE5;&#x83B7;&#x5F97;&#x8DB3;&#x591F;&#x7684;&#x6570;&#x636E;&#x6765;&#x9632;&#x6B62;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x53D1;&#x751F;&#x8FC7;&#x62DF;&#x5408;&#x548C;&#x7ADE;&#x4E89;&#x9700;&#x6C42;&#xFF0C;&#x8981;&#x5904;&#x7406;&#x5305;&#x542B;30&#x4EBF;&#x53C2;&#x6570;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x5DE8;&#x5927;&#x7684;&#x5185;&#x5B58;&#x9700;&#x6C42;&#x8BA9;&#x4EBA;&#x4E0D;&#x592A;&#x80FD;&#x63A5;&#x53D7;&#x3002;</p>
<p>&#x4F46;&#x5BF9;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x5E94;&#x7528;&#x6765;&#x8BF4;&#xFF0C;&#x4F60;&#x80AF;&#x5B9A;&#x4E0D;&#x60F3;&#x5B83;&#x53EA;&#x5904;&#x7406;&#x5C0F;&#x56FE;&#x7247;&#xFF0C;&#x4F60;&#x5E0C;&#x671B;&#x5B83;&#x540C;&#x65F6;&#x4E5F;&#x8981;&#x80FD;&#x5904;&#x7406;&#x5927;&#x56FE;&#x3002;&#x4E3A;&#x6B64;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x5377;&#x79EF;&#x8BA1;&#x7B97;&#xFF0C;&#x5B83;&#x662F;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x5757;&#x3002;&#x4E0B;&#x8282;&#x8BFE;&#x4E2D;&#xFF0C;&#x6211;&#x4F1A;&#x4E3A;&#x4F60;&#x4ECB;&#x7ECD;&#x5982;&#x4F55;&#x8FDB;&#x884C;&#x8FD9;&#x79CD;&#x8FD0;&#x7B97;&#xFF0C;&#x6211;&#x5C06;&#x7528;&#x8FB9;&#x7F18;&#x68C0;&#x6D4B;&#x7684;&#x4F8B;&#x5B50;&#x6765;&#x5411;&#x4F60;&#x8BF4;&#x660E;&#x5377;&#x79EF;&#x7684;&#x542B;&#x4E49;&#x3002;</p>
<h3 id="12-&#x8FB9;&#x7F18;&#x68C0;&#x6D4B;&#x793A;&#x4F8B;&#xFF08;edge-detection-example&#xFF09;">1.2 &#x8FB9;&#x7F18;&#x68C0;&#x6D4B;&#x793A;&#x4F8B;&#xFF08;Edge detection example&#xFF09;</h3>
<p>&#x5377;&#x79EF;&#x8FD0;&#x7B97;&#x662F;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6700;&#x57FA;&#x672C;&#x7684;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#xFF0C;&#x4F7F;&#x7528;&#x8FB9;&#x7F18;&#x68C0;&#x6D4B;&#x4F5C;&#x4E3A;&#x5165;&#x95E8;&#x6837;&#x4F8B;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x89C6;&#x9891;&#x4E2D;&#xFF0C;&#x4F60;&#x4F1A;&#x770B;&#x5230;&#x5377;&#x79EF;&#x662F;&#x5982;&#x4F55;&#x8FDB;&#x884C;&#x8FD0;&#x7B97;&#x7684;&#x3002;</p>
<p><img src="../images/a4b8429a41f31afb14adaa9204f98c66.png" alt=""></p>
<p>&#x5728;&#x4E4B;&#x524D;&#x7684;&#x89C6;&#x9891;&#x4E2D;&#xFF0C;&#x6211;&#x8BF4;&#x8FC7;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x524D;&#x51E0;&#x5C42;&#x662F;&#x5982;&#x4F55;&#x68C0;&#x6D4B;&#x8FB9;&#x7F18;&#x7684;&#xFF0C;&#x7136;&#x540E;&#xFF0C;&#x540E;&#x9762;&#x7684;&#x5C42;&#x6709;&#x53EF;&#x80FD;&#x68C0;&#x6D4B;&#x5230;&#x7269;&#x4F53;&#x7684;&#x90E8;&#x5206;&#x533A;&#x57DF;&#xFF0C;&#x66F4;&#x9760;&#x540E;&#x7684;&#x4E00;&#x4E9B;&#x5C42;&#x53EF;&#x80FD;&#x68C0;&#x6D4B;&#x5230;&#x5B8C;&#x6574;&#x7684;&#x7269;&#x4F53;&#xFF0C;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x5C31;&#x662F;&#x4EBA;&#x8138;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x89C6;&#x9891;&#x4E2D;&#xFF0C;&#x4F60;&#x4F1A;&#x770B;&#x5230;&#x5982;&#x4F55;&#x5728;&#x4E00;&#x5F20;&#x56FE;&#x7247;&#x4E2D;&#x8FDB;&#x884C;&#x8FB9;&#x7F18;&#x68C0;&#x6D4B;&#x3002;</p>
<p><img src="../images/47c14f666d56e509a6863e826502bda2.png" alt=""></p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x7ED9;&#x4E86;&#x8FD9;&#x6837;&#x4E00;&#x5F20;&#x56FE;&#x7247;&#xFF0C;&#x8BA9;&#x7535;&#x8111;&#x53BB;&#x641E;&#x6E05;&#x695A;&#x8FD9;&#x5F20;&#x7167;&#x7247;&#x91CC;&#x6709;&#x4EC0;&#x4E48;&#x7269;&#x4F53;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x505A;&#x7684;&#x7B2C;&#x4E00;&#x4EF6;&#x4E8B;&#x662F;&#x68C0;&#x6D4B;&#x56FE;&#x7247;&#x4E2D;&#x7684;&#x5782;&#x76F4;&#x8FB9;&#x7F18;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x5728;&#x8FD9;&#x5F20;&#x56FE;&#x7247;&#x4E2D;&#x7684;&#x680F;&#x6746;&#x5C31;&#x5BF9;&#x5E94;&#x5782;&#x76F4;&#x7EBF;&#xFF0C;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#xFF0C;&#x8FD9;&#x4E9B;&#x884C;&#x4EBA;&#x7684;&#x8F6E;&#x5ED3;&#x7EBF;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x4E5F;&#x662F;&#x5782;&#x7EBF;&#xFF0C;&#x8FD9;&#x4E9B;&#x7EBF;&#x662F;&#x5782;&#x76F4;&#x8FB9;&#x7F18;&#x68C0;&#x6D4B;&#x5668;&#x7684;&#x8F93;&#x51FA;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4E5F;&#x60F3;&#x68C0;&#x6D4B;&#x6C34;&#x5E73;&#x8FB9;&#x7F18;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x8FD9;&#x4E9B;&#x680F;&#x6746;&#x5C31;&#x662F;&#x5F88;&#x660E;&#x663E;&#x7684;&#x6C34;&#x5E73;&#x7EBF;&#xFF0C;&#x5B83;&#x4EEC;&#x4E5F;&#x80FD;&#x88AB;&#x68C0;&#x6D4B;&#x5230;&#xFF0C;&#x7ED3;&#x679C;&#x5728;&#x8FD9;&#x3002;&#x6240;&#x4EE5;&#x5982;&#x4F55;&#x5728;&#x56FE;&#x50CF;&#x4E2D;&#x68C0;&#x6D4B;&#x8FD9;&#x4E9B;&#x8FB9;&#x7F18;&#xFF1F;</p>
<p>&#x770B;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;6&#xD7;6&#x7684;&#x7070;&#x5EA6;&#x56FE;&#x50CF;&#x3002;&#x56E0;&#x4E3A;&#x662F;&#x7070;&#x5EA6;&#x56FE;&#x50CF;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x662F;6&#xD7;6&#xD7;1&#x7684;&#x77E9;&#x9635;&#xFF0C;&#x800C;&#x4E0D;&#x662F;6&#xD7;6&#xD7;3&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;<strong>RGB</strong>&#x4E09;&#x901A;&#x9053;&#x3002;&#x4E3A;&#x4E86;&#x68C0;&#x6D4B;&#x56FE;&#x50CF;&#x4E2D;&#x7684;&#x5782;&#x76F4;&#x8FB9;&#x7F18;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x6784;&#x9020;&#x4E00;&#x4E2A;3&#xD7;3&#x77E9;&#x9635;&#x3002;&#x5728;&#x5171;&#x7528;&#x4E60;&#x60EF;&#x4E2D;&#xFF0C;&#x5728;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x672F;&#x8BED;&#x4E2D;&#xFF0C;&#x5B83;&#x88AB;&#x79F0;&#x4E3A;&#x8FC7;&#x6EE4;&#x5668;&#x3002;&#x6211;&#x8981;&#x6784;&#x9020;&#x4E00;&#x4E2A;3&#xD7;3&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x50CF;&#x8FD9;&#x6837;$\begin{bmatrix}1 &amp; 0 &amp; -1\ 1 &amp; 0 &amp; -1\ 1 &amp; 0 &amp; -1\end{bmatrix}$&#x3002;&#x5728;&#x8BBA;&#x6587;&#x5B83;&#x6709;&#x65F6;&#x5019;&#x4F1A;&#x88AB;&#x79F0;&#x4E3A;&#x6838;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x4F46;&#x5728;&#x8FD9;&#x4E2A;&#x89C6;&#x9891;&#x4E2D;&#xFF0C;&#x6211;&#x5C06;&#x4F7F;&#x7528;&#x8FC7;&#x6EE4;&#x5668;&#x8FD9;&#x4E2A;&#x672F;&#x8BED;&#x3002;&#x5BF9;&#x8FD9;&#x4E2A;6&#xD7;6&#x7684;&#x56FE;&#x50CF;&#x8FDB;&#x884C;&#x5377;&#x79EF;&#x8FD0;&#x7B97;&#xFF0C;&#x5377;&#x79EF;&#x8FD0;&#x7B97;&#x7528;&#x201C;$*$&#x201D;&#x6765;&#x8868;&#x793A;&#xFF0C;&#x7528;3&#xD7;3&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x5377;&#x79EF;&#x3002;</p>
<p><img src="../images/7099a5373f2281626aa8ddd47a180571.png" alt=""></p>
<p>&#x5173;&#x4E8E;&#x7B26;&#x53F7;&#x8868;&#x793A;&#xFF0C;&#x6709;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x5728;&#x6570;&#x5B66;&#x4E2D;&#x201C;$<em>$&#x201D;&#x5C31;&#x662F;&#x5377;&#x79EF;&#x7684;&#x6807;&#x51C6;&#x6807;&#x5FD7;&#xFF0C;&#x4F46;&#x662F;&#x5728;<strong>Python</strong>&#x4E2D;&#xFF0C;&#x8FD9;&#x4E2A;&#x6807;&#x8BC6;&#x5E38;&#x5E38;&#x88AB;&#x7528;&#x6765;&#x8868;&#x793A;&#x4E58;&#x6CD5;&#x6216;&#x8005;&#x5143;&#x7D20;&#x4E58;&#x6CD5;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x201C;$</em>$&#x201D;&#x6709;&#x591A;&#x5C42;&#x542B;&#x4E49;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x91CD;&#x8F7D;&#x7B26;&#x53F7;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x89C6;&#x9891;&#x4E2D;&#xFF0C;&#x5F53;&#x201C;$*$&#x201D;&#x8868;&#x793A;&#x5377;&#x79EF;&#x7684;&#x65F6;&#x5019;&#x6211;&#x4F1A;&#x7279;&#x522B;&#x8BF4;&#x660E;&#x3002;</p>
<p><img src="../images/d6ecaeb7228172a00bc3948e8b214a27.png" alt=""></p>
<p>&#x8FD9;&#x4E2A;&#x5377;&#x79EF;&#x8FD0;&#x7B97;&#x7684;&#x8F93;&#x51FA;&#x5C06;&#x4F1A;&#x662F;&#x4E00;&#x4E2A;4&#xD7;4&#x7684;&#x77E9;&#x9635;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x5B83;&#x770B;&#x6210;&#x4E00;&#x4E2A;4&#xD7;4&#x7684;&#x56FE;&#x50CF;&#x3002;&#x4E0B;&#x9762;&#x6765;&#x8BF4;&#x660E;&#x662F;&#x5982;&#x4F55;&#x8BA1;&#x7B97;&#x5F97;&#x5230;&#x8FD9;&#x4E2A;4&#xD7;4&#x77E9;&#x9635;&#x7684;&#x3002;&#x4E3A;&#x4E86;&#x8BA1;&#x7B97;&#x7B2C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x5728;4&#xD7;4&#x5DE6;&#x4E0A;&#x89D2;&#x7684;&#x90A3;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x4F7F;&#x7528;3&#xD7;3&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x5C06;&#x5176;&#x8986;&#x76D6;&#x5728;&#x8F93;&#x5165;&#x56FE;&#x50CF;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;&#x7136;&#x540E;&#x8FDB;&#x884C;&#x5143;&#x7D20;&#x4E58;&#x6CD5;&#xFF08;<strong>element-wise products</strong>&#xFF09;&#x8FD0;&#x7B97;&#xFF0C;&#x6240;&#x4EE5;$\begin{bmatrix} 3 \times 1 &amp; 0 \times 0 &amp; 1 \times \left(1 \right) \ 1 \times 1 &amp; 5 \times 0 &amp; 8 \times \left( - 1 \right) \ 2 \times1 &amp; 7 \times 0 &amp; 2 \times \left( - 1 \right) \ \end{bmatrix} = \begin{bmatrix}3 &amp; 0 &amp; - 1 \ 1 &amp; 0 &amp; - 8 \ 2 &amp; 0 &amp; - 2 \\end{bmatrix}$&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x8BE5;&#x77E9;&#x9635;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x76F8;&#x52A0;&#x5F97;&#x5230;&#x6700;&#x5DE6;&#x4E0A;&#x89D2;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x5373;$3+1+2+0+0 +0+(-1)+(-8) +(-2)=-5$&#x3002;</p>
<p><img src="../images/2b4796e91703492fe5a87d4fd95fcd6b.png" alt=""></p>
<p>&#x628A;&#x8FD9;9&#x4E2A;&#x6570;&#x52A0;&#x8D77;&#x6765;&#x5F97;&#x5230;-5&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x8FD9;9&#x4E2A;&#x6570;&#x6309;&#x4EFB;&#x4F55;&#x987A;&#x5E8F;&#x76F8;&#x52A0;&#xFF0C;&#x6211;&#x53EA;&#x662F;&#x5148;&#x5199;&#x4E86;&#x7B2C;&#x4E00;&#x5217;&#xFF0C;&#x7136;&#x540E;&#x7B2C;&#x4E8C;&#x5217;&#xFF0C;&#x7B2C;&#x4E09;&#x5217;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x4E3A;&#x4E86;&#x5F04;&#x660E;&#x767D;&#x7B2C;&#x4E8C;&#x4E2A;&#x5143;&#x7D20;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x4F60;&#x8981;&#x628A;&#x84DD;&#x8272;&#x7684;&#x65B9;&#x5757;&#xFF0C;&#x5411;&#x53F3;&#x79FB;&#x52A8;&#x4E00;&#x6B65;&#xFF0C;&#x50CF;&#x8FD9;&#x6837;&#xFF0C;&#x628A;&#x8FD9;&#x4E9B;&#x7EFF;&#x8272;&#x7684;&#x6807;&#x8BB0;&#x53BB;&#x6389;&#xFF1A;</p>
<p><img src="../images/ad626a7a5a1cda8eb679e15f953f84a7.png" alt=""></p>
<p>&#x7EE7;&#x7EED;&#x505A;&#x540C;&#x6837;&#x7684;&#x5143;&#x7D20;&#x4E58;&#x6CD5;&#xFF0C;&#x7136;&#x540E;&#x52A0;&#x8D77;&#x6765;&#xFF0C;&#x6240;&#x4EE5;&#x662F; $0&#xD7;1+5&#xD7;1+7&#xD7;1+1&#xD7;0+8&#xD7;0+2&#xD7;0+2&#xD7;(-1)+ 9&#xD7;(-1)+5&#xD7;(-1)=-4 $&#x3002;</p>
<p><img src="../images/9aa008335e8a229d3818a61aaccc7173.png" alt=""></p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x4E5F;&#x662F;&#x4E00;&#x6837;&#xFF0C;&#x7EE7;&#x7EED;&#x53F3;&#x79FB;&#x4E00;&#x6B65;&#xFF0C;&#x628A;9&#x4E2A;&#x6570;&#x7684;&#x70B9;&#x79EF;&#x52A0;&#x8D77;&#x6765;&#x5F97;&#x5230;0&#x3002;</p>
<p><img src="../images/440160a5ee39c0cd09380ad496c02e00.png" alt=""></p>
<p>&#x7EE7;&#x7EED;&#x79FB;&#x5F97;&#x5230;8&#xFF0C;&#x9A8C;&#x8BC1;&#x4E00;&#x4E0B;&#xFF1A;$2&#xD7;1+9&#xD7;1+5&#xD7;1+7&#xD7;0+3&#xD7;0+1&#xD7;0+4&#xD7;(-1)+ 1&#xD7;(-1)+ 3&#xD7;(-1)=8$&#x3002;</p>
<p><img src="../images/2d34d782d438191675289a0b4bffcd20.png" alt=""></p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x4E3A;&#x4E86;&#x5F97;&#x5230;&#x4E0B;&#x4E00;&#x884C;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x73B0;&#x5728;&#x628A;&#x84DD;&#x8272;&#x5757;&#x4E0B;&#x79FB;&#xFF0C;&#x73B0;&#x5728;&#x84DD;&#x8272;&#x5757;&#x5728;&#x8FD9;&#x4E2A;&#x4F4D;&#x7F6E;&#xFF1A;</p>
<p><img src="../images/348ff3ef87dd57f40b0ed0e0571f7751.png" alt=""></p>
<p>&#x91CD;&#x590D;&#x8FDB;&#x884C;&#x5143;&#x7D20;&#x4E58;&#x6CD5;&#xFF0C;&#x7136;&#x540E;&#x52A0;&#x8D77;&#x6765;&#x3002;&#x901A;&#x8FC7;&#x8FD9;&#x6837;&#x505A;&#x5F97;&#x5230;-10&#x3002;&#x518D;&#x5C06;&#x5176;&#x53F3;&#x79FB;&#x5F97;&#x5230;-2&#xFF0C;&#x63A5;&#x7740;&#x662F;2&#xFF0C;3&#x3002;&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#xFF0C;&#x8FD9;&#x6837;&#x8BA1;&#x7B97;&#x5B8C;&#x77E9;&#x9635;&#x4E2D;&#x7684;&#x5176;&#x4ED6;&#x5143;&#x7D20;&#x3002;</p>
<p><img src="../images/5f9c10d0986f003e5bd6fa87a9ffe04b.png" alt=""></p>
<p>&#x4E3A;&#x4E86;&#x8BF4;&#x5F97;&#x66F4;&#x6E05;&#x695A;&#x4E00;&#x70B9;&#xFF0C;&#x8FD9;&#x4E2A;-16&#x662F;&#x901A;&#x8FC7;&#x5E95;&#x90E8;&#x53F3;&#x4E0B;&#x89D2;&#x7684;3&#xD7;3&#x533A;&#x57DF;&#x5F97;&#x5230;&#x7684;&#x3002;</p>
<p>&#x56E0;&#x6B64;6&#xD7;6&#x77E9;&#x9635;&#x548C;3&#xD7;3&#x77E9;&#x9635;&#x8FDB;&#x884C;&#x5377;&#x79EF;&#x8FD0;&#x7B97;&#x5F97;&#x5230;4&#xD7;4&#x77E9;&#x9635;&#x3002;&#x8FD9;&#x4E9B;&#x56FE;&#x7247;&#x548C;&#x8FC7;&#x6EE4;&#x5668;&#x662F;&#x4E0D;&#x540C;&#x7EF4;&#x5EA6;&#x7684;&#x77E9;&#x9635;&#xFF0C;&#x4F46;&#x5DE6;&#x8FB9;&#x77E9;&#x9635;&#x5BB9;&#x6613;&#x88AB;&#x7406;&#x89E3;&#x4E3A;&#x4E00;&#x5F20;&#x56FE;&#x7247;&#xFF0C;&#x4E2D;&#x95F4;&#x7684;&#x8FD9;&#x4E2A;&#x88AB;&#x7406;&#x89E3;&#x4E3A;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x53F3;&#x8FB9;&#x7684;&#x56FE;&#x7247;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x53E6;&#x4E00;&#x5F20;&#x56FE;&#x7247;&#x3002;&#x8FD9;&#x4E2A;&#x5C31;&#x662F;&#x5782;&#x76F4;&#x8FB9;&#x7F18;&#x68C0;&#x6D4B;&#x5668;&#xFF0C;&#x4E0B;&#x4E00;&#x9875;&#x4E2D;&#x4F60;&#x5C31;&#x4F1A;&#x660E;&#x767D;&#x3002;</p>
<p>&#x5728;&#x5F80;&#x4E0B;&#x8BB2;&#x4E4B;&#x524D;&#xFF0C;&#x591A;&#x8BF4;&#x4E00;&#x53E5;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8981;&#x4F7F;&#x7528;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x8FD0;&#x7B97;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7528;&#x201C;$<em>$&#x201D;&#x6765;&#x8868;&#x793A;&#x5377;&#x79EF;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x7F16;&#x7A0B;&#x7EC3;&#x4E60;&#x4E2D;&#xFF0C;&#x4F60;&#x4F1A;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x53EB;<strong>conv_forward</strong>&#x7684;&#x51FD;&#x6570;&#x3002;&#x5982;&#x679C;&#x5728;<strong>tensorflow</strong>&#x4E0B;&#xFF0C;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x53EB;<strong>tf.conv2d</strong>&#x3002;&#x5728;&#x5176;&#x4ED6;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x6846;&#x67B6;&#x4E2D;&#xFF0C;&#x5728;&#x540E;&#x9762;&#x7684;&#x8BFE;&#x7A0B;&#x4E2D;&#xFF0C;&#x4F60;&#x5C06;&#x4F1A;&#x770B;&#x5230;<strong>Keras</strong>&#x8FD9;&#x4E2A;&#x6846;&#x67B6;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x6846;&#x67B6;&#x4E0B;&#x7528;<em>*Conv2D</em></em>&#x5B9E;&#x73B0;&#x5377;&#x79EF;&#x8FD0;&#x7B97;&#x3002;&#x6240;&#x6709;&#x7684;&#x7F16;&#x7A0B;&#x6846;&#x67B6;&#x90FD;&#x6709;&#x4E00;&#x4E9B;&#x51FD;&#x6570;&#x6765;&#x5B9E;&#x73B0;&#x5377;&#x79EF;&#x8FD0;&#x7B97;&#x3002;</p>
<p><img src="../images/fdfb1a469b84ac7c25482e5064f3d594.png" alt=""></p>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4E2A;&#x53EF;&#x4EE5;&#x505A;&#x5782;&#x76F4;&#x8FB9;&#x7F18;&#x68C0;&#x6D4B;&#x5462;&#xFF1F;&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x3002;&#x4E3A;&#x4E86;&#x8BB2;&#x6E05;&#x695A;&#xFF0C;&#x6211;&#x4F1A;&#x7528;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;6&#xD7;6&#x56FE;&#x50CF;&#xFF0C;&#x5DE6;&#x8FB9;&#x7684;&#x4E00;&#x534A;&#x662F;10&#xFF0C;&#x53F3;&#x8FB9;&#x4E00;&#x822C;&#x662F;0&#x3002;&#x5982;&#x679C;&#x4F60;&#x628A;&#x5B83;&#x5F53;&#x6210;&#x4E00;&#x4E2A;&#x56FE;&#x7247;&#xFF0C;&#x5DE6;&#x8FB9;&#x90A3;&#x90E8;&#x5206;&#x770B;&#x8D77;&#x6765;&#x662F;&#x767D;&#x8272;&#x7684;&#xFF0C;&#x50CF;&#x7D20;&#x503C;10&#x662F;&#x6BD4;&#x8F83;&#x4EAE;&#x7684;&#x50CF;&#x7D20;&#x503C;&#xFF0C;&#x53F3;&#x8FB9;&#x50CF;&#x7D20;&#x503C;&#x6BD4;&#x8F83;&#x6697;&#xFF0C;&#x6211;&#x4F7F;&#x7528;&#x7070;&#x8272;&#x6765;&#x8868;&#x793A;0&#xFF0C;&#x5C3D;&#x7BA1;&#x5B83;&#x4E5F;&#x53EF;&#x4EE5;&#x88AB;&#x753B;&#x6210;&#x9ED1;&#x7684;&#x3002;&#x56FE;&#x7247;&#x91CC;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x7279;&#x522B;&#x660E;&#x663E;&#x7684;&#x5782;&#x76F4;&#x8FB9;&#x7F18;&#x5728;&#x56FE;&#x50CF;&#x4E2D;&#x95F4;&#xFF0C;&#x8FD9;&#x6761;&#x5782;&#x76F4;&#x7EBF;&#x662F;&#x4ECE;&#x9ED1;&#x5230;&#x767D;&#x7684;&#x8FC7;&#x6E21;&#x7EBF;&#xFF0C;&#x6216;&#x8005;&#x4ECE;&#x767D;&#x8272;&#x5230;&#x6DF1;&#x8272;&#x3002;</p>
<p><img src="../images/50836692632e32453f0eefcbbf58551b.png" alt=""></p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x5F53;&#x4F60;&#x7528;&#x4E00;&#x4E2A;3&#xD7;3&#x8FC7;&#x6EE4;&#x5668;&#x8FDB;&#x884C;&#x5377;&#x79EF;&#x8FD0;&#x7B97;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FD9;&#x4E2A;3&#xD7;3&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x53EF;&#x89C6;&#x5316;&#x4E3A;&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x6837;&#x5B50;&#xFF0C;&#x5728;&#x5DE6;&#x8FB9;&#x6709;&#x660E;&#x4EAE;&#x7684;&#x50CF;&#x7D20;&#xFF0C;&#x7136;&#x540E;&#x6709;&#x4E00;&#x4E2A;&#x8FC7;&#x6E21;&#xFF0C;0&#x5728;&#x4E2D;&#x95F4;&#xFF0C;&#x7136;&#x540E;&#x53F3;&#x8FB9;&#x662F;&#x6DF1;&#x8272;&#x7684;&#x3002;&#x5377;&#x79EF;&#x8FD0;&#x7B97;&#x540E;&#xFF0C;&#x4F60;&#x5F97;&#x5230;&#x7684;&#x662F;&#x53F3;&#x8FB9;&#x7684;&#x77E9;&#x9635;&#x3002;&#x5982;&#x679C;&#x4F60;&#x613F;&#x610F;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6570;&#x5B66;&#x8FD0;&#x7B97;&#x53BB;&#x9A8C;&#x8BC1;&#x3002;&#x4E3E;&#x4F8B;&#x6765;&#x8BF4;&#xFF0C;&#x6700;&#x5DE6;&#x4E0A;&#x89D2;&#x7684;&#x5143;&#x7D20;0&#xFF0C;&#x5C31;&#x662F;&#x7531;&#x8FD9;&#x4E2A;3&#xD7;3&#x5757;&#xFF08;&#x7EFF;&#x8272;&#x65B9;&#x6846;&#x6807;&#x8BB0;&#xFF09;&#x7ECF;&#x8FC7;&#x5143;&#x7D20;&#x4E58;&#x79EF;&#x8FD0;&#x7B97;&#x518D;&#x6C42;&#x548C;&#x5F97;&#x5230;&#x7684;&#xFF0C;$10&#xD7;1+10&#xD7;1+10&#xD7;1+10&#xD7;0+10&#xD7;0+10&#xD7;0+10&#xD7;(-1)+10&#xD7;(-1)+10&#xD7;(-1)=0$</p>
<p>&#x3002;&#x76F8;&#x53CD;&#x8FD9;&#x4E2A;30&#x662F;&#x7531;&#x8FD9;&#x4E2A;&#xFF08;&#x7EA2;&#x8272;&#x65B9;&#x6846;&#x6807;&#x8BB0;&#xFF09;&#x5F97;&#x5230;&#x7684;&#xFF0C;</p>
<p>$10&#xD7;1+10&#xD7;1+10&#xD7;1+10&#xD7;0+10&#xD7;0+10&#xD7;0+0&#xD7;(-1)+0&#xD7;(-1)+ 0&#xD7;(-1)=30$&#x3002;</p>
<p><img src="../images/0c8b5b8441557b671431d515aefa1e8a.png" alt=""></p>
<p>&#x5982;&#x679C;&#x628A;&#x6700;&#x53F3;&#x8FB9;&#x7684;&#x77E9;&#x9635;&#x5F53;&#x6210;&#x56FE;&#x50CF;&#xFF0C;&#x5B83;&#x662F;&#x8FD9;&#x4E2A;&#x6837;&#x5B50;&#x3002;&#x5728;&#x4E2D;&#x95F4;&#x6709;&#x6BB5;&#x4EAE;&#x4E00;&#x70B9;&#x7684;&#x533A;&#x57DF;&#xFF0C;&#x5BF9;&#x5E94;&#x68C0;&#x67E5;&#x5230;&#x8FD9;&#x4E2A;6&#xD7;6&#x56FE;&#x50CF;&#x4E2D;&#x95F4;&#x7684;&#x5782;&#x76F4;&#x8FB9;&#x7F18;&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x7EF4;&#x6570;&#x4F3C;&#x4E4E;&#x6709;&#x70B9;&#x4E0D;&#x6B63;&#x786E;&#xFF0C;&#x68C0;&#x6D4B;&#x5230;&#x7684;&#x8FB9;&#x7F18;&#x592A;&#x7C97;&#x4E86;&#x3002;&#x56E0;&#x4E3A;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x56FE;&#x7247;&#x592A;&#x5C0F;&#x4E86;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7528;&#x4E00;&#x4E2A;1000&#xD7;1000&#x7684;&#x56FE;&#x50CF;&#xFF0C;&#x800C;&#x4E0D;&#x662F;6&#xD7;6&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x5176;&#x4F1A;&#x5F88;&#x597D;&#x5730;&#x68C0;&#x6D4B;&#x51FA;&#x56FE;&#x50CF;&#x4E2D;&#x7684;&#x5782;&#x76F4;&#x8FB9;&#x7F18;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x5728;&#x8F93;&#x51FA;&#x56FE;&#x50CF;&#x4E2D;&#x95F4;&#x7684;&#x4EAE;&#x5904;&#xFF0C;&#x8868;&#x793A;&#x5728;&#x56FE;&#x50CF;&#x4E2D;&#x95F4;&#x6709;&#x4E00;&#x4E2A;&#x7279;&#x522B;&#x660E;&#x663E;&#x7684;&#x5782;&#x76F4;&#x8FB9;&#x7F18;&#x3002;&#x4ECE;&#x5782;&#x76F4;&#x8FB9;&#x7F18;&#x68C0;&#x6D4B;&#x4E2D;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x7684;&#x542F;&#x53D1;&#x662F;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x4F7F;&#x7528;3&#xD7;3&#x7684;&#x77E9;&#x9635;&#xFF08;&#x8FC7;&#x6EE4;&#x5668;&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#x5782;&#x76F4;&#x8FB9;&#x7F18;&#x662F;&#x4E00;&#x4E2A;3&#xD7;3&#x7684;&#x533A;&#x57DF;&#xFF0C;&#x5DE6;&#x8FB9;&#x662F;&#x660E;&#x4EAE;&#x7684;&#x50CF;&#x7D20;&#xFF0C;&#x4E2D;&#x95F4;&#x7684;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x8003;&#x8651;&#xFF0C;&#x53F3;&#x8FB9;&#x662F;&#x6DF1;&#x8272;&#x50CF;&#x7D20;&#x3002;&#x5728;&#x8FD9;&#x4E2A;6&#xD7;6&#x56FE;&#x50CF;&#x7684;&#x4E2D;&#x95F4;&#x90E8;&#x5206;&#xFF0C;&#x660E;&#x4EAE;&#x7684;&#x50CF;&#x7D20;&#x5728;&#x5DE6;&#x8FB9;&#xFF0C;&#x6DF1;&#x8272;&#x7684;&#x50CF;&#x7D20;&#x5728;&#x53F3;&#x8FB9;&#xFF0C;&#x5C31;&#x88AB;&#x89C6;&#x4E3A;&#x4E00;&#x4E2A;&#x5782;&#x76F4;&#x8FB9;&#x7F18;&#xFF0C;&#x5377;&#x79EF;&#x8FD0;&#x7B97;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x65B9;&#x4FBF;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x53D1;&#x73B0;&#x56FE;&#x50CF;&#x4E2D;&#x7684;&#x5782;&#x76F4;&#x8FB9;&#x7F18;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x4F60;&#x5DF2;&#x7ECF;&#x4E86;&#x89E3;&#x5377;&#x79EF;&#x662F;&#x600E;&#x4E48;&#x5DE5;&#x4F5C;&#x7684;&#xFF0C;&#x5728;&#x4E0B;&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#x4E2D;&#xFF0C;&#x4F60;&#x5C06;&#x4F1A;&#x770B;&#x5230;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x5377;&#x79EF;&#x8FD0;&#x7B97;&#x4F5C;&#x4E3A;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x57FA;&#x672C;&#x6A21;&#x5757;&#x7684;&#x3002;</p>
<h3 id="13-&#x66F4;&#x591A;&#x8FB9;&#x7F18;&#x68C0;&#x6D4B;&#x5185;&#x5BB9;&#xFF08;more-edge-detection&#xFF09;">1.3 &#x66F4;&#x591A;&#x8FB9;&#x7F18;&#x68C0;&#x6D4B;&#x5185;&#x5BB9;&#xFF08;More edge detection&#xFF09;</h3>
<p>&#x4F60;&#x5DF2;&#x7ECF;&#x89C1;&#x8BC6;&#x5230;&#x7528;&#x5377;&#x79EF;&#x8FD0;&#x7B97;&#x5B9E;&#x73B0;&#x5782;&#x76F4;&#x8FB9;&#x7F18;&#x68C0;&#x6D4B;&#xFF0C;&#x5728;&#x672C;&#x89C6;&#x9891;&#x4E2D;&#xFF0C;&#x4F60;&#x5C06;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x533A;&#x5206;&#x6B63;&#x8FB9;&#x548C;&#x8D1F;&#x8FB9;&#xFF0C;&#x8FD9;&#x5B9E;&#x9645;&#x5C31;&#x662F;&#x7531;&#x4EAE;&#x5230;&#x6697;&#x4E0E;&#x7531;&#x6697;&#x5230;&#x4EAE;&#x7684;&#x533A;&#x522B;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8FB9;&#x7F18;&#x7684;&#x8FC7;&#x6E21;&#x3002;&#x4F60;&#x8FD8;&#x80FD;&#x4E86;&#x89E3;&#x5230;&#x5176;&#x4ED6;&#x7C7B;&#x578B;&#x7684;&#x8FB9;&#x7F18;&#x68C0;&#x6D4B;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x53BB;&#x5B9E;&#x73B0;&#x8FD9;&#x4E9B;&#x7B97;&#x6CD5;&#xFF0C;&#x800C;&#x4E0D;&#x8981;&#x603B;&#x60F3;&#x7740;&#x53BB;&#x81EA;&#x5DF1;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x8FB9;&#x7F18;&#x68C0;&#x6D4B;&#x7A0B;&#x5E8F;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x5427;&#x3002;</p>
<p><img src="../images/783267536976c27544bbe36ac758a48e.png" alt=""></p>
<p>&#x8FD8;&#x662F;&#x4E0A;&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#x4E2D;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x8FD9;&#x5F20;6&#xD7;6&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x5DE6;&#x8FB9;&#x8F83;&#x4EAE;&#xFF0C;&#x800C;&#x53F3;&#x8FB9;&#x8F83;&#x6697;&#xFF0C;&#x5C06;&#x5B83;&#x4E0E;&#x5782;&#x76F4;&#x8FB9;&#x7F18;&#x68C0;&#x6D4B;&#x6EE4;&#x6CE2;&#x5668;&#x8FDB;&#x884C;&#x5377;&#x79EF;&#xFF0C;&#x68C0;&#x6D4B;&#x7ED3;&#x679C;&#x5C31;&#x663E;&#x793A;&#x5728;&#x4E86;&#x53F3;&#x8FB9;&#x8FD9;&#x5E45;&#x56FE;&#x7684;&#x4E2D;&#x95F4;&#x90E8;&#x5206;&#x3002;</p>
<p><img src="../images/6a248e5698d1f61ac4ba0238363c4a37.png" alt=""></p>
<p>&#x73B0;&#x5728;&#x8FD9;&#x5E45;&#x56FE;&#x6709;&#x4EC0;&#x4E48;&#x53D8;&#x5316;&#x5462;&#xFF1F;&#x5B83;&#x7684;&#x989C;&#x8272;&#x88AB;&#x7FFB;&#x8F6C;&#x4E86;&#xFF0C;&#x53D8;&#x6210;&#x4E86;&#x5DE6;&#x8FB9;&#x6BD4;&#x8F83;&#x6697;&#xFF0C;&#x800C;&#x53F3;&#x8FB9;&#x6BD4;&#x8F83;&#x4EAE;&#x3002;&#x73B0;&#x5728;&#x4EAE;&#x5EA6;&#x4E3A;10&#x7684;&#x70B9;&#x8DD1;&#x5230;&#x4E86;&#x53F3;&#x8FB9;&#xFF0C;&#x4E3A;0&#x7684;&#x70B9;&#x5219;&#x8DD1;&#x5230;&#x4E86;&#x5DE6;&#x8FB9;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7528;&#x5B83;&#x4E0E;&#x76F8;&#x540C;&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x8FDB;&#x884C;&#x5377;&#x79EF;&#xFF0C;&#x6700;&#x540E;&#x5F97;&#x5230;&#x7684;&#x56FE;&#x4E2D;&#x95F4;&#x4F1A;&#x662F;-30&#xFF0C;&#x800C;&#x4E0D;&#x662F;30&#x3002;&#x5982;&#x679C;&#x4F60;&#x5C06;&#x77E9;&#x9635;&#x8F6C;&#x6362;&#x4E3A;&#x56FE;&#x7247;&#xFF0C;&#x5C31;&#x4F1A;&#x662F;&#x8BE5;&#x77E9;&#x9635;&#x4E0B;&#x9762;&#x56FE;&#x7247;&#x7684;&#x6837;&#x5B50;&#x3002;&#x73B0;&#x5728;&#x4E2D;&#x95F4;&#x7684;&#x8FC7;&#x6E21;&#x90E8;&#x5206;&#x88AB;&#x7FFB;&#x8F6C;&#x4E86;&#xFF0C;&#x4E4B;&#x524D;&#x7684;30&#x7FFB;&#x8F6C;&#x6210;&#x4E86;-30&#xFF0C;&#x8868;&#x660E;&#x662F;&#x7531;&#x6697;&#x5411;&#x4EAE;&#x8FC7;&#x6E21;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7531;&#x4EAE;&#x5411;&#x6697;&#x8FC7;&#x6E21;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x5728;&#x4E4E;&#x8FD9;&#x4E24;&#x8005;&#x7684;&#x533A;&#x522B;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x53D6;&#x51FA;&#x77E9;&#x9635;&#x7684;&#x7EDD;&#x5BF9;&#x503C;&#x3002;&#x4F46;&#x8FD9;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x786E;&#x5B9E;&#x53EF;&#x4EE5;&#x4E3A;&#x6211;&#x4EEC;&#x533A;&#x5206;&#x8FD9;&#x4E24;&#x79CD;&#x660E;&#x6697;&#x53D8;&#x5316;&#x7684;&#x533A;&#x522B;&#x3002;</p>
<p>&#x518D;&#x6765;&#x770B;&#x770B;&#x66F4;&#x591A;&#x7684;&#x8FB9;&#x7F18;&#x68C0;&#x6D4B;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x89C1;&#x8FC7;&#x8FD9;&#x4E2A;3&#xD7;3&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x68C0;&#x6D4B;&#x51FA;&#x5782;&#x76F4;&#x7684;&#x8FB9;&#x7F18;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x770B;&#x5230;&#x53F3;&#x8FB9;&#x8FD9;&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x6211;&#x60F3;&#x4F60;&#x5E94;&#x8BE5;&#x731C;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x5B83;&#x80FD;&#x8BA9;&#x4F60;&#x68C0;&#x6D4B;&#x51FA;&#x6C34;&#x5E73;&#x7684;&#x8FB9;&#x7F18;&#x3002;&#x63D0;&#x9192;&#x4E00;&#x4E0B;&#xFF0C;&#x4E00;&#x4E2A;&#x5782;&#x76F4;&#x8FB9;&#x7F18;&#x8FC7;&#x6EE4;&#x5668;&#x662F;&#x4E00;&#x4E2A;3&#xD7;3&#x7684;&#x533A;&#x57DF;&#xFF0C;&#x5B83;&#x7684;&#x5DE6;&#x8FB9;&#x76F8;&#x5BF9;&#x8F83;&#x4EAE;&#xFF0C;&#x800C;&#x53F3;&#x8FB9;&#x76F8;&#x5BF9;&#x8F83;&#x6697;&#x3002;&#x76F8;&#x4F3C;&#x7684;&#xFF0C;&#x53F3;&#x8FB9;&#x8FD9;&#x4E2A;&#x6C34;&#x5E73;&#x8FB9;&#x7F18;&#x8FC7;&#x6EE4;&#x5668;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;3&#xD7;3&#x7684;&#x533A;&#x57DF;&#xFF0C;&#x5B83;&#x7684;&#x4E0A;&#x8FB9;&#x76F8;&#x5BF9;&#x8F83;&#x4EAE;&#xFF0C;&#x800C;&#x4E0B;&#x65B9;&#x76F8;&#x5BF9;&#x8F83;&#x6697;&#x3002;</p>
<p><img src="../images/199323db1d4858ef2463f34323e1d85f.png" alt=""></p>
<p>&#x8FD9;&#x91CC;&#x8FD8;&#x6709;&#x4E2A;&#x66F4;&#x590D;&#x6742;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5DE6;&#x4E0A;&#x65B9;&#x548C;&#x53F3;&#x4E0B;&#x65B9;&#x90FD;&#x662F;&#x4EAE;&#x5EA6;&#x4E3A;10&#x7684;&#x70B9;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5C06;&#x5B83;&#x7ED8;&#x6210;&#x56FE;&#x7247;&#xFF0C;&#x53F3;&#x4E0A;&#x89D2;&#x662F;&#x6BD4;&#x8F83;&#x6697;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x8FD9;&#x8FB9;&#x90FD;&#x662F;&#x4EAE;&#x5EA6;&#x4E3A;0&#x7684;&#x70B9;&#xFF0C;&#x6211;&#x628A;&#x8FD9;&#x4E9B;&#x6BD4;&#x8F83;&#x6697;&#x7684;&#x533A;&#x57DF;&#x90FD;&#x52A0;&#x4E0A;&#x9634;&#x5F71;&#x3002;&#x800C;&#x5DE6;&#x4E0A;&#x65B9;&#x548C;&#x53F3;&#x4E0B;&#x65B9;&#x90FD;&#x4F1A;&#x76F8;&#x5BF9;&#x8F83;&#x4EAE;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7528;&#x8FD9;&#x5E45;&#x56FE;&#x4E0E;&#x6C34;&#x5E73;&#x8FB9;&#x7F18;&#x8FC7;&#x6EE4;&#x5668;&#x5377;&#x79EF;&#xFF0C;&#x5C31;&#x4F1A;&#x5F97;&#x5230;&#x53F3;&#x8FB9;&#x8FD9;&#x4E2A;&#x77E9;&#x9635;&#x3002;</p>
<p><img src="../images/f4adb9d91879e1c1aaef9bc9e244c64a.png" alt=""></p>
<p>&#x518D;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;30&#xFF08;&#x53F3;&#x8FB9;&#x77E9;&#x9635;&#x4E2D;&#x7EFF;&#x8272;&#x65B9;&#x6846;&#x6807;&#x8BB0;&#x5143;&#x7D20;&#xFF09;&#x4EE3;&#x8868;&#x4E86;&#x5DE6;&#x8FB9;&#x8FD9;&#x5757;3&#xD7;3&#x7684;&#x533A;&#x57DF;&#xFF08;&#x5DE6;&#x8FB9;&#x77E9;&#x9635;&#x7EFF;&#x8272;&#x65B9;&#x6846;&#x6807;&#x8BB0;&#x90E8;&#x5206;&#xFF09;&#xFF0C;&#x8FD9;&#x5757;&#x533A;&#x57DF;&#x786E;&#x5B9E;&#x662F;&#x4E0A;&#x8FB9;&#x6BD4;&#x8F83;&#x4EAE;&#xFF0C;&#x800C;&#x4E0B;&#x8FB9;&#x6BD4;&#x8F83;&#x6697;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x5728;&#x8FD9;&#x91CC;&#x53D1;&#x73B0;&#x4E86;&#x4E00;&#x6761;&#x6B63;&#x8FB9;&#x7F18;&#x3002;&#x800C;&#x8FD9;&#x91CC;&#x7684;-30&#xFF08;&#x53F3;&#x8FB9;&#x77E9;&#x9635;&#x4E2D;&#x7D2B;&#x8272;&#x65B9;&#x6846;&#x6807;&#x8BB0;&#x5143;&#x7D20;&#xFF09;&#x53C8;&#x4EE3;&#x8868;&#x4E86;&#x5DE6;&#x8FB9;&#x53E6;&#x4E00;&#x5757;&#x533A;&#x57DF;&#xFF08;&#x5DE6;&#x8FB9;&#x77E9;&#x9635;&#x7D2B;&#x8272;&#x65B9;&#x6846;&#x6807;&#x8BB0;&#x90E8;&#x5206;&#xFF09;&#xFF0C;&#x8FD9;&#x5757;&#x533A;&#x57DF;&#x786E;&#x5B9E;&#x662F;&#x5E95;&#x90E8;&#x6BD4;&#x8F83;&#x4EAE;&#xFF0C;&#x800C;&#x4E0A;&#x8FB9;&#x5219;&#x6BD4;&#x8F83;&#x6697;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x8FD9;&#x91CC;&#x5B83;&#x662F;&#x4E00;&#x6761;&#x8D1F;&#x8FB9;&#x3002;</p>
<p><img src="../images/eb8668010205b08fbcbcde7c2bb1fee2.png" alt=""></p>
<p>&#x518D;&#x6B21;&#x5F3A;&#x8C03;&#xFF0C;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x90FD;&#x662F;&#x76F8;&#x5BF9;&#x5F88;&#x5C0F;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x4EC5;&#x6709;6&#xD7;6&#x3002;&#x4F46;&#x8FD9;&#x4E9B;&#x4E2D;&#x95F4;&#x7684;&#x6570;&#x503C;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x8FD9;&#x4E2A;10&#xFF08;&#x53F3;&#x8FB9;&#x77E9;&#x9635;&#x4E2D;&#x9EC4;&#x8272;&#x65B9;&#x6846;&#x6807;&#x8BB0;&#x5143;&#x7D20;&#xFF09;&#x4EE3;&#x8868;&#x7684;&#x662F;&#x5DE6;&#x8FB9;&#x8FD9;&#x5757;&#x533A;&#x57DF;&#xFF08;&#x5DE6;&#x8FB9;6&#xD7;6&#x77E9;&#x9635;&#x4E2D;&#x9EC4;&#x8272;&#x65B9;&#x6846;&#x6807;&#x8BB0;&#x7684;&#x90E8;&#x5206;&#xFF09;&#x3002;&#x8FD9;&#x5757;&#x533A;&#x57DF;&#x5DE6;&#x8FB9;&#x4E24;&#x5217;&#x662F;&#x6B63;&#x8FB9;&#xFF0C;&#x53F3;&#x8FB9;&#x4E00;&#x5217;&#x662F;&#x8D1F;&#x8FB9;&#xFF0C;&#x6B63;&#x8FB9;&#x548C;&#x8D1F;&#x8FB9;&#x7684;&#x503C;&#x52A0;&#x5728;&#x4E00;&#x8D77;&#x5F97;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x4E2D;&#x95F4;&#x503C;&#x3002;&#x4F46;&#x5047;&#x5982;&#x8FD9;&#x4E2A;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x5927;&#x7684;1000&#xD7;1000&#x7684;&#x7C7B;&#x4F3C;&#x8FD9;&#x6837;&#x68CB;&#x76D8;&#x98CE;&#x683C;&#x7684;&#x5927;&#x56FE;&#xFF0C;&#x5C31;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x8FD9;&#x4E9B;&#x4EAE;&#x5EA6;&#x4E3A;10&#x7684;&#x8FC7;&#x6E21;&#x5E26;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x56FE;&#x7247;&#x5C3A;&#x5BF8;&#x5F88;&#x5927;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E2D;&#x95F4;&#x503C;&#x5C31;&#x4F1A;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x5C0F;&#x3002;</p>
<p>&#x603B;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x627E;&#x51FA;&#x5782;&#x76F4;&#x7684;&#x6216;&#x662F;&#x6C34;&#x5E73;&#x7684;&#x8FB9;&#x7F18;&#x3002;&#x4F46;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;3&#xD7;3&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4E86;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x79CD;&#x6570;&#x5B57;&#x7EC4;&#x5408;&#x3002;</p>
<p><img src="../images/20cea5b23b32153fe2a8b8707ef21b6f.png" alt=""></p>
<p>&#x4F46;&#x5728;&#x5386;&#x53F2;&#x4E0A;&#xFF0C;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x7684;&#x6587;&#x732E;&#x4E2D;&#xFF0C;&#x66FE;&#x516C;&#x5E73;&#x5730;&#x4E89;&#x8BBA;&#x8FC7;&#x600E;&#x6837;&#x7684;&#x6570;&#x5B57;&#x7EC4;&#x5408;&#x624D;&#x662F;&#x6700;&#x597D;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x8FD8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#xFF1A;$\begin{bmatrix}1 &amp; 0 &amp; - 1 \ 2 &amp; 0 &amp; - 2 \ 1 &amp; 0 &amp; - 1 \\end{bmatrix}$&#xFF0C;&#x53EB;&#x505A;<strong>Sobel</strong>&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x5B83;&#x7684;&#x4F18;&#x70B9;&#x5728;&#x4E8E;&#x589E;&#x52A0;&#x4E86;&#x4E2D;&#x95F4;&#x4E00;&#x884C;&#x5143;&#x7D20;&#x7684;&#x6743;&#x91CD;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x7ED3;&#x679C;&#x7684;&#x9C81;&#x68D2;&#x6027;&#x4F1A;&#x66F4;&#x9AD8;&#x4E00;&#x4E9B;&#x3002;</p>
<p>&#x4F46;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x7684;&#x7814;&#x7A76;&#x8005;&#x4EEC;&#x4E5F;&#x4F1A;&#x7ECF;&#x5E38;&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x7684;&#x6570;&#x5B57;&#x7EC4;&#x5408;&#xFF0C;&#x6BD4;&#x5982;&#x8FD9;&#x79CD;&#xFF1A;$\begin{bmatrix} 3&amp; 0 &amp; - 3 \ 10 &amp; 0 &amp; - 10 \ 3 &amp; 0 &amp; - 3 \\end{bmatrix}$&#xFF0C;&#x8FD9;&#x53EB;&#x505A;Scharr&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x5B83;&#x6709;&#x7740;&#x548C;&#x4E4B;&#x524D;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x5782;&#x76F4;&#x8FB9;&#x7F18;&#x68C0;&#x6D4B;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5C06;&#x5176;&#x7FFB;&#x8F6C;90&#x5EA6;&#xFF0C;&#x4F60;&#x5C31;&#x80FD;&#x5F97;&#x5230;&#x5BF9;&#x5E94;&#x6C34;&#x5E73;&#x8FB9;&#x7F18;&#x68C0;&#x6D4B;&#x3002;</p>
<p>&#x968F;&#x7740;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x6211;&#x4EEC;&#x5B66;&#x4E60;&#x7684;&#x5176;&#x4E2D;&#x4E00;&#x4EF6;&#x4E8B;&#x5C31;&#x662F;&#x5F53;&#x4F60;&#x771F;&#x6B63;&#x60F3;&#x53BB;&#x68C0;&#x6D4B;&#x51FA;&#x590D;&#x6742;&#x56FE;&#x50CF;&#x7684;&#x8FB9;&#x7F18;&#xFF0C;&#x4F60;&#x4E0D;&#x4E00;&#x5B9A;&#x8981;&#x53BB;&#x4F7F;&#x7528;&#x90A3;&#x4E9B;&#x7814;&#x7A76;&#x8005;&#x4EEC;&#x6240;&#x9009;&#x62E9;&#x7684;&#x8FD9;&#x4E5D;&#x4E2A;&#x6570;&#x5B57;&#xFF0C;&#x4F46;&#x4F60;&#x53EF;&#x4EE5;&#x4ECE;&#x4E2D;&#x83B7;&#x76CA;&#x532A;&#x6D45;&#x3002;&#x628A;&#x8FD9;&#x77E9;&#x9635;&#x4E2D;&#x7684;9&#x4E2A;&#x6570;&#x5B57;&#x5F53;&#x6210;9&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x4E4B;&#x540E;&#x4F60;&#x53EF;&#x4EE5;&#x5B66;&#x4E60;&#x4F7F;&#x7528;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x7B97;&#x6CD5;&#xFF0C;&#x5176;&#x76EE;&#x6807;&#x5C31;&#x662F;&#x53BB;&#x7406;&#x89E3;&#x8FD9;9&#x4E2A;&#x53C2;&#x6570;&#x3002;</p>
<p><img src="../images/f889ad7011738a23d78070e8ed2df04e.png" alt=""></p>
<p>&#x5F53;&#x4F60;&#x5F97;&#x5230;&#x5DE6;&#x8FB9;&#x8FD9;&#x4E2A;6&#xD7;6&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x5C06;&#x5176;&#x4E0E;&#x8FD9;&#x4E2A;3&#xD7;3&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x8FDB;&#x884C;&#x5377;&#x79EF;&#xFF0C;&#x5C06;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x51FA;&#x8272;&#x7684;&#x8FB9;&#x7F18;&#x68C0;&#x6D4B;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x4F60;&#x5728;&#x4E0B;&#x8282;&#x89C6;&#x9891;&#x4E2D;&#x5C06;&#x4F1A;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x628A;&#x8FD9;9&#x4E2A;&#x6570;&#x5B57;&#x5F53;&#x6210;&#x53C2;&#x6570;&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x901A;&#x8FC7;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5B66;&#x4E60;&#x8FD9;&#x79CD;$\begin{bmatrix}1 &amp; 0 &amp; - 1 \ 1 &amp; 0 &amp; - 1 \ 1 &amp; 0 &amp; - 1 \\end{bmatrix}$&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x6216;&#x8005;<strong>Sobel</strong>&#x8FC7;&#x6EE4;&#x5668;&#x548C;<strong>Scharr</strong>&#x8FC7;&#x6EE4;&#x5668;&#x3002;&#x8FD8;&#x6709;&#x53E6;&#x4E00;&#x79CD;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x8FD9;&#x79CD;&#x8FC7;&#x6EE4;&#x5668;&#x5BF9;&#x4E8E;&#x6570;&#x636E;&#x7684;&#x6355;&#x6349;&#x80FD;&#x529B;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x80DC;&#x8FC7;&#x4EFB;&#x4F55;&#x4E4B;&#x524D;&#x8FD9;&#x4E9B;&#x624B;&#x5199;&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x3002;&#x76F8;&#x6BD4;&#x8FD9;&#x79CD;&#x5355;&#x7EAF;&#x7684;&#x5782;&#x76F4;&#x8FB9;&#x7F18;&#x548C;&#x6C34;&#x5E73;&#x8FB9;&#x7F18;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x68C0;&#x6D4B;&#x51FA;45&#xB0;&#x6216;70&#xB0;&#x6216;73&#xB0;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x4EFB;&#x4F55;&#x89D2;&#x5EA6;&#x7684;&#x8FB9;&#x7F18;&#x3002;&#x6240;&#x4EE5;&#x5C06;&#x77E9;&#x9635;&#x7684;&#x6240;&#x6709;&#x6570;&#x5B57;&#x90FD;&#x8BBE;&#x7F6E;&#x4E3A;&#x53C2;&#x6570;&#xFF0C;&#x901A;&#x8FC7;&#x6570;&#x636E;&#x53CD;&#x9988;&#xFF0C;&#x8BA9;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x81EA;&#x52A8;&#x53BB;&#x5B66;&#x4E60;&#x5B83;&#x4EEC;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x53D1;&#x73B0;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x53EF;&#x4EE5;&#x5B66;&#x4E60;&#x4E00;&#x4E9B;&#x4F4E;&#x7EA7;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x4F8B;&#x5982;&#x8FD9;&#x4E9B;&#x8FB9;&#x7F18;&#x7684;&#x7279;&#x5F81;&#x3002;&#x5C3D;&#x7BA1;&#x6BD4;&#x8D77;&#x90A3;&#x4E9B;&#x7814;&#x7A76;&#x8005;&#x4EEC;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x66F4;&#x8D39;&#x52B2;&#x4E00;&#x4E9B;&#xFF0C;&#x4F46;&#x786E;&#x5B9E;&#x53EF;&#x4EE5;&#x52A8;&#x624B;&#x5199;&#x51FA;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x3002;&#x4E0D;&#x8FC7;&#x6784;&#x6210;&#x8FD9;&#x4E9B;&#x8BA1;&#x7B97;&#x7684;&#x57FA;&#x7840;&#x4F9D;&#x7136;&#x662F;&#x5377;&#x79EF;&#x8FD0;&#x7B97;&#xFF0C;&#x4F7F;&#x5F97;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x7B97;&#x6CD5;&#x80FD;&#x591F;&#x8BA9;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5B66;&#x4E60;&#x4EFB;&#x4F55;&#x5B83;&#x6240;&#x9700;&#x8981;&#x7684;3&#xD7;3&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x5E76;&#x5728;&#x6574;&#x5E45;&#x56FE;&#x7247;&#x4E0A;&#x53BB;&#x5E94;&#x7528;&#x5B83;&#x3002;&#x8FD9;&#x91CC;&#xFF0C;&#x8FD9;&#x91CC;&#xFF0C;&#x8FD8;&#x6709;&#x8FD9;&#x91CC;&#xFF08;&#x5DE6;&#x8FB9;&#x77E9;&#x9635;&#x84DD;&#x8272;&#x65B9;&#x6846;&#x6807;&#x8BB0;&#x90E8;&#x5206;&#xFF09;&#xFF0C;&#x53BB;&#x8F93;&#x51FA;&#x8FD9;&#x4E9B;&#xFF0C;&#x4EFB;&#x4F55;&#x5B83;&#x6240;&#x68C0;&#x6D4B;&#x5230;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x4E0D;&#x7BA1;&#x662F;&#x5782;&#x76F4;&#x7684;&#x8FB9;&#x7F18;&#xFF0C;&#x6C34;&#x5E73;&#x7684;&#x8FB9;&#x7F18;&#xFF0C;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x5947;&#x602A;&#x89D2;&#x5EA6;&#x7684;&#x8FB9;&#x7F18;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x5176;&#x5B83;&#x7684;&#x8FDE;&#x540D;&#x5B57;&#x90FD;&#x6CA1;&#x6709;&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x8FD9;&#x79CD;&#x5C06;&#x8FD9;9&#x4E2A;&#x6570;&#x5B57;&#x5F53;&#x6210;&#x53C2;&#x6570;&#x7684;&#x601D;&#x60F3;&#xFF0C;&#x5DF2;&#x7ECF;&#x6210;&#x4E3A;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x4E2D;&#x6700;&#x4E3A;&#x6709;&#x6548;&#x7684;&#x601D;&#x60F3;&#x4E4B;&#x4E00;&#x3002;&#x5728;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x8BFE;&#x7A0B;&#x4E2D;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4E0B;&#x4E2A;&#x661F;&#x671F;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8BE6;&#x7EC6;&#x53BB;&#x63A2;&#x8BA8;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x53BB;&#x8BA9;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5B66;&#x4E60;&#x8FD9;9&#x4E2A;&#x6570;&#x5B57;&#x3002;&#x4F46;&#x5728;&#x6B64;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5148;&#x8BA8;&#x8BBA;&#x4E00;&#x4E9B;&#x5176;&#x5B83;&#x7EC6;&#x8282;&#xFF0C;&#x6BD4;&#x5982;&#x4E00;&#x4E9B;&#x57FA;&#x7840;&#x7684;&#x5377;&#x79EF;&#x8FD0;&#x7B97;&#x7684;&#x53D8;&#x91CF;&#x3002;&#x5728;&#x4E0B;&#x9762;&#x4E24;&#x8282;&#x89C6;&#x9891;&#x4E2D;&#xFF0C;&#x6211;&#x5C06;&#x4E0E;&#x4F60;&#x4EEC;&#x8BA8;&#x8BBA;&#x5982;&#x4F55;&#x53BB;&#x4F7F;&#x7528;<strong>padding</strong>&#xFF0C;&#x4EE5;&#x53CA;&#x5377;&#x79EF;&#x5404;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x8FD9;&#x4E24;&#x8282;&#x5185;&#x5BB9;&#x5C06;&#x4F1A;&#x662F;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x5377;&#x79EF;&#x6A21;&#x5757;&#x7684;&#x91CD;&#x8981;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x4E0B;&#x8282;&#x89C6;&#x9891;&#x518D;&#x89C1;&#x3002;</p>
<h3 id="14-padding">1.4 Padding</h3>
<p>&#x4E3A;&#x4E86;&#x6784;&#x5EFA;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x5B66;&#x4F1A;&#x4F7F;&#x7528;&#x7684;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x7684;&#x5377;&#x79EF;&#x64CD;&#x4F5C;&#x5C31;&#x662F;<strong>padding</strong>&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;&#x5B83;&#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#x3002;</p>
<p><img src="../images/d21e2642815d03b15396f7998ba4459a.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x5728;&#x4E4B;&#x524D;&#x89C6;&#x9891;&#x4E2D;&#x770B;&#x5230;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7528;&#x4E00;&#x4E2A;3&#xD7;3&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x5377;&#x79EF;&#x4E00;&#x4E2A;6&#xD7;6&#x7684;&#x56FE;&#x50CF;&#xFF0C;&#x4F60;&#x6700;&#x540E;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x4E2A;4&#xD7;4&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4E00;&#x4E2A;4&#xD7;4&#x77E9;&#x9635;&#x3002;&#x90A3;&#x662F;&#x56E0;&#x4E3A;&#x4F60;&#x7684;3&#xD7;3&#x8FC7;&#x6EE4;&#x5668;&#x5728;6&#xD7;6&#x77E9;&#x9635;&#x4E2D;&#xFF0C;&#x53EA;&#x53EF;&#x80FD;&#x6709;4&#xD7;4&#x79CD;&#x53EF;&#x80FD;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x8FD9;&#x80CC;&#x540E;&#x7684;&#x6570;&#x5B66;&#x89E3;&#x91CA;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x4E2A;$n&#xD7;n$&#x7684;&#x56FE;&#x50CF;&#xFF0C;&#x7528;$f&#xD7;f$&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x505A;&#x5377;&#x79EF;&#xFF0C;&#x90A3;&#x4E48;&#x8F93;&#x51FA;&#x7684;&#x7EF4;&#x5EA6;&#x5C31;&#x662F;$(n-f+1)&#xD7;(n-f+1)$&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x91CC;&#x662F;$6-3+1=4$&#xFF0C;&#x56E0;&#x6B64;&#x5F97;&#x5230;&#x4E86;&#x4E00;&#x4E2A;4&#xD7;4&#x7684;&#x8F93;&#x51FA;&#x3002;</p>
<p>&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#x4F1A;&#x6709;&#x4E24;&#x4E2A;&#x7F3A;&#x70B9;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x7F3A;&#x70B9;&#x662F;&#x6BCF;&#x6B21;&#x505A;&#x5377;&#x79EF;&#x64CD;&#x4F5C;&#xFF0C;&#x4F60;&#x7684;&#x56FE;&#x50CF;&#x5C31;&#x4F1A;&#x7F29;&#x5C0F;&#xFF0C;&#x4ECE;6&#xD7;6&#x7F29;&#x5C0F;&#x5230;4&#xD7;4&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x505A;&#x4E86;&#x51E0;&#x6B21;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x7684;&#x56FE;&#x50CF;&#x5C31;&#x4F1A;&#x53D8;&#x5F97;&#x5F88;&#x5C0F;&#x4E86;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x7F29;&#x5C0F;&#x5230;&#x53EA;&#x6709;1&#xD7;1&#x7684;&#x5927;&#x5C0F;&#x3002;&#x4F60;&#x53EF;&#x4E0D;&#x60F3;&#x8BA9;&#x4F60;&#x7684;&#x56FE;&#x50CF;&#x5728;&#x6BCF;&#x6B21;&#x8BC6;&#x522B;&#x8FB9;&#x7F18;&#x6216;&#x5176;&#x4ED6;&#x7279;&#x5F81;&#x65F6;&#x90FD;&#x7F29;&#x5C0F;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x7B2C;&#x4E00;&#x4E2A;&#x7F3A;&#x70B9;&#x3002;</p>
<p><img src="../images/170e076ceaeb70339baa7b25ad5f5e6c.png" alt=""></p>
<p>&#x7B2C;&#x4E8C;&#x4E2A;&#x7F3A;&#x70B9;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6CE8;&#x610F;&#x89D2;&#x843D;&#x8FB9;&#x7F18;&#x7684;&#x50CF;&#x7D20;&#xFF0C;&#x8FD9;&#x4E2A;&#x50CF;&#x7D20;&#x70B9;&#xFF08;&#x7EFF;&#x8272;&#x9634;&#x5F71;&#x6807;&#x8BB0;&#xFF09;&#x53EA;&#x88AB;&#x4E00;&#x4E2A;&#x8F93;&#x51FA;&#x6240;&#x89E6;&#x78B0;&#x6216;&#x8005;&#x4F7F;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4F4D;&#x4E8E;&#x8FD9;&#x4E2A;3&#xD7;3&#x7684;&#x533A;&#x57DF;&#x7684;&#x4E00;&#x89D2;&#x3002;&#x4F46;&#x5982;&#x679C;&#x662F;&#x5728;&#x4E2D;&#x95F4;&#x7684;&#x50CF;&#x7D20;&#x70B9;&#xFF0C;&#x6BD4;&#x5982;&#x8FD9;&#x4E2A;&#xFF08;&#x7EA2;&#x8272;&#x65B9;&#x6846;&#x6807;&#x8BB0;&#xFF09;&#xFF0C;&#x5C31;&#x4F1A;&#x6709;&#x8BB8;&#x591A;3&#xD7;3&#x7684;&#x533A;&#x57DF;&#x4E0E;&#x4E4B;&#x91CD;&#x53E0;&#x3002;&#x6240;&#x4EE5;&#x90A3;&#x4E9B;&#x5728;&#x89D2;&#x843D;&#x6216;&#x8005;&#x8FB9;&#x7F18;&#x533A;&#x57DF;&#x7684;&#x50CF;&#x7D20;&#x70B9;&#x5728;&#x8F93;&#x51FA;&#x4E2D;&#x91C7;&#x7528;&#x8F83;&#x5C11;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x4F60;&#x4E22;&#x6389;&#x4E86;&#x56FE;&#x50CF;&#x8FB9;&#x7F18;&#x4F4D;&#x7F6E;&#x7684;&#x8BB8;&#x591A;&#x4FE1;&#x606F;&#x3002;</p>
<p><img src="../images/0b384788a0ebc6f19ba3d3aa0c49adca.png" alt=""></p>
<p>&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4E00;&#x662F;&#x8F93;&#x51FA;&#x7F29;&#x5C0F;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x5EFA;&#x7ACB;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x65F6;&#xFF0C;&#x4F60;&#x5C31;&#x4F1A;&#x77E5;&#x9053;&#x4F60;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x5E0C;&#x671B;&#x6BCF;&#x8FDB;&#x884C;&#x4E00;&#x6B65;&#x64CD;&#x4F5C;&#x56FE;&#x50CF;&#x90FD;&#x4F1A;&#x7F29;&#x5C0F;&#x3002;&#x6BD4;&#x5982;&#x5F53;&#x4F60;&#x6709;100&#x5C42;&#x6DF1;&#x5C42;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x5982;&#x679C;&#x56FE;&#x50CF;&#x6BCF;&#x7ECF;&#x8FC7;&#x4E00;&#x5C42;&#x90FD;&#x7F29;&#x5C0F;&#x7684;&#x8BDD;&#xFF0C;&#x7ECF;&#x8FC7;100&#x5C42;&#x7F51;&#x7EDC;&#x540E;&#xFF0C;&#x4F60;&#x5C31;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x5F88;&#x5C0F;&#x7684;&#x56FE;&#x50CF;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x662F;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x53E6;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#x56FE;&#x50CF;&#x8FB9;&#x7F18;&#x7684;&#x5927;&#x90E8;&#x5206;&#x4FE1;&#x606F;&#x90FD;&#x4E22;&#x5931;&#x4E86;&#x3002;</p>
<p><img src="../images/208104bae9256fba5d8e37e22a9f5408.png" alt=""></p>
<p>&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x5377;&#x79EF;&#x64CD;&#x4F5C;&#x4E4B;&#x524D;&#x586B;&#x5145;&#x8FD9;&#x5E45;&#x56FE;&#x50CF;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x6848;&#x4F8B;&#x4E2D;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x6CBF;&#x7740;&#x56FE;&#x50CF;&#x8FB9;&#x7F18;&#x518D;&#x586B;&#x5145;&#x4E00;&#x5C42;&#x50CF;&#x7D20;&#x3002;&#x5982;&#x679C;&#x4F60;&#x8FD9;&#x6837;&#x64CD;&#x4F5C;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;6&#xD7;6&#x7684;&#x56FE;&#x50CF;&#x5C31;&#x88AB;&#x4F60;&#x586B;&#x5145;&#x6210;&#x4E86;&#x4E00;&#x4E2A;8&#xD7;8&#x7684;&#x56FE;&#x50CF;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7528;3&#xD7;3&#x7684;&#x56FE;&#x50CF;&#x5BF9;&#x8FD9;&#x4E2A;8&#xD7;8&#x7684;&#x56FE;&#x50CF;&#x5377;&#x79EF;&#xFF0C;&#x4F60;&#x5F97;&#x5230;&#x7684;&#x8F93;&#x51FA;&#x5C31;&#x4E0D;&#x662F;4&#xD7;4&#x7684;&#xFF0C;&#x800C;&#x662F;6&#xD7;6&#x7684;&#x56FE;&#x50CF;&#xFF0C;&#x4F60;&#x5C31;&#x5F97;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x5C3A;&#x5BF8;&#x548C;&#x539F;&#x59CB;&#x56FE;&#x50CF;6&#xD7;6&#x7684;&#x56FE;&#x50CF;&#x3002;&#x4E60;&#x60EF;&#x4E0A;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x7528;0&#x53BB;&#x586B;&#x5145;&#xFF0C;&#x5982;&#x679C;$p$&#x662F;&#x586B;&#x5145;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x6848;&#x4F8B;&#x4E2D;&#xFF0C;$p=1$&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5728;&#x5468;&#x56F4;&#x90FD;&#x586B;&#x5145;&#x4E86;&#x4E00;&#x4E2A;&#x50CF;&#x7D20;&#x70B9;&#xFF0C;&#x8F93;&#x51FA;&#x4E5F;&#x5C31;&#x53D8;&#x6210;&#x4E86;$(n+2p-f+1)&#xD7;(n+2p-f+1)$&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x53D8;&#x6210;&#x4E86;$(6+2&#xD7;1-3+1)&#xD7;(6+2&#xD7;1-3+1)=6&#xD7;6$&#xFF0C;&#x548C;&#x8F93;&#x5165;&#x7684;&#x56FE;&#x50CF;&#x4E00;&#x6837;&#x5927;&#x3002;&#x8FD9;&#x4E2A;&#x6D82;&#x7EFF;&#x7684;&#x50CF;&#x7D20;&#x70B9;&#xFF08;&#x5DE6;&#x8FB9;&#x77E9;&#x9635;&#xFF09;&#x5F71;&#x54CD;&#x4E86;&#x8F93;&#x51FA;&#x4E2D;&#x7684;&#x8FD9;&#x4E9B;&#x683C;&#x5B50;&#xFF08;&#x53F3;&#x8FB9;&#x77E9;&#x9635;&#xFF09;&#x3002;&#x8FD9;&#x6837;&#x4E00;&#x6765;&#xFF0C;&#x4E22;&#x5931;&#x4FE1;&#x606F;&#x6216;&#x8005;&#x66F4;&#x51C6;&#x786E;&#x6765;&#x8BF4;&#x89D2;&#x843D;&#x6216;&#x56FE;&#x50CF;&#x8FB9;&#x7F18;&#x7684;&#x4FE1;&#x606F;&#x53D1;&#x6325;&#x7684;&#x4F5C;&#x7528;&#x8F83;&#x5C0F;&#x7684;&#x8FD9;&#x4E00;&#x7F3A;&#x70B9;&#x5C31;&#x88AB;&#x524A;&#x5F31;&#x4E86;&#x3002;</p>
<p>&#x521A;&#x624D;&#x6211;&#x5DF2;&#x7ECF;&#x5C55;&#x793A;&#x8FC7;&#x7528;&#x4E00;&#x4E2A;&#x50CF;&#x7D20;&#x70B9;&#x6765;&#x586B;&#x5145;&#x8FB9;&#x7F18;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x7684;&#x8BDD;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x586B;&#x5145;&#x4E24;&#x4E2A;&#x50CF;&#x7D20;&#x70B9;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5728;&#x8FD9;&#x91CC;&#x586B;&#x5145;&#x4E00;&#x5C42;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#x4F60;&#x8FD8;&#x53EF;&#x4EE5;&#x586B;&#x5145;&#x66F4;&#x591A;&#x50CF;&#x7D20;&#x3002;&#x6211;&#x8FD9;&#x91CC;&#x753B;&#x7684;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x586B;&#x5145;&#x540E;$p=2$&#x3002;</p>
<p><img src="../images/7043a30561c0e84e1c905e5723e51c6c.png" alt=""></p>
<p>&#x81F3;&#x4E8E;&#x9009;&#x62E9;&#x586B;&#x5145;&#x591A;&#x5C11;&#x50CF;&#x7D20;&#xFF0C;&#x901A;&#x5E38;&#x6709;&#x4E24;&#x4E2A;&#x9009;&#x62E9;&#xFF0C;&#x5206;&#x522B;&#x53EB;&#x505A;<strong>Valid</strong>&#x5377;&#x79EF;&#x548C;<strong>Same</strong>&#x5377;&#x79EF;&#x3002;</p>
<p><strong>Valid</strong>&#x5377;&#x79EF;&#x610F;&#x5473;&#x7740;&#x4E0D;&#x586B;&#x5145;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;&#x4E00;&#x4E2A;$n&#xD7;n$&#x7684;&#x56FE;&#x50CF;&#xFF0C;&#x7528;&#x4E00;&#x4E2A;$f&#xD7;f$&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x5377;&#x79EF;&#xFF0C;&#x5B83;&#x5C06;&#x4F1A;&#x7ED9;&#x4F60;&#x4E00;&#x4E2A;$(n-f+1)&#xD7;(n-f+1)$&#x7EF4;&#x7684;&#x8F93;&#x51FA;&#x3002;&#x8FD9;&#x7C7B;&#x4F3C;&#x4E8E;&#x6211;&#x4EEC;&#x5728;&#x524D;&#x9762;&#x7684;&#x89C6;&#x9891;&#x4E2D;&#x5C55;&#x793A;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;6&#xD7;6&#x7684;&#x56FE;&#x50CF;&#xFF0C;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;3&#xD7;3&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x5F97;&#x5230;&#x4E00;&#x4E2A;4&#xD7;4&#x7684;&#x8F93;&#x51FA;&#x3002;</p>
<p><img src="../images/0663e1a9e477e2737067d9e79194208d.png" alt=""></p>
<p>&#x53E6;&#x4E00;&#x4E2A;&#x7ECF;&#x5E38;&#x88AB;&#x7528;&#x5230;&#x7684;&#x586B;&#x5145;&#x65B9;&#x6CD5;&#x53EB;&#x505A;<strong>Same</strong>&#x5377;&#x79EF;&#xFF0C;&#x90A3;&#x610F;&#x5473;&#x4F60;&#x586B;&#x5145;&#x540E;&#xFF0C;&#x4F60;&#x7684;&#x8F93;&#x51FA;&#x5927;&#x5C0F;&#x548C;&#x8F93;&#x5165;&#x5927;&#x5C0F;&#x662F;&#x4E00;&#x6837;&#x7684;&#x3002;&#x6839;&#x636E;&#x8FD9;&#x4E2A;&#x516C;&#x5F0F;$n-f+1$&#xFF0C;&#x5F53;&#x4F60;&#x586B;&#x5145;$p$&#x4E2A;&#x50CF;&#x7D20;&#x70B9;&#xFF0C;$n$&#x5C31;&#x53D8;&#x6210;&#x4E86;$n+2p$&#xFF0C;&#x6700;&#x540E;&#x516C;&#x5F0F;&#x53D8;&#x4E3A;$n+2p-f+1$&#x3002;&#x56E0;&#x6B64;&#x5982;&#x679C;&#x4F60;&#x6709;&#x4E00;&#x4E2A;$n&#xD7;n$&#x7684;&#x56FE;&#x50CF;&#xFF0C;&#x7528;$p$&#x4E2A;&#x50CF;&#x7D20;&#x586B;&#x5145;&#x8FB9;&#x7F18;&#xFF0C;&#x8F93;&#x51FA;&#x7684;&#x5927;&#x5C0F;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x7684;$(n+2p-f+1)&#xD7;(n+2p-f+1)$&#x3002;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8BA9;$n+2p-f+1=n$&#x7684;&#x8BDD;&#xFF0C;&#x4F7F;&#x5F97;&#x8F93;&#x51FA;&#x548C;&#x8F93;&#x5165;&#x5927;&#x5C0F;&#x76F8;&#x7B49;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7528;&#x8FD9;&#x4E2A;&#x7B49;&#x5F0F;&#x6C42;&#x89E3;$p$&#xFF0C;&#x90A3;&#x4E48;$p=(f-1)/2$&#x3002;&#x6240;&#x4EE5;&#x5F53;$f$&#x662F;&#x4E00;&#x4E2A;&#x5947;&#x6570;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EA;&#x8981;&#x9009;&#x62E9;&#x76F8;&#x5E94;&#x7684;&#x586B;&#x5145;&#x5C3A;&#x5BF8;&#xFF0C;&#x4F60;&#x5C31;&#x80FD;&#x786E;&#x4FDD;&#x5F97;&#x5230;&#x548C;&#x8F93;&#x5165;&#x76F8;&#x540C;&#x5C3A;&#x5BF8;&#x7684;&#x8F93;&#x51FA;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x524D;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5F53;&#x8FC7;&#x6EE4;&#x5668;&#x662F;3&#xD7;3&#x65F6;&#xFF0C;&#x548C;&#x4E0A;&#x4E00;&#x5F20;&#x5E7B;&#x706F;&#x7247;&#x7684;&#x4F8B;&#x5B50;&#x4E00;&#x6837;&#xFF0C;&#x4F7F;&#x5F97;&#x8F93;&#x51FA;&#x5C3A;&#x5BF8;&#x7B49;&#x4E8E;&#x8F93;&#x5165;&#x5C3A;&#x5BF8;&#xFF0C;&#x6240;&#x9700;&#x8981;&#x7684;&#x586B;&#x5145;&#x662F;(3-1)/2&#xFF0C;&#x4E5F;&#x5C31;&#x662F;1&#x4E2A;&#x50CF;&#x7D20;&#x3002;&#x53E6;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5F53;&#x4F60;&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x662F;5&#xD7;5&#xFF0C;&#x5982;&#x679C;$f=5$&#xFF0C;&#x7136;&#x540E;&#x4EE3;&#x5165;&#x90A3;&#x4E2A;&#x5F0F;&#x5B50;&#xFF0C;&#x4F60;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;&#x9700;&#x8981;2&#x5C42;&#x586B;&#x5145;&#x4F7F;&#x5F97;&#x8F93;&#x51FA;&#x548C;&#x8F93;&#x5165;&#x4E00;&#x6837;&#x5927;&#xFF0C;&#x8FD9;&#x662F;&#x8FC7;&#x6EE4;&#x5668;5&#xD7;5&#x7684;&#x60C5;&#x51B5;&#x3002;</p>
<p><img src="../images/ca5382358f30c1349fff98d1e52366b4.png" alt=""></p>
<p>&#x4E60;&#x60EF;&#x4E0A;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x4E2D;&#xFF0C;$f$&#x901A;&#x5E38;&#x662F;&#x5947;&#x6570;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x80FD;&#x90FD;&#x662F;&#x8FD9;&#x6837;&#x3002;&#x4F60;&#x5F88;&#x5C11;&#x770B;&#x5230;&#x4E00;&#x4E2A;&#x5076;&#x6570;&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x91CC;&#x4F7F;&#x7528;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x6709;&#x4E24;&#x4E2A;&#x539F;&#x56E0;&#x3002;</p>
<p>&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x53EF;&#x80FD;&#x662F;&#xFF0C;&#x5982;&#x679C;$f$&#x662F;&#x4E00;&#x4E2A;&#x5076;&#x6570;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x53EA;&#x80FD;&#x4F7F;&#x7528;&#x4E00;&#x4E9B;&#x4E0D;&#x5BF9;&#x79F0;&#x586B;&#x5145;&#x3002;&#x53EA;&#x6709;$f$&#x662F;&#x5947;&#x6570;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;<strong>Same</strong>&#x5377;&#x79EF;&#x624D;&#x4F1A;&#x6709;&#x81EA;&#x7136;&#x7684;&#x586B;&#x5145;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4EE5;&#x540C;&#x6837;&#x7684;&#x6570;&#x91CF;&#x586B;&#x5145;&#x56DB;&#x5468;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5DE6;&#x8FB9;&#x586B;&#x5145;&#x591A;&#x4E00;&#x70B9;&#xFF0C;&#x53F3;&#x8FB9;&#x586B;&#x5145;&#x5C11;&#x4E00;&#x70B9;&#xFF0C;&#x8FD9;&#x6837;&#x4E0D;&#x5BF9;&#x79F0;&#x7684;&#x586B;&#x5145;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x4E2A;&#x539F;&#x56E0;&#x662F;&#x5F53;&#x4F60;&#x6709;&#x4E00;&#x4E2A;&#x5947;&#x6570;&#x7EF4;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x6BD4;&#x5982;3&#xD7;3&#x6216;&#x8005;5&#xD7;5&#x7684;&#xFF0C;&#x5B83;&#x5C31;&#x6709;&#x4E00;&#x4E2A;&#x4E2D;&#x5FC3;&#x70B9;&#x3002;&#x6709;&#x65F6;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x91CC;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x4E00;&#x4E2A;&#x4E2D;&#x5FC3;&#x50CF;&#x7D20;&#x70B9;&#x4F1A;&#x66F4;&#x65B9;&#x4FBF;&#xFF0C;&#x4FBF;&#x4E8E;&#x6307;&#x51FA;&#x8FC7;&#x6EE4;&#x5668;&#x7684;&#x4F4D;&#x7F6E;&#x3002;</p>
<p>&#x4E5F;&#x8BB8;&#x8FD9;&#x4E9B;&#x90FD;&#x4E0D;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;$f$&#x901A;&#x5E38;&#x662F;&#x5947;&#x6570;&#x7684;&#x5145;&#x5206;&#x539F;&#x56E0;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x4F60;&#x770B;&#x4E86;&#x5377;&#x79EF;&#x7684;&#x6587;&#x732E;&#xFF0C;&#x4F60;&#x7ECF;&#x5E38;&#x4F1A;&#x770B;&#x5230;3&#xD7;3&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x80FD;&#x4F1A;&#x770B;&#x5230;&#x4E00;&#x4E9B;5&#xD7;5&#xFF0C;7&#xD7;7&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x3002;&#x540E;&#x9762;&#x6211;&#x4EEC;&#x4E5F;&#x4F1A;&#x8C08;&#x5230;1&#xD7;1&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x4EE5;&#x53CA;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x5B83;&#x662F;&#x6709;&#x610F;&#x4E49;&#x7684;&#x3002;&#x4F46;&#x662F;&#x4E60;&#x60EF;&#x4E0A;&#xFF0C;&#x6211;&#x63A8;&#x8350;&#x4F60;&#x53EA;&#x4F7F;&#x7528;&#x5947;&#x6570;&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x3002;&#x6211;&#x60F3;&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;&#x5076;&#x6570;f&#x4E5F;&#x53EF;&#x80FD;&#x4F1A;&#x5F97;&#x5230;&#x4E0D;&#x9519;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x5982;&#x679C;&#x9075;&#x5FAA;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x7684;&#x60EF;&#x4F8B;&#xFF0C;&#x6211;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x5947;&#x6570;&#x503C;&#x7684;$f$&#x3002;</p>
<p>&#x4F60;&#x5DF2;&#x7ECF;&#x770B;&#x5230;&#x5982;&#x4F55;&#x4F7F;&#x7528;<strong>padding</strong>&#x5377;&#x79EF;&#xFF0C;&#x4E3A;&#x4E86;&#x6307;&#x5B9A;&#x5377;&#x79EF;&#x64CD;&#x4F5C;&#x4E2D;&#x7684;<strong>padding</strong>&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x6307;&#x5B9A;$p$&#x7684;&#x503C;&#x3002;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<strong>Valid</strong>&#x5377;&#x79EF;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;$p=0$&#x3002;&#x4E5F;&#x53EF;&#x4F7F;&#x7528;<strong>Same</strong>&#x5377;&#x79EF;&#x586B;&#x5145;&#x50CF;&#x7D20;&#xFF0C;&#x4F7F;&#x4F60;&#x7684;&#x8F93;&#x51FA;&#x548C;&#x8F93;&#x5165;&#x5927;&#x5C0F;&#x76F8;&#x540C;&#x3002;&#x4EE5;&#x4E0A;&#x5C31;&#x662F;<strong>padding</strong>&#xFF0C;&#x5728;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x89C6;&#x9891;&#x4E2D;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x5982;&#x4F55;&#x5728;&#x5377;&#x79EF;&#x4E2D;&#x8BBE;&#x7F6E;&#x6B65;&#x957F;&#x3002;</p>
<h3 id="15-&#x5377;&#x79EF;&#x6B65;&#x957F;&#xFF08;strided-convolutions&#xFF09;">1.5 &#x5377;&#x79EF;&#x6B65;&#x957F;&#xFF08;Strided convolutions&#xFF09;</h3>
<p>&#x5377;&#x79EF;&#x4E2D;&#x7684;&#x6B65;&#x5E45;&#x662F;&#x53E6;&#x4E00;&#x4E2A;&#x6784;&#x5EFA;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x57FA;&#x672C;&#x64CD;&#x4F5C;&#xFF0C;&#x8BA9;&#x6211;&#x5411;&#x4F60;&#x5C55;&#x793A;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x3002;</p>
<p><img src="../images/1694d1170d50481e7180cfff7e697ef0.png" alt=""></p>
<p>&#x5982;&#x679C;&#x4F60;&#x60F3;&#x7528;3&#xD7;3&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x5377;&#x79EF;&#x8FD9;&#x4E2A;7&#xD7;7&#x7684;&#x56FE;&#x50CF;&#xFF0C;&#x548C;&#x4E4B;&#x524D;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x6B65;&#x5E45;&#x8BBE;&#x7F6E;&#x6210;&#x4E86;2&#x3002;&#x4F60;&#x8FD8;&#x548C;&#x4E4B;&#x524D;&#x4E00;&#x6837;&#x53D6;&#x5DE6;&#x4E0A;&#x65B9;&#x7684;3&#xD7;3&#x533A;&#x57DF;&#x7684;&#x5143;&#x7D20;&#x7684;&#x4E58;&#x79EF;&#xFF0C;&#x518D;&#x52A0;&#x8D77;&#x6765;&#xFF0C;&#x6700;&#x540E;&#x7ED3;&#x679C;&#x4E3A;91&#x3002;</p>
<p><img src="../images/ba96c6114037a96d060f10dd7cb586c4.png" alt=""></p>
<p>&#x53EA;&#x662F;&#x4E4B;&#x524D;&#x6211;&#x4EEC;&#x79FB;&#x52A8;&#x84DD;&#x6846;&#x7684;&#x6B65;&#x957F;&#x662F;1&#xFF0C;&#x73B0;&#x5728;&#x79FB;&#x52A8;&#x7684;&#x6B65;&#x957F;&#x662F;2&#xFF0C;&#x6211;&#x4EEC;&#x8BA9;&#x8FC7;&#x6EE4;&#x5668;&#x8DF3;&#x8FC7;2&#x4E2A;&#x6B65;&#x957F;&#xFF0C;&#x6CE8;&#x610F;&#x4E00;&#x4E0B;&#x5DE6;&#x4E0A;&#x89D2;&#xFF0C;&#x8FD9;&#x4E2A;&#x70B9;&#x79FB;&#x52A8;&#x5230;&#x5176;&#x540E;&#x4E24;&#x683C;&#x7684;&#x70B9;&#xFF0C;&#x8DF3;&#x8FC7;&#x4E86;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#x3002;&#x7136;&#x540E;&#x4F60;&#x8FD8;&#x662F;&#x5C06;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x76F8;&#x4E58;&#x5E76;&#x6C42;&#x548C;&#xFF0C;&#x4F60;&#x5C06;&#x4F1A;&#x5F97;&#x5230;&#x7684;&#x7ED3;&#x679C;&#x662F;100&#x3002;</p>
<p><img src="../images/2739e8477bc1e66d482ee8aff917acab.png" alt=""></p>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x7EE7;&#x7EED;&#xFF0C;&#x5C06;&#x84DD;&#x8272;&#x6846;&#x79FB;&#x52A8;&#x4E24;&#x4E2A;&#x6B65;&#x957F;&#xFF0C;&#x4F60;&#x5C06;&#x4F1A;&#x5F97;&#x5230;83&#x7684;&#x7ED3;&#x679C;&#x3002;&#x5F53;&#x4F60;&#x79FB;&#x52A8;&#x5230;&#x4E0B;&#x4E00;&#x884C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x4E5F;&#x662F;&#x4F7F;&#x7528;&#x6B65;&#x957F;2&#x800C;&#x4E0D;&#x662F;&#x6B65;&#x957F;1&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5C06;&#x84DD;&#x8272;&#x6846;&#x79FB;&#x52A8;&#x5230;&#x8FD9;&#x91CC;&#xFF1A;</p>
<p><img src="../images/9cacda308d53adb7d154a3b259569f45.png" alt=""></p>
<p>&#x6CE8;&#x610F;&#x5230;&#x6211;&#x4EEC;&#x8DF3;&#x8FC7;&#x4E86;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#xFF0C;&#x5F97;&#x5230;69&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x73B0;&#x5728;&#x4F60;&#x7EE7;&#x7EED;&#x79FB;&#x52A8;&#x4E24;&#x4E2A;&#x6B65;&#x957F;&#xFF0C;&#x4F1A;&#x5F97;&#x5230;91&#xFF0C;127&#xFF0C;&#x6700;&#x540E;&#x4E00;&#x884C;&#x5206;&#x522B;&#x662F;44&#xFF0C;72&#xFF0C;74&#x3002;</p>
<p><img src="../images/d665c6db6cfb55a7b6dc4b80789d46ed.png" alt=""></p>
<p>&#x6240;&#x4EE5;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x7528;3&#xD7;3&#x7684;&#x77E9;&#x9635;&#x5377;&#x79EF;&#x4E00;&#x4E2A;7&#xD7;7&#x7684;&#x77E9;&#x9635;&#xFF0C;&#x5F97;&#x5230;&#x4E00;&#x4E2A;3&#xD7;3&#x7684;&#x8F93;&#x51FA;&#x3002;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x7684;&#x7EF4;&#x5EA6;&#x662F;&#x7531;&#x4E0B;&#x9762;&#x7684;&#x516C;&#x5F0F;&#x51B3;&#x5B9A;&#x7684;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7528;&#x4E00;&#x4E2A;$f&#xD7;f$&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x5377;&#x79EF;&#x4E00;&#x4E2A;$n&#xD7;n$&#x7684;&#x56FE;&#x50CF;&#xFF0C;&#x4F60;&#x7684;<strong>padding</strong>&#x4E3A;$p$&#xFF0C;&#x6B65;&#x5E45;&#x4E3A;$s$&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;$s=2$&#xFF0C;&#x4F60;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x8F93;&#x51FA;&#xFF0C;&#x56E0;&#x4E3A;&#x73B0;&#x5728;&#x4F60;&#x4E0D;&#x662F;&#x4E00;&#x6B21;&#x79FB;&#x52A8;&#x4E00;&#x4E2A;&#x6B65;&#x5B50;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x6B21;&#x79FB;&#x52A8;$s$&#x4E2A;&#x6B65;&#x5B50;&#xFF0C;&#x8F93;&#x51FA;&#x4E8E;&#x662F;&#x53D8;&#x4E3A;$\frac{n+2p - f}{s} + 1 \times \frac{n+2p - f}{s} + 1$</p>
<p><img src="../images/3c52cc84feb068790c17c950028daf31.png" alt=""></p>
<p>&#x5728;&#x6211;&#x4EEC;&#x7684;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x91CC;&#xFF0C;$n=7$&#xFF0C;$p=0$&#xFF0C;$f=3$&#xFF0C;$s=2$&#xFF0C;$\ \frac{7 + 0 - 3}{2} + 1 =3$&#xFF0C;&#x5373;3&#xD7;3&#x7684;&#x8F93;&#x51FA;&#x3002;</p>
<p><img src="../images/16196714c202bb1c8022219394543bf5.png" alt=""></p>
<p>&#x73B0;&#x5728;&#x53EA;&#x5269;&#x4E0B;&#x6700;&#x540E;&#x7684;&#x4E00;&#x4E2A;&#x7EC6;&#x8282;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x5546;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x6574;&#x6570;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x5411;&#x4E0B;&#x53D6;&#x6574;&#x3002;$&#x230A; &#x230B;$&#x8FD9;&#x662F;&#x5411;&#x4E0B;&#x53D6;&#x6574;&#x7684;&#x7B26;&#x53F7;&#xFF0C;&#x8FD9;&#x4E5F;&#x53EB;&#x505A;&#x5BF9;$z$&#x8FDB;&#x884C;&#x5730;&#x677F;&#x9664;(<strong>floor</strong>)&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;$z$&#x5411;&#x4E0B;&#x53D6;&#x6574;&#x5230;&#x6700;&#x8FD1;&#x7684;&#x6574;&#x6570;&#x3002;&#x8FD9;&#x4E2A;&#x539F;&#x5219;&#x5B9E;&#x73B0;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#xFF0C;&#x4F60;&#x53EA;&#x5728;&#x84DD;&#x6846;&#x5B8C;&#x5168;&#x5305;&#x62EC;&#x5728;&#x56FE;&#x50CF;&#x6216;&#x586B;&#x5145;&#x5B8C;&#x7684;&#x56FE;&#x50CF;&#x5185;&#x90E8;&#x65F6;&#xFF0C;&#x624D;&#x5BF9;&#x5B83;&#x8FDB;&#x884C;&#x8FD0;&#x7B97;&#x3002;&#x5982;&#x679C;&#x6709;&#x4EFB;&#x610F;&#x4E00;&#x4E2A;&#x84DD;&#x6846;&#x79FB;&#x52A8;&#x5230;&#x4E86;&#x5916;&#x9762;&#xFF0C;&#x90A3;&#x4F60;&#x5C31;&#x4E0D;&#x8981;&#x8FDB;&#x884C;&#x76F8;&#x4E58;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x60EF;&#x4F8B;&#x3002;&#x4F60;&#x7684;3&#xD7;3&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x5FC5;&#x987B;&#x5B8C;&#x5168;&#x5904;&#x4E8E;&#x56FE;&#x50CF;&#x4E2D;&#x6216;&#x8005;&#x586B;&#x5145;&#x4E4B;&#x540E;&#x7684;&#x56FE;&#x50CF;&#x533A;&#x57DF;&#x5185;&#x624D;&#x8F93;&#x51FA;&#x76F8;&#x5E94;&#x7ED3;&#x679C;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x60EF;&#x4F8B;&#x3002;&#x56E0;&#x6B64;&#x6B63;&#x786E;&#x8BA1;&#x7B97;&#x8F93;&#x51FA;&#x7EF4;&#x5EA6;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x5411;&#x4E0B;&#x53D6;&#x6574;&#xFF0C;&#x4EE5;&#x514D;$\frac{n + 2p - f}{s}$&#x4E0D;&#x662F;&#x6574;&#x6570;&#x3002;</p>
<p><img src="../images/58810d826a00657957640fb931f792a7.png" alt=""></p>
<p>&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#x7EF4;&#x5EA6;&#x60C5;&#x51B5;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;&#x4E00;&#x4E2A;$n&#xD7;n$&#x7684;&#x77E9;&#x9635;&#x6216;&#x8005;$n&#xD7;n$&#x7684;&#x56FE;&#x50CF;&#xFF0C;&#x4E0E;&#x4E00;&#x4E2A;$f&#xD7;f$&#x7684;&#x77E9;&#x9635;&#x5377;&#x79EF;&#xFF0C;&#x6216;&#x8005;&#x8BF4;$f&#xD7;f$&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x3002;<strong>Padding</strong>&#x662F;$p$&#xFF0C;&#x6B65;&#x5E45;&#x4E3A;$s$&#x6CA1;&#x8F93;&#x51FA;&#x5C3A;&#x5BF8;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#xFF1A;</p>
<p><img src="../images/58810d826a00657957640fb931f792a7.png" alt=""></p>
<p>&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x6240;&#x6709;&#x7684;&#x6570;&#x4F7F;&#x7ED3;&#x679C;&#x662F;&#x6574;&#x6570;&#x662F;&#x633A;&#x4E0D;&#x9519;&#x7684;&#xFF0C;&#x5C3D;&#x7BA1;&#x4E00;&#x4E9B;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x4E0D;&#x5FC5;&#x8FD9;&#x6837;&#x505A;&#xFF0C;&#x53EA;&#x8981;&#x5411;&#x4E0B;&#x53D6;&#x6574;&#x4E5F;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x9009;&#x62E9;&#x4E00;&#x4E9B;$n$&#xFF0C;$f$&#xFF0C;$p$&#x548C;$s$&#x7684;&#x503C;&#x6765;&#x9A8C;&#x8BC1;&#x8FD9;&#x4E2A;&#x8F93;&#x51FA;&#x5C3A;&#x5BF8;&#x7684;&#x516C;&#x5F0F;&#x662F;&#x5BF9;&#x7684;&#x3002;</p>
<p><img src="../images/197a4ff81c7e793962516fc6e636830a.png" alt=""></p>
<p>&#x5728;&#x8BB2;&#x4E0B;&#x4E00;&#x90E8;&#x5206;&#x4E4B;&#x524D;&#xFF0C;&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x4E2A;&#x5173;&#x4E8E;&#x4E92;&#x76F8;&#x5173;&#x548C;&#x5377;&#x79EF;&#x7684;&#x6280;&#x672F;&#x6027;&#x5EFA;&#x8BAE;&#xFF0C;&#x8FD9;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x5230;&#x4F60;&#x6784;&#x5EFA;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x4F46;&#x53D6;&#x51B3;&#x4E8E;&#x4F60;&#x8BFB;&#x7684;&#x662F;&#x6570;&#x5B66;&#x6559;&#x6750;&#x8FD8;&#x662F;&#x4FE1;&#x53F7;&#x5904;&#x7406;&#x6559;&#x6750;&#xFF0C;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x6559;&#x6750;&#x91CC;&#x7B26;&#x53F7;&#x53EF;&#x80FD;&#x4E0D;&#x4E00;&#x81F4;&#x3002;&#x5982;&#x679C;&#x4F60;&#x770B;&#x7684;&#x662F;&#x4E00;&#x672C;&#x5178;&#x578B;&#x7684;&#x6570;&#x5B66;&#x6559;&#x79D1;&#x4E66;&#xFF0C;&#x90A3;&#x4E48;&#x5377;&#x79EF;&#x7684;&#x5B9A;&#x4E49;&#x662F;&#x505A;&#x5143;&#x7D20;&#x4E58;&#x79EF;&#x6C42;&#x548C;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x6B65;&#x9AA4;&#x662F;&#x4F60;&#x9996;&#x5148;&#x8981;&#x505A;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5728;&#x628A;&#x8FD9;&#x4E2A;6&#xD7;6&#x7684;&#x77E9;&#x9635;&#x548C;3&#xD7;3&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x5377;&#x79EF;&#x4E4B;&#x524D;&#xFF0C;&#x9996;&#x5148;&#x4F60;&#x5C06;3&#xD7;3&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x6CBF;&#x6C34;&#x5E73;&#x548C;&#x5782;&#x76F4;&#x8F74;&#x7FFB;&#x8F6C;&#xFF0C;&#x6240;&#x4EE5;$\begin{bmatrix}3 &amp; 4 &amp; 5 \ 1 &amp; 0 &amp; 2 \  - 1 &amp; 9 &amp; 7 \ \end{bmatrix}$&#x53D8;&#x4E3A;$\begin{bmatrix} 7&amp; 2 &amp; 5 \ 9 &amp; 0 &amp; 4 \  - 1 &amp; 1 &amp; 3 \\end{bmatrix}$&#xFF0C;&#x8FD9;&#x76F8;&#x5F53;&#x4E8E;&#x5C06;3&#xD7;3&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x505A;&#x4E86;&#x4E2A;&#x955C;&#x50CF;&#xFF0C;&#x5728;&#x6C34;&#x5E73;&#x548C;&#x5782;&#x76F4;&#x8F74;&#x4E0A;&#xFF08;&#x6574;&#x7406;&#x8005;&#x6CE8;&#xFF1A;&#x6B64;&#x5904;&#x5E94;&#x8BE5;&#x662F;&#x5148;&#x987A;&#x65F6;&#x9488;&#x65CB;&#x8F6C;90&#x5F97;&#x5230;$\begin{bmatrix}-1 &amp; 1 &amp; 3 \ 9 &amp; 0 &amp; 4 \ 7 &amp; 2 &amp; 5 \\end{bmatrix}$&#xFF0C;&#x518D;&#x6C34;&#x5E73;&#x7FFB;&#x8F6C;&#x5F97;&#x5230;$\begin{bmatrix}  7&amp; 2 &amp; 5 \ 9 &amp; 0 &amp; 4 \  - 1&amp; 1 &amp; 3 \\end{bmatrix}$&#xFF09;&#x3002;&#x7136;&#x540E;&#x4F60;&#x518D;&#x628A;&#x8FD9;&#x4E2A;&#x7FFB;&#x8F6C;&#x540E;&#x7684;&#x77E9;&#x9635;&#x590D;&#x5236;&#x5230;&#x8FD9;&#x91CC;&#xFF08;&#x5DE6;&#x8FB9;&#x7684;&#x56FE;&#x50CF;&#x77E9;&#x9635;&#xFF09;&#xFF0C;&#x4F60;&#x8981;&#x628A;&#x8FD9;&#x4E2A;&#x7FFB;&#x8F6C;&#x77E9;&#x9635;&#x7684;&#x5143;&#x7D20;&#x76F8;&#x4E58;&#x6765;&#x8BA1;&#x7B97;&#x8F93;&#x51FA;&#x7684;4&#xD7;4&#x77E9;&#x9635;&#x5DE6;&#x4E0A;&#x89D2;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x5982;&#x56FE;&#x6240;&#x793A;&#x3002;&#x7136;&#x540E;&#x53D6;&#x8FD9;9&#x4E2A;&#x6570;&#x5B57;&#xFF0C;&#x628A;&#x5B83;&#x4EEC;&#x5E73;&#x79FB;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#xFF0C;&#x518D;&#x5E73;&#x79FB;&#x4E00;&#x683C;&#xFF0C;&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5728;&#x8FD9;&#x4E9B;&#x89C6;&#x9891;&#x4E2D;&#x5B9A;&#x4E49;&#x5377;&#x79EF;&#x8FD0;&#x7B97;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x8DF3;&#x8FC7;&#x4E86;&#x8FD9;&#x4E2A;&#x955C;&#x50CF;&#x64CD;&#x4F5C;&#x3002;&#x4ECE;&#x6280;&#x672F;&#x4E0A;&#x8BB2;&#xFF0C;&#x6211;&#x4EEC;&#x5B9E;&#x9645;&#x4E0A;&#x505A;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x524D;&#x9762;&#x89C6;&#x9891;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x6709;&#x65F6;&#x88AB;&#x79F0;&#x4E3A;&#x4E92;&#x76F8;&#x5173;&#xFF08;<strong>cross-correlation</strong>&#xFF09;&#x800C;&#x4E0D;&#x662F;&#x5377;&#x79EF;&#xFF08;<strong>convolution</strong>&#xFF09;&#x3002;&#x4F46;&#x5728;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x6587;&#x732E;&#x4E2D;&#xFF0C;&#x6309;&#x7167;&#x60EF;&#x4F8B;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8FD9;&#xFF08;&#x4E0D;&#x8FDB;&#x884C;&#x7FFB;&#x8F6C;&#x64CD;&#x4F5C;&#xFF09;&#x53EB;&#x505A;&#x5377;&#x79EF;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x603B;&#x7ED3;&#x6765;&#x8BF4;&#xFF0C;&#x6309;&#x7167;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x60EF;&#x4F8B;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x4E0D;&#x8FDB;&#x884C;&#x7FFB;&#x8F6C;&#x64CD;&#x4F5C;&#x3002;&#x4ECE;&#x6280;&#x672F;&#x4E0A;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E2A;&#x64CD;&#x4F5C;&#x53EF;&#x80FD;&#x53EB;&#x505A;&#x4E92;&#x76F8;&#x5173;&#x66F4;&#x597D;&#x3002;&#x4F46;&#x5728;&#x5927;&#x90E8;&#x5206;&#x7684;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x6587;&#x732E;&#x4E2D;&#x90FD;&#x628A;&#x5B83;&#x53EB;&#x505A;&#x5377;&#x79EF;&#x8FD0;&#x7B97;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x8FD9;&#x4E9B;&#x89C6;&#x9891;&#x4E2D;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x7EA6;&#x5B9A;&#x3002;&#x5982;&#x679C;&#x4F60;&#x8BFB;&#x4E86;&#x5F88;&#x591A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6587;&#x732E;&#x7684;&#x8BDD;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x8BB8;&#x591A;&#x4EBA;&#x90FD;&#x628A;&#x5B83;&#x53EB;&#x505A;&#x5377;&#x79EF;&#x8FD0;&#x7B97;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x7528;&#x5230;&#x8FD9;&#x4E9B;&#x7FFB;&#x8F6C;&#x3002;</p>
<p><img src="../images/42d89137318c0edc3c9ce05820e37a3e.png" alt=""></p>
<p>&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#x5728;&#x4FE1;&#x53F7;&#x5904;&#x7406;&#x4E2D;&#x6216;&#x67D0;&#x4E9B;&#x6570;&#x5B66;&#x5206;&#x652F;&#x4E2D;&#xFF0C;&#x5728;&#x5377;&#x79EF;&#x7684;&#x5B9A;&#x4E49;&#x5305;&#x542B;&#x7FFB;&#x8F6C;&#xFF0C;&#x4F7F;&#x5F97;&#x5377;&#x79EF;&#x8FD0;&#x7B97;&#x7B26;&#x62E5;&#x6709;&#x8FD9;&#x4E2A;&#x6027;&#x8D28;&#xFF0C;&#x5373;$(A<em>B)</em>C=A<em>(B</em>C)$&#xFF0C;&#x8FD9;&#x5728;&#x6570;&#x5B66;&#x4E2D;&#x88AB;&#x79F0;&#x4E3A;&#x7ED3;&#x5408;&#x5F8B;&#x3002;&#x8FD9;&#x5BF9;&#x4E8E;&#x4E00;&#x4E9B;&#x4FE1;&#x53F7;&#x5904;&#x7406;&#x5E94;&#x7528;&#x6765;&#x8BF4;&#x5F88;&#x597D;&#xFF0C;&#x4F46;&#x5BF9;&#x4E8E;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6765;&#x8BF4;&#x5B83;&#x771F;&#x7684;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x6B64;&#x7701;&#x7565;&#x4E86;&#x8FD9;&#x4E2A;&#x53CC;&#x91CD;&#x955C;&#x50CF;&#x64CD;&#x4F5C;&#xFF0C;&#x5C31;&#x7B80;&#x5316;&#x4E86;&#x4EE3;&#x7801;&#xFF0C;&#x5E76;&#x4F7F;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E5F;&#x80FD;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x6839;&#x636E;&#x60EF;&#x4F8B;&#xFF0C;&#x6211;&#x4EEC;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x90FD;&#x53EB;&#x5B83;&#x5377;&#x79EF;&#xFF0C;&#x5C3D;&#x7BA1;&#x6570;&#x5B66;&#x5BB6;&#x4EEC;&#x66F4;&#x559C;&#x6B22;&#x79F0;&#x4E4B;&#x4E3A;&#x4E92;&#x76F8;&#x5173;&#xFF0C;&#x4F46;&#x8FD9;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x5230;&#x4F60;&#x5728;&#x7F16;&#x7A0B;&#x7EC3;&#x4E60;&#x4E2D;&#x8981;&#x5B9E;&#x73B0;&#x7684;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x4F60;&#x9605;&#x8BFB;&#x548C;&#x7406;&#x89E3;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x6587;&#x732E;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x4F60;&#x5DF2;&#x7ECF;&#x770B;&#x5230;&#x4E86;&#x5982;&#x4F55;&#x8FDB;&#x884C;&#x5377;&#x79EF;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x586B;&#x5145;&#xFF0C;&#x5982;&#x4F55;&#x5728;&#x5377;&#x79EF;&#x4E2D;&#x9009;&#x62E9;&#x6B65;&#x5E45;&#x3002;&#x4F46;&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x6211;&#x4EEC;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x5173;&#x4E8E;&#x77E9;&#x9635;&#x7684;&#x5377;&#x79EF;&#xFF0C;&#x4F8B;&#x5982;6&#xD7;6&#x7684;&#x77E9;&#x9635;&#x3002;&#x5728;&#x4E0B;&#x4E00;&#x96C6;&#x89C6;&#x9891;&#x4E2D;&#xFF0C;&#x4F60;&#x5C06;&#x770B;&#x5230;&#x5982;&#x4F55;&#x5BF9;&#x7ACB;&#x4F53;&#x8FDB;&#x884C;&#x5377;&#x79EF;&#xFF0C;&#x8FD9;&#x5C06;&#x4F1A;&#x4F7F;&#x4F60;&#x7684;&#x5377;&#x79EF;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x5F3A;&#x5927;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x7EE7;&#x7EED;&#x4E0B;&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#x3002;</p>
<h3 id="16-&#x4E09;&#x7EF4;&#x5377;&#x79EF;&#xFF08;convolutions-over-volumes&#xFF09;">1.6 &#x4E09;&#x7EF4;&#x5377;&#x79EF;&#xFF08;Convolutions over volumes&#xFF09;</h3>
<p>&#x4F60;&#x5DF2;&#x7ECF;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x5BF9;&#x4E8C;&#x7EF4;&#x56FE;&#x50CF;&#x505A;&#x5377;&#x79EF;&#x4E86;&#xFF0C;&#x73B0;&#x5728;&#x770B;&#x770B;&#x5982;&#x4F55;&#x6267;&#x884C;&#x5377;&#x79EF;&#x4E0D;&#x4EC5;&#x4EC5;&#x5728;&#x4E8C;&#x7EF4;&#x56FE;&#x50CF;&#x4E0A;&#xFF0C;&#x800C;&#x662F;&#x4E09;&#x7EF4;&#x7ACB;&#x4F53;&#x4E0A;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x4ECE;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x5F00;&#x59CB;&#xFF0C;&#x5047;&#x5982;&#x8BF4;&#x4F60;&#x4E0D;&#x4EC5;&#x60F3;&#x68C0;&#x6D4B;&#x7070;&#x5EA6;&#x56FE;&#x50CF;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x4E5F;&#x60F3;&#x68C0;&#x6D4B;<strong>RGB</strong>&#x5F69;&#x8272;&#x56FE;&#x50CF;&#x7684;&#x7279;&#x5F81;&#x3002;&#x5F69;&#x8272;&#x56FE;&#x50CF;&#x5982;&#x679C;&#x662F;6&#xD7;6&#xD7;3&#xFF0C;&#x8FD9;&#x91CC;&#x7684;3&#x6307;&#x7684;&#x662F;&#x4E09;&#x4E2A;&#x989C;&#x8272;&#x901A;&#x9053;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x5B83;&#x60F3;&#x8C61;&#x6210;&#x4E09;&#x4E2A;6&#xD7;6&#x56FE;&#x50CF;&#x7684;&#x5806;&#x53E0;&#x3002;&#x4E3A;&#x4E86;&#x68C0;&#x6D4B;&#x56FE;&#x50CF;&#x7684;&#x8FB9;&#x7F18;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x4E0D;&#x662F;&#x628A;&#x5B83;&#x8DDF;&#x539F;&#x6765;&#x7684;3&#xD7;3&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x505A;&#x5377;&#x79EF;&#xFF0C;&#x800C;&#x662F;&#x8DDF;&#x4E00;&#x4E2A;&#x4E09;&#x7EF4;&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x5B83;&#x7684;&#x7EF4;&#x5EA6;&#x662F;3&#xD7;3&#xD7;3&#xFF0C;&#x8FD9;&#x6837;&#x8FD9;&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#x4E5F;&#x6709;&#x4E09;&#x5C42;&#xFF0C;&#x5BF9;&#x5E94;&#x7EA2;&#x7EFF;&#x3001;&#x84DD;&#x4E09;&#x4E2A;&#x901A;&#x9053;&#x3002;</p>
<p><img src="../images/0750b2344d16400b2db885261b059f53.png" alt=""></p>
<p>&#x7ED9;&#x8FD9;&#x4E9B;&#x8D77;&#x4E2A;&#x540D;&#x5B57;&#xFF08;&#x539F;&#x56FE;&#x50CF;&#xFF09;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;6&#x4EE3;&#x8868;&#x56FE;&#x50CF;&#x9AD8;&#x5EA6;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;6&#x4EE3;&#x8868;&#x5BBD;&#x5EA6;&#xFF0C;&#x8FD9;&#x4E2A;3&#x4EE3;&#x8868;&#x901A;&#x9053;&#x7684;&#x6570;&#x76EE;&#x3002;&#x540C;&#x6837;&#x4F60;&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x4E5F;&#x6709;&#x4E00;&#x4E2A;&#x9AD8;&#xFF0C;&#x5BBD;&#x548C;&#x901A;&#x9053;&#x6570;&#xFF0C;&#x5E76;&#x4E14;&#x56FE;&#x50CF;&#x7684;&#x901A;&#x9053;&#x6570;&#x5FC5;&#x987B;&#x548C;&#x8FC7;&#x6EE4;&#x5668;&#x7684;&#x901A;&#x9053;&#x6570;&#x5339;&#x914D;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E24;&#x4E2A;&#x6570;&#xFF08;&#x7D2B;&#x8272;&#x65B9;&#x6846;&#x6807;&#x8BB0;&#x7684;&#x4E24;&#x4E2A;&#x6570;&#xFF09;&#x5FC5;&#x987B;&#x76F8;&#x7B49;&#x3002;&#x4E0B;&#x4E2A;&#x5E7B;&#x706F;&#x7247;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x4F1A;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x5377;&#x79EF;&#x64CD;&#x4F5C;&#x662F;&#x5982;&#x4F55;&#x8FDB;&#x884C;&#x7684;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x7684;&#x8F93;&#x51FA;&#x4F1A;&#x662F;&#x4E00;&#x4E2A;4&#xD7;4&#x7684;&#x56FE;&#x50CF;&#xFF0C;&#x6CE8;&#x610F;&#x662F;4&#xD7;4&#xD7;1&#xFF0C;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x6570;&#x4E0D;&#x662F;3&#x4E86;&#x3002;</p>
<p><img src="../images/d148c3dd7ce9e6d7e29c02c483298842.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x7814;&#x7A76;&#x4E0B;&#x8FD9;&#x80CC;&#x540E;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x9996;&#x5148;&#x5148;&#x6362;&#x4E00;&#x5F20;&#x597D;&#x770B;&#x7684;&#x56FE;&#x7247;&#x3002;&#x8FD9;&#x4E2A;&#x662F;6&#xD7;6&#xD7;3&#x7684;&#x56FE;&#x50CF;&#xFF0C;&#x8FD9;&#x4E2A;&#x662F;3&#xD7;3&#xD7;3&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#x901A;&#x9053;&#x6570;&#x5FC5;&#x987B;&#x548C;&#x8FC7;&#x6EE4;&#x5668;&#x4E2D;&#x7684;&#x901A;&#x9053;&#x6570;&#x76F8;&#x5339;&#x914D;&#x3002;&#x4E3A;&#x4E86;&#x7B80;&#x5316;&#x8FD9;&#x4E2A;3&#xD7;3&#xD7;3&#x8FC7;&#x6EE4;&#x5668;&#x7684;&#x56FE;&#x50CF;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x628A;&#x5B83;&#x753B;&#x6210;3&#x4E2A;&#x77E9;&#x9635;&#x7684;&#x5806;&#x53E0;&#xFF0C;&#x800C;&#x753B;&#x6210;&#x8FD9;&#x6837;&#xFF0C;&#x4E00;&#x4E2A;&#x4E09;&#x7EF4;&#x7684;&#x7ACB;&#x65B9;&#x4F53;&#x3002;</p>
<p><img src="../images/9b0b0e9062f8814a6a462ea64449f89e.png" alt=""></p>
<p>&#x4E3A;&#x4E86;&#x8BA1;&#x7B97;&#x8FD9;&#x4E2A;&#x5377;&#x79EF;&#x64CD;&#x4F5C;&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x4F60;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x628A;&#x8FD9;&#x4E2A;3&#xD7;3&#xD7;3&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x5148;&#x653E;&#x5230;&#x6700;&#x5DE6;&#x4E0A;&#x89D2;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x8FD9;&#x4E2A;3&#xD7;3&#xD7;3&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x6709;27&#x4E2A;&#x6570;&#xFF0C;27&#x4E2A;&#x53C2;&#x6570;&#x5C31;&#x662F;3&#x7684;&#x7ACB;&#x65B9;&#x3002;&#x4F9D;&#x6B21;&#x53D6;&#x8FD9;27&#x4E2A;&#x6570;&#xFF0C;&#x7136;&#x540E;&#x4E58;&#x4EE5;&#x76F8;&#x5E94;&#x7684;&#x7EA2;&#x7EFF;&#x84DD;&#x901A;&#x9053;&#x4E2D;&#x7684;&#x6570;&#x5B57;&#x3002;&#x5148;&#x53D6;&#x7EA2;&#x8272;&#x901A;&#x9053;&#x7684;&#x524D;9&#x4E2A;&#x6570;&#x5B57;&#xFF0C;&#x7136;&#x540E;&#x662F;&#x7EFF;&#x8272;&#x901A;&#x9053;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x662F;&#x84DD;&#x8272;&#x901A;&#x9053;&#xFF0C;&#x4E58;&#x4EE5;&#x5DE6;&#x8FB9;&#x9EC4;&#x8272;&#x7ACB;&#x65B9;&#x4F53;&#x8986;&#x76D6;&#x7684;&#x5BF9;&#x5E94;&#x7684;27&#x4E2A;&#x6570;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x8FD9;&#x4E9B;&#x6570;&#x90FD;&#x52A0;&#x8D77;&#x6765;&#xFF0C;&#x5C31;&#x5F97;&#x5230;&#x4E86;&#x8F93;&#x51FA;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#x3002;</p>
<p>&#x5982;&#x679C;&#x8981;&#x8BA1;&#x7B97;&#x4E0B;&#x4E00;&#x4E2A;&#x8F93;&#x51FA;&#xFF0C;&#x4F60;&#x628A;&#x8FD9;&#x4E2A;&#x7ACB;&#x65B9;&#x4F53;&#x6ED1;&#x52A8;&#x4E00;&#x4E2A;&#x5355;&#x4F4D;&#xFF0C;&#x518D;&#x4E0E;&#x8FD9;27&#x4E2A;&#x6570;&#x76F8;&#x4E58;&#xFF0C;&#x628A;&#x5B83;&#x4EEC;&#x90FD;&#x52A0;&#x8D77;&#x6765;&#xFF0C;&#x5C31;&#x5F97;&#x5230;&#x4E86;&#x4E0B;&#x4E00;&#x4E2A;&#x8F93;&#x51FA;&#xFF0C;&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#x3002;</p>
<p><img src="../images/2fd0c97947a3e8222e78d550a317366d.png" alt=""></p>
<p>&#x90A3;&#x4E48;&#xFF0C;&#x8FD9;&#x4E2A;&#x80FD;&#x5E72;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#x662F;3&#xD7;3&#xD7;3&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x68C0;&#x6D4B;&#x56FE;&#x50CF;&#x7EA2;&#x8272;&#x901A;&#x9053;&#x7684;&#x8FB9;&#x7F18;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x7B2C;&#x4E00;&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#x8BBE;&#x4E3A;$\begin{bmatrix}1 &amp; 0 &amp; - 1 \ 1 &amp; 0 &amp; - 1 \ 1 &amp; 0 &amp; - 1 \\end{bmatrix}$&#xFF0C;&#x548C;&#x4E4B;&#x524D;&#x4E00;&#x6837;&#xFF0C;&#x800C;&#x7EFF;&#x8272;&#x901A;&#x9053;&#x5168;&#x4E3A;0&#xFF0C;$\begin{bmatrix} 0&amp; 0 &amp; 0 \ 0 &amp;0 &amp; 0 \ 0 &amp; 0 &amp; 0 \\end{bmatrix}$&#xFF0C;&#x84DD;&#x8272;&#x4E5F;&#x5168;&#x4E3A;0&#x3002;&#x5982;&#x679C;&#x4F60;&#x628A;&#x8FD9;&#x4E09;&#x4E2A;&#x5806;&#x53E0;&#x5728;&#x4E00;&#x8D77;&#x5F62;&#x6210;&#x4E00;&#x4E2A;3&#xD7;3&#xD7;3&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x68C0;&#x6D4B;&#x5782;&#x76F4;&#x8FB9;&#x754C;&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x4F46;&#x53EA;&#x5BF9;&#x7EA2;&#x8272;&#x901A;&#x9053;&#x6709;&#x7528;&#x3002;</p>
<p><img src="../images/d088cafb50cabd6837d95c03c953e920.png" alt=""></p>
<p>&#x6216;&#x8005;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x5173;&#x5FC3;&#x5782;&#x76F4;&#x8FB9;&#x754C;&#x5728;&#x54EA;&#x4E2A;&#x989C;&#x8272;&#x901A;&#x9053;&#x91CC;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x4E00;&#x4E2A;&#x8FD9;&#x6837;&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;$\begin{bmatrix}1 &amp; 0 &amp; - 1 \ 1 &amp; 0 &amp; - 1 \ 1 &amp; 0 &amp; - 1 \ \end{bmatrix}$&#xFF0C;$\begin{bmatrix}1 &amp; 0 &amp; - 1 \ 1 &amp; 0 &amp; - 1 \ 1 &amp; 0 &amp; - 1 \ \end{bmatrix}$&#xFF0C;$\begin{bmatrix}1 &amp; 0 &amp; - 1 \ 1 &amp; 0 &amp; - 1 \ 1 &amp; 0 &amp; - 1 \\end{bmatrix}$&#xFF0C;&#x6240;&#x6709;&#x4E09;&#x4E2A;&#x901A;&#x9053;&#x90FD;&#x662F;&#x8FD9;&#x6837;&#x3002;&#x6240;&#x4EE5;&#x901A;&#x8FC7;&#x8BBE;&#x7F6E;&#x7B2C;&#x4E8C;&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#x53C2;&#x6570;&#xFF0C;&#x4F60;&#x5C31;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x8FB9;&#x754C;&#x68C0;&#x6D4B;&#x5668;&#xFF0C;3&#xD7;3&#xD7;3&#x7684;&#x8FB9;&#x754C;&#x68C0;&#x6D4B;&#x5668;&#xFF0C;&#x7528;&#x6765;&#x68C0;&#x6D4B;&#x4EFB;&#x610F;&#x989C;&#x8272;&#x901A;&#x9053;&#x91CC;&#x7684;&#x8FB9;&#x754C;&#x3002;&#x53C2;&#x6570;&#x7684;&#x9009;&#x62E9;&#x4E0D;&#x540C;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x7279;&#x5F81;&#x68C0;&#x6D4B;&#x5668;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x90FD;&#x662F;3&#xD7;3&#xD7;3&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x3002;</p>
<p>&#x6309;&#x7167;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x7684;&#x60EF;&#x4F8B;&#xFF0C;&#x5F53;&#x4F60;&#x7684;&#x8F93;&#x5165;&#x6709;&#x7279;&#x5B9A;&#x7684;&#x9AD8;&#x5BBD;&#x548C;&#x901A;&#x9053;&#x6570;&#x65F6;&#xFF0C;&#x4F60;&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x53EF;&#x4EE5;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x9AD8;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x5BBD;&#xFF0C;&#x4F46;&#x662F;&#x5FC5;&#x987B;&#x4E00;&#x6837;&#x7684;&#x901A;&#x9053;&#x6570;&#x3002;&#x7406;&#x8BBA;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x53EA;&#x5173;&#x6CE8;&#x7EA2;&#x8272;&#x901A;&#x9053;&#xFF0C;&#x6216;&#x8005;&#x53EA;&#x5173;&#x6CE8;&#x7EFF;&#x8272;&#x6216;&#x8005;&#x84DD;&#x8272;&#x901A;&#x9053;&#x4E5F;&#x662F;&#x53EF;&#x884C;&#x7684;&#x3002;</p>
<p>&#x518D;&#x6CE8;&#x610F;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;&#x5377;&#x79EF;&#x7ACB;&#x65B9;&#x4F53;&#xFF0C;&#x4E00;&#x4E2A;6&#xD7;6&#xD7;6&#x7684;&#x8F93;&#x5165;&#x56FE;&#x50CF;&#x5377;&#x79EF;&#x4E0A;&#x4E00;&#x4E2A;3&#xD7;3&#xD7;3&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x5F97;&#x5230;&#x4E00;&#x4E2A;4&#xD7;4&#x7684;&#x4E8C;&#x7EF4;&#x8F93;&#x51FA;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x4F60;&#x5DF2;&#x7ECF;&#x4E86;&#x89E3;&#x4E86;&#x5982;&#x4F55;&#x5BF9;&#x7ACB;&#x65B9;&#x4F53;&#x5377;&#x79EF;&#xFF0C;&#x8FD8;&#x6709;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x6982;&#x5FF5;&#xFF0C;&#x5BF9;&#x5EFA;&#x7ACB;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x3002;&#x5C31;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4E0D;&#x4EC5;&#x4EC5;&#x60F3;&#x8981;&#x68C0;&#x6D4B;&#x5782;&#x76F4;&#x8FB9;&#x7F18;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x540C;&#x65F6;&#x68C0;&#x6D4B;&#x5782;&#x76F4;&#x8FB9;&#x7F18;&#x548C;&#x6C34;&#x5E73;&#x8FB9;&#x7F18;&#xFF0C;&#x8FD8;&#x6709;45&#xB0;&#x503E;&#x659C;&#x7684;&#x8FB9;&#x7F18;&#xFF0C;&#x8FD8;&#x6709;70&#xB0;&#x503E;&#x659C;&#x7684;&#x8FB9;&#x7F18;&#x600E;&#x4E48;&#x505A;&#xFF1F;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x540C;&#x65F6;&#x7528;&#x591A;&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#x600E;&#x4E48;&#x529E;&#xFF1F;</p>
<p>&#x8FD9;&#x662F;&#x6211;&#x4EEC;&#x4E0A;&#x4E00;&#x5F20;&#x5E7B;&#x706F;&#x7247;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x6211;&#x4EEC;&#x8BA9;&#x8FD9;&#x4E2A;6&#xD7;6&#xD7;3&#x7684;&#x56FE;&#x50CF;&#x548C;&#x8FD9;&#x4E2A;3&#xD7;3&#xD7;3&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x5377;&#x79EF;&#xFF0C;&#x5F97;&#x5230;4&#xD7;4&#x7684;&#x8F93;&#x51FA;&#x3002;&#xFF08;&#x7B2C;&#x4E00;&#x4E2A;&#xFF09;&#x8FD9;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x4E2A;&#x5782;&#x76F4;&#x8FB9;&#x754C;&#x68C0;&#x6D4B;&#x5668;&#x6216;&#x8005;&#x662F;&#x5B66;&#x4E60;&#x68C0;&#x6D4B;&#x5176;&#x4ED6;&#x7684;&#x7279;&#x5F81;&#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#x53EF;&#x4EE5;&#x7528;&#x6A58;&#x8272;&#x6765;&#x8868;&#x793A;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x662F;&#x4E00;&#x4E2A;&#x6C34;&#x5E73;&#x8FB9;&#x7F18;&#x68C0;&#x6D4B;&#x5668;&#x3002;</p>
<p><img src="../images/794b25829ae809f93ac69f81eee79cd1.png" alt=""></p>
<p>&#x6240;&#x4EE5;&#x548C;&#x7B2C;&#x4E00;&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#x5377;&#x79EF;&#xFF0C;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x7B2C;&#x4E00;&#x4E2A;4&#xD7;4&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x7136;&#x540E;&#x5377;&#x79EF;&#x7B2C;&#x4E8C;&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x4E0D;&#x540C;&#x7684;4&#xD7;4&#x7684;&#x8F93;&#x51FA;&#x3002;&#x6211;&#x4EEC;&#x505A;&#x5B8C;&#x5377;&#x79EF;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x8FD9;&#x4E24;&#x4E2A;4&#xD7;4&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x53D6;&#x7B2C;&#x4E00;&#x4E2A;&#x628A;&#x5B83;&#x653E;&#x5230;&#x524D;&#x9762;&#xFF0C;&#x7136;&#x540E;&#x53D6;&#x7B2C;&#x4E8C;&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#x8F93;&#x51FA;&#xFF0C;&#x6211;&#x628A;&#x5B83;&#x753B;&#x5728;&#x8FD9;&#xFF0C;&#x653E;&#x5230;&#x540E;&#x9762;&#x3002;&#x6240;&#x4EE5;&#x628A;&#x8FD9;&#x4E24;&#x4E2A;&#x8F93;&#x51FA;&#x5806;&#x53E0;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x5C31;&#x90FD;&#x5F97;&#x5230;&#x4E86;&#x4E00;&#x4E2A;4&#xD7;4&#xD7;2&#x7684;&#x8F93;&#x51FA;&#x7ACB;&#x65B9;&#x4F53;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x8FD9;&#x4E2A;&#x7ACB;&#x65B9;&#x4F53;&#x5F53;&#x6210;&#xFF0C;&#x91CD;&#x65B0;&#x753B;&#x5728;&#x8FD9;&#xFF0C;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x8FD9;&#x6837;&#x7684;&#x76D2;&#x5B50;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x5C31;&#x662F;&#x4E00;&#x4E2A;4&#xD7;4&#xD7;2&#x7684;&#x8F93;&#x51FA;&#x7ACB;&#x65B9;&#x4F53;&#x3002;&#x5B83;&#x7528;6&#xD7;6&#xD7;3&#x7684;&#x56FE;&#x50CF;&#xFF0C;&#x7136;&#x540E;&#x5377;&#x79EF;&#x4E0A;&#x8FD9;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;3&#xD7;3&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x5F97;&#x5230;&#x4E24;&#x4E2A;4&#xD7;4&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x5B83;&#x4EEC;&#x5806;&#x53E0;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x5F62;&#x6210;&#x4E00;&#x4E2A;4&#xD7;4&#xD7;2&#x7684;&#x7ACB;&#x65B9;&#x4F53;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;2&#x7684;&#x6765;&#x6E90;&#x4E8E;&#x6211;&#x4EEC;&#x7528;&#x4E86;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x3002;</p>
<p><img src="../images/d590398749e3f5f3ac230ab25116c4b7.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#x7EF4;&#x5EA6;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;&#x4E00;&#x4E2A;$n \times n \times n<em>{c}$&#xFF08;&#x901A;&#x9053;&#x6570;&#xFF09;&#x7684;&#x8F93;&#x5165;&#x56FE;&#x50CF;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x5C31;&#x662F;6&#xD7;6&#xD7;3&#xFF0C;&#x8FD9;&#x91CC;&#x7684;$n</em>{c}$&#x5C31;&#x662F;&#x901A;&#x9053;&#x6570;&#x76EE;&#xFF0C;&#x7136;&#x540E;&#x5377;&#x79EF;&#x4E0A;&#x4E00;&#x4E2A;$f&#xD7;f&#xD7;n<em>{c}$&#xFF0C;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x662F;3&#xD7;3&#xD7;3&#xFF0C;&#x6309;&#x7167;&#x60EF;&#x4F8B;&#xFF0C;&#x8FD9;&#x4E2A;&#xFF08;&#x524D;&#x4E00;&#x4E2A;$n</em>{c}$&#xFF09;&#x548C;&#x8FD9;&#x4E2A;&#xFF08;&#x540E;&#x4E00;&#x4E2A;$n<em>{c}$&#xFF09;&#x5FC5;&#x987B;&#x6570;&#x503C;&#x76F8;&#x540C;&#x3002;&#x7136;&#x540E;&#x4F60;&#x5C31;&#x5F97;&#x5230;&#x4E86;$&#xFF08;n-f+1&#xFF09;&#xD7;&#xFF08;n-f+1&#xFF09;&#xD7;n</em>{c^{&apos;}}$&#xFF0C;&#x8FD9;&#x91CC;$n_{c^{&apos;}}$&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x4E0B;&#x4E00;&#x5C42;&#x7684;&#x901A;&#x9053;&#x6570;&#xFF0C;&#x5B83;&#x5C31;&#x662F;&#x4F60;&#x7528;&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x7684;&#x4E2A;&#x6570;&#xFF0C;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x90A3;&#x5C31;&#x662F;4&#xD7;4&#xD7;2&#x3002;&#x6211;&#x5199;&#x4E0B;&#x8FD9;&#x4E2A;&#x5047;&#x8BBE;&#x65F6;&#xFF0C;&#x7528;&#x7684;&#x6B65;&#x5E45;&#x4E3A;1&#xFF0C;&#x5E76;&#x4E14;&#x6CA1;&#x6709;<strong>padding</strong>&#x3002;&#x5982;&#x679C;&#x4F60;&#x7528;&#x4E86;&#x4E0D;&#x540C;&#x7684;&#x6B65;&#x5E45;&#x6216;&#x8005;<strong>padding</strong>&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;$n-f+1$&#x6570;&#x503C;&#x4F1A;&#x53D8;&#x5316;&#xFF0C;&#x6B63;&#x5982;&#x524D;&#x9762;&#x7684;&#x89C6;&#x9891;&#x6F14;&#x793A;&#x7684;&#x90A3;&#x6837;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x5BF9;&#x7ACB;&#x65B9;&#x4F53;&#x5377;&#x79EF;&#x7684;&#x6982;&#x5FF5;&#x771F;&#x7684;&#x5F88;&#x6709;&#x7528;&#xFF0C;&#x4F60;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x7528;&#x5B83;&#x7684;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#x76F4;&#x63A5;&#x5728;&#x4E09;&#x4E2A;&#x901A;&#x9053;&#x7684;<strong>RGB</strong>&#x56FE;&#x50CF;&#x4E0A;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#x3002;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x68C0;&#x6D4B;&#x4E24;&#x4E2A;&#x7279;&#x5F81;&#xFF0C;&#x6BD4;&#x5982;&#x5782;&#x76F4;&#x548C;&#x6C34;&#x5E73;&#x8FB9;&#x7F18;&#x6216;&#x8005;10&#x4E2A;&#x6216;&#x8005;128&#x4E2A;&#x6216;&#x8005;&#x51E0;&#x767E;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x5E76;&#x4E14;&#x8F93;&#x51FA;&#x7684;&#x901A;&#x9053;&#x6570;&#x4F1A;&#x7B49;&#x4E8E;&#x4F60;&#x8981;&#x68C0;&#x6D4B;&#x7684;&#x7279;&#x5F81;&#x6570;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x8FD9;&#x91CC;&#x7684;&#x7B26;&#x53F7;&#xFF0C;&#x6211;&#x4E00;&#x76F4;&#x7528;&#x901A;&#x9053;&#x6570;&#xFF08;$n_{c}$&#xFF09;&#x6765;&#x8868;&#x793A;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x7EF4;&#x5EA6;&#xFF0C;&#x5728;&#x6587;&#x732E;&#x91CC;&#x5927;&#x5BB6;&#x4E5F;&#x628A;&#x5B83;&#x53EB;&#x505A;3&#x7EF4;&#x7ACB;&#x65B9;&#x4F53;&#x7684;&#x6DF1;&#x5EA6;&#x3002;&#x8FD9;&#x4E24;&#x4E2A;&#x672F;&#x8BED;&#xFF0C;&#x5373;&#x901A;&#x9053;&#x6216;&#x8005;&#x6DF1;&#x5EA6;&#xFF0C;&#x7ECF;&#x5E38;&#x88AB;&#x7528;&#x5728;&#x6587;&#x732E;&#x4E2D;&#x3002;&#x4F46;&#x6211;&#x89C9;&#x5F97;&#x6DF1;&#x5EA6;&#x5BB9;&#x6613;&#x8BA9;&#x4EBA;&#x6DF7;&#x6DC6;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x901A;&#x5E38;&#x4E5F;&#x4F1A;&#x8BF4;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x6DF1;&#x5EA6;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5728;&#x8FD9;&#x4E9B;&#x89C6;&#x9891;&#x91CC;&#x6211;&#x4F1A;&#x7528;&#x901A;&#x9053;&#x8FD9;&#x4E2A;&#x672F;&#x8BED;&#x6765;&#x8868;&#x793A;&#x8FC7;&#x6EE4;&#x5668;&#x7684;&#x7B2C;&#x4E09;&#x4E2A;&#x7EF4;&#x5EA6;&#x7684;&#x5927;&#x5C0F;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x4F60;&#x5DF2;&#x7ECF;&#x77E5;&#x9053;&#x600E;&#x4E48;&#x5BF9;&#x7ACB;&#x65B9;&#x4F53;&#x505A;&#x5377;&#x79EF;&#x4E86;&#xFF0C;&#x4F60;&#x5DF2;&#x7ECF;&#x51C6;&#x5907;&#x597D;&#x4E86;&#x5B9E;&#x73B0;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x5176;&#x4E2D;&#x4E00;&#x5C42;&#x4E86;&#xFF0C;&#x5728;&#x4E0B;&#x4E2A;&#x89C6;&#x9891;&#x91CC;&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x662F;&#x600E;&#x4E48;&#x505A;&#x7684;&#x3002;</p>
<h3 id="17-&#x5355;&#x5C42;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#xFF08;one-layer-of-a-convolutional-network&#xFF09;">1.7 &#x5355;&#x5C42;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#xFF08;One layer of a convolutional network&#xFF09;</h3>
<p>&#x4ECA;&#x5929;&#x6211;&#x4EEC;&#x8981;&#x8BB2;&#x7684;&#x662F;&#x5982;&#x4F55;&#x6784;&#x5EFA;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x5377;&#x79EF;&#x5C42;&#xFF0C;&#x4E0B;&#x9762;&#x6765;&#x770B;&#x4E2A;&#x4F8B;&#x5B50;&#x3002;</p>
<p><img src="../images/47ee90bd4a3939254a10d4b808d475ff.png" alt=""></p>
<p>&#x4E0A;&#x8282;&#x8BFE;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x8BB2;&#x4E86;&#x5982;&#x4F55;&#x901A;&#x8FC7;&#x4E24;&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#x5377;&#x79EF;&#x5904;&#x7406;&#x4E00;&#x4E2A;&#x4E09;&#x7EF4;&#x56FE;&#x50CF;&#xFF0C;&#x5E76;&#x8F93;&#x51FA;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;4&#xD7;4&#x77E9;&#x9635;&#x3002;&#x5047;&#x8BBE;&#x4F7F;&#x7528;&#x7B2C;&#x4E00;&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#x8FDB;&#x884C;&#x5377;&#x79EF;&#xFF0C;&#x5F97;&#x5230;&#x7B2C;&#x4E00;&#x4E2A;4&#xD7;4&#x77E9;&#x9635;&#x3002;&#x4F7F;&#x7528;&#x7B2C;&#x4E8C;&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#x8FDB;&#x884C;&#x5377;&#x79EF;&#x5F97;&#x5230;&#x53E6;&#x5916;&#x4E00;&#x4E2A;4&#xD7;4&#x77E9;&#x9635;&#x3002;</p>
<p><img src="../images/2e42ccefeeecd75656bc871e89723844.png" alt=""></p>
<p>&#x6700;&#x7EC8;&#x5404;&#x81EA;&#x5F62;&#x6210;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5C42;&#xFF0C;&#x7136;&#x540E;&#x589E;&#x52A0;&#x504F;&#x5DEE;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x5B9E;&#x6570;&#xFF0C;&#x901A;&#x8FC7;<strong>Python</strong>&#x7684;&#x5E7F;&#x64AD;&#x673A;&#x5236;&#x7ED9;&#x8FD9;16&#x4E2A;&#x5143;&#x7D20;&#x90FD;&#x52A0;&#x4E0A;&#x540C;&#x4E00;&#x504F;&#x5DEE;&#x3002;&#x7136;&#x540E;&#x5E94;&#x7528;&#x975E;&#x7EBF;&#x6027;&#x51FD;&#x6570;&#xFF0C;&#x4E3A;&#x4E86;&#x8BF4;&#x660E;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x7EBF;&#x6027;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;<strong>ReLU</strong>&#xFF0C;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x662F;&#x4E00;&#x4E2A;4&#xD7;4&#x77E9;&#x9635;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x7B2C;&#x4E8C;&#x4E2A;4&#xD7;4&#x77E9;&#x9635;&#xFF0C;&#x6211;&#x4EEC;&#x52A0;&#x4E0A;&#x4E0D;&#x540C;&#x7684;&#x504F;&#x5DEE;&#xFF0C;&#x5B83;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x5B9E;&#x6570;&#xFF0C;16&#x4E2A;&#x6570;&#x5B57;&#x90FD;&#x52A0;&#x4E0A;&#x540C;&#x4E00;&#x4E2A;&#x5B9E;&#x6570;&#xFF0C;&#x7136;&#x540E;&#x5E94;&#x7528;&#x975E;&#x7EBF;&#x6027;&#x51FD;&#x6570;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x7EBF;&#x6027;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;<strong>ReLU</strong>&#xFF0C;&#x6700;&#x7EC8;&#x5F97;&#x5230;&#x53E6;&#x4E00;&#x4E2A;4&#xD7;4&#x77E9;&#x9635;&#x3002;&#x7136;&#x540E;&#x91CD;&#x590D;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x7684;&#x6B65;&#x9AA4;&#xFF0C;&#x628A;&#x8FD9;&#x4E24;&#x4E2A;&#x77E9;&#x9635;&#x5806;&#x53E0;&#x8D77;&#x6765;&#xFF0C;&#x6700;&#x7EC8;&#x5F97;&#x5230;&#x4E00;&#x4E2A;4&#xD7;4&#xD7;2&#x7684;&#x77E9;&#x9635;&#x3002;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x8BA1;&#x7B97;&#xFF0C;&#x4ECE;6&#xD7;6&#xD7;3&#x7684;&#x8F93;&#x5165;&#x63A8;&#x5BFC;&#x51FA;&#x4E00;&#x4E2A;4&#xD7;4&#xD7;2&#x77E9;&#x9635;&#xFF0C;&#x5B83;&#x662F;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x4E00;&#x5C42;&#xFF0C;&#x628A;&#x5B83;&#x6620;&#x5C04;&#x5230;&#x6807;&#x51C6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x56DB;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x4E2D;&#x7684;&#x67D0;&#x4E00;&#x5C42;&#x6216;&#x8005;&#x4E00;&#x4E2A;&#x975E;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x3002;</p>
<p><img src="../images/1236aad1426bd324964091f1d9db2587.png" alt=""></p>
<p>&#x6CE8;&#x610F;&#x524D;&#x5411;&#x4F20;&#x64AD;&#x4E2D;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x5C31;&#x662F;$z^{[1]} = W^{[1]}a^{[0]} + b^{[1]}$&#xFF0C;&#x5176;&#x4E2D;$a^{[0]} =x$&#xFF0C;&#x6267;&#x884C;&#x975E;&#x7EBF;&#x6027;&#x51FD;&#x6570;&#x5F97;&#x5230;$a^{[1]}$&#xFF0C;&#x5373;$a^{[1]} = g(z^{[1]})$&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x8F93;&#x5165;&#x662F;$a^{\left\lbrack 0\right\rbrack}$&#xFF0C;&#x4E5F;&#x5C31;&#x662F;$x$&#xFF0C;&#x8FD9;&#x4E9B;&#x8FC7;&#x6EE4;&#x5668;&#x7528;&#x53D8;&#x91CF;$W^{[1]}$&#x8868;&#x793A;&#x3002;&#x5728;&#x5377;&#x79EF;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9;&#x8FD9;27&#x4E2A;&#x6570;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF0C;&#x5176;&#x5B9E;&#x662F;27&#xD7;2&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x7528;&#x4E86;&#x4E24;&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x6211;&#x4EEC;&#x53D6;&#x8FD9;&#x4E9B;&#x6570;&#x505A;&#x4E58;&#x6CD5;&#x3002;&#x5B9E;&#x9645;&#x6267;&#x884C;&#x4E86;&#x4E00;&#x4E2A;&#x7EBF;&#x6027;&#x51FD;&#x6570;&#xFF0C;&#x5F97;&#x5230;&#x4E00;&#x4E2A;4&#xD7;4&#x7684;&#x77E9;&#x9635;&#x3002;&#x5377;&#x79EF;&#x64CD;&#x4F5C;&#x7684;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x662F;&#x4E00;&#x4E2A;4&#xD7;4&#x7684;&#x77E9;&#x9635;&#xFF0C;&#x5B83;&#x7684;&#x4F5C;&#x7528;&#x7C7B;&#x4F3C;&#x4E8E;$W^{[1]}a^{[0]}$&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8FD9;&#x4E24;&#x4E2A;4&#xD7;4&#x77E9;&#x9635;&#x7684;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#xFF0C;&#x7136;&#x540E;&#x52A0;&#x4E0A;&#x504F;&#x5DEE;&#x3002;</p>
<p><img src="../images/f75c1c3fb38083e046d3497656ab4591.png" alt=""></p>
<p>&#x8FD9;&#x4E00;&#x90E8;&#x5206;&#xFF08;&#x56FE;&#x4E2D;&#x84DD;&#x8272;&#x8FB9;&#x6846;&#x6807;&#x8BB0;&#x7684;&#x90E8;&#x5206;&#xFF09;&#x5C31;&#x662F;&#x5E94;&#x7528;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;<strong>ReLU</strong>&#x4E4B;&#x524D;&#x7684;&#x503C;&#xFF0C;&#x5B83;&#x7684;&#x4F5C;&#x7528;&#x7C7B;&#x4F3C;&#x4E8E;$z^{[1]}$&#xFF0C;&#x6700;&#x540E;&#x5E94;&#x7528;&#x975E;&#x7EBF;&#x6027;&#x51FD;&#x6570;&#xFF0C;&#x5F97;&#x5230;&#x7684;&#x8FD9;&#x4E2A;4&#xD7;4&#xD7;2&#x77E9;&#x9635;&#xFF0C;&#x6210;&#x4E3A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x4E0B;&#x4E00;&#x5C42;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6FC0;&#x6D3B;&#x5C42;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;$a^{[0]}$&#x5230;$a^{[1]}$&#x7684;&#x6F14;&#x53D8;&#x8FC7;&#x7A0B;&#xFF0C;&#x9996;&#x5148;&#x6267;&#x884C;&#x7EBF;&#x6027;&#x51FD;&#x6570;&#xFF0C;&#x7136;&#x540E;&#x6240;&#x6709;&#x5143;&#x7D20;&#x76F8;&#x4E58;&#x505A;&#x5377;&#x79EF;&#xFF0C;&#x5177;&#x4F53;&#x505A;&#x6CD5;&#x662F;&#x8FD0;&#x7528;&#x7EBF;&#x6027;&#x51FD;&#x6570;&#x518D;&#x52A0;&#x4E0A;&#x504F;&#x5DEE;&#xFF0C;&#x7136;&#x540E;&#x5E94;&#x7528;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;<strong>ReLU</strong>&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x901A;&#x8FC7;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x4E00;&#x5C42;&#x628A;&#x4E00;&#x4E2A;6&#xD7;6&#xD7;3&#x7684;&#x7EF4;&#x5EA6;$a^{[0]}$&#x6F14;&#x5316;&#x4E3A;&#x4E00;&#x4E2A;4&#xD7;4&#xD7;2&#x7EF4;&#x5EA6;&#x7684;$a^{[1]}$&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x4E00;&#x5C42;&#x3002;</p>
<p>&#x793A;&#x4F8B;&#x4E2D;&#x6211;&#x4EEC;&#x6709;&#x4E24;&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6709;&#x4E24;&#x4E2A;&#x7279;&#x5F81;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x624D;&#x6700;&#x7EC8;&#x5F97;&#x5230;&#x4E00;&#x4E2A;4&#xD7;4&#xD7;2&#x7684;&#x8F93;&#x51FA;&#x3002;&#x4F46;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x7528;&#x4E86;10&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x800C;&#x4E0D;&#x662F;2&#x4E2A;&#xFF0C;&#x6211;&#x4EEC;&#x6700;&#x540E;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x4E2A;4&#xD7;4&#xD7;10&#x7EF4;&#x5EA6;&#x7684;&#x8F93;&#x51FA;&#x56FE;&#x50CF;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x9009;&#x53D6;&#x4E86;&#x5176;&#x4E2D;10&#x4E2A;&#x7279;&#x5F81;&#x6620;&#x5C04;&#xFF0C;&#x800C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;2&#x4E2A;&#xFF0C;&#x5C06;&#x5B83;&#x4EEC;&#x5806;&#x53E0;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x5F62;&#x6210;&#x4E00;&#x4E2A;4&#xD7;4&#xD7;10&#x7684;&#x8F93;&#x51FA;&#x56FE;&#x50CF;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;$a^{\left\lbrack1 \right\rbrack}$&#x3002;</p>
<p><img src="../images/d0241a6550665caeec21174158e96da9.png" alt=""></p>
<p>&#x4E3A;&#x4E86;&#x52A0;&#x6DF1;&#x7406;&#x89E3;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x505A;&#x4E00;&#x4E2A;&#x7EC3;&#x4E60;&#x3002;&#x5047;&#x8BBE;&#x4F60;&#x6709;10&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x800C;&#x4E0D;&#x662F;2&#x4E2A;&#xFF0C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x4E00;&#x5C42;&#x662F;3&#xD7;3&#xD7;3&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;&#x8FD9;&#x4E00;&#x5C42;&#x6709;&#x591A;&#x5C11;&#x4E2A;&#x53C2;&#x6570;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x6765;&#x8BA1;&#x7B97;&#x4E00;&#x4E0B;&#xFF0C;&#x6BCF;&#x4E00;&#x5C42;&#x90FD;&#x662F;&#x4E00;&#x4E2A;3&#xD7;3&#xD7;3&#x7684;&#x77E9;&#x9635;&#xFF0C;&#x56E0;&#x6B64;&#x6BCF;&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#x6709;27&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;27&#x4E2A;&#x6570;&#x3002;&#x7136;&#x540E;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&#x504F;&#x5DEE;&#xFF0C;&#x7528;&#x53C2;&#x6570;$b$&#x8868;&#x793A;&#xFF0C;&#x73B0;&#x5728;&#x53C2;&#x6570;&#x589E;&#x52A0;&#x5230;28&#x4E2A;&#x3002;&#x4E0A;&#x4E00;&#x9875;&#x5E7B;&#x706F;&#x7247;&#x91CC;&#x6211;&#x753B;&#x4E86;2&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x800C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6709;10&#x4E2A;&#xFF0C;&#x52A0;&#x5728;&#x4E00;&#x8D77;&#x662F;28&#xD7;10&#xFF0C;&#x4E5F;&#x5C31;&#x662F;280&#x4E2A;&#x53C2;&#x6570;&#x3002;</p>
<p>&#x8BF7;&#x6CE8;&#x610F;&#x4E00;&#x70B9;&#xFF0C;&#x4E0D;&#x8BBA;&#x8F93;&#x5165;&#x56FE;&#x7247;&#x6709;&#x591A;&#x5927;&#xFF0C;1000&#xD7;1000&#x4E5F;&#x597D;&#xFF0C;5000&#xD7;5000&#x4E5F;&#x597D;&#xFF0C;&#x53C2;&#x6570;&#x59CB;&#x7EC8;&#x90FD;&#x662F;280&#x4E2A;&#x3002;&#x7528;&#x8FD9;10&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#x6765;&#x63D0;&#x53D6;&#x7279;&#x5F81;&#xFF0C;&#x5982;&#x5782;&#x76F4;&#x8FB9;&#x7F18;&#xFF0C;&#x6C34;&#x5E73;&#x8FB9;&#x7F18;&#x548C;&#x5176;&#x5B83;&#x7279;&#x5F81;&#x3002;&#x5373;&#x4F7F;&#x8FD9;&#x4E9B;&#x56FE;&#x7247;&#x5F88;&#x5927;&#xFF0C;&#x53C2;&#x6570;&#x5374;&#x5F88;&#x5C11;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x4E00;&#x4E2A;&#x7279;&#x5F81;&#xFF0C;&#x53EB;&#x4F5C;&#x201C;<strong>&#x907F;&#x514D;&#x8FC7;&#x62DF;&#x5408;</strong>&#x201D;&#x3002;&#x4F60;&#x5DF2;&#x7ECF;&#x77E5;&#x9053;&#x5230;&#x5982;&#x4F55;&#x63D0;&#x53D6;10&#x4E2A;&#x7279;&#x5F81;&#xFF0C;&#x53EF;&#x4EE5;&#x5E94;&#x7528;&#x5230;&#x5927;&#x56FE;&#x7247;&#x4E2D;&#xFF0C;&#x800C;&#x53C2;&#x6570;&#x6570;&#x91CF;&#x56FA;&#x5B9A;&#x4E0D;&#x53D8;&#xFF0C;&#x6B64;&#x4F8B;&#x4E2D;&#x53EA;&#x6709;28&#x4E2A;&#xFF0C;&#x76F8;&#x5BF9;&#x8F83;&#x5C11;&#x3002;</p>
<p>&#x6700;&#x540E;&#x6211;&#x4EEC;&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#x7528;&#x4E8E;&#x63CF;&#x8FF0;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x4E00;&#x5C42;&#xFF08;&#x4EE5;$l$&#x5C42;&#x4E3A;&#x4F8B;&#xFF09;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5377;&#x79EF;&#x5C42;&#x7684;&#x5404;&#x79CD;&#x6807;&#x8BB0;&#x3002;</p>
<p><img src="../images/0582fe0191d4ffe37f29f0f8a8bdd69e.png" alt=""></p>
<p>&#x8FD9;&#x4E00;&#x5C42;&#x662F;&#x5377;&#x79EF;&#x5C42;&#xFF0C;&#x7528;$f^{[l]}$&#x8868;&#x793A;&#x8FC7;&#x6EE4;&#x5668;&#x5927;&#x5C0F;&#xFF0C;&#x6211;&#x4EEC;&#x8BF4;&#x8FC7;&#x8FC7;&#x6EE4;&#x5668;&#x5927;&#x5C0F;&#x4E3A;$f&#xD7;f$&#xFF0C;&#x4E0A;&#x6807;$\lbrack l\rbrack$&#x8868;&#x793A;$l$&#x5C42;&#x4E2D;&#x8FC7;&#x6EE4;&#x5668;&#x5927;&#x5C0F;&#x4E3A;$f&#xD7;f$&#x3002;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E0A;&#x6807;$\lbrack l\rbrack$&#x7528;&#x6765;&#x6807;&#x8BB0;$l$&#x5C42;&#x3002;&#x7528;$p^{[l]}$&#x6765;&#x6807;&#x8BB0;<strong>padding</strong>&#x7684;&#x6570;&#x91CF;&#xFF0C;<strong>padding</strong>&#x6570;&#x91CF;&#x4E5F;&#x53EF;&#x6307;&#x5B9A;&#x4E3A;&#x4E00;&#x4E2A;<strong>valid</strong>&#x5377;&#x79EF;&#xFF0C;&#x5373;&#x65E0;<strong>padding</strong>&#x3002;&#x6216;&#x662F;<strong>same</strong>&#x5377;&#x79EF;&#xFF0C;&#x5373;&#x9009;&#x5B9A;<strong>padding</strong>&#xFF0C;&#x5982;&#x6B64;&#x4E00;&#x6765;&#xFF0C;&#x8F93;&#x51FA;&#x548C;&#x8F93;&#x5165;&#x56FE;&#x7247;&#x7684;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#x5C31;&#x76F8;&#x540C;&#x4E86;&#x3002;&#x7528;$s^{[l]}$&#x6807;&#x8BB0;&#x6B65;&#x5E45;&#x3002;</p>
<p>&#x8FD9;&#x4E00;&#x5C42;&#x7684;&#x8F93;&#x5165;&#x4F1A;&#x662F;&#x67D0;&#x4E2A;&#x7EF4;&#x5EA6;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8868;&#x793A;&#x4E3A;$n \times n \times n<em>{c}$&#xFF0C;$n</em>{c}$&#x67D0;&#x5C42;&#x4E0A;&#x7684;&#x989C;&#x8272;&#x901A;&#x9053;&#x6570;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x8981;&#x7A0D;&#x4F5C;&#x4FEE;&#x6539;&#xFF0C;&#x589E;&#x52A0;&#x4E0A;&#x6807;$\lbrack l -1\rbrack$&#xFF0C;&#x5373;$n^{\left\lbrack l - 1 \right\rbrack} \times n^{\left\lbrack l -1 \right\rbrack} \times n_{c}^{\left\lbrack l - 1\right\rbrack}$&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x662F;&#x4E0A;&#x4E00;&#x5C42;&#x7684;&#x6FC0;&#x6D3B;&#x503C;&#x3002;</p>
<p>&#x6B64;&#x4F8B;&#x4E2D;&#xFF0C;&#x6240;&#x7528;&#x56FE;&#x7247;&#x7684;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#x90FD;&#x4E00;&#x6837;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x4E5F;&#x6709;&#x53EF;&#x80FD;&#x4E0D;&#x540C;&#xFF0C;&#x6240;&#x4EE5;&#x5206;&#x522B;&#x7528;&#x4E0A;&#x4E0B;&#x6807;$H$&#x548C;$W$&#x6765;&#x6807;&#x8BB0;&#xFF0C;&#x5373;$n<em>{H}^{\left\lbrack l - 1 \right\rbrack} \times n</em>{W}^{\left\lbrack l - 1 \right\rbrack} \times n<em>{c}^{\left\lbrack l - 1\right\rbrack}$&#x3002;&#x90A3;&#x4E48;&#x5728;&#x7B2C;$l$&#x5C42;&#xFF0C;&#x56FE;&#x7247;&#x5927;&#x5C0F;&#x4E3A;$n</em>{H}^{\left\lbrack l - 1 \right\rbrack} \times n<em>{W}^{\left\lbrack l - 1  \right\rbrack} \times n</em>{c}^{\left\lbrack l - 1\right\rbrack}$&#xFF0C;$l$&#x5C42;&#x7684;&#x8F93;&#x5165;&#x5C31;&#x662F;&#x4E0A;&#x4E00;&#x5C42;&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x56E0;&#x6B64;&#x4E0A;&#x6807;&#x8981;&#x7528;$\lbrack l - 1\rbrack$&#x3002;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8FD9;&#x4E00;&#x5C42;&#x4E2D;&#x4F1A;&#x6709;&#x8F93;&#x51FA;&#xFF0C;&#x5B83;&#x672C;&#x8EAB;&#x4F1A;&#x8F93;&#x51FA;&#x56FE;&#x50CF;&#x3002;&#x5176;&#x5927;&#x5C0F;&#x4E3A;$n<em>{H}^{[l]} \times n</em>{W}^{[l]} \times n_{c}^{[l]}$&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x8F93;&#x51FA;&#x56FE;&#x50CF;&#x7684;&#x5927;&#x5C0F;&#x3002;</p>
<p>&#x524D;&#x9762;&#x6211;&#x4EEC;&#x63D0;&#x5230;&#x8FC7;&#xFF0C;&#x8FD9;&#x4E2A;&#x516C;&#x5F0F;&#x7ED9;&#x51FA;&#x4E86;&#x8F93;&#x51FA;&#x56FE;&#x7247;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x81F3;&#x5C11;&#x7ED9;&#x51FA;&#x4E86;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#xFF0C;$\lfloor\frac{n+2p - f}{s} + 1\rfloor$&#xFF08;&#x6CE8;&#x610F;&#xFF1A;&#xFF08;$\frac{n + 2p - f}{s} +1)$&#x76F4;&#x63A5;&#x7528;&#x8FD9;&#x4E2A;&#x8FD0;&#x7B97;&#x7ED3;&#x679C;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5411;&#x4E0B;&#x53D6;&#x6574;&#xFF09;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x65B0;&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#xFF0C;$l$&#x5C42;&#x8F93;&#x51FA;&#x56FE;&#x50CF;&#x7684;&#x9AD8;&#x5EA6;&#xFF0C;&#x5373;$n<em>{H}^{[l]} = \lfloor\frac{n</em>{H}^{\left\lbrack l - 1 \right\rbrack} +2p^{[l]} - f^{[l]}}{s^{[l]}} +1\rfloor$&#xFF0C;&#x540C;&#x6837;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8BA1;&#x7B97;&#x51FA;&#x56FE;&#x50CF;&#x7684;&#x5BBD;&#x5EA6;&#xFF0C;&#x7528;$W$&#x66FF;&#x6362;&#x53C2;&#x6570;$H$&#xFF0C;&#x5373;$n<em>{W}^{[l]} = \lfloor\frac{n</em>{W}^{\left\lbrack l - 1 \right\rbrack} +2p^{[l]} - f^{[l]}}{s^{[l]}} +1\rfloor$&#xFF0C;&#x516C;&#x5F0F;&#x4E00;&#x6837;&#xFF0C;&#x53EA;&#x8981;&#x53D8;&#x5316;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#x7684;&#x53C2;&#x6570;&#x6211;&#x4EEC;&#x4FBF;&#x80FD;&#x8BA1;&#x7B97;&#x8F93;&#x51FA;&#x56FE;&#x50CF;&#x7684;&#x9AD8;&#x5EA6;&#x6216;&#x5BBD;&#x5EA6;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x7531;$n<em>{H}^{\left\lbrack l - 1 \right\rbrack}$&#x63A8;&#x5BFC;$n</em>{H}^{[l]}$&#x4EE5;&#x53CA;$n<em>{W}^{\left\lbrack l - 1\right\rbrack}$&#x63A8;&#x5BFC;$n</em>{W}^{[l]}$&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x901A;&#x9053;&#x6570;&#x91CF;&#x53C8;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x8FD9;&#x4E9B;&#x6570;&#x5B57;&#x4ECE;&#x54EA;&#x513F;&#x6765;&#x7684;&#xFF1F;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E0B;&#x3002;&#x8F93;&#x51FA;&#x56FE;&#x50CF;&#x4E5F;&#x5177;&#x6709;&#x6DF1;&#x5EA6;&#xFF0C;&#x901A;&#x8FC7;&#x4E0A;&#x4E00;&#x4E2A;&#x793A;&#x4F8B;&#xFF0C;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x5B83;&#x7B49;&#x4E8E;&#x8BE5;&#x5C42;&#x4E2D;&#x8FC7;&#x6EE4;&#x5668;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x5982;&#x679C;&#x6709;2&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x8F93;&#x51FA;&#x56FE;&#x50CF;&#x5C31;&#x662F;4&#xD7;4&#xD7;2&#xFF0C;&#x5B83;&#x662F;&#x4E8C;&#x7EF4;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x6709;10&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x8F93;&#x51FA;&#x56FE;&#x50CF;&#x5C31;&#x662F;4&#xD7;4&#xD7;10&#x3002;&#x8F93;&#x51FA;&#x56FE;&#x50CF;&#x4E2D;&#x7684;&#x901A;&#x9053;&#x6570;&#x91CF;&#x5C31;&#x662F;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x8FD9;&#x4E00;&#x5C42;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x7684;&#x6570;&#x91CF;&#x3002;&#x5982;&#x4F55;&#x786E;&#x5B9A;&#x8FC7;&#x6EE4;&#x5668;&#x7684;&#x5927;&#x5C0F;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x5377;&#x79EF;&#x4E00;&#x4E2A;6&#xD7;6&#xD7;3&#x7684;&#x56FE;&#x7247;&#x9700;&#x8981;&#x4E00;&#x4E2A;3&#xD7;3&#xD7;3&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x56E0;&#x6B64;&#x8FC7;&#x6EE4;&#x5668;&#x4E2D;&#x901A;&#x9053;&#x7684;&#x6570;&#x91CF;&#x5FC5;&#x987B;&#x4E0E;&#x8F93;&#x5165;&#x4E2D;&#x901A;&#x9053;&#x7684;&#x6570;&#x91CF;&#x4E00;&#x81F4;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8F93;&#x51FA;&#x901A;&#x9053;&#x6570;&#x91CF;&#x5C31;&#x662F;&#x8F93;&#x5165;&#x901A;&#x9053;&#x6570;&#x91CF;&#xFF0C;&#x6240;&#x4EE5;&#x8FC7;&#x6EE4;&#x5668;&#x7EF4;&#x5EA6;&#x7B49;&#x4E8E;$f^{[l]} \times f^{[l]} \times n_{c}^{\left\lbrack l - 1 \right\rbrack}$&#x3002;</p>
<p><img src="../images/53d04d8ee616c7468e5b92da95c0e22b.png" alt=""></p>
<p>&#x5E94;&#x7528;&#x504F;&#x5DEE;&#x548C;&#x975E;&#x7EBF;&#x6027;&#x51FD;&#x6570;&#x4E4B;&#x540E;&#xFF0C;&#x8FD9;&#x4E00;&#x5C42;&#x7684;&#x8F93;&#x51FA;&#x7B49;&#x4E8E;&#x5B83;&#x7684;&#x6FC0;&#x6D3B;&#x503C;$a^{[l]}$&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x7EF4;&#x5EA6;&#xFF08;&#x8F93;&#x51FA;&#x7EF4;&#x5EA6;&#xFF09;&#x3002;$a^{[l]}$&#x662F;&#x4E00;&#x4E2A;&#x4E09;&#x7EF4;&#x4F53;&#xFF0C;&#x5373;$n<em>{H}^{[l]} \times n</em>{W}^{[l]} \times n<em>{c}^{[l]}$&#x3002;&#x5F53;&#x4F60;&#x6267;&#x884C;&#x6279;&#x91CF;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x6216;&#x5C0F;&#x6279;&#x91CF;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x6709;$m$&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5C31;&#x662F;&#x6709;$m$&#x4E2A;&#x6FC0;&#x6D3B;&#x503C;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x90A3;&#x4E48;&#x8F93;&#x51FA;$A^{[l]} = m \times n</em>{H}^{[l]} \times n<em>{W}^{[l]} \times n</em>{c}^{[l]}$&#x3002;&#x5982;&#x679C;&#x91C7;&#x7528;&#x6279;&#x91CF;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#xFF0C;&#x53D8;&#x91CF;&#x7684;&#x6392;&#x5217;&#x987A;&#x5E8F;&#x5982;&#x4E0B;&#xFF0C;&#x9996;&#x5148;&#x662F;&#x7D22;&#x5F15;&#x548C;&#x8BAD;&#x7EC3;&#x793A;&#x4F8B;&#xFF0C;&#x7136;&#x540E;&#x662F;&#x5176;&#x5B83;&#x4E09;&#x4E2A;&#x53D8;&#x91CF;&#x3002;</p>
<p>&#x8BE5;&#x5982;&#x4F55;&#x786E;&#x5B9A;&#x6743;&#x91CD;&#x53C2;&#x6570;&#xFF0C;&#x5373;&#x53C2;&#x6570;W&#x5462;&#xFF1F;&#x8FC7;&#x6EE4;&#x5668;&#x7684;&#x7EF4;&#x5EA6;&#x5DF2;&#x77E5;&#xFF0C;&#x4E3A;$f^{[l]} \times  f^{[l]} \times  n<em>{c}^{[l - 1]}$&#xFF0C;&#x8FD9;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#x7684;&#x7EF4;&#x5EA6;&#xFF0C;&#x6709;&#x591A;&#x5C11;&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x8FD9;&#xFF08;$n</em>{c}^{[l]}$&#xFF09;&#x662F;&#x8FC7;&#x6EE4;&#x5668;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x6743;&#x91CD;&#x4E5F;&#x5C31;&#x662F;&#x6240;&#x6709;&#x8FC7;&#x6EE4;&#x5668;&#x7684;&#x96C6;&#x5408;&#x518D;&#x4E58;&#x4EE5;&#x8FC7;&#x6EE4;&#x5668;&#x7684;&#x603B;&#x6570;&#x91CF;&#xFF0C;&#x5373;$f^{[l]} \times f^{[l]} \times  n<em>{c}^{[l - 1]} \times n</em>{c}^{[l]}$&#xFF0C;&#x635F;&#x5931;&#x6570;&#x91CF;L&#x5C31;&#x662F;$l$&#x5C42;&#x4E2D;&#x8FC7;&#x6EE4;&#x5668;&#x7684;&#x4E2A;&#x6570;&#x3002;</p>
<p>&#x6700;&#x540E;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x504F;&#x5DEE;&#x53C2;&#x6570;&#xFF0C;&#x6BCF;&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x504F;&#x5DEE;&#x53C2;&#x6570;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x5B9E;&#x6570;&#x3002;&#x504F;&#x5DEE;&#x5305;&#x542B;&#x4E86;&#x8FD9;&#x4E9B;&#x53D8;&#x91CF;&#xFF0C;&#x5B83;&#x662F;&#x8BE5;&#x7EF4;&#x5EA6;&#x4E0A;&#x7684;&#x4E00;&#x4E2A;&#x5411;&#x91CF;&#x3002;&#x540E;&#x7EED;&#x8BFE;&#x7A0B;&#x4E2D;&#x6211;&#x4EEC;&#x4F1A;&#x770B;&#x5230;&#xFF0C;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#xFF0C;&#x504F;&#x5DEE;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x8868;&#x793A;&#x4E3A;&#x4E00;&#x4E2A;1&#xD7;1&#xD7;1&#xD7;$n_{c}^{[l]}$&#x7684;&#x56DB;&#x7EF4;&#x5411;&#x91CF;&#x6216;&#x56DB;&#x7EF4;&#x5F20;&#x91CF;&#x3002;</p>
<p><img src="../images/254491a07bfca29fee5eb75cde43e3f9.png" alt=""></p>
<p>&#x5377;&#x79EF;&#x6709;&#x5F88;&#x591A;&#x79CD;&#x6807;&#x8BB0;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x4EEC;&#x6700;&#x5E38;&#x7528;&#x7684;&#x5377;&#x79EF;&#x7B26;&#x53F7;&#x3002;&#x5927;&#x5BB6;&#x5728;&#x7EBF;&#x641C;&#x7D22;&#x6216;&#x67E5;&#x770B;&#x5F00;&#x6E90;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x5173;&#x4E8E;&#x9AD8;&#x5EA6;&#xFF0C;&#x5BBD;&#x5EA6;&#x548C;&#x901A;&#x9053;&#x7684;&#x987A;&#x5E8F;&#x5E76;&#x6CA1;&#x6709;&#x5B8C;&#x5168;&#x7EDF;&#x4E00;&#x7684;&#x6807;&#x51C6;&#x5377;&#x79EF;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x67E5;&#x770B;<strong>GitHub</strong>&#x4E0A;&#x7684;&#x6E90;&#x4EE3;&#x7801;&#x6216;&#x9605;&#x8BFB;&#x4E00;&#x4E9B;&#x5F00;&#x6E90;&#x5B9E;&#x73B0;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x6709;&#x4E9B;&#x4F5C;&#x8005;&#x4F1A;&#x91C7;&#x7528;&#x628A;&#x901A;&#x9053;&#x653E;&#x5728;&#x9996;&#x4F4D;&#x7684;&#x7F16;&#x7801;&#x6807;&#x51C6;&#xFF0C;&#x6709;&#x65F6;&#x6240;&#x6709;&#x53D8;&#x91CF;&#x90FD;&#x91C7;&#x7528;&#x8FD9;&#x79CD;&#x6807;&#x51C6;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#x5728;&#x67D0;&#x4E9B;&#x67B6;&#x6784;&#x4E2D;&#xFF0C;&#x5F53;&#x68C0;&#x7D22;&#x8FD9;&#x4E9B;&#x56FE;&#x7247;&#x65F6;&#xFF0C;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x6216;&#x53C2;&#x6570;&#x6765;&#x6807;&#x8BC6;&#x8BA1;&#x7B97;&#x901A;&#x9053;&#x6570;&#x91CF;&#x548C;&#x901A;&#x9053;&#x635F;&#x5931;&#x6570;&#x91CF;&#x7684;&#x5148;&#x540E;&#x987A;&#x5E8F;&#x3002;&#x53EA;&#x8981;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#xFF0C;&#x8FD9;&#x4E24;&#x79CD;&#x5377;&#x79EF;&#x6807;&#x51C6;&#x90FD;&#x53EF;&#x7528;&#x3002;&#x5F88;&#x9057;&#x61BE;&#xFF0C;&#x8FD9;&#x53EA;&#x662F;&#x4E00;&#x90E8;&#x5206;&#x6807;&#x8BB0;&#x6CD5;&#xFF0C;&#x56E0;&#x4E3A;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x6587;&#x732E;&#x5E76;&#x672A;&#x5BF9;&#x6807;&#x8BB0;&#x8FBE;&#x6210;&#x4E00;&#x81F4;&#xFF0C;&#x4F46;&#x8BFE;&#x4E0A;&#x6211;&#x4F1A;&#x91C7;&#x7528;&#x8FD9;&#x79CD;&#x5377;&#x79EF;&#x6807;&#x8BC6;&#x6CD5;&#xFF0C;&#x6309;&#x9AD8;&#x5EA6;&#xFF0C;&#x5BBD;&#x5EA6;&#x548C;&#x901A;&#x9053;&#x635F;&#x5931;&#x6570;&#x91CF;&#x7684;&#x987A;&#x5E8F;&#x4F9D;&#x6B21;&#x8BA1;&#x7B97;&#x3002;</p>
<p><img src="../images/522eb892bf05adbb57f3ff51bd876149.png" alt=""></p>
<p>&#x6211;&#x77E5;&#x9053;&#xFF0C;&#x5FFD;&#x7136;&#x95F4;&#x63A5;&#x89E6;&#x5230;&#x8FD9;&#x4E48;&#x591A;&#x65B0;&#x7684;&#x6807;&#x8BB0;&#x65B9;&#x6CD5;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E48;&#x591A;&#x600E;&#x4E48;&#x8BB0;&#x5462;&#xFF1F;&#x522B;&#x62C5;&#x5FC3;&#xFF0C;&#x4E0D;&#x7528;&#x5168;&#x90FD;&#x8BB0;&#x4F4F;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x672C;&#x5468;&#x7684;&#x7EC3;&#x4E60;&#x6765;&#x719F;&#x6089;&#x5B83;&#x4EEC;&#x3002;&#x800C;&#x8FD9;&#x8282;&#x8BFE;&#x6211;&#x60F3;&#x8BB2;&#x7684;&#x91CD;&#x70B9;&#x662F;&#xFF0C;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x67D0;&#x4E00;&#x5377;&#x79EF;&#x5C42;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x8BA1;&#x7B97;&#x67D0;&#x4E00;&#x5377;&#x79EF;&#x5C42;&#x7684;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF0C;&#x5E76;&#x6620;&#x5C04;&#x5230;&#x4E0B;&#x4E00;&#x5C42;&#x7684;&#x6FC0;&#x6D3B;&#x503C;&#x3002;&#x4E86;&#x89E3;&#x4E86;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x67D0;&#x4E00;&#x5377;&#x79EF;&#x5C42;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x628A;&#x5B83;&#x4EEC;&#x5806;&#x53E0;&#x8D77;&#x6765;&#x5F62;&#x6210;&#x4E00;&#x4E2A;&#x6DF1;&#x5EA6;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x6211;&#x4EEC;&#x4E0B;&#x8282;&#x8BFE;&#x518D;&#x8BB2;&#x3002;</p>
<h3 id="18-&#x7B80;&#x5355;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x793A;&#x4F8B;&#xFF08;a-simple-convolution-network-example&#xFF09;">1.8 &#x7B80;&#x5355;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x793A;&#x4F8B;&#xFF08;A simple convolution network example&#xFF09;</h3>
<p>&#x4E0A;&#x8282;&#x8BFE;&#xFF0C;&#x6211;&#x4EEC;&#x8BB2;&#x4E86;&#x5982;&#x4F55;&#x4E3A;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x3002;&#x4ECA;&#x5929;&#x6211;&#x4EEC;&#x770B;&#x4E00;&#x4E2A;&#x6DF1;&#x5EA6;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x5177;&#x4F53;&#x793A;&#x4F8B;&#xFF0C;&#x987A;&#x4FBF;&#x7EC3;&#x4E60;&#x4E00;&#x4E0B;&#x6211;&#x4EEC;&#x4E0A;&#x8282;&#x8BFE;&#x6240;&#x5B66;&#x7684;&#x6807;&#x8BB0;&#x6CD5;&#x3002;</p>
<p>&#x5047;&#x8BBE;&#x4F60;&#x6709;&#x4E00;&#x5F20;&#x56FE;&#x7247;&#xFF0C;&#x4F60;&#x60F3;&#x505A;&#x56FE;&#x7247;&#x5206;&#x7C7B;&#x6216;&#x56FE;&#x7247;&#x8BC6;&#x522B;&#xFF0C;&#x628A;&#x8FD9;&#x5F20;&#x56FE;&#x7247;&#x8F93;&#x5165;&#x5B9A;&#x4E49;&#x4E3A;$x$&#xFF0C;&#x7136;&#x540E;&#x8FA8;&#x522B;&#x56FE;&#x7247;&#x4E2D;&#x6709;&#x6CA1;&#x6709;&#x732B;&#xFF0C;&#x7528;0&#x6216;1&#x8868;&#x793A;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x6784;&#x5EFA;&#x9002;&#x7528;&#x4E8E;&#x8FD9;&#x9879;&#x4EFB;&#x52A1;&#x7684;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;&#x9488;&#x5BF9;&#x8FD9;&#x4E2A;&#x793A;&#x4F8B;&#xFF0C;&#x6211;&#x7528;&#x4E86;&#x4E00;&#x5F20;&#x6BD4;&#x8F83;&#x5C0F;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x5927;&#x5C0F;&#x662F;39&#xD7;39&#xD7;3&#xFF0C;&#x8FD9;&#x6837;&#x8BBE;&#x5B9A;&#x53EF;&#x4EE5;&#x4F7F;&#x5176;&#x4E2D;&#x4E00;&#x4E9B;&#x6570;&#x5B57;&#x6548;&#x679C;&#x66F4;&#x597D;&#x3002;&#x6240;&#x4EE5;$n<em>{H}^{[0]} = n</em>{W}^{[0]}$&#xFF0C;&#x5373;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#x90FD;&#x7B49;&#x4E8E;39&#xFF0C;$n_{c}^{[0]} =3$&#xFF0C;&#x5373;0&#x5C42;&#x7684;&#x901A;&#x9053;&#x6570;&#x4E3A;3&#x3002;</p>
<p><img src="../images/84aa3be646a1e61f880fb8ab77ac92c7.png" alt=""></p>
<p>&#x5047;&#x8BBE;&#x7B2C;&#x4E00;&#x5C42;&#x6211;&#x4EEC;&#x7528;&#x4E00;&#x4E2A;3&#xD7;3&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x6765;&#x63D0;&#x53D6;&#x7279;&#x5F81;&#xFF0C;&#x90A3;&#x4E48;$f^{[1]} = 3$&#xFF0C;&#x56E0;&#x4E3A;&#x8FC7;&#x6EE4;&#x5668;&#x65F6;3&#xD7;3&#x7684;&#x77E9;&#x9635;&#x3002;$s^{[1]} = 1$&#xFF0C;$p^{[1]} =0$&#xFF0C;&#x6240;&#x4EE5;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#x4F7F;&#x7528;<strong>valid</strong>&#x5377;&#x79EF;&#x3002;&#x5982;&#x679C;&#x6709;10&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E0B;&#x4E00;&#x5C42;&#x7684;&#x6FC0;&#x6D3B;&#x503C;&#x4E3A;37&#xD7;37&#xD7;10&#xFF0C;&#x5199;10&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x7528;&#x4E86;10&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;37&#x662F;&#x516C;&#x5F0F;$\frac{n + 2p - f}{s} + 1$&#x7684;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;$\frac{39 + 0 - 3}{1} + 1 = 37$&#xFF0C;&#x6240;&#x4EE5;&#x8F93;&#x51FA;&#x662F;37&#xD7;37&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;<strong>vaild</strong>&#x5377;&#x79EF;&#xFF0C;&#x8FD9;&#x662F;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x7684;&#x5927;&#x5C0F;&#x3002;&#x7B2C;&#x4E00;&#x5C42;&#x6807;&#x8BB0;&#x4E3A;$n<em>{H}^{[1]} = n</em>{W}^{[1]} = 37$&#xFF0C;$n<em>{c}^{[1]} = 10$&#xFF0C;$n</em>{c}^{[1]}$&#x7B49;&#x4E8E;&#x7B2C;&#x4E00;&#x5C42;&#x4E2D;&#x8FC7;&#x6EE4;&#x5668;&#x7684;&#x4E2A;&#x6570;&#xFF0C;&#x8FD9;&#xFF08;37&#xD7;37&#xD7;10&#xFF09;&#x662F;&#x7B2C;&#x4E00;&#x5C42;&#x6FC0;&#x6D3B;&#x503C;&#x7684;&#x7EF4;&#x5EA6;&#x3002;</p>
<p><img src="../images/2e56c91e1e90260de922b5055a37e5e4.png" alt=""></p>
<p>&#x5047;&#x8BBE;&#x8FD8;&#x6709;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#xFF0C;&#x8FD9;&#x6B21;&#x6211;&#x4EEC;&#x91C7;&#x7528;&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x662F;5&#xD7;5&#x7684;&#x77E9;&#x9635;&#x3002;&#x5728;&#x6807;&#x8BB0;&#x6CD5;&#x4E2D;&#xFF0C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E0B;&#x4E00;&#x5C42;&#x7684;$f=5$&#xFF0C;&#x5373;$f^{\left\lbrack 2 \right\rbrack} = 5$&#x6B65;&#x5E45;&#x4E3A;2&#xFF0C;&#x5373;$s^{\left\lbrack 2 \right\rbrack} = 2$&#x3002;<strong>padding</strong>&#x4E3A;0&#xFF0C;&#x5373;$p^{\left\lbrack 2 \right\rbrack} = 0$&#xFF0C;&#x4E14;&#x6709;20&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#x3002;&#x6240;&#x4EE5;&#x5176;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x4F1A;&#x662F;&#x4E00;&#x5F20;&#x65B0;&#x56FE;&#x50CF;&#xFF0C;&#x8FD9;&#x6B21;&#x7684;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x4E3A;17&#xD7;17&#xD7;20&#xFF0C;&#x56E0;&#x4E3A;&#x6B65;&#x5E45;&#x662F;2&#xFF0C;&#x7EF4;&#x5EA6;&#x7F29;&#x5C0F;&#x5F97;&#x5F88;&#x5FEB;&#xFF0C;&#x5927;&#x5C0F;&#x4ECE;37&#xD7;37&#x51CF;&#x5C0F;&#x5230;17&#xD7;17&#xFF0C;&#x51CF;&#x5C0F;&#x4E86;&#x4E00;&#x534A;&#x8FD8;&#x591A;&#xFF0C;&#x8FC7;&#x6EE4;&#x5668;&#x662F;20&#x4E2A;&#xFF0C;&#x6240;&#x4EE5;&#x901A;&#x9053;&#x6570;&#x4E5F;&#x662F;20&#xFF0C;17&#xD7;17&#xD7;20&#x5373;&#x6FC0;&#x6D3B;&#x503C;$a^{\left\lbrack 2 \right\rbrack}$&#x7684;&#x7EF4;&#x5EA6;&#x3002;&#x56E0;&#x6B64;$n<em>{H}^{\left\lbrack 2 \right\rbrack} = n</em>{W}^{\left\lbrack 2 \right\rbrack} = 17$&#xFF0C;$n_{c}^{\left\lbrack 2 \right\rbrack} = 20$&#x3002;</p>
<p><img src="../images/7181dca1d3663d558944cbfd428c4727.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x6765;&#x6784;&#x5EFA;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#xFF0C;&#x5047;&#x8BBE;&#x8FC7;&#x6EE4;&#x5668;&#x8FD8;&#x662F;5&#xD7;5&#xFF0C;&#x6B65;&#x5E45;&#x4E3A;2&#xFF0C;&#x5373;$f^{\left\lbrack 2 \right\rbrack} = 5$&#xFF0C;$s^{\left\lbrack 3 \right\rbrack} = 2$&#xFF0C;&#x8BA1;&#x7B97;&#x8FC7;&#x7A0B;&#x6211;&#x8DF3;&#x8FC7;&#x4E86;&#xFF0C;&#x6700;&#x540E;&#x8F93;&#x51FA;&#x4E3A;7&#xD7;7&#xD7;40&#xFF0C;&#x5047;&#x8BBE;&#x4F7F;&#x7528;&#x4E86;40&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#x3002;<strong>padding</strong>&#x4E3A;0&#xFF0C;40&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x6700;&#x540E;&#x7ED3;&#x679C;&#x4E3A;7&#xD7;7&#xD7;40&#x3002;</p>
<p><img src="../images/f97b7dfd7775fea9f9d18d8b404ad4ef.png" alt=""></p>
<p>&#x5230;&#x6B64;&#xFF0C;&#x8FD9;&#x5F20;39&#xD7;39&#xD7;3&#x7684;&#x8F93;&#x5165;&#x56FE;&#x50CF;&#x5C31;&#x5904;&#x7406;&#x5B8C;&#x6BD5;&#x4E86;&#xFF0C;&#x4E3A;&#x56FE;&#x7247;&#x63D0;&#x53D6;&#x4E86;7&#xD7;7&#xD7;40&#x4E2A;&#x7279;&#x5F81;&#xFF0C;&#x8BA1;&#x7B97;&#x51FA;&#x6765;&#x5C31;&#x662F;1960&#x4E2A;&#x7279;&#x5F81;&#x3002;&#x7136;&#x540E;&#x5BF9;&#x8BE5;&#x5377;&#x79EF;&#x8FDB;&#x884C;&#x5904;&#x7406;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x5E73;&#x6ED1;&#x6216;&#x5C55;&#x5F00;&#x6210;1960&#x4E2A;&#x5355;&#x5143;&#x3002;&#x5E73;&#x6ED1;&#x5904;&#x7406;&#x540E;&#x53EF;&#x4EE5;&#x8F93;&#x51FA;&#x4E00;&#x4E2A;&#x5411;&#x91CF;&#xFF0C;&#x5176;&#x586B;&#x5145;&#x5185;&#x5BB9;&#x662F;<strong>logistic</strong>&#x56DE;&#x5F52;&#x5355;&#x5143;&#x8FD8;&#x662F;<strong>softmax</strong>&#x56DE;&#x5F52;&#x5355;&#x5143;&#xFF0C;&#x5B8C;&#x5168;&#x53D6;&#x51B3;&#x4E8E;&#x6211;&#x4EEC;&#x662F;&#x60F3;&#x8BC6;&#x56FE;&#x7247;&#x4E0A;&#x6709;&#x6CA1;&#x6709;&#x732B;&#xFF0C;&#x8FD8;&#x662F;&#x60F3;&#x8BC6;&#x522B;$K$&#x79CD;&#x4E0D;&#x540C;&#x5BF9;&#x8C61;&#x4E2D;&#x7684;&#x4E00;&#x79CD;&#xFF0C;&#x7528;$\hat y$&#x8868;&#x793A;&#x6700;&#x7EC8;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x9884;&#x6D4B;&#x8F93;&#x51FA;&#x3002;&#x660E;&#x786E;&#x4E00;&#x70B9;&#xFF0C;&#x6700;&#x540E;&#x8FD9;&#x4E00;&#x6B65;&#x662F;&#x5904;&#x7406;&#x6240;&#x6709;&#x6570;&#x5B57;&#xFF0C;&#x5373;&#x5168;&#x90E8;&#x7684;1960&#x4E2A;&#x6570;&#x5B57;&#xFF0C;&#x628A;&#x5B83;&#x4EEC;&#x5C55;&#x5F00;&#x6210;&#x4E00;&#x4E2A;&#x5F88;&#x957F;&#x7684;&#x5411;&#x91CF;&#x3002;&#x4E3A;&#x4E86;&#x9884;&#x6D4B;&#x6700;&#x7EC8;&#x7684;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x8FD9;&#x4E2A;&#x957F;&#x5411;&#x91CF;&#x586B;&#x5145;&#x5230;<strong>softmax</strong>&#x56DE;&#x5F52;&#x51FD;&#x6570;&#x4E2D;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x8303;&#x4F8B;&#xFF0C;&#x8BBE;&#x8BA1;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x65F6;&#xFF0C;&#x786E;&#x5B9A;&#x8FD9;&#x4E9B;&#x8D85;&#x53C2;&#x6570;&#x6BD4;&#x8F83;&#x8D39;&#x5DE5;&#x592B;&#x3002;&#x8981;&#x51B3;&#x5B9A;&#x8FC7;&#x6EE4;&#x5668;&#x7684;&#x5927;&#x5C0F;&#x3001;&#x6B65;&#x5E45;&#x3001;<strong>padding</strong>&#x4EE5;&#x53CA;&#x4F7F;&#x7528;&#x591A;&#x5C11;&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#x3002;&#x8FD9;&#x5468;&#x548C;&#x4E0B;&#x5468;&#xFF0C;&#x6211;&#x4F1A;&#x9488;&#x5BF9;&#x9009;&#x62E9;&#x53C2;&#x6570;&#x7684;&#x95EE;&#x9898;&#x63D0;&#x4F9B;&#x4E00;&#x4E9B;&#x5EFA;&#x8BAE;&#x548C;&#x6307;&#x5BFC;&#x3002;</p>
<p><img src="../images/0c09c238ff2bcda0ddd9405d1a60b325.png" alt=""></p>
<p>&#x800C;&#x8FD9;&#x8282;&#x8BFE;&#x4F60;&#x8981;&#x638C;&#x63E1;&#x7684;&#x4E00;&#x70B9;&#x662F;&#xFF0C;&#x968F;&#x7740;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8BA1;&#x7B97;&#x6DF1;&#x5EA6;&#x4E0D;&#x65AD;&#x52A0;&#x6DF1;&#xFF0C;&#x901A;&#x5E38;&#x5F00;&#x59CB;&#x65F6;&#x7684;&#x56FE;&#x50CF;&#x4E5F;&#x8981;&#x66F4;&#x5927;&#x4E00;&#x4E9B;&#xFF0C;&#x521D;&#x59CB;&#x503C;&#x4E3A;39&#xD7;39&#xFF0C;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#x4F1A;&#x5728;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#xFF0C;&#x7136;&#x540E;&#x968F;&#x7740;&#x7F51;&#x7EDC;&#x6DF1;&#x5EA6;&#x7684;&#x52A0;&#x6DF1;&#x800C;&#x9010;&#x6E10;&#x51CF;&#x5C0F;&#xFF0C;&#x4ECE;39&#x5230;37&#xFF0C;&#x518D;&#x5230;17&#xFF0C;&#x6700;&#x540E;&#x5230;7&#x3002;&#x800C;&#x901A;&#x9053;&#x6570;&#x91CF;&#x5728;&#x589E;&#x52A0;&#xFF0C;&#x4ECE;3&#x5230;10&#xFF0C;&#x518D;&#x5230;20&#xFF0C;&#x6700;&#x540E;&#x5230;40&#x3002;&#x5728;&#x8BB8;&#x591A;&#x5176;&#x5B83;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x8FD9;&#x79CD;&#x8D8B;&#x52BF;&#x3002;&#x5173;&#x4E8E;&#x5982;&#x4F55;&#x786E;&#x5B9A;&#x8FD9;&#x4E9B;&#x53C2;&#x6570;&#xFF0C;&#x540E;&#x9762;&#x8BFE;&#x4E0A;&#x6211;&#x4F1A;&#x66F4;&#x8BE6;&#x7EC6;&#x8BB2;&#x89E3;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x4EEC;&#x8BB2;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x793A;&#x4F8B;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x7684;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x901A;&#x5E38;&#x6709;&#x4E09;&#x5C42;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x5377;&#x79EF;&#x5C42;&#xFF0C;&#x6211;&#x4EEC;&#x5E38;&#x5E38;&#x7528;<strong>Conv</strong>&#x6765;&#x6807;&#x6CE8;&#x3002;&#x4E0A;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x6211;&#x7528;&#x7684;&#x5C31;&#x662F;<strong>CONV</strong>&#x3002;&#x8FD8;&#x6709;&#x4E24;&#x79CD;&#x5E38;&#x89C1;&#x7C7B;&#x578B;&#x7684;&#x5C42;&#xFF0C;&#x6211;&#x4EEC;&#x7559;&#x5728;&#x540E;&#x4E24;&#x8282;&#x8BFE;&#x8BB2;&#x3002;&#x4E00;&#x4E2A;&#x662F;&#x6C60;&#x5316;&#x5C42;&#xFF0C;&#x6211;&#x4EEC;&#x79F0;&#x4E4B;&#x4E3A;<strong>POOL</strong>&#x3002;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x662F;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#xFF0C;&#x7528;<strong>FC</strong>&#x8868;&#x793A;&#x3002;&#x867D;&#x7136;&#x4EC5;&#x7528;&#x5377;&#x79EF;&#x5C42;&#x4E5F;&#x6709;&#x53EF;&#x80FD;&#x6784;&#x5EFA;&#x51FA;&#x5F88;&#x597D;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x4F46;&#x5927;&#x90E8;&#x5206;&#x795E;&#x7ECF;&#x671B;&#x697C;&#x67B6;&#x6784;&#x5E08;&#x4F9D;&#x7136;&#x4F1A;&#x6DFB;&#x52A0;&#x6C60;&#x5316;&#x5C42;&#x548C;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x6C60;&#x5316;&#x5C42;&#x548C;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x6BD4;&#x5377;&#x79EF;&#x5C42;&#x66F4;&#x5BB9;&#x6613;&#x8BBE;&#x8BA1;&#x3002;&#x540E;&#x4E24;&#x8282;&#x8BFE;&#x6211;&#x4EEC;&#x4F1A;&#x5FEB;&#x901F;&#x8BB2;&#x89E3;&#x8FD9;&#x4E24;&#x4E2A;&#x6982;&#x5FF5;&#x4EE5;&#x4FBF;&#x4F60;&#x66F4;&#x597D;&#x7684;&#x4E86;&#x89E3;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x6700;&#x5E38;&#x7528;&#x7684;&#x8FD9;&#x51E0;&#x79CD;&#x5C42;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x5B83;&#x4EEC;&#x6784;&#x5EFA;&#x66F4;&#x5F3A;&#x5927;&#x7684;&#x7F51;&#x7EDC;&#x4E86;&#x3002;</p>
<p><img src="../images/02028431085fb7974b76156dd4974b68.png" alt=""></p>
<p>&#x518D;&#x6B21;&#x606D;&#x559C;&#x4F60;&#x5DF2;&#x7ECF;&#x638C;&#x63E1;&#x4E86;&#x7B2C;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x672C;&#x5468;&#x540E;&#x51E0;&#x8282;&#x8BFE;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x8BAD;&#x7EC3;&#x8FD9;&#x4E9B;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;&#x4E0D;&#x8FC7;&#x5728;&#x8FD9;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x8FD8;&#x8981;&#x7B80;&#x5355;&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B;&#x6C60;&#x5316;&#x5C42;&#x548C;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x3002;&#x7136;&#x540E;&#x518D;&#x8BAD;&#x7EC3;&#x8FD9;&#x4E9B;&#x7F51;&#x7EDC;&#xFF0C;&#x5230;&#x65F6;&#x6211;&#x4F1A;&#x7528;&#x5230;&#x5927;&#x5BB6;&#x719F;&#x6089;&#x7684;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x8BAD;&#x7EC3;&#x65B9;&#x6CD5;&#x3002;&#x90A3;&#x4E48;&#x4E0B;&#x8282;&#x8BFE;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x5148;&#x6765;&#x4E86;&#x89E3;&#x5982;&#x4F55;&#x6784;&#x5EFA;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x6C60;&#x5316;&#x5C42;&#x3002;</p>
<h3 id="19-&#x6C60;&#x5316;&#x5C42;&#xFF08;pooling-layers&#xFF09;">1.9 &#x6C60;&#x5316;&#x5C42;&#xFF08;Pooling layers&#xFF09;</h3>
<p>&#x9664;&#x4E86;&#x5377;&#x79EF;&#x5C42;&#xFF0C;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x4E5F;&#x7ECF;&#x5E38;&#x4F7F;&#x7528;&#x6C60;&#x5316;&#x5C42;&#x6765;&#x7F29;&#x51CF;&#x6A21;&#x578B;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x63D0;&#x9AD8;&#x8BA1;&#x7B97;&#x901F;&#x5EA6;&#xFF0C;&#x540C;&#x65F6;&#x63D0;&#x9AD8;&#x6240;&#x63D0;&#x53D6;&#x7279;&#x5F81;&#x7684;&#x9C81;&#x68D2;&#x6027;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E0B;&#x3002;</p>
<p><img src="../images/ac42ede86634922acf4d34b12025b34f.png" alt=""></p>
<p>&#x5148;&#x4E3E;&#x4E00;&#x4E2A;&#x6C60;&#x5316;&#x5C42;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x518D;&#x8BA8;&#x8BBA;&#x6C60;&#x5316;&#x5C42;&#x7684;&#x5FC5;&#x8981;&#x6027;&#x3002;&#x5047;&#x5982;&#x8F93;&#x5165;&#x662F;&#x4E00;&#x4E2A;4&#xD7;4&#x77E9;&#x9635;&#xFF0C;&#x7528;&#x5230;&#x7684;&#x6C60;&#x5316;&#x7C7B;&#x578B;&#x662F;&#x6700;&#x5927;&#x6C60;&#x5316;&#xFF08;<strong>max pooling</strong>&#xFF09;&#x3002;&#x6267;&#x884C;&#x6700;&#x5927;&#x6C60;&#x5316;&#x7684;&#x6811;&#x6C60;&#x662F;&#x4E00;&#x4E2A;2&#xD7;2&#x77E9;&#x9635;&#x3002;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x628A;4&#xD7;4&#x7684;&#x8F93;&#x5165;&#x62C6;&#x5206;&#x6210;&#x4E0D;&#x540C;&#x7684;&#x533A;&#x57DF;&#xFF0C;&#x6211;&#x628A;&#x8FD9;&#x4E2A;&#x533A;&#x57DF;&#x7528;&#x4E0D;&#x540C;&#x989C;&#x8272;&#x6765;&#x6807;&#x8BB0;&#x3002;&#x5BF9;&#x4E8E;2&#xD7;2&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x8F93;&#x51FA;&#x7684;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x90FD;&#x662F;&#x5176;&#x5BF9;&#x5E94;&#x989C;&#x8272;&#x533A;&#x57DF;&#x4E2D;&#x7684;&#x6700;&#x5927;&#x5143;&#x7D20;&#x503C;&#x3002;</p>
<p><img src="../images/9687f796debffce065daa8c654b9b7b7.png" alt=""></p>
<p>&#x5DE6;&#x4E0A;&#x533A;&#x57DF;&#x7684;&#x6700;&#x5927;&#x503C;&#x662F;9&#xFF0C;&#x53F3;&#x4E0A;&#x533A;&#x57DF;&#x7684;&#x6700;&#x5927;&#x5143;&#x7D20;&#x503C;&#x662F;2&#xFF0C;&#x5DE6;&#x4E0B;&#x533A;&#x57DF;&#x7684;&#x6700;&#x5927;&#x503C;&#x662F;6&#xFF0C;&#x53F3;&#x4E0B;&#x533A;&#x57DF;&#x7684;&#x6700;&#x5927;&#x503C;&#x662F;3&#x3002;&#x4E3A;&#x4E86;&#x8BA1;&#x7B97;&#x51FA;&#x53F3;&#x4FA7;&#x8FD9;4&#x4E2A;&#x5143;&#x7D20;&#x503C;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5BF9;&#x8F93;&#x5165;&#x77E9;&#x9635;&#x7684;2&#xD7;2&#x533A;&#x57DF;&#x505A;&#x6700;&#x5927;&#x503C;&#x8FD0;&#x7B97;&#x3002;&#x8FD9;&#x5C31;&#x50CF;&#x662F;&#x5E94;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x89C4;&#x6A21;&#x4E3A;2&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x9009;&#x7528;&#x7684;&#x662F;2&#xD7;2&#x533A;&#x57DF;&#xFF0C;&#x6B65;&#x5E45;&#x662F;2&#xFF0C;&#x8FD9;&#x4E9B;&#x5C31;&#x662F;&#x6700;&#x5927;&#x6C60;&#x5316;&#x7684;&#x8D85;&#x53C2;&#x6570;&#x3002;</p>
<p>&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x4E3A;2&#xD7;2&#xFF0C;&#x6700;&#x540E;&#x8F93;&#x51FA;&#x662F;9&#x3002;&#x7136;&#x540E;&#x5411;&#x53F3;&#x79FB;&#x52A8;2&#x4E2A;&#x6B65;&#x5E45;&#xFF0C;&#x8BA1;&#x7B97;&#x51FA;&#x6700;&#x5927;&#x503C;2&#x3002;&#x7136;&#x540E;&#x662F;&#x7B2C;&#x4E8C;&#x884C;&#xFF0C;&#x5411;&#x4E0B;&#x79FB;&#x52A8;2&#x6B65;&#x5F97;&#x5230;&#x6700;&#x5927;&#x503C;6&#x3002;&#x6700;&#x540E;&#x5411;&#x53F3;&#x79FB;&#x52A8;3&#x6B65;&#xFF0C;&#x5F97;&#x5230;&#x6700;&#x5927;&#x503C;3&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;2&#xD7;2&#x77E9;&#x9635;&#xFF0C;&#x5373;$f=2$&#xFF0C;&#x6B65;&#x5E45;&#x662F;2&#xFF0C;&#x5373;$s=2$&#x3002;</p>
<p><img src="../images/ad5cf6dd7ca9a8ef144d8d918b21b1bc.png" alt=""></p>
<p>&#x8FD9;&#x662F;&#x5BF9;&#x6700;&#x5927;&#x6C60;&#x5316;&#x529F;&#x80FD;&#x7684;&#x76F4;&#x89C2;&#x7406;&#x89E3;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x8FD9;&#x4E2A;4&#xD7;4&#x8F93;&#x5165;&#x770B;&#x4F5C;&#x662F;&#x67D0;&#x4E9B;&#x7279;&#x5F81;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x4E5F;&#x8BB8;&#x4E0D;&#x662F;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x8FD9;&#x4E2A;4&#xD7;4&#x533A;&#x57DF;&#x770B;&#x4F5C;&#x662F;&#x67D0;&#x4E9B;&#x7279;&#x5F81;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x67D0;&#x4E00;&#x5C42;&#x7684;&#x975E;&#x6FC0;&#x6D3B;&#x503C;&#x96C6;&#x5408;&#x3002;&#x6570;&#x5B57;&#x5927;&#x610F;&#x5473;&#x7740;&#x53EF;&#x80FD;&#x63A2;&#x6D4B;&#x5230;&#x4E86;&#x67D0;&#x4E9B;&#x7279;&#x5B9A;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x5DE6;&#x4E0A;&#x8C61;&#x9650;&#x5177;&#x6709;&#x7684;&#x7279;&#x5F81;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x4E2A;&#x5782;&#x76F4;&#x8FB9;&#x7F18;&#xFF0C;&#x4E00;&#x53EA;&#x773C;&#x775B;&#xFF0C;&#x6216;&#x662F;&#x5927;&#x5BB6;&#x5BB3;&#x6015;&#x9047;&#x5230;&#x7684;<strong>CAP</strong>&#x7279;&#x5F81;&#x3002;&#x663E;&#x7136;&#x5DE6;&#x4E0A;&#x8C61;&#x9650;&#x4E2D;&#x5B58;&#x5728;&#x8FD9;&#x4E2A;&#x7279;&#x5F81;&#xFF0C;&#x8FD9;&#x4E2A;&#x7279;&#x5F81;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x53EA;&#x732B;&#x773C;&#x63A2;&#x6D4B;&#x5668;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x53F3;&#x4E0A;&#x8C61;&#x9650;&#x5E76;&#x4E0D;&#x5B58;&#x5728;&#x8FD9;&#x4E2A;&#x7279;&#x5F81;&#x3002;&#x6700;&#x5927;&#x5316;&#x64CD;&#x4F5C;&#x7684;&#x529F;&#x80FD;&#x5C31;&#x662F;&#x53EA;&#x8981;&#x5728;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x8C61;&#x9650;&#x5185;&#x63D0;&#x53D6;&#x5230;&#x67D0;&#x4E2A;&#x7279;&#x5F81;&#xFF0C;&#x5B83;&#x90FD;&#x4F1A;&#x4FDD;&#x7559;&#x5728;&#x6700;&#x5927;&#x5316;&#x7684;&#x6C60;&#x5316;&#x8F93;&#x51FA;&#x91CC;&#x3002;&#x6240;&#x4EE5;&#x6700;&#x5927;&#x5316;&#x8FD0;&#x7B97;&#x7684;&#x5B9E;&#x9645;&#x4F5C;&#x7528;&#x5C31;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x8FC7;&#x6EE4;&#x5668;&#x4E2D;&#x63D0;&#x53D6;&#x5230;&#x67D0;&#x4E2A;&#x7279;&#x5F81;&#xFF0C;&#x90A3;&#x4E48;&#x4FDD;&#x7559;&#x5176;&#x6700;&#x5927;&#x503C;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x63D0;&#x53D6;&#x5230;&#x8FD9;&#x4E2A;&#x7279;&#x5F81;&#xFF0C;&#x53EF;&#x80FD;&#x5728;&#x53F3;&#x4E0A;&#x8C61;&#x9650;&#x4E2D;&#x4E0D;&#x5B58;&#x5728;&#x8FD9;&#x4E2A;&#x7279;&#x5F81;&#xFF0C;&#x90A3;&#x4E48;&#x5176;&#x4E2D;&#x7684;&#x6700;&#x5927;&#x503C;&#x4E5F;&#x8FD8;&#x662F;&#x5F88;&#x5C0F;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6700;&#x5927;&#x6C60;&#x5316;&#x7684;&#x76F4;&#x89C2;&#x7406;&#x89E3;&#x3002;</p>
<p>&#x5FC5;&#x987B;&#x627F;&#x8BA4;&#xFF0C;&#x4EBA;&#x4EEC;&#x4F7F;&#x7528;&#x6700;&#x5927;&#x6C60;&#x5316;&#x7684;&#x4E3B;&#x8981;&#x539F;&#x56E0;&#x662F;&#x6B64;&#x65B9;&#x6CD5;&#x5728;&#x5F88;&#x591A;&#x5B9E;&#x9A8C;&#x4E2D;&#x6548;&#x679C;&#x90FD;&#x5F88;&#x597D;&#x3002;&#x5C3D;&#x7BA1;&#x521A;&#x521A;&#x63CF;&#x8FF0;&#x7684;&#x76F4;&#x89C2;&#x7406;&#x89E3;&#x7ECF;&#x5E38;&#x88AB;&#x5F15;&#x7528;&#xFF0C;&#x4E0D;&#x77E5;&#x5927;&#x5BB6;&#x662F;&#x5426;&#x5B8C;&#x5168;&#x7406;&#x89E3;&#x5B83;&#x7684;&#x771F;&#x6B63;&#x539F;&#x56E0;&#xFF0C;&#x4E0D;&#x77E5;&#x5927;&#x5BB6;&#x662F;&#x5426;&#x7406;&#x89E3;&#x6700;&#x5927;&#x6C60;&#x5316;&#x6548;&#x7387;&#x5F88;&#x9AD8;&#x7684;&#x771F;&#x6B63;&#x539F;&#x56E0;&#x3002;</p>
<p>&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x6709;&#x610F;&#x601D;&#x7684;&#x7279;&#x70B9;&#x5C31;&#x662F;&#xFF0C;&#x5B83;&#x6709;&#x4E00;&#x7EC4;&#x8D85;&#x53C2;&#x6570;&#xFF0C;&#x4F46;&#x5E76;&#x6CA1;&#x6709;&#x53C2;&#x6570;&#x9700;&#x8981;&#x5B66;&#x4E60;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x53EF;&#x5B66;&#x7684;&#xFF0C;&#x4E00;&#x65E6;&#x786E;&#x5B9A;&#x4E86;$f$&#x548C;$s$&#xFF0C;&#x5B83;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x8FD0;&#x7B97;&#xFF0C;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x65E0;&#x9700;&#x6539;&#x53D8;&#x4EFB;&#x4F55;&#x503C;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E2A;&#x6709;&#x82E5;&#x5E72;&#x4E2A;&#x8D85;&#x7EA7;&#x53C2;&#x6570;&#x7684;&#x793A;&#x4F8B;&#xFF0C;&#x8F93;&#x5165;&#x662F;&#x4E00;&#x4E2A;5&#xD7;5&#x7684;&#x77E9;&#x9635;&#x3002;&#x6211;&#x4EEC;&#x91C7;&#x7528;&#x6700;&#x5927;&#x6C60;&#x5316;&#x6CD5;&#xFF0C;&#x5B83;&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x53C2;&#x6570;&#x4E3A;3&#xD7;3&#xFF0C;&#x5373;$f=3$&#xFF0C;&#x6B65;&#x5E45;&#x4E3A;1&#xFF0C;$s=1$&#xFF0C;&#x8F93;&#x51FA;&#x77E9;&#x9635;&#x662F;3&#xD7;3.&#x4E4B;&#x524D;&#x8BB2;&#x7684;&#x8BA1;&#x7B97;&#x5377;&#x79EF;&#x5C42;&#x8F93;&#x51FA;&#x5927;&#x5C0F;&#x7684;&#x516C;&#x5F0F;&#x540C;&#x6837;&#x9002;&#x7528;&#x4E8E;&#x6700;&#x5927;&#x6C60;&#x5316;&#xFF0C;&#x5373;$\frac{n + 2p - f}{s} + 1$&#xFF0C;&#x8FD9;&#x4E2A;&#x516C;&#x5F0F;&#x4E5F;&#x53EF;&#x4EE5;&#x8BA1;&#x7B97;&#x6700;&#x5927;&#x6C60;&#x5316;&#x7684;&#x8F93;&#x51FA;&#x5927;&#x5C0F;&#x3002;</p>
<p><img src="../images/dd39353b23464d32599738065bc87172.png" alt=""></p>
<p>&#x6B64;&#x4F8B;&#x662F;&#x8BA1;&#x7B97;3&#xD7;3&#x8F93;&#x51FA;&#x7684;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x5DE6;&#x4E0A;&#x89D2;&#x8FD9;&#x4E9B;&#x5143;&#x7D20;&#xFF0C;&#x6CE8;&#x610F;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;3&#xD7;3&#x533A;&#x57DF;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;3&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x53D6;&#x6700;&#x5927;&#x503C;9&#x3002;&#x7136;&#x540E;&#x79FB;&#x52A8;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x56E0;&#x4E3A;&#x6B65;&#x5E45;&#x662F;1&#xFF0C;&#x84DD;&#x8272;&#x533A;&#x57DF;&#x7684;&#x6700;&#x5927;&#x503C;&#x662F;9.&#x7EE7;&#x7EED;&#x5411;&#x53F3;&#x79FB;&#x52A8;&#xFF0C;&#x84DD;&#x8272;&#x533A;&#x57DF;&#x7684;&#x6700;&#x5927;&#x503C;&#x662F;5&#x3002;&#x7136;&#x540E;&#x79FB;&#x5230;&#x4E0B;&#x4E00;&#x884C;&#xFF0C;&#x56E0;&#x4E3A;&#x6B65;&#x5E45;&#x662F;1&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x5411;&#x4E0B;&#x79FB;&#x52A8;&#x4E00;&#x4E2A;&#x683C;&#xFF0C;&#x6240;&#x4EE5;&#x8BE5;&#x533A;&#x57DF;&#x7684;&#x6700;&#x5927;&#x503C;&#x662F;9&#x3002;&#x8FD9;&#x4E2A;&#x533A;&#x57DF;&#x4E5F;&#x662F;9&#x3002;&#x8FD9;&#x4E24;&#x4E2A;&#x533A;&#x57DF;&#x7684;&#x6700;&#x5927;&#x503C;&#x90FD;&#x662F;5&#x3002;&#x6700;&#x540E;&#x8FD9;&#x4E09;&#x4E2A;&#x533A;&#x57DF;&#x7684;&#x6700;&#x5927;&#x503C;&#x5206;&#x522B;&#x4E3A;8&#xFF0C;6&#x548C;9&#x3002;&#x8D85;&#x53C2;&#x6570;$f=3$&#xFF0C;$s=1$&#xFF0C;&#x6700;&#x7EC8;&#x8F93;&#x51FA;&#x5982;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p><img src="../images/a800c70b250dc43b7003aaeebb4eefc2.png" alt=""></p>
<p>&#x4EE5;&#x4E0A;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x4E8C;&#x7EF4;&#x8F93;&#x5165;&#x7684;&#x6700;&#x5927;&#x6C60;&#x5316;&#x7684;&#x6F14;&#x793A;&#xFF0C;&#x5982;&#x679C;&#x8F93;&#x5165;&#x662F;&#x4E09;&#x7EF4;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x8F93;&#x51FA;&#x4E5F;&#x662F;&#x4E09;&#x7EF4;&#x7684;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8F93;&#x5165;&#x662F;5&#xD7;5&#xD7;2&#xFF0C;&#x90A3;&#x4E48;&#x8F93;&#x51FA;&#x662F;3&#xD7;3&#xD7;2&#x3002;&#x8BA1;&#x7B97;&#x6700;&#x5927;&#x6C60;&#x5316;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x5206;&#x522B;&#x5BF9;&#x6BCF;&#x4E2A;&#x901A;&#x9053;&#x6267;&#x884C;&#x521A;&#x521A;&#x7684;&#x8BA1;&#x7B97;&#x8FC7;&#x7A0B;&#x3002;&#x5982;&#x4E0A;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x901A;&#x9053;&#x4F9D;&#x7136;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#x3002;&#x5BF9;&#x4E8E;&#x7B2C;&#x4E8C;&#x4E2A;&#x901A;&#x9053;&#xFF0C;&#x6211;&#x521A;&#x624D;&#x753B;&#x5728;&#x4E0B;&#x9762;&#x7684;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x5C42;&#x505A;&#x540C;&#x6837;&#x7684;&#x8BA1;&#x7B97;&#xFF0C;&#x5F97;&#x5230;&#x7B2C;&#x4E8C;&#x4E2A;&#x901A;&#x9053;&#x7684;&#x8F93;&#x51FA;&#x3002;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x8F93;&#x5165;&#x662F;5&#xD7;5&#xD7;$n<em>{c}$&#xFF0C;&#x8F93;&#x51FA;&#x5C31;&#x662F;3&#xD7;3&#xD7;$n</em>{c}$&#xFF0C;$n_{c}$&#x4E2A;&#x901A;&#x9053;&#x4E2D;&#x6BCF;&#x4E2A;&#x901A;&#x9053;&#x90FD;&#x5355;&#x72EC;&#x6267;&#x884C;&#x6700;&#x5927;&#x6C60;&#x5316;&#x8BA1;&#x7B97;&#xFF0C;&#x4EE5;&#x4E0A;&#x5C31;&#x662F;&#x6700;&#x5927;&#x6C60;&#x5316;&#x7B97;&#x6CD5;&#x3002;</p>
<p><img src="../images/c225755635059449e2a9a84135e2548e.png" alt=""></p>
<p>&#x53E6;&#x5916;&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x6C60;&#x5316;&#xFF0C;&#x5E73;&#x5747;&#x6C60;&#x5316;&#xFF0C;&#x5B83;&#x4E0D;&#x592A;&#x5E38;&#x7528;&#x3002;&#x6211;&#x7B80;&#x5355;&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B;&#xFF0C;&#x8FD9;&#x79CD;&#x8FD0;&#x7B97;&#x987E;&#x540D;&#x601D;&#x4E49;&#xFF0C;&#x9009;&#x53D6;&#x7684;&#x4E0D;&#x662F;&#x6BCF;&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#x7684;&#x6700;&#x5927;&#x503C;&#xFF0C;&#x800C;&#x662F;&#x5E73;&#x5747;&#x503C;&#x3002;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x7D2B;&#x8272;&#x533A;&#x57DF;&#x7684;&#x5E73;&#x5747;&#x503C;&#x662F;3.75&#xFF0C;&#x540E;&#x9762;&#x4F9D;&#x6B21;&#x662F;1.25&#x3001;4&#x548C;2&#x3002;&#x8FD9;&#x4E2A;&#x5E73;&#x5747;&#x6C60;&#x5316;&#x7684;&#x8D85;&#x7EA7;&#x53C2;&#x6570;$f=2$&#xFF0C;$s=2$&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x5176;&#x5B83;&#x8D85;&#x7EA7;&#x53C2;&#x6570;&#x3002;</p>
<p><img src="../images/1b5bbeadd76a7d65d3201c1e3de467ca.png" alt=""></p>
<p>&#x76EE;&#x524D;&#x6765;&#x8BF4;&#xFF0C;&#x6700;&#x5927;&#x6C60;&#x5316;&#x6BD4;&#x5E73;&#x5747;&#x6C60;&#x5316;&#x66F4;&#x5E38;&#x7528;&#x3002;&#x4F46;&#x4E5F;&#x6709;&#x4F8B;&#x5916;&#xFF0C;&#x5C31;&#x662F;&#x6DF1;&#x5EA6;&#x5F88;&#x6DF1;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x5E73;&#x5747;&#x6C60;&#x5316;&#x6765;&#x5206;&#x89E3;&#x89C4;&#x6A21;&#x4E3A;7&#xD7;7&#xD7;1000&#x7684;&#x7F51;&#x7EDC;&#x7684;&#x8868;&#x793A;&#x5C42;&#xFF0C;&#x5728;&#x6574;&#x4E2A;&#x7A7A;&#x95F4;&#x5185;&#x6C42;&#x5E73;&#x5747;&#x503C;&#xFF0C;&#x5F97;&#x5230;1&#xD7;1&#xD7;1000&#xFF0C;&#x4E00;&#x4F1A;&#x6211;&#x4EEC;&#x770B;&#x4E2A;&#x4F8B;&#x5B50;&#x3002;&#x4F46;&#x5728;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#xFF0C;&#x6700;&#x5927;&#x6C60;&#x5316;&#x8981;&#x6BD4;&#x5E73;&#x5747;&#x6C60;&#x5316;&#x7528;&#x5F97;&#x66F4;&#x591A;&#x3002;</p>
<p>&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#xFF0C;&#x6C60;&#x5316;&#x7684;&#x8D85;&#x7EA7;&#x53C2;&#x6570;&#x5305;&#x62EC;&#x8FC7;&#x6EE4;&#x5668;&#x5927;&#x5C0F;$f$&#x548C;&#x6B65;&#x5E45;$s$&#xFF0C;&#x5E38;&#x7528;&#x7684;&#x53C2;&#x6570;&#x503C;&#x4E3A;$f=2$&#xFF0C;$s=2$&#xFF0C;&#x5E94;&#x7528;&#x9891;&#x7387;&#x975E;&#x5E38;&#x9AD8;&#xFF0C;&#x5176;&#x6548;&#x679C;&#x76F8;&#x5F53;&#x4E8E;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#x7F29;&#x51CF;&#x4E00;&#x534A;&#x3002;&#x4E5F;&#x6709;&#x4F7F;&#x7528;$f=3$&#xFF0C;$s=2$&#x7684;&#x60C5;&#x51B5;&#x3002;&#x81F3;&#x4E8E;&#x5176;&#x5B83;&#x8D85;&#x7EA7;&#x53C2;&#x6570;&#x5C31;&#x8981;&#x770B;&#x4F60;&#x7528;&#x7684;&#x662F;&#x6700;&#x5927;&#x6C60;&#x5316;&#x8FD8;&#x662F;&#x5E73;&#x5747;&#x6C60;&#x5316;&#x4E86;&#x3002;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x610F;&#x613F;&#x589E;&#x52A0;&#x8868;&#x793A;<strong>padding</strong>&#x7684;&#x5176;&#x4ED6;&#x8D85;&#x7EA7;&#x53C2;&#x6570;&#xFF0C;&#x867D;&#x7136;&#x5F88;&#x5C11;&#x8FD9;&#x4E48;&#x7528;&#x3002;&#x6700;&#x5927;&#x6C60;&#x5316;&#x65F6;&#xFF0C;&#x5F80;&#x5F80;&#x5F88;&#x5C11;&#x7528;&#x5230;&#x8D85;&#x53C2;&#x6570;<strong>padding</strong>&#xFF0C;&#x5F53;&#x7136;&#x4E5F;&#x6709;&#x4F8B;&#x5916;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x6211;&#x4EEC;&#x4E0B;&#x5468;&#x4F1A;&#x8BB2;&#x3002;&#x5927;&#x90E8;&#x5206;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6700;&#x5927;&#x6C60;&#x5316;&#x5F88;&#x5C11;&#x7528;<strong>padding</strong>&#x3002;&#x76EE;&#x524D;$p$&#x6700;&#x5E38;&#x7528;&#x7684;&#x503C;&#x662F;0&#xFF0C;&#x5373;$p=0$&#x3002;&#x6700;&#x5927;&#x6C60;&#x5316;&#x7684;&#x8F93;&#x5165;&#x5C31;&#x662F;$n<em>{H} \times n</em>{W} \times n<em>{c}$&#xFF0C;&#x5047;&#x8BBE;&#x6CA1;&#x6709;<strong>padding</strong>&#xFF0C;&#x5219;&#x8F93;&#x51FA;$\lfloor\frac{n</em>{H} - f}{s} +1\rfloor \times \lfloor\frac{n<em>{w} - f}{s} + 1\rfloor \times n</em>{c}$&#x3002;&#x8F93;&#x5165;&#x901A;&#x9053;&#x4E0E;&#x8F93;&#x51FA;&#x901A;&#x9053;&#x4E2A;&#x6570;&#x76F8;&#x540C;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5BF9;&#x6BCF;&#x4E2A;&#x901A;&#x9053;&#x90FD;&#x505A;&#x4E86;&#x6C60;&#x5316;&#x3002;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x4E00;&#x70B9;&#x662F;&#xFF0C;&#x6C60;&#x5316;&#x8FC7;&#x7A0B;&#x4E2D;&#x6CA1;&#x6709;&#x9700;&#x8981;&#x5B66;&#x4E60;&#x7684;&#x53C2;&#x6570;&#x3002;&#x6267;&#x884C;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x65F6;&#xFF0C;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x6CA1;&#x6709;&#x53C2;&#x6570;&#x9002;&#x7528;&#x4E8E;&#x6700;&#x5927;&#x6C60;&#x5316;&#x3002;&#x53EA;&#x6709;&#x8FD9;&#x4E9B;&#x8BBE;&#x7F6E;&#x8FC7;&#x7684;&#x8D85;&#x53C2;&#x6570;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x624B;&#x52A8;&#x8BBE;&#x7F6E;&#x7684;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x901A;&#x8FC7;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x8BBE;&#x7F6E;&#x7684;&#x3002;</p>
<p><img src="../images/6bd58a754152e7f5cf55a8c5bbac3100.png" alt=""></p>
<p>&#x9664;&#x4E86;&#x8FD9;&#x4E9B;&#xFF0C;&#x6C60;&#x5316;&#x7684;&#x5185;&#x5BB9;&#x5C31;&#x5168;&#x90E8;&#x8BB2;&#x5B8C;&#x4E86;&#x3002;&#x6700;&#x5927;&#x6C60;&#x5316;&#x53EA;&#x662F;&#x8BA1;&#x7B97;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x67D0;&#x4E00;&#x5C42;&#x7684;&#x9759;&#x6001;&#x5C5E;&#x6027;&#xFF0C;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x9700;&#x8981;&#x5B66;&#x4E60;&#x7684;&#xFF0C;&#x5B83;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x9759;&#x6001;&#x5C5E;&#x6027;&#x3002;</p>
<p>&#x5173;&#x4E8E;&#x6C60;&#x5316;&#x6211;&#x4EEC;&#x5C31;&#x8BB2;&#x5230;&#x8FD9;&#x513F;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x6784;&#x5EFA;&#x5377;&#x79EF;&#x5C42;&#x548C;&#x6C60;&#x5316;&#x5C42;&#x4E86;&#x3002;&#x4E0B;&#x8282;&#x8BFE;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x5206;&#x6790;&#x4E00;&#x4E2A;&#x66F4;&#x590D;&#x6742;&#x7684;&#x53EF;&#x4EE5;&#x5F15;&#x8FDB;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x7684;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x793A;&#x4F8B;&#x3002;</p>
<h3 id="110-&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x793A;&#x4F8B;&#xFF08;convolutional-neural-network-example&#xFF09;">1.10 &#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x793A;&#x4F8B;&#xFF08;Convolutional neural network example&#xFF09;</h3>
<p>&#x6784;&#x5EFA;&#x5168;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x6784;&#x9020;&#x6A21;&#x5757;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x638C;&#x63E1;&#x5F97;&#x5DEE;&#x4E0D;&#x591A;&#x4E86;&#xFF0C;&#x4E0B;&#x9762;&#x6765;&#x770B;&#x4E2A;&#x4F8B;&#x5B50;&#x3002;</p>
<p>&#x5047;&#x8BBE;&#xFF0C;&#x6709;&#x4E00;&#x5F20;&#x5927;&#x5C0F;&#x4E3A;32&#xD7;32&#xD7;3&#x7684;&#x8F93;&#x5165;&#x56FE;&#x7247;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x5F20;<strong>RGB</strong>&#x6A21;&#x5F0F;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x4F60;&#x60F3;&#x505A;&#x624B;&#x5199;&#x4F53;&#x6570;&#x5B57;&#x8BC6;&#x522B;&#x3002;32&#xD7;32&#xD7;3&#x7684;<strong>RGB</strong>&#x56FE;&#x7247;&#x4E2D;&#x542B;&#x6709;&#x67D0;&#x4E2A;&#x6570;&#x5B57;&#xFF0C;&#x6BD4;&#x5982;7&#xFF0C;&#x4F60;&#x60F3;&#x8BC6;&#x522B;&#x5B83;&#x662F;&#x4ECE;0-9&#x8FD9;10&#x4E2A;&#x6570;&#x5B57;&#x4E2D;&#x7684;&#x54EA;&#x4E00;&#x4E2A;&#xFF0C;&#x6211;&#x4EEC;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6765;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x3002;</p>
<p><img src="../images/a7a10b593562a00a1a29df9c422aa1a2.png" alt=""></p>
<p>&#x6211;&#x7528;&#x7684;&#x8FD9;&#x4E2A;&#x7F51;&#x7EDC;&#x6A21;&#x578B;&#x548C;&#x7ECF;&#x5178;&#x7F51;&#x7EDC;<strong>LeNet-5</strong>&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#xFF0C;&#x7075;&#x611F;&#x4E5F;&#x6765;&#x6E90;&#x4E8E;&#x6B64;&#x3002;<strong>LeNet-5</strong>&#x662F;&#x591A;&#x5E74;&#x524D;<strong>Yann LeCun</strong>&#x521B;&#x5EFA;&#x7684;&#xFF0C;&#x6211;&#x6240;&#x91C7;&#x7528;&#x7684;&#x6A21;&#x578B;&#x5E76;&#x4E0D;&#x662F;<strong>LeNet-5</strong>&#xFF0C;&#x4F46;&#x662F;&#x53D7;&#x5B83;&#x542F;&#x53D1;&#xFF0C;&#x8BB8;&#x591A;&#x53C2;&#x6570;&#x9009;&#x62E9;&#x90FD;&#x4E0E;<strong>LeNet-5</strong>&#x76F8;&#x4F3C;&#x3002;&#x8F93;&#x5165;&#x662F;32&#xD7;32&#xD7;3&#x7684;&#x77E9;&#x9635;&#xFF0C;&#x5047;&#x8BBE;&#x7B2C;&#x4E00;&#x5C42;&#x4F7F;&#x7528;&#x8FC7;&#x6EE4;&#x5668;&#x5927;&#x5C0F;&#x4E3A;5&#xD7;5&#xFF0C;&#x6B65;&#x5E45;&#x662F;1&#xFF0C;<strong>paddin</strong>g&#x662F;0&#xFF0C;&#x8FC7;&#x6EE4;&#x5668;&#x4E2A;&#x6570;&#x4E3A;6&#xFF0C;&#x90A3;&#x4E48;&#x8F93;&#x51FA;&#x4E3A;28&#xD7;28&#xD7;6&#x3002;&#x5C06;&#x8FD9;&#x5C42;&#x6807;&#x8BB0;&#x4E3A;<strong>CONV1</strong>&#xFF0C;&#x5B83;&#x7528;&#x4E86;6&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x589E;&#x52A0;&#x4E86;&#x504F;&#x5DEE;&#xFF0C;&#x5E94;&#x7528;&#x4E86;&#x975E;&#x7EBF;&#x6027;&#x51FD;&#x6570;&#xFF0C;&#x53EF;&#x80FD;&#x662F;<strong>ReLU</strong>&#x975E;&#x7EBF;&#x6027;&#x51FD;&#x6570;&#xFF0C;&#x6700;&#x540E;&#x8F93;&#x51FA;<strong>CONV1</strong>&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p><img src="../images/4e3af8ce9e6ec2135c5437eb1f87af85.png" alt=""></p>
<p>&#x7136;&#x540E;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x6C60;&#x5316;&#x5C42;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x9009;&#x62E9;&#x7528;&#x6700;&#x5927;&#x6C60;&#x5316;&#xFF0C;&#x53C2;&#x6570;$f=2$&#xFF0C;$s=2$&#xFF0C;&#x56E0;&#x4E3A;<strong>padding</strong>&#x4E3A;0&#xFF0C;&#x6211;&#x5C31;&#x4E0D;&#x5199;&#x51FA;&#x6765;&#x4E86;&#x3002;&#x73B0;&#x5728;&#x5F00;&#x59CB;&#x6784;&#x5EFA;&#x6C60;&#x5316;&#x5C42;&#xFF0C;&#x6700;&#x5927;&#x6C60;&#x5316;&#x4F7F;&#x7528;&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x4E3A;2&#xD7;2&#xFF0C;&#x6B65;&#x5E45;&#x4E3A;2&#xFF0C;&#x8868;&#x793A;&#x5C42;&#x7684;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#x4F1A;&#x51CF;&#x5C11;&#x4E00;&#x534A;&#x3002;&#x56E0;&#x6B64;&#xFF0C;28&#xD7;28&#x53D8;&#x6210;&#x4E86;14&#xD7;14&#xFF0C;&#x901A;&#x9053;&#x6570;&#x91CF;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#xFF0C;&#x6240;&#x4EE5;&#x6700;&#x7EC8;&#x8F93;&#x51FA;&#x4E3A;14&#xD7;14&#xD7;6&#xFF0C;&#x5C06;&#x8BE5;&#x8F93;&#x51FA;&#x6807;&#x8BB0;&#x4E3A;<strong>POOL1</strong>&#x3002;</p>
<p><img src="../images/445418bf9cd2eaa5a83f31c1f40757dc.png" alt=""></p>
<p>&#x4EBA;&#x4EEC;&#x53D1;&#x73B0;&#x5728;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6587;&#x732E;&#x4E2D;&#xFF0C;&#x5377;&#x79EF;&#x6709;&#x4E24;&#x79CD;&#x5206;&#x7C7B;&#xFF0C;&#x8FD9;&#x4E0E;&#x6240;&#x8C13;&#x5C42;&#x7684;&#x5212;&#x5206;&#x5B58;&#x5728;&#x4E00;&#x81F4;&#x6027;&#x3002;&#x4E00;&#x7C7B;&#x5377;&#x79EF;&#x662F;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x548C;&#x4E00;&#x4E2A;&#x6C60;&#x5316;&#x5C42;&#x4E00;&#x8D77;&#x4F5C;&#x4E3A;&#x4E00;&#x5C42;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;<strong>Layer1</strong>&#x3002;&#x53E6;&#x4E00;&#x7C7B;&#x5377;&#x79EF;&#x662F;&#x628A;&#x5377;&#x79EF;&#x5C42;&#x4F5C;&#x4E3A;&#x4E00;&#x5C42;&#xFF0C;&#x800C;&#x6C60;&#x5316;&#x5C42;&#x5355;&#x72EC;&#x4F5C;&#x4E3A;&#x4E00;&#x5C42;&#x3002;&#x4EBA;&#x4EEC;&#x5728;&#x8BA1;&#x7B97;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6709;&#x591A;&#x5C11;&#x5C42;&#x65F6;&#xFF0C;&#x901A;&#x5E38;&#x53EA;&#x7EDF;&#x8BA1;&#x5177;&#x6709;&#x6743;&#x91CD;&#x548C;&#x53C2;&#x6570;&#x7684;&#x5C42;&#x3002;&#x56E0;&#x4E3A;&#x6C60;&#x5316;&#x5C42;&#x6CA1;&#x6709;&#x6743;&#x91CD;&#x548C;&#x53C2;&#x6570;&#xFF0C;&#x53EA;&#x6709;&#x4E00;&#x4E9B;&#x8D85;&#x53C2;&#x6570;&#x3002;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x628A;<strong>CONV1</strong>&#x548C;<strong>POOL1</strong>&#x5171;&#x540C;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#xFF0C;&#x5E76;&#x6807;&#x8BB0;&#x4E3A;<strong>Layer1</strong>&#x3002;&#x867D;&#x7136;&#x4F60;&#x5728;&#x9605;&#x8BFB;&#x7F51;&#x7EDC;&#x6587;&#x7AE0;&#x6216;&#x7814;&#x7A76;&#x62A5;&#x544A;&#x65F6;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x770B;&#x5230;&#x5377;&#x79EF;&#x5C42;&#x548C;&#x6C60;&#x5316;&#x5C42;&#x5404;&#x4E3A;&#x4E00;&#x5C42;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x8FD9;&#x53EA;&#x662F;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x6807;&#x8BB0;&#x672F;&#x8BED;&#x3002;&#x4E00;&#x822C;&#x6211;&#x5728;&#x7EDF;&#x8BA1;&#x7F51;&#x7EDC;&#x5C42;&#x6570;&#x65F6;&#xFF0C;&#x53EA;&#x8BA1;&#x7B97;&#x5177;&#x6709;&#x6743;&#x91CD;&#x7684;&#x5C42;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x628A;<strong>CONV1</strong>&#x548C;<strong>POOL1</strong>&#x4F5C;&#x4E3A;<strong>Layer1</strong>&#x3002;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x7528;<strong>CONV1</strong>&#x548C;<strong>POOL1</strong>&#x6765;&#x6807;&#x8BB0;&#xFF0C;&#x4E24;&#x8005;&#x90FD;&#x662F;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;<strong>Layer1</strong>&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;<strong>POOL1</strong>&#x4E5F;&#x88AB;&#x5212;&#x5206;&#x5728;<strong>Layer1</strong>&#x4E2D;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x6CA1;&#x6709;&#x6743;&#x91CD;&#xFF0C;&#x5F97;&#x5230;&#x7684;&#x8F93;&#x51FA;&#x662F;14&#xD7;14&#xD7;6&#x3002;</p>
<p><img src="../images/8b70ab4bfd6764598058a201c3e402b4.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x518D;&#x4E3A;&#x5B83;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#xFF0C;&#x8FC7;&#x6EE4;&#x5668;&#x5927;&#x5C0F;&#x4E3A;5&#xD7;5&#xFF0C;&#x6B65;&#x5E45;&#x4E3A;1&#xFF0C;&#x8FD9;&#x6B21;&#x6211;&#x4EEC;&#x7528;10&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x6700;&#x540E;&#x8F93;&#x51FA;&#x4E00;&#x4E2A;10&#xD7;10&#xD7;10&#x7684;&#x77E9;&#x9635;&#xFF0C;&#x6807;&#x8BB0;&#x4E3A;<strong>CONV2</strong>&#x3002;</p>
<p><img src="../images/8a0fb1836475716cc66f35584b17ded8.png" alt=""></p>
<p>&#x7136;&#x540E;&#x505A;&#x6700;&#x5927;&#x6C60;&#x5316;&#xFF0C;&#x8D85;&#x53C2;&#x6570;$f=2$&#xFF0C;$s=2$&#x3002;&#x4F60;&#x5927;&#x6982;&#x53EF;&#x4EE5;&#x731C;&#x51FA;&#x7ED3;&#x679C;&#xFF0C;$f=2$&#xFF0C;$s=2$&#xFF0C;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#x4F1A;&#x51CF;&#x534A;&#xFF0C;&#x6700;&#x540E;&#x8F93;&#x51FA;&#x4E3A;5&#xD7;5&#xD7;10&#xFF0C;&#x6807;&#x8BB0;&#x4E3A;<strong>POOL2</strong>&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#xFF0C;&#x5373;<strong>Layer2</strong>&#x3002;</p>
<p><img src="../images/53f662cecbbebc80d849ee0d97e7d727.png" alt=""></p>
<p>&#x5982;&#x679C;&#x5BF9;<strong>Layer1</strong>&#x5E94;&#x7528;&#x53E6;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#xFF0C;&#x8FC7;&#x6EE4;&#x5668;&#x4E3A;5&#xD7;5&#xFF0C;&#x5373;$f=5$&#xFF0C;&#x6B65;&#x5E45;&#x662F;1&#xFF0C;<strong>padding</strong>&#x4E3A;0&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x7701;&#x7565;&#x4E86;&#xFF0C;&#x8FC7;&#x6EE4;&#x5668;16&#x4E2A;&#xFF0C;&#x6240;&#x4EE5;<strong>CONV2</strong>&#x8F93;&#x51FA;&#x4E3A;10&#xD7;10&#xD7;16&#x3002;&#x6211;&#x4EEC;&#x770B;&#x770B;<strong>CONV2</strong>&#xFF0C;&#x8FD9;&#x662F;<strong>CONV2</strong>&#x5C42;&#x3002;</p>
<p><img src="../images/f00469a1fbea2ace64f1280849f9cd7d.png" alt=""></p>
<p>&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x505A;&#x5927;&#x6C60;&#x5316;&#x8BA1;&#x7B97;&#xFF0C;&#x53C2;&#x6570;$f=2$&#xFF0C;$s=2$&#xFF0C;&#x4F60;&#x80FD;&#x731C;&#x5230;&#x7ED3;&#x679C;&#x4E48;&#xFF1F;&#x5BF9;10&#xD7;10&#xD7;16&#x8F93;&#x5165;&#x6267;&#x884C;&#x6700;&#x5927;&#x6C60;&#x5316;&#x8BA1;&#x7B97;&#xFF0C;&#x53C2;&#x6570;$f=2$&#xFF0C;$s=2$&#xFF0C;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#x51CF;&#x534A;&#xFF0C;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x731C;&#x5230;&#x4E86;&#x5427;&#x3002;&#x6700;&#x5927;&#x6C60;&#x5316;&#x7684;&#x53C2;&#x6570;$f=2$&#xFF0C;$s=2$&#xFF0C;&#x8F93;&#x5165;&#x7684;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#x4F1A;&#x51CF;&#x534A;&#xFF0C;&#x7ED3;&#x679C;&#x4E3A;5&#xD7;5&#xD7;16&#xFF0C;&#x901A;&#x9053;&#x6570;&#x548C;&#x4E4B;&#x524D;&#x4E00;&#x6837;&#xFF0C;&#x6807;&#x8BB0;&#x4E3A;<strong>POOL2</strong>&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#xFF0C;&#x5373;<strong>Layer2</strong>&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x6743;&#x91CD;&#x96C6;&#x548C;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x5C42;<strong>CONV2</strong>&#x3002;</p>
<p><img src="../images/8071427c9477615d68b771454f43699f.png" alt=""></p>
<p>5&#xD7;5&#xD7;16&#x77E9;&#x9635;&#x5305;&#x542B;400&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x73B0;&#x5728;&#x5C06;<strong>POOL2</strong>&#x5E73;&#x6574;&#x5316;&#x4E3A;&#x4E00;&#x4E2A;&#x5927;&#x5C0F;&#x4E3A;400&#x7684;&#x4E00;&#x7EF4;&#x5411;&#x91CF;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x628A;&#x5E73;&#x6574;&#x5316;&#x7ED3;&#x679C;&#x60F3;&#x8C61;&#x6210;&#x8FD9;&#x6837;&#x7684;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x96C6;&#x5408;&#xFF0C;&#x7136;&#x540E;&#x5229;&#x7528;&#x8FD9;400&#x4E2A;&#x5355;&#x5143;&#x6784;&#x5EFA;&#x4E0B;&#x4E00;&#x5C42;&#x3002;&#x4E0B;&#x4E00;&#x5C42;&#x542B;&#x6709;120&#x4E2A;&#x5355;&#x5143;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x7B2C;&#x4E00;&#x4E2A;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#xFF0C;&#x6807;&#x8BB0;&#x4E3A;<strong>FC3</strong>&#x3002;&#x8FD9;400&#x4E2A;&#x5355;&#x5143;&#x4E0E;120&#x4E2A;&#x5355;&#x5143;&#x7D27;&#x5BC6;&#x76F8;&#x8FDE;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x3002;&#x5B83;&#x5F88;&#x50CF;&#x6211;&#x4EEC;&#x5728;&#x7B2C;&#x4E00;&#x548C;&#x7B2C;&#x4E8C;&#x95E8;&#x8BFE;&#x4E2D;&#x8BB2;&#x8FC7;&#x7684;&#x5355;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5C42;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x6807;&#x51C6;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;&#x5B83;&#x7684;&#x6743;&#x91CD;&#x77E9;&#x9635;&#x4E3A;$W^{\left\lbrack 3 \right\rbrack}$&#xFF0C;&#x7EF4;&#x5EA6;&#x4E3A;120&#xD7;400&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684;&#x201C;&#x5168;&#x8FDE;&#x63A5;&#x201D;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;400&#x4E2A;&#x5355;&#x5143;&#x4E0E;&#x8FD9;120&#x4E2A;&#x5355;&#x5143;&#x7684;&#x6BCF;&#x4E00;&#x9879;&#x8FDE;&#x63A5;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x504F;&#x5DEE;&#x53C2;&#x6570;&#x3002;&#x6700;&#x540E;&#x8F93;&#x51FA;120&#x4E2A;&#x7EF4;&#x5EA6;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;120&#x4E2A;&#x8F93;&#x51FA;&#x3002;</p>
<p>&#x7136;&#x540E;&#x6211;&#x4EEC;&#x5BF9;&#x8FD9;&#x4E2A;120&#x4E2A;&#x5355;&#x5143;&#x518D;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#xFF0C;&#x8FD9;&#x5C42;&#x66F4;&#x5C0F;&#xFF0C;&#x5047;&#x8BBE;&#x5B83;&#x542B;&#x6709;84&#x4E2A;&#x5355;&#x5143;&#xFF0C;&#x6807;&#x8BB0;&#x4E3A;<strong>FC4</strong>&#x3002;</p>
<p><img src="../images/c6894969e33cfc84b16267b752baf644.png" alt=""></p>
<p>&#x6700;&#x540E;&#xFF0C;&#x7528;&#x8FD9;84&#x4E2A;&#x5355;&#x5143;&#x586B;&#x5145;&#x4E00;&#x4E2A;<strong>softmax</strong>&#x5355;&#x5143;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x60F3;&#x901A;&#x8FC7;&#x624B;&#x5199;&#x6570;&#x5B57;&#x8BC6;&#x522B;&#x6765;&#x8BC6;&#x522B;&#x624B;&#x5199;0-9&#x8FD9;10&#x4E2A;&#x6570;&#x5B57;&#xFF0C;&#x8FD9;&#x4E2A;<strong>softmax</strong>&#x5C31;&#x4F1A;&#x6709;10&#x4E2A;&#x8F93;&#x51FA;&#x3002;</p>
<p>&#x6B64;&#x4F8B;&#x4E2D;&#x7684;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5F88;&#x5178;&#x578B;&#xFF0C;&#x770B;&#x4E0A;&#x53BB;&#x5B83;&#x6709;&#x5F88;&#x591A;&#x8D85;&#x53C2;&#x6570;&#xFF0C;&#x5173;&#x4E8E;&#x5982;&#x4F55;&#x9009;&#x5B9A;&#x8FD9;&#x4E9B;&#x53C2;&#x6570;&#xFF0C;&#x540E;&#x9762;&#x6211;&#x63D0;&#x4F9B;&#x66F4;&#x591A;&#x5EFA;&#x8BAE;&#x3002;&#x5E38;&#x89C4;&#x505A;&#x6CD5;&#x662F;&#xFF0C;&#x5C3D;&#x91CF;&#x4E0D;&#x8981;&#x81EA;&#x5DF1;&#x8BBE;&#x7F6E;&#x8D85;&#x53C2;&#x6570;&#xFF0C;&#x800C;&#x662F;&#x67E5;&#x770B;&#x6587;&#x732E;&#x4E2D;&#x522B;&#x4EBA;&#x91C7;&#x7528;&#x4E86;&#x54EA;&#x4E9B;&#x8D85;&#x53C2;&#x6570;&#xFF0C;&#x9009;&#x4E00;&#x4E2A;&#x5728;&#x522B;&#x4EBA;&#x4EFB;&#x52A1;&#x4E2D;&#x6548;&#x679C;&#x5F88;&#x597D;&#x7684;&#x67B6;&#x6784;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x4E5F;&#x6709;&#x53EF;&#x80FD;&#x9002;&#x7528;&#x4E8E;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x8FD9;&#x5757;&#x4E0B;&#x5468;&#x6211;&#x4F1A;&#x7EC6;&#x8BB2;&#x3002;</p>
<p><img src="../images/aa71fe522f85ea932e3797f4fd4f405c.png" alt=""></p>
<p>&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x60F3;&#x6307;&#x51FA;&#x7684;&#x662F;&#xFF0C;&#x968F;&#x7740;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6DF1;&#x5EA6;&#x7684;&#x52A0;&#x6DF1;&#xFF0C;&#x9AD8;&#x5EA6;$n<em>{H}$&#x548C;&#x5BBD;&#x5EA6;$n</em>{W}$&#x901A;&#x5E38;&#x90FD;&#x4F1A;&#x51CF;&#x5C11;&#xFF0C;&#x524D;&#x9762;&#x6211;&#x5C31;&#x63D0;&#x5230;&#x8FC7;&#xFF0C;&#x4ECE;32&#xD7;32&#x5230;28&#xD7;28&#xFF0C;&#x5230;14&#xD7;14&#xFF0C;&#x5230;10&#xD7;10&#xFF0C;&#x518D;&#x5230;5&#xD7;5&#x3002;&#x6240;&#x4EE5;&#x968F;&#x7740;&#x5C42;&#x6570;&#x589E;&#x52A0;&#xFF0C;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#x90FD;&#x4F1A;&#x51CF;&#x5C0F;&#xFF0C;&#x800C;&#x901A;&#x9053;&#x6570;&#x91CF;&#x4F1A;&#x589E;&#x52A0;&#xFF0C;&#x4ECE;3&#x5230;6&#x5230;16&#x4E0D;&#x65AD;&#x589E;&#x52A0;&#xFF0C;&#x7136;&#x540E;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x3002;</p>
<p>&#x5728;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#xFF0C;&#x53E6;&#x4E00;&#x79CD;&#x5E38;&#x89C1;&#x6A21;&#x5F0F;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x5377;&#x79EF;&#x540E;&#x9762;&#x8DDF;&#x968F;&#x4E00;&#x4E2A;&#x6C60;&#x5316;&#x5C42;&#xFF0C;&#x7136;&#x540E;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x540E;&#x9762;&#x518D;&#x8DDF;&#x4E00;&#x4E2A;&#x6C60;&#x5316;&#x5C42;&#xFF0C;&#x7136;&#x540E;&#x662F;&#x51E0;&#x4E2A;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#xFF0C;&#x6700;&#x540E;&#x662F;&#x4E00;&#x4E2A;<strong>softmax</strong>&#x3002;&#x8FD9;&#x662F;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x53E6;&#x4E00;&#x79CD;&#x5E38;&#x89C1;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x8BB2;&#x8BB2;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x6FC0;&#x6D3B;&#x503C;&#x5F62;&#x72B6;&#xFF0C;&#x6FC0;&#x6D3B;&#x503C;&#x5927;&#x5C0F;&#x548C;&#x53C2;&#x6570;&#x6570;&#x91CF;&#x3002;&#x8F93;&#x5165;&#x4E3A;32&#xD7;32&#xD7;3&#xFF0C;&#x8FD9;&#x4E9B;&#x6570;&#x505A;&#x4E58;&#x6CD5;&#xFF0C;&#x7ED3;&#x679C;&#x4E3A;3072&#xFF0C;&#x6240;&#x4EE5;&#x6FC0;&#x6D3B;&#x503C;$a^{[0]}$&#x6709;3072&#x7EF4;&#xFF0C;&#x6FC0;&#x6D3B;&#x503C;&#x77E9;&#x9635;&#x4E3A;32&#xD7;32&#xD7;3&#xFF0C;&#x8F93;&#x5165;&#x5C42;&#x6CA1;&#x6709;&#x53C2;&#x6570;&#x3002;&#x8BA1;&#x7B97;&#x5176;&#x4ED6;&#x5C42;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8BD5;&#x7740;&#x81EA;&#x5DF1;&#x8BA1;&#x7B97;&#x51FA;&#x6FC0;&#x6D3B;&#x503C;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x7F51;&#x7EDC;&#x4E2D;&#x4E0D;&#x540C;&#x5C42;&#x7684;&#x6FC0;&#x6D3B;&#x503C;&#x5F62;&#x72B6;&#x548C;&#x6FC0;&#x6D3B;&#x503C;&#x5927;&#x5C0F;&#x3002;</p>
<p><img src="../images/b715a532e64edaa241c27eef9fdc9bfd.png" alt=""></p>
<p>&#x6709;&#x51E0;&#x70B9;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x7B2C;&#x4E00;&#xFF0C;&#x6C60;&#x5316;&#x5C42;&#x548C;&#x6700;&#x5927;&#x6C60;&#x5316;&#x5C42;&#x6CA1;&#x6709;&#x53C2;&#x6570;&#xFF1B;&#x7B2C;&#x4E8C;&#x5377;&#x79EF;&#x5C42;&#x7684;&#x53C2;&#x6570;&#x76F8;&#x5BF9;&#x8F83;&#x5C11;&#xFF0C;&#x524D;&#x9762;&#x8BFE;&#x4E0A;&#x6211;&#x4EEC;&#x63D0;&#x5230;&#x8FC7;&#xFF0C;&#x5176;&#x5B9E;&#x8BB8;&#x591A;&#x53C2;&#x6570;&#x90FD;&#x5B58;&#x5728;&#x4E8E;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x3002;&#x89C2;&#x5BDF;&#x53EF;&#x53D1;&#x73B0;&#xFF0C;&#x968F;&#x7740;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x52A0;&#x6DF1;&#xFF0C;&#x6FC0;&#x6D3B;&#x503C;&#x5C3A;&#x5BF8;&#x4F1A;&#x9010;&#x6E10;&#x53D8;&#x5C0F;&#xFF0C;&#x5982;&#x679C;&#x6FC0;&#x6D3B;&#x503C;&#x5C3A;&#x5BF8;&#x4E0B;&#x964D;&#x592A;&#x5FEB;&#xFF0C;&#x4E5F;&#x4F1A;&#x5F71;&#x54CD;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6027;&#x80FD;&#x3002;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x6FC0;&#x6D3B;&#x503C;&#x5C3A;&#x5BF8;&#x5728;&#x7B2C;&#x4E00;&#x5C42;&#x4E3A;6000&#xFF0C;&#x7136;&#x540E;&#x51CF;&#x5C11;&#x5230;1600&#xFF0C;&#x6162;&#x6162;&#x51CF;&#x5C11;&#x5230;84&#xFF0C;&#x6700;&#x540E;&#x8F93;&#x51FA;<strong>softmax</strong>&#x7ED3;&#x679C;&#x3002;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#xFF0C;&#x8BB8;&#x591A;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x90FD;&#x5177;&#x6709;&#x8FD9;&#x4E9B;&#x5C5E;&#x6027;&#xFF0C;&#x6A21;&#x5F0F;&#x4E0A;&#x4E5F;&#x76F8;&#x4F3C;&#x3002;</p>
<p>&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x57FA;&#x672C;&#x6784;&#x9020;&#x6A21;&#x5757;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x8BB2;&#x5B8C;&#x4E86;&#xFF0C;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5305;&#x62EC;&#x5377;&#x79EF;&#x5C42;&#x3001;&#x6C60;&#x5316;&#x5C42;&#x548C;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x3002;&#x8BB8;&#x591A;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x7814;&#x7A76;&#x6B63;&#x5728;&#x63A2;&#x7D22;&#x5982;&#x4F55;&#x628A;&#x8FD9;&#x4E9B;&#x57FA;&#x672C;&#x6A21;&#x5757;&#x6574;&#x5408;&#x8D77;&#x6765;&#xFF0C;&#x6784;&#x5EFA;&#x9AD8;&#x6548;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x6574;&#x5408;&#x8FD9;&#x4E9B;&#x57FA;&#x672C;&#x6A21;&#x5757;&#x786E;&#x5B9E;&#x9700;&#x8981;&#x6DF1;&#x5165;&#x7684;&#x7406;&#x89E3;&#x3002;&#x6839;&#x636E;&#x6211;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x627E;&#x5230;&#x6574;&#x5408;&#x57FA;&#x672C;&#x6784;&#x9020;&#x6A21;&#x5757;&#x6700;&#x597D;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x5927;&#x91CF;&#x9605;&#x8BFB;&#x522B;&#x4EBA;&#x7684;&#x6848;&#x4F8B;&#x3002;&#x4E0B;&#x5468;&#x6211;&#x4F1A;&#x6F14;&#x793A;&#x4E00;&#x4E9B;&#x6574;&#x5408;&#x57FA;&#x672C;&#x6A21;&#x5757;&#xFF0C;&#x6210;&#x529F;&#x6784;&#x5EFA;&#x9AD8;&#x6548;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x5177;&#x4F53;&#x6848;&#x4F8B;&#x3002;&#x6211;&#x5E0C;&#x671B;&#x4E0B;&#x5468;&#x7684;&#x8BFE;&#x7A0B;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x4F60;&#x627E;&#x5230;&#x6784;&#x5EFA;&#x6709;&#x6548;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x6216;&#x8BB8;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x5C06;&#x522B;&#x4EBA;&#x5F00;&#x53D1;&#x7684;&#x6846;&#x67B6;&#x5E94;&#x7528;&#x4E8E;&#x81EA;&#x5DF1;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x8FD9;&#x662F;&#x4E0B;&#x5468;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x4E0B;&#x8282;&#x8BFE;&#xFF0C;&#x4E5F;&#x662F;&#x672C;&#x5468;&#x6700;&#x540E;&#x4E00;&#x8282;&#x8BFE;&#xFF0C;&#x6211;&#x60F3;&#x82B1;&#x70B9;&#x65F6;&#x95F4;&#x8BA8;&#x8BBA;&#x4E0B;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x5927;&#x5BB6;&#x613F;&#x610F;&#x4F7F;&#x7528;&#x5377;&#x79EF;&#xFF0C;&#x4F7F;&#x7528;&#x5377;&#x79EF;&#x7684;&#x597D;&#x5904;&#x548C;&#x4F18;&#x52BF;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x6574;&#x5408;&#x591A;&#x4E2A;&#x5377;&#x79EF;&#xFF0C;&#x5982;&#x4F55;&#x68C0;&#x9A8C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x5982;&#x4F55;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x8BAD;&#x7EC3;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6765;&#x8BC6;&#x522B;&#x56FE;&#x7247;&#x6216;&#x6267;&#x884C;&#x5176;&#x4ED6;&#x4EFB;&#x52A1;&#xFF0C;&#x6211;&#x4EEC;&#x4E0B;&#x8282;&#x8BFE;&#x7EE7;&#x7EED;&#x8BB2;&#x3002;</p>
<h3 id="111-&#x4E3A;&#x4EC0;&#x4E48;&#x4F7F;&#x7528;&#x5377;&#x79EF;&#xFF1F;&#xFF08;why-convolutions&#xFF09;">1.11 &#x4E3A;&#x4EC0;&#x4E48;&#x4F7F;&#x7528;&#x5377;&#x79EF;&#xFF1F;&#xFF08;Why convolutions?&#xFF09;</h3>
<p>&#x8FD9;&#x662F;&#x672C;&#x5468;&#x6700;&#x540E;&#x4E00;&#x8282;&#x8BFE;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x5206;&#x6790;&#x4E00;&#x4E0B;&#x5377;&#x79EF;&#x5728;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x5982;&#x6B64;&#x53D7;&#x7528;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x5982;&#x4F55;&#x6574;&#x5408;&#x8FD9;&#x4E9B;&#x5377;&#x79EF;&#xFF0C;&#x5982;&#x4F55;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x6807;&#x6CE8;&#x8FC7;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#x8BAD;&#x7EC3;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x505A;&#x4E2A;&#x7B80;&#x5355;&#x6982;&#x62EC;&#x3002;&#x548C;&#x53EA;&#x7528;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x76F8;&#x6BD4;&#xFF0C;&#x5377;&#x79EF;&#x5C42;&#x7684;&#x4E24;&#x4E2A;&#x4E3B;&#x8981;&#x4F18;&#x52BF;&#x5728;&#x4E8E;&#x53C2;&#x6570;&#x5171;&#x4EAB;&#x548C;&#x7A00;&#x758F;&#x8FDE;&#x63A5;&#xFF0C;&#x4E3E;&#x4F8B;&#x8BF4;&#x660E;&#x4E00;&#x4E0B;&#x3002;</p>
<p><img src="../images/beedba9de67752b61ad0eede899eb4de.png" alt=""></p>
<p>&#x5047;&#x8BBE;&#x6709;&#x4E00;&#x5F20;32&#xD7;32&#xD7;3&#x7EF4;&#x5EA6;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x8FD9;&#x662F;&#x4E0A;&#x8282;&#x8BFE;&#x7684;&#x793A;&#x4F8B;&#xFF0C;&#x5047;&#x8BBE;&#x7528;&#x4E86;6&#x4E2A;&#x5927;&#x5C0F;&#x4E3A;5&#xD7;5&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x8F93;&#x51FA;&#x7EF4;&#x5EA6;&#x4E3A;28&#xD7;28&#xD7;6&#x3002;32&#xD7;32&#xD7;3=3072&#xFF0C;28&#xD7;28&#xD7;6=4704&#x3002;&#x6211;&#x4EEC;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x5C42;&#x542B;&#x6709;3072&#x4E2A;&#x5355;&#x5143;&#xFF0C;&#x4E0B;&#x4E00;&#x5C42;&#x542B;&#x6709;4074&#x4E2A;&#x5355;&#x5143;&#xFF0C;&#x4E24;&#x5C42;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x5F7C;&#x6B64;&#x76F8;&#x8FDE;&#xFF0C;&#x7136;&#x540E;&#x8BA1;&#x7B97;&#x6743;&#x91CD;&#x77E9;&#x9635;&#xFF0C;&#x5B83;&#x7B49;&#x4E8E;4074&#xD7;3072&#x2248;1400&#x4E07;&#xFF0C;&#x6240;&#x4EE5;&#x8981;&#x8BAD;&#x7EC3;&#x7684;&#x53C2;&#x6570;&#x5F88;&#x591A;&#x3002;&#x867D;&#x7136;&#x4EE5;&#x73B0;&#x5728;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;1400&#x591A;&#x4E07;&#x4E2A;&#x53C2;&#x6570;&#x6765;&#x8BAD;&#x7EC3;&#x7F51;&#x7EDC;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x5F20;32&#xD7;32&#xD7;3&#x7684;&#x56FE;&#x7247;&#x975E;&#x5E38;&#x5C0F;&#xFF0C;&#x8BAD;&#x7EC3;&#x8FD9;&#x4E48;&#x591A;&#x53C2;&#x6570;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x662F;&#x4E00;&#x5F20;1000&#xD7;1000&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x6743;&#x91CD;&#x77E9;&#x9635;&#x4F1A;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x5927;&#x3002;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x8FD9;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x7684;&#x53C2;&#x6570;&#x6570;&#x91CF;&#xFF0C;&#x6BCF;&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#x90FD;&#x662F;5&#xD7;5&#xFF0C;&#x4E00;&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#x6709;25&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;&#x504F;&#x5DEE;&#x53C2;&#x6570;&#xFF0C;&#x90A3;&#x4E48;&#x6BCF;&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#x5C31;&#x6709;26&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x4E00;&#x5171;&#x6709;6&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x6240;&#x4EE5;&#x53C2;&#x6570;&#x5171;&#x8BA1;156&#x4E2A;&#xFF0C;&#x53C2;&#x6570;&#x6570;&#x91CF;&#x8FD8;&#x662F;&#x5F88;&#x5C11;&#x3002;</p>
<p>&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x6620;&#x5C04;&#x8FD9;&#x4E48;&#x5C11;&#x53C2;&#x6570;&#x6709;&#x4E24;&#x4E2A;&#x539F;&#x56E0;&#xFF1A;</p>
<p>&#x4E00;&#x662F;&#x53C2;&#x6570;&#x5171;&#x4EAB;&#x3002;&#x89C2;&#x5BDF;&#x53D1;&#x73B0;&#xFF0C;&#x7279;&#x5F81;&#x68C0;&#x6D4B;&#x5982;&#x5782;&#x76F4;&#x8FB9;&#x7F18;&#x68C0;&#x6D4B;&#x5982;&#x679C;&#x9002;&#x7528;&#x4E8E;&#x56FE;&#x7247;&#x7684;&#x67D0;&#x4E2A;&#x533A;&#x57DF;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x4E5F;&#x53EF;&#x80FD;&#x9002;&#x7528;&#x4E8E;&#x56FE;&#x7247;&#x7684;&#x5176;&#x4ED6;&#x533A;&#x57DF;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7528;&#x4E00;&#x4E2A;3&#xD7;3&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x68C0;&#x6D4B;&#x5782;&#x76F4;&#x8FB9;&#x7F18;&#xFF0C;&#x90A3;&#x4E48;&#x56FE;&#x7247;&#x7684;&#x5DE6;&#x4E0A;&#x89D2;&#x533A;&#x57DF;&#xFF0C;&#x4EE5;&#x53CA;&#x65C1;&#x8FB9;&#x7684;&#x5404;&#x4E2A;&#x533A;&#x57DF;&#xFF08;&#x5DE6;&#x8FB9;&#x77E9;&#x9635;&#x4E2D;&#x84DD;&#x8272;&#x65B9;&#x6846;&#x6807;&#x8BB0;&#x7684;&#x90E8;&#x5206;&#xFF09;&#x90FD;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;3&#xD7;3&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x3002;&#x6BCF;&#x4E2A;&#x7279;&#x5F81;&#x68C0;&#x6D4B;&#x5668;&#x4EE5;&#x53CA;&#x8F93;&#x51FA;&#x90FD;&#x53EF;&#x4EE5;&#x5728;&#x8F93;&#x5165;&#x56FE;&#x7247;&#x7684;&#x4E0D;&#x540C;&#x533A;&#x57DF;&#x4E2D;&#x4F7F;&#x7528;&#x540C;&#x6837;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x4EE5;&#x4FBF;&#x63D0;&#x53D6;&#x5782;&#x76F4;&#x8FB9;&#x7F18;&#x6216;&#x5176;&#x5B83;&#x7279;&#x5F81;&#x3002;&#x5B83;&#x4E0D;&#x4EC5;&#x9002;&#x7528;&#x4E8E;&#x8FB9;&#x7F18;&#x7279;&#x5F81;&#x8FD9;&#x6837;&#x7684;&#x4F4E;&#x9636;&#x7279;&#x5F81;&#xFF0C;&#x540C;&#x6837;&#x9002;&#x7528;&#x4E8E;&#x9AD8;&#x9636;&#x7279;&#x5F81;&#xFF0C;&#x4F8B;&#x5982;&#x63D0;&#x53D6;&#x8138;&#x4E0A;&#x7684;&#x773C;&#x775B;&#xFF0C;&#x732B;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x7279;&#x5F81;&#x5BF9;&#x8C61;&#x3002;&#x5373;&#x4F7F;&#x51CF;&#x5C11;&#x53C2;&#x6570;&#x4E2A;&#x6570;&#xFF0C;&#x8FD9;9&#x4E2A;&#x53C2;&#x6570;&#x540C;&#x6837;&#x80FD;&#x8BA1;&#x7B97;&#x51FA;16&#x4E2A;&#x8F93;&#x51FA;&#x3002;&#x76F4;&#x89C2;&#x611F;&#x89C9;&#x662F;&#xFF0C;&#x4E00;&#x4E2A;&#x7279;&#x5F81;&#x68C0;&#x6D4B;&#x5668;&#xFF0C;&#x5982;&#x5782;&#x76F4;&#x8FB9;&#x7F18;&#x68C0;&#x6D4B;&#x5668;&#x7528;&#x4E8E;&#x68C0;&#x6D4B;&#x56FE;&#x7247;&#x5DE6;&#x4E0A;&#x89D2;&#x533A;&#x57DF;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x8FD9;&#x4E2A;&#x7279;&#x5F81;&#x5F88;&#x53EF;&#x80FD;&#x4E5F;&#x9002;&#x7528;&#x4E8E;&#x56FE;&#x7247;&#x7684;&#x53F3;&#x4E0B;&#x89D2;&#x533A;&#x57DF;&#x3002;&#x56E0;&#x6B64;&#x5728;&#x8BA1;&#x7B97;&#x56FE;&#x7247;&#x5DE6;&#x4E0A;&#x89D2;&#x548C;&#x53F3;&#x4E0B;&#x89D2;&#x533A;&#x57DF;&#x65F6;&#xFF0C;&#x4F60;&#x4E0D;&#x9700;&#x8981;&#x6DFB;&#x52A0;&#x5176;&#x5B83;&#x7279;&#x5F81;&#x68C0;&#x6D4B;&#x5668;&#x3002;&#x5047;&#x5982;&#x6709;&#x4E00;&#x4E2A;&#x8FD9;&#x6837;&#x7684;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x5176;&#x5DE6;&#x4E0A;&#x89D2;&#x548C;&#x53F3;&#x4E0B;&#x89D2;&#x53EF;&#x80FD;&#x6709;&#x4E0D;&#x540C;&#x5206;&#x5E03;&#xFF0C;&#x4E5F;&#x6709;&#x53EF;&#x80FD;&#x7A0D;&#x6709;&#x4E0D;&#x540C;&#xFF0C;&#x4F46;&#x5F88;&#x76F8;&#x4F3C;&#xFF0C;&#x6574;&#x5F20;&#x56FE;&#x7247;&#x5171;&#x4EAB;&#x7279;&#x5F81;&#x68C0;&#x6D4B;&#x5668;&#xFF0C;&#x63D0;&#x53D6;&#x6548;&#x679C;&#x4E5F;&#x5F88;&#x597D;&#x3002;</p>
<p><img src="../images/dad50972904bcd2131657db7798595b7.png" alt=""></p>
<p>&#x7B2C;&#x4E8C;&#x4E2A;&#x65B9;&#x6CD5;&#x662F;&#x4F7F;&#x7528;&#x7A00;&#x758F;&#x8FDE;&#x63A5;&#xFF0C;&#x6211;&#x6765;&#x89E3;&#x91CA;&#x4E0B;&#x3002;&#x8FD9;&#x4E2A;0&#x662F;&#x901A;&#x8FC7;3&#xD7;3&#x7684;&#x5377;&#x79EF;&#x8BA1;&#x7B97;&#x5F97;&#x5230;&#x7684;&#xFF0C;&#x5B83;&#x53EA;&#x4F9D;&#x8D56;&#x4E8E;&#x8FD9;&#x4E2A;3&#xD7;3&#x7684;&#x8F93;&#x5165;&#x7684;&#x5355;&#x5143;&#x683C;&#xFF0C;&#x53F3;&#x8FB9;&#x8FD9;&#x4E2A;&#x8F93;&#x51FA;&#x5355;&#x5143;&#xFF08;&#x5143;&#x7D20;0&#xFF09;&#x4EC5;&#x4E0E;36&#x4E2A;&#x8F93;&#x5165;&#x7279;&#x5F81;&#x4E2D;9&#x4E2A;&#x76F8;&#x8FDE;&#x63A5;&#x3002;&#x800C;&#x4E14;&#x5176;&#x5B83;&#x50CF;&#x7D20;&#x503C;&#x90FD;&#x4E0D;&#x4F1A;&#x5BF9;&#x8F93;&#x51FA;&#x4EA7;&#x751F;&#x4EFB;&#x5F71;&#x54CD;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x7A00;&#x758F;&#x8FDE;&#x63A5;&#x7684;&#x6982;&#x5FF5;&#x3002;</p>
<p><img src="../images/7503372ab986cd3aedda7674bedfd5f0.png" alt=""></p>
<p>&#x518D;&#x4E3E;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x8FD9;&#x4E2A;&#x8F93;&#x51FA;&#xFF08;&#x53F3;&#x8FB9;&#x77E9;&#x9635;&#x4E2D;&#x7EA2;&#x8272;&#x6807;&#x8BB0;&#x7684;&#x5143;&#x7D20; 30&#xFF09;&#x4EC5;&#x4EC5;&#x4F9D;&#x8D56;&#x4E8E;&#x8FD9;9&#x4E2A;&#x7279;&#x5F81;&#xFF08;&#x5DE6;&#x8FB9;&#x77E9;&#x9635;&#x7EA2;&#x8272;&#x65B9;&#x6846;&#x6807;&#x8BB0;&#x7684;&#x533A;&#x57DF;&#xFF09;&#xFF0C;&#x770B;&#x4E0A;&#x53BB;&#x53EA;&#x6709;&#x8FD9;9&#x4E2A;&#x8F93;&#x5165;&#x7279;&#x5F81;&#x4E0E;&#x8F93;&#x51FA;&#x76F8;&#x8FDE;&#x63A5;&#xFF0C;&#x5176;&#x5B83;&#x50CF;&#x7D20;&#x5BF9;&#x8F93;&#x51FA;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5F71;&#x54CD;&#x3002;</p>
<p>&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8FD9;&#x4E24;&#x79CD;&#x673A;&#x5236;&#x51CF;&#x5C11;&#x53C2;&#x6570;&#xFF0C;&#x4EE5;&#x4FBF;&#x6211;&#x4EEC;&#x7528;&#x66F4;&#x5C0F;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#x6765;&#x8BAD;&#x7EC3;&#x5B83;&#xFF0C;&#x4ECE;&#x800C;&#x9884;&#x9632;&#x8FC7;&#x5EA6;&#x62DF;&#x5408;&#x3002;&#x4F60;&#x4EEC;&#x4E5F;&#x53EF;&#x80FD;&#x542C;&#x8FC7;&#xFF0C;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5584;&#x4E8E;&#x6355;&#x6349;&#x5E73;&#x79FB;&#x4E0D;&#x53D8;&#x3002;&#x901A;&#x8FC7;&#x89C2;&#x5BDF;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#xFF0C;&#x5411;&#x53F3;&#x79FB;&#x52A8;&#x4E24;&#x4E2A;&#x50CF;&#x7D20;&#xFF0C;&#x56FE;&#x7247;&#x4E2D;&#x7684;&#x732B;&#x4F9D;&#x7136;&#x6E05;&#x6670;&#x53EF;&#x89C1;&#xFF0C;&#x56E0;&#x4E3A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x5377;&#x79EF;&#x7ED3;&#x6784;&#x4F7F;&#x5F97;&#x5373;&#x4F7F;&#x79FB;&#x52A8;&#x51E0;&#x4E2A;&#x50CF;&#x7D20;&#xFF0C;&#x8FD9;&#x5F20;&#x56FE;&#x7247;&#x4F9D;&#x7136;&#x5177;&#x6709;&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x5E94;&#x8BE5;&#x5C5E;&#x4E8E;&#x540C;&#x6837;&#x7684;&#x8F93;&#x51FA;&#x6807;&#x8BB0;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x7528;&#x540C;&#x4E00;&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#x751F;&#x6210;&#x5404;&#x5C42;&#x4E2D;&#xFF0C;&#x56FE;&#x7247;&#x7684;&#x6240;&#x6709;&#x50CF;&#x7D20;&#x503C;&#xFF0C;&#x5E0C;&#x671B;&#x7F51;&#x7EDC;&#x901A;&#x8FC7;&#x81EA;&#x52A8;&#x5B66;&#x4E60;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x5065;&#x58EE;&#xFF0C;&#x4EE5;&#x4FBF;&#x66F4;&#x597D;&#x5730;&#x53D6;&#x5F97;&#x6240;&#x671F;&#x671B;&#x7684;&#x5E73;&#x79FB;&#x4E0D;&#x53D8;&#x5C5E;&#x6027;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x5377;&#x79EF;&#x6216;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x4EFB;&#x52A1;&#x4E2D;&#x8868;&#x73B0;&#x826F;&#x597D;&#x7684;&#x539F;&#x56E0;&#x3002;</p>
<p><img src="../images/8fd4c61773f0245c87871de14f0a2d03.png" alt=""></p>
<p>&#x6700;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x8FD9;&#x4E9B;&#x5C42;&#x6574;&#x5408;&#x8D77;&#x6765;&#xFF0C;&#x770B;&#x770B;&#x5982;&#x4F55;&#x8BAD;&#x7EC3;&#x8FD9;&#x4E9B;&#x7F51;&#x7EDC;&#x3002;&#x6BD4;&#x5982;&#x6211;&#x4EEC;&#x8981;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x732B;&#x54AA;&#x68C0;&#x6D4B;&#x5668;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x6807;&#x8BB0;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;$x$&#x8868;&#x793A;&#x4E00;&#x5F20;&#x56FE;&#x7247;&#xFF0C;$\hat{y}$&#x662F;&#x4E8C;&#x8FDB;&#x5236;&#x6807;&#x8BB0;&#x6216;&#x67D0;&#x4E2A;&#x91CD;&#x8981;&#x6807;&#x8BB0;&#x3002;&#x6211;&#x4EEC;&#x9009;&#x5B9A;&#x4E86;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x8F93;&#x5165;&#x56FE;&#x7247;&#xFF0C;&#x589E;&#x52A0;&#x5377;&#x79EF;&#x5C42;&#x548C;&#x6C60;&#x5316;&#x5C42;&#xFF0C;&#x7136;&#x540E;&#x6DFB;&#x52A0;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#xFF0C;&#x6700;&#x540E;&#x8F93;&#x51FA;&#x4E00;&#x4E2A;<strong>softmax</strong>&#xFF0C;&#x5373;$\hat{y}$&#x3002;&#x5377;&#x79EF;&#x5C42;&#x548C;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x53C2;&#x6570;$w$&#x548C;&#x504F;&#x5DEE;$b$&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;&#x4EFB;&#x4F55;&#x53C2;&#x6570;&#x96C6;&#x5408;&#x6765;&#x5B9A;&#x4E49;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x3002;&#x4E00;&#x4E2A;&#x7C7B;&#x4F3C;&#x4E8E;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x8BB2;&#x8FC7;&#x7684;&#x90A3;&#x79CD;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#xFF0C;&#x5E76;&#x968F;&#x673A;&#x521D;&#x59CB;&#x5316;&#x5176;&#x53C2;&#x6570;$w$&#x548C;$b$&#xFF0C;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;$J$&#x7B49;&#x4E8E;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5BF9;&#x6574;&#x4E2A;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x9884;&#x6D4B;&#x7684;&#x635F;&#x5931;&#x603B;&#x548C;&#x518D;&#x9664;&#x4EE5;$m$&#xFF08;&#x5373;$\text{Cost}\ J = \frac{1}{m}\sum_{i = 1}^{m}{L(\hat{y}^{(i)},y^{(i)})}$&#xFF09;&#x3002;&#x6240;&#x4EE5;&#x8BAD;&#x7EC3;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x4F60;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x4F7F;&#x7528;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x6CD5;&#xFF0C;&#x6216;&#x5176;&#x5B83;&#x7B97;&#x6CD5;&#xFF0C;&#x4F8B;&#x5982;<strong>Momentum</strong>&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x6CD5;&#xFF0C;&#x542B;<strong>RMSProp</strong>&#x6216;&#x5176;&#x5B83;&#x56E0;&#x5B50;&#x7684;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x6765;&#x4F18;&#x5316;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x6240;&#x6709;&#x53C2;&#x6570;&#xFF0C;&#x4EE5;&#x51CF;&#x5C11;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;$J$&#x7684;&#x503C;&#x3002;&#x901A;&#x8FC7;&#x4E0A;&#x8FF0;&#x64CD;&#x4F5C;&#x4F60;&#x53EF;&#x4EE5;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x9AD8;&#x6548;&#x7684;&#x732B;&#x54AA;&#x68C0;&#x6D4B;&#x5668;&#x6216;&#x5176;&#x5B83;&#x68C0;&#x6D4B;&#x5668;&#x3002;</p>
<p>&#x606D;&#x559C;&#x4F60;&#x5B8C;&#x6210;&#x4E86;&#x8FD9;&#x4E00;&#x5468;&#x7684;&#x8BFE;&#x7A0B;&#xFF0C;&#x4F60;&#x5DF2;&#x7ECF;&#x5B66;&#x4E60;&#x4E86;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x6240;&#x6709;&#x57FA;&#x672C;&#x6784;&#x9020;&#x6A21;&#x5757;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x5728;&#x9AD8;&#x6548;&#x56FE;&#x7247;&#x8BC6;&#x522B;&#x7CFB;&#x7EDF;&#x4E2D;&#x6574;&#x5408;&#x8FD9;&#x4E9B;&#x6A21;&#x5757;&#x3002;&#x900F;&#x8FC7;&#x672C;&#x5468;&#x7F16;&#x7A0B;&#x7EC3;&#x4E60;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x66F4;&#x52A0;&#x5177;&#x4F53;&#x4E86;&#x89E3;&#x8FD9;&#x4E9B;&#x6982;&#x5FF5;&#xFF0C;&#x8BD5;&#x7740;&#x6574;&#x5408;&#x8FD9;&#x4E9B;&#x6784;&#x9020;&#x6A21;&#x5757;&#xFF0C;&#x5E76;&#x7528;&#x5B83;&#x4EEC;&#x89E3;&#x51B3;&#x81EA;&#x5DF1;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x4E0B;&#x5468;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x7EE7;&#x7EED;&#x6DF1;&#x5165;&#x5B66;&#x4E60;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;&#x6211;&#x66FE;&#x63D0;&#x5230;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x6709;&#x5F88;&#x591A;&#x8D85;&#x53C2;&#x6570;&#xFF0C;&#x4E0B;&#x5468;&#xFF0C;&#x6211;&#x6253;&#x7B97;&#x5177;&#x4F53;&#x5C55;&#x793A;&#x4E00;&#x4E9B;&#x6700;&#x6709;&#x6548;&#x7684;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x793A;&#x4F8B;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x53BB;&#x5224;&#x65AD;&#x54EA;&#x4E9B;&#x7F51;&#x7EDC;&#x67B6;&#x6784;&#x7C7B;&#x578B;&#x6548;&#x7387;&#x66F4;&#x9AD8;&#x3002;&#x4EBA;&#x4EEC;&#x901A;&#x5E38;&#x7684;&#x505A;&#x6CD5;&#x662F;&#x5C06;&#x522B;&#x4EBA;&#x53D1;&#x73B0;&#x548C;&#x53D1;&#x8868;&#x5728;&#x7814;&#x7A76;&#x62A5;&#x544A;&#x4E0A;&#x7684;&#x67B6;&#x6784;&#x5E94;&#x7528;&#x4E8E;&#x81EA;&#x5DF1;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x4E0B;&#x5468;&#x770B;&#x8FC7;&#x66F4;&#x591A;&#x5177;&#x4F53;&#x7684;&#x793A;&#x4F8B;&#x540E;&#xFF0C;&#x76F8;&#x4FE1;&#x4F60;&#x4F1A;&#x505A;&#x7684;&#x66F4;&#x597D;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x4E0B;&#x661F;&#x671F;&#x6211;&#x4EEC;&#x4E5F;&#x4F1A;&#x6DF1;&#x5165;&#x5206;&#x6790;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5982;&#x6B64;&#x9AD8;&#x6548;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x540C;&#x65F6;&#x8BB2;&#x89E3;&#x4E00;&#x4E9B;&#x65B0;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x5BF9;&#x8C61;&#x68C0;&#x6D4B;&#x548C;&#x795E;&#x7ECF;&#x98CE;&#x683C;&#x8FC1;&#x79FB;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x5229;&#x7528;&#x8FD9;&#x4E9B;&#x7B97;&#x6CD5;&#x521B;&#x9020;&#x65B0;&#x7684;&#x827A;&#x672F;&#x54C1;&#x5F62;&#x5F0F;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="lesson3-week2.html" class="navigation navigation-prev " aria-label="Previous page: 第二周：机器学习策略">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="lesson4-week2.html" class="navigation navigation-next " aria-label="Next page: 第二周 深度卷积网络：实例探究">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第一周 卷积神经网络","level":"4.1","depth":1,"next":{"title":"第二周 深度卷积网络：实例探究","level":"4.2","depth":1,"path":"lesson4-week2.md","ref":"lesson4-week2.md","articles":[]},"previous":{"title":"第二周：机器学习策略","level":"3.2","depth":1,"path":"lesson3-week2.md","ref":"lesson3-week2.md","articles":[]},"dir":"ltr"},"config":{"plugins":["fontsettings","sharing","-lunr","-search","search-pro","highlight","livereload","back-to-top-button","cdn"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"cdn":{"url":"//cdn.jsdelivr.net/gh/zhepama/C-Sharp-Playground@gh-pages/","img_url":"//cdn.jsdelivr.net/gh/zhepama/C-Sharp-Playground@gh-pages/"},"fontsettings":{"family":"sans","size":2,"theme":"white"},"sharing":{"all":["facebook","google","twitter","weibo","instapaper"],"facebook":true,"google":false,"instapaper":false,"twitter":true,"vk":false,"weibo":false},"search-pro":{},"highlight":{},"livereload":{},"back-to-top-button":{},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"深度学习教程","language":"zh-hans","links":{"sidebar":{"编程网":"https://www.editcode.net"}},"gitbook":"*"},"file":{"path":"lesson4-week1.md","mtime":"2020-11-28T01:34:16.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-05-09T13:30:39.812Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook.js"></script>
    <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/theme.js"></script>
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    

    </body>
</html>

