
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第一周：深度学习的实践层面 · 深度学习教程</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/style.css">

    
            
                
                <link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-back-to-top-button/plugin.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="lesson2-week2.html" />
    
    
    <link rel="prev" href="lesson1-week4.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://www.editcode.net" target="_blank" class="custom-link">编程网</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        <li class="header">第一门课 神经网络和深度学习</li>
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="lesson1-week1.html">
            
                <a href="lesson1-week1.html">
            
                    
                    第一周：深度学习引言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="lesson1-week2.html">
            
                <a href="lesson1-week2.html">
            
                    
                    第二周：神经网络的编程基础
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="lesson1-week3.html">
            
                <a href="lesson1-week3.html">
            
                    
                    第三周：浅层神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="lesson1-week4.html">
            
                <a href="lesson1-week4.html">
            
                    
                    第四周：深层神经网络
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第二门课 改善深层神经网络</li>
        
        
    
        <li class="chapter active" data-level="2.1" data-path="lesson2-week1.html">
            
                <a href="lesson2-week1.html">
            
                    
                    第一周：深度学习的实践层面
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="lesson2-week2.html">
            
                <a href="lesson2-week2.html">
            
                    
                    第二周：优化算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="lesson2-week3.html">
            
                <a href="lesson2-week3.html">
            
                    
                    第三周超参数调试，batch正则化和程序框架
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第三门课 结构化机器学习项目</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="lesson3-week1.html">
            
                <a href="lesson3-week1.html">
            
                    
                    第一周：机器学习策略
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="lesson3-week2.html">
            
                <a href="lesson3-week2.html">
            
                    
                    第二周：机器学习策略
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第四门课 卷积神经网络</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="lesson4-week1.html">
            
                <a href="lesson4-week1.html">
            
                    
                    第一周 卷积神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="lesson4-week2.html">
            
                <a href="lesson4-week2.html">
            
                    
                    第二周 深度卷积网络：实例探究
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.3" data-path="lesson4-week3.html">
            
                <a href="lesson4-week3.html">
            
                    
                    第三周 目标检测
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.4" data-path="lesson4-week4.html">
            
                <a href="lesson4-week4.html">
            
                    
                    第四周 特殊应用：人脸识别和神经风格转换
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第五门课 序列模型</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="lesson5-week1.html">
            
                <a href="lesson5-week1.html">
            
                    
                    第一周 循环序列模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.2" data-path="lesson5-week2.html">
            
                <a href="lesson5-week2.html">
            
                    
                    第二周 自然语言处理与词嵌入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.3" data-path="lesson5-week3.html">
            
                <a href="lesson5-week3.html">
            
                    
                    第三周 序列模型和注意力机制
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">附件</li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="interview.html">
            
                <a href="interview.html">
            
                    
                    人工智能大师访谈
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.2" data-path="notation.html">
            
                <a href="notation.html">
            
                    
                    深度学习符号指南（原课程翻译）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.3" data-path="notation.html">
            
                <a href="notation.html">
            
                    
                    机器学习的数学基础
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第一周：深度学习的实践层面</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;&#x4E8C;&#x95E8;&#x8BFE;-&#x6539;&#x5584;&#x6DF1;&#x5C42;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF1A;&#x8D85;&#x53C2;&#x6570;&#x8C03;&#x8BD5;&#x3001;&#x6B63;&#x5219;&#x5316;&#x4EE5;&#x53CA;&#x4F18;&#x5316;improving-deep-neural-networkshyperparameter-tuning-regularization-and-optimization">&#x7B2C;&#x4E8C;&#x95E8;&#x8BFE; &#x6539;&#x5584;&#x6DF1;&#x5C42;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF1A;&#x8D85;&#x53C2;&#x6570;&#x8C03;&#x8BD5;&#x3001;&#x6B63;&#x5219;&#x5316;&#x4EE5;&#x53CA;&#x4F18;&#x5316;(Improving Deep Neural Networks:Hyperparameter tuning, Regularization and Optimization)</h1>
<h2 id="&#x7B2C;&#x4E00;&#x5468;&#xFF1A;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x5B9E;&#x8DF5;&#x5C42;&#x9762;practical-aspects-of-deep-learning">&#x7B2C;&#x4E00;&#x5468;&#xFF1A;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x5B9E;&#x8DF5;&#x5C42;&#x9762;(Practical aspects of Deep Learning)</h2>
<p>[TOC]</p>
<h3 id="11-&#x8BAD;&#x7EC3;&#xFF0C;&#x9A8C;&#x8BC1;&#xFF0C;&#x6D4B;&#x8BD5;&#x96C6;&#xFF08;train--dev--test-sets&#xFF09;">1.1 &#x8BAD;&#x7EC3;&#xFF0C;&#x9A8C;&#x8BC1;&#xFF0C;&#x6D4B;&#x8BD5;&#x96C6;&#xFF08;Train / Dev / Test sets&#xFF09;</h3>
<p><img src="../images/L2_week1_1.png" alt=""></p>
<p>&#x5927;&#x5BB6;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x4E86;&#x89E3;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x672C;&#x5468;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x7EE7;&#x7EED;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x6709;&#x6548;&#x8FD0;&#x4F5C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x5185;&#x5BB9;&#x6D89;&#x53CA;&#x8D85;&#x53C2;&#x6570;&#x8C03;&#x4F18;&#xFF0C;&#x5982;&#x4F55;&#x6784;&#x5EFA;&#x6570;&#x636E;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x786E;&#x4FDD;&#x4F18;&#x5316;&#x7B97;&#x6CD5;&#x5FEB;&#x901F;&#x8FD0;&#x884C;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x5728;&#x5408;&#x7406;&#x65F6;&#x95F4;&#x5185;&#x5B8C;&#x6210;&#x81EA;&#x6211;&#x5B66;&#x4E60;&#x3002;</p>
<p>&#x7B2C;&#x4E00;&#x5468;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x8BF4;&#x8BF4;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4E2D;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x7136;&#x540E;&#x662F;&#x968F;&#x673A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x8FD8;&#x4F1A;&#x5B66;&#x4E60;&#x4E00;&#x4E9B;&#x786E;&#x4FDD;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6B63;&#x786E;&#x8FD0;&#x884C;&#x7684;&#x6280;&#x5DE7;&#xFF0C;&#x5E26;&#x7740;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x4ECA;&#x5929;&#x7684;&#x8BFE;&#x7A0B;&#x3002;</p>
<p>&#x5728;&#x914D;&#x7F6E;&#x8BAD;&#x7EC3;&#x3001;&#x9A8C;&#x8BC1;&#x548C;&#x6D4B;&#x8BD5;&#x6570;&#x636E;&#x96C6;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x505A;&#x51FA;&#x6B63;&#x786E;&#x51B3;&#x7B56;&#x4F1A;&#x5728;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x5E2E;&#x52A9;&#x5927;&#x5BB6;&#x521B;&#x5EFA;&#x9AD8;&#x6548;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;&#x8BAD;&#x7EC3;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x505A;&#x51FA;&#x5F88;&#x591A;&#x51B3;&#x7B56;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p>
<ol>
<li><p>&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5206;&#x591A;&#x5C11;&#x5C42;</p>
</li>
<li><p>&#x6BCF;&#x5C42;&#x542B;&#x6709;&#x591A;&#x5C11;&#x4E2A;&#x9690;&#x85CF;&#x5355;&#x5143;</p>
</li>
<li><p>&#x5B66;&#x4E60;&#x901F;&#x7387;&#x662F;&#x591A;&#x5C11;</p>
</li>
<li><p>&#x5404;&#x5C42;&#x91C7;&#x7528;&#x54EA;&#x4E9B;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;</p>
</li>
</ol>
<p><img src="../images/L2_week1_2.png" alt=""></p>
<p>&#x521B;&#x5EFA;&#x65B0;&#x5E94;&#x7528;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x53EF;&#x80FD;&#x4ECE;&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x51C6;&#x786E;&#x9884;&#x6D4B;&#x51FA;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x548C;&#x5176;&#x4ED6;&#x8D85;&#x7EA7;&#x53C2;&#x6570;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5E94;&#x7528;&#x578B;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x662F;&#x4E00;&#x4E2A;&#x9AD8;&#x5EA6;&#x8FED;&#x4EE3;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x901A;&#x5E38;&#x5728;&#x9879;&#x76EE;&#x542F;&#x52A8;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x5148;&#x6709;&#x4E00;&#x4E2A;&#x521D;&#x6B65;&#x60F3;&#x6CD5;&#xFF0C;&#x6BD4;&#x5982;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x542B;&#x6709;&#x7279;&#x5B9A;&#x5C42;&#x6570;&#xFF0C;&#x9690;&#x85CF;&#x5355;&#x5143;&#x6570;&#x91CF;&#x6216;&#x6570;&#x636E;&#x96C6;&#x4E2A;&#x6570;&#x7B49;&#x7B49;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x7136;&#x540E;&#x7F16;&#x7801;&#xFF0C;&#x5E76;&#x5C1D;&#x8BD5;&#x8FD0;&#x884C;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#xFF0C;&#x901A;&#x8FC7;&#x8FD0;&#x884C;&#x548C;&#x6D4B;&#x8BD5;&#x5F97;&#x5230;&#x8BE5;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6216;&#x8FD9;&#x4E9B;&#x914D;&#x7F6E;&#x4FE1;&#x606F;&#x7684;&#x8FD0;&#x884C;&#x7ED3;&#x679C;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x6839;&#x636E;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x91CD;&#x65B0;&#x5B8C;&#x5584;&#x81EA;&#x5DF1;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x6539;&#x53D8;&#x7B56;&#x7565;&#xFF0C;&#x6216;&#x8005;&#x4E3A;&#x4E86;&#x627E;&#x5230;&#x66F4;&#x597D;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E0D;&#x65AD;&#x8FED;&#x4EE3;&#x66F4;&#x65B0;&#x81EA;&#x5DF1;&#x7684;&#x65B9;&#x6848;&#x3002;</p>
<p>&#x73B0;&#x5982;&#x4ECA;&#xFF0C;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x5DF2;&#x7ECF;&#x5728;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x5904;&#x7406;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#xFF0C;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#x4EE5;&#x53CA;&#x7ED3;&#x6784;&#x5316;&#x6570;&#x636E;&#x5E94;&#x7528;&#x7B49;&#x4F17;&#x591A;&#x9886;&#x57DF;&#x53D6;&#x5F97;&#x5DE8;&#x5927;&#x6210;&#x529F;&#x3002;&#x7ED3;&#x6784;&#x5316;&#x6570;&#x636E;&#x65E0;&#x6240;&#x4E0D;&#x5305;&#xFF0C;&#x4ECE;&#x5E7F;&#x544A;&#x5230;&#x7F51;&#x7EDC;&#x641C;&#x7D22;&#x3002;&#x5176;&#x4E2D;&#x7F51;&#x7EDC;&#x641C;&#x7D22;&#x4E0D;&#x4EC5;&#x5305;&#x62EC;&#x7F51;&#x7EDC;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#xFF0C;&#x8FD8;&#x5305;&#x62EC;&#x8D2D;&#x7269;&#x7F51;&#x7AD9;&#xFF0C;&#x4ECE;&#x6240;&#x6709;&#x6839;&#x636E;&#x641C;&#x7D22;&#x680F;&#x8BCD;&#x6761;&#x4F20;&#x8F93;&#x7ED3;&#x679C;&#x7684;&#x7F51;&#x7AD9;&#x3002;&#x518D;&#x5230;&#x8BA1;&#x7B97;&#x673A;&#x5B89;&#x5168;&#xFF0C;&#x7269;&#x6D41;&#xFF0C;&#x6BD4;&#x5982;&#x5224;&#x65AD;&#x53F8;&#x673A;&#x53BB;&#x54EA;&#x63A5;&#x9001;&#x8D27;&#xFF0C;&#x8303;&#x56F4;&#x4E4B;&#x5E7F;&#xFF0C;&#x4E0D;&#x80DC;&#x679A;&#x4E3E;&#x3002;</p>
<p>&#x6211;&#x53D1;&#x73B0;&#xFF0C;&#x53EF;&#x80FD;&#x6709;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x5904;&#x7406;&#x65B9;&#x9762;&#x7684;&#x4EBA;&#x624D;&#x60F3;&#x8E0F;&#x8DB3;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x9886;&#x57DF;&#xFF0C;&#x6216;&#x8005;&#x7ECF;&#x9A8C;&#x4E30;&#x5BCC;&#x7684;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#x4E13;&#x5BB6;&#x60F3;&#x6295;&#x8EAB;&#x5E7F;&#x544A;&#x884C;&#x4E1A;&#xFF0C;&#x53C8;&#x6216;&#x8005;&#xFF0C;&#x6709;&#x7684;&#x4EBA;&#x60F3;&#x4ECE;&#x7535;&#x8111;&#x5B89;&#x5168;&#x9886;&#x57DF;&#x8DF3;&#x5230;&#x7269;&#x6D41;&#x884C;&#x4E1A;&#xFF0C;&#x5728;&#x6211;&#x770B;&#x6765;&#xFF0C;&#x4ECE;&#x4E00;&#x4E2A;&#x9886;&#x57DF;&#x6216;&#x8005;&#x5E94;&#x7528;&#x9886;&#x57DF;&#x5F97;&#x6765;&#x7684;&#x76F4;&#x89C9;&#x7ECF;&#x9A8C;&#xFF0C;&#x901A;&#x5E38;&#x65E0;&#x6CD5;&#x8F6C;&#x79FB;&#x5230;&#x5176;&#x4ED6;&#x5E94;&#x7528;&#x9886;&#x57DF;&#xFF0C;&#x6700;&#x4F73;&#x51B3;&#x7B56;&#x53D6;&#x51B3;&#x4E8E;&#x4F60;&#x6240;&#x62E5;&#x6709;&#x7684;&#x6570;&#x636E;&#x91CF;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x914D;&#x7F6E;&#x4E2D;&#x8F93;&#x5165;&#x7279;&#x5F81;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x7528;<strong>GPU</strong>&#x8BAD;&#x7EC3;&#x8FD8;&#x662F;<strong>CPU</strong>&#xFF0C;<strong>GPU</strong>&#x548C;<strong>CPU</strong>&#x7684;&#x5177;&#x4F53;&#x914D;&#x7F6E;&#x4EE5;&#x53CA;&#x5176;&#x4ED6;&#x8BF8;&#x591A;&#x56E0;&#x7D20;&#x3002;</p>
<p><img src="../images/97596da07232f85d566710ee7dd2f8ad.png" alt=""></p>
<p>&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#xFF0C;&#x5BF9;&#x4E8E;&#x5F88;&#x591A;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x7ECF;&#x9A8C;&#x4E30;&#x5BCC;&#x7684;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x884C;&#x5BB6;&#x4E5F;&#x4E0D;&#x592A;&#x53EF;&#x80FD;&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x9884;&#x8BBE;&#x51FA;&#x6700;&#x5339;&#x914D;&#x7684;&#x8D85;&#x7EA7;&#x53C2;&#x6570;&#xFF0C;&#x6240;&#x4EE5;&#x8BF4;&#xFF0C;&#x5E94;&#x7528;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x662F;&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x7684;&#x8FED;&#x4EE3;&#x8FC7;&#x7A0B;&#xFF0C;&#x9700;&#x8981;&#x591A;&#x6B21;&#x5FAA;&#x73AF;&#x5F80;&#x590D;&#xFF0C;&#x624D;&#x80FD;&#x4E3A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x79F0;&#x5FC3;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x56E0;&#x6B64;&#x5FAA;&#x73AF;&#x8BE5;&#x8FC7;&#x7A0B;&#x7684;&#x6548;&#x7387;&#x662F;&#x51B3;&#x5B9A;&#x9879;&#x76EE;&#x8FDB;&#x5C55;&#x901F;&#x5EA6;&#x7684;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x56E0;&#x7D20;&#xFF0C;&#x800C;&#x521B;&#x5EFA;&#x9AD8;&#x8D28;&#x91CF;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x9A8C;&#x8BC1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x4E5F;&#x6709;&#x52A9;&#x4E8E;&#x63D0;&#x9AD8;&#x5FAA;&#x73AF;&#x6548;&#x7387;&#x3002;</p>
<p><img src="../images/072653e2e9402d2857bfcb7b9f783a5c.png" alt=""></p>
<p>&#x5047;&#x8BBE;&#x8FD9;&#x662F;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#xFF0C;&#x6211;&#x7528;&#x4E00;&#x4E2A;&#x957F;&#x65B9;&#x5F62;&#x8868;&#x793A;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x4F1A;&#x5C06;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x5212;&#x5206;&#x6210;&#x51E0;&#x90E8;&#x5206;&#xFF0C;&#x4E00;&#x90E8;&#x5206;&#x4F5C;&#x4E3A;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x4E00;&#x90E8;&#x5206;&#x4F5C;&#x4E3A;&#x7B80;&#x5355;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x96C6;&#xFF0C;&#x6709;&#x65F6;&#x4E5F;&#x79F0;&#x4E4B;&#x4E3A;&#x9A8C;&#x8BC1;&#x96C6;&#xFF0C;&#x65B9;&#x4FBF;&#x8D77;&#x89C1;&#xFF0C;&#x6211;&#x5C31;&#x53EB;&#x5B83;&#x9A8C;&#x8BC1;&#x96C6;&#xFF08;<strong>dev set</strong>&#xFF09;&#xFF0C;&#x5176;&#x5B9E;&#x90FD;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x6982;&#x5FF5;&#xFF0C;&#x6700;&#x540E;&#x4E00;&#x90E8;&#x5206;&#x5219;&#x4F5C;&#x4E3A;&#x6D4B;&#x8BD5;&#x96C6;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x5BF9;&#x8BAD;&#x7EC3;&#x96C6;&#x6267;&#x884C;&#x7B97;&#x6CD5;&#xFF0C;&#x901A;&#x8FC7;&#x9A8C;&#x8BC1;&#x96C6;&#x6216;&#x7B80;&#x5355;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x96C6;&#x9009;&#x62E9;&#x6700;&#x597D;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x7ECF;&#x8FC7;&#x5145;&#x5206;&#x9A8C;&#x8BC1;&#xFF0C;&#x6211;&#x4EEC;&#x9009;&#x5B9A;&#x4E86;&#x6700;&#x7EC8;&#x6A21;&#x578B;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x6D4B;&#x8BD5;&#x96C6;&#x4E0A;&#x8FDB;&#x884C;&#x8BC4;&#x4F30;&#x4E86;&#xFF0C;&#x4E3A;&#x4E86;&#x65E0;&#x504F;&#x8BC4;&#x4F30;&#x7B97;&#x6CD5;&#x7684;&#x8FD0;&#x884C;&#x72B6;&#x51B5;&#x3002;</p>
<p>&#x5728;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x53D1;&#x5C55;&#x7684;&#x5C0F;&#x6570;&#x636E;&#x91CF;&#x65F6;&#x4EE3;&#xFF0C;&#x5E38;&#x89C1;&#x505A;&#x6CD5;&#x662F;&#x5C06;&#x6240;&#x6709;&#x6570;&#x636E;&#x4E09;&#x4E03;&#x5206;&#xFF0C;&#x5C31;&#x662F;&#x4EBA;&#x4EEC;&#x5E38;&#x8BF4;&#x7684;70%&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;30%&#x6D4B;&#x8BD5;&#x96C6;&#x3002;&#x5982;&#x679C;&#x660E;&#x786E;&#x8BBE;&#x7F6E;&#x4E86;&#x9A8C;&#x8BC1;&#x96C6;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x6309;&#x7167;60%&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;20%&#x9A8C;&#x8BC1;&#x96C6;&#x548C;20%&#x6D4B;&#x8BD5;&#x96C6;&#x6765;&#x5212;&#x5206;&#x3002;&#x8FD9;&#x662F;&#x524D;&#x51E0;&#x5E74;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x9886;&#x57DF;&#x666E;&#x904D;&#x8BA4;&#x53EF;&#x7684;&#x6700;&#x597D;&#x7684;&#x5B9E;&#x8DF5;&#x65B9;&#x6CD5;&#x3002;</p>
<p><img src="../images/ebbfb8514ff5a983f41e938d5870b79d.png" alt=""></p>
<p>&#x5982;&#x679C;&#x53EA;&#x6709;100&#x6761;&#xFF0C;1000&#x6761;&#x6216;&#x8005;1&#x4E07;&#x6761;&#x6570;&#x636E;&#xFF0C;&#x90A3;&#x4E48;&#x4E0A;&#x8FF0;&#x6BD4;&#x4F8B;&#x5212;&#x5206;&#x662F;&#x975E;&#x5E38;&#x5408;&#x7406;&#x7684;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x5728;&#x5927;&#x6570;&#x636E;&#x65F6;&#x4EE3;&#xFF0C;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x7684;&#x6570;&#x636E;&#x91CF;&#x53EF;&#x80FD;&#x662F;&#x767E;&#x4E07;&#x7EA7;&#x522B;&#xFF0C;&#x90A3;&#x4E48;&#x9A8C;&#x8BC1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x5360;&#x6570;&#x636E;&#x603B;&#x91CF;&#x7684;&#x6BD4;&#x4F8B;&#x4F1A;&#x8D8B;&#x5411;&#x4E8E;&#x53D8;&#x5F97;&#x66F4;&#x5C0F;&#x3002;&#x56E0;&#x4E3A;&#x9A8C;&#x8BC1;&#x96C6;&#x7684;&#x76EE;&#x7684;&#x5C31;&#x662F;&#x9A8C;&#x8BC1;&#x4E0D;&#x540C;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x68C0;&#x9A8C;&#x54EA;&#x79CD;&#x7B97;&#x6CD5;&#x66F4;&#x6709;&#x6548;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x9A8C;&#x8BC1;&#x96C6;&#x53EA;&#x8981;&#x8DB3;&#x591F;&#x5927;&#x5230;&#x80FD;&#x8BC4;&#x4F30;&#x4E0D;&#x540C;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x6BD4;&#x5982;2&#x4E2A;&#x751A;&#x81F3;10&#x4E2A;&#x4E0D;&#x540C;&#x7B97;&#x6CD5;&#xFF0C;&#x5E76;&#x8FC5;&#x901F;&#x5224;&#x65AD;&#x51FA;&#x54EA;&#x79CD;&#x7B97;&#x6CD5;&#x66F4;&#x6709;&#x6548;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x4E0D;&#x9700;&#x8981;&#x62FF;&#x51FA;20%&#x7684;&#x6570;&#x636E;&#x4F5C;&#x4E3A;&#x9A8C;&#x8BC1;&#x96C6;&#x3002;</p>
<p><img src="../images/1224fb0922d5673c380e6dad9ded0b6b.png" alt=""></p>
<p>&#x6BD4;&#x5982;&#x6211;&#x4EEC;&#x6709;100&#x4E07;&#x6761;&#x6570;&#x636E;&#xFF0C;&#x90A3;&#x4E48;&#x53D6;1&#x4E07;&#x6761;&#x6570;&#x636E;&#x4FBF;&#x8DB3;&#x4EE5;&#x8FDB;&#x884C;&#x8BC4;&#x4F30;&#xFF0C;&#x627E;&#x51FA;&#x5176;&#x4E2D;&#x8868;&#x73B0;&#x6700;&#x597D;&#x7684;1-2&#x79CD;&#x7B97;&#x6CD5;&#x3002;&#x540C;&#x6837;&#x5730;&#xFF0C;&#x6839;&#x636E;&#x6700;&#x7EC8;&#x9009;&#x62E9;&#x7684;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x6D4B;&#x8BD5;&#x96C6;&#x7684;&#x4E3B;&#x8981;&#x76EE;&#x7684;&#x662F;&#x6B63;&#x786E;&#x8BC4;&#x4F30;&#x5206;&#x7C7B;&#x5668;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x5982;&#x679C;&#x62E5;&#x6709;&#x767E;&#x4E07;&#x6570;&#x636E;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;1000&#x6761;&#x6570;&#x636E;&#xFF0C;&#x4FBF;&#x8DB3;&#x4EE5;&#x8BC4;&#x4F30;&#x5355;&#x4E2A;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x5E76;&#x4E14;&#x51C6;&#x786E;&#x8BC4;&#x4F30;&#x8BE5;&#x5206;&#x7C7B;&#x5668;&#x7684;&#x6027;&#x80FD;&#x3002;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x6709;100&#x4E07;&#x6761;&#x6570;&#x636E;&#xFF0C;&#x5176;&#x4E2D;1&#x4E07;&#x6761;&#x4F5C;&#x4E3A;&#x9A8C;&#x8BC1;&#x96C6;&#xFF0C;1&#x4E07;&#x6761;&#x4F5C;&#x4E3A;&#x6D4B;&#x8BD5;&#x96C6;&#xFF0C;100&#x4E07;&#x91CC;&#x53D6;1&#x4E07;&#xFF0C;&#x6BD4;&#x4F8B;&#x662F;1%&#xFF0C;&#x5373;&#xFF1A;&#x8BAD;&#x7EC3;&#x96C6;&#x5360;98%&#xFF0C;&#x9A8C;&#x8BC1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x5404;&#x5360;1%&#x3002;&#x5BF9;&#x4E8E;&#x6570;&#x636E;&#x91CF;&#x8FC7;&#x767E;&#x4E07;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x8BAD;&#x7EC3;&#x96C6;&#x53EF;&#x4EE5;&#x5360;&#x5230;99.5%&#xFF0C;&#x9A8C;&#x8BC1;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x5404;&#x5360;0.25%&#xFF0C;&#x6216;&#x8005;&#x9A8C;&#x8BC1;&#x96C6;&#x5360;0.4%&#xFF0C;&#x6D4B;&#x8BD5;&#x96C6;&#x5360;0.1%&#x3002;</p>
<p>&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#xFF0C;&#x5728;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x5C06;&#x6837;&#x672C;&#x5206;&#x6210;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x9A8C;&#x8BC1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x4E09;&#x90E8;&#x5206;&#xFF0C;&#x6570;&#x636E;&#x96C6;&#x89C4;&#x6A21;&#x76F8;&#x5BF9;&#x8F83;&#x5C0F;&#xFF0C;&#x9002;&#x7528;&#x4F20;&#x7EDF;&#x7684;&#x5212;&#x5206;&#x6BD4;&#x4F8B;&#xFF0C;&#x6570;&#x636E;&#x96C6;&#x89C4;&#x6A21;&#x8F83;&#x5927;&#x7684;&#xFF0C;&#x9A8C;&#x8BC1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x8981;&#x5C0F;&#x4E8E;&#x6570;&#x636E;&#x603B;&#x91CF;&#x7684;20%&#x6216;10%&#x3002;&#x540E;&#x9762;&#x6211;&#x4F1A;&#x7ED9;&#x51FA;&#x5982;&#x4F55;&#x5212;&#x5206;&#x9A8C;&#x8BC1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x7684;&#x5177;&#x4F53;&#x6307;&#x5BFC;&#x3002;</p>
<p>&#x73B0;&#x4EE3;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x8D8B;&#x52BF;&#x662F;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x4EBA;&#x5728;&#x8BAD;&#x7EC3;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x5206;&#x5E03;&#x4E0D;&#x5339;&#x914D;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#xFF0C;&#x5047;&#x8BBE;&#x4F60;&#x8981;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x4E0A;&#x4F20;&#x5927;&#x91CF;&#x56FE;&#x7247;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x76EE;&#x7684;&#x662F;&#x627E;&#x51FA;&#x5E76;&#x5448;&#x73B0;&#x6240;&#x6709;&#x732B;&#x54AA;&#x56FE;&#x7247;&#xFF0C;&#x53EF;&#x80FD;&#x4F60;&#x7684;&#x7528;&#x6237;&#x90FD;&#x662F;&#x7231;&#x732B;&#x4EBA;&#x58EB;&#xFF0C;&#x8BAD;&#x7EC3;&#x96C6;&#x53EF;&#x80FD;&#x662F;&#x4ECE;&#x7F51;&#x4E0A;&#x4E0B;&#x8F7D;&#x7684;&#x732B;&#x54AA;&#x56FE;&#x7247;&#xFF0C;&#x800C;&#x9A8C;&#x8BC1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x662F;&#x7528;&#x6237;&#x5728;&#x8FD9;&#x4E2A;&#x5E94;&#x7528;&#x4E0A;&#x4E0A;&#x4F20;&#x7684;&#x732B;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x8BAD;&#x7EC3;&#x96C6;&#x53EF;&#x80FD;&#x662F;&#x4ECE;&#x7F51;&#x7EDC;&#x4E0A;&#x6293;&#x4E0B;&#x6765;&#x7684;&#x56FE;&#x7247;&#x3002;&#x800C;&#x9A8C;&#x8BC1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x662F;&#x7528;&#x6237;&#x4E0A;&#x4F20;&#x7684;&#x56FE;&#x7247;&#x3002;&#x7ED3;&#x679C;&#x8BB8;&#x591A;&#x7F51;&#x9875;&#x4E0A;&#x7684;&#x732B;&#x54AA;&#x56FE;&#x7247;&#x5206;&#x8FA8;&#x7387;&#x5F88;&#x9AD8;&#xFF0C;&#x5F88;&#x4E13;&#x4E1A;&#xFF0C;&#x540E;&#x671F;&#x5236;&#x4F5C;&#x7CBE;&#x826F;&#xFF0C;&#x800C;&#x7528;&#x6237;&#x4E0A;&#x4F20;&#x7684;&#x7167;&#x7247;&#x53EF;&#x80FD;&#x662F;&#x7528;&#x624B;&#x673A;&#x968F;&#x610F;&#x62CD;&#x6444;&#x7684;&#xFF0C;&#x50CF;&#x7D20;&#x4F4E;&#xFF0C;&#x6BD4;&#x8F83;&#x6A21;&#x7CCA;&#xFF0C;&#x8FD9;&#x4E24;&#x7C7B;&#x6570;&#x636E;&#x6709;&#x6240;&#x4E0D;&#x540C;&#xFF0C;&#x9488;&#x5BF9;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x6839;&#x636E;&#x7ECF;&#x9A8C;&#xFF0C;&#x6211;&#x5EFA;&#x8BAE;&#x5927;&#x5BB6;&#x8981;&#x786E;&#x4FDD;&#x9A8C;&#x8BC1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x7684;&#x6570;&#x636E;&#x6765;&#x81EA;&#x540C;&#x4E00;&#x5206;&#x5E03;&#xFF0C;&#x5173;&#x4E8E;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x6211;&#x4E5F;&#x4F1A;&#x591A;&#x8BB2;&#x4E00;&#x4E9B;&#x3002;&#x56E0;&#x4E3A;&#x4F60;&#x4EEC;&#x8981;&#x7528;&#x9A8C;&#x8BC1;&#x96C6;&#x6765;&#x8BC4;&#x4F30;&#x4E0D;&#x540C;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x5C3D;&#x53EF;&#x80FD;&#x5730;&#x4F18;&#x5316;&#x6027;&#x80FD;&#x3002;&#x5982;&#x679C;&#x9A8C;&#x8BC1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x6765;&#x81EA;&#x540C;&#x4E00;&#x4E2A;&#x5206;&#x5E03;&#x5C31;&#x4F1A;&#x5F88;&#x597D;&#x3002;</p>
<p><img src="../images/459ffc8998b35b259bc3bab4fd4fb44c.png" alt=""></p>
<p>&#x4F46;&#x7531;&#x4E8E;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x9700;&#x8981;&#x5927;&#x91CF;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#xFF0C;&#x4E3A;&#x4E86;&#x83B7;&#x53D6;&#x66F4;&#x5927;&#x89C4;&#x6A21;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x5F53;&#x524D;&#x6D41;&#x884C;&#x7684;&#x5404;&#x79CD;&#x521B;&#x610F;&#x7B56;&#x7565;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x7F51;&#x9875;&#x6293;&#x53D6;&#xFF0C;&#x4EE3;&#x4EF7;&#x5C31;&#x662F;&#x8BAD;&#x7EC3;&#x96C6;&#x6570;&#x636E;&#x4E0E;&#x9A8C;&#x8BC1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x6570;&#x636E;&#x6709;&#x53EF;&#x80FD;&#x4E0D;&#x662F;&#x6765;&#x81EA;&#x540C;&#x4E00;&#x5206;&#x5E03;&#x3002;&#x4F46;&#x53EA;&#x8981;&#x9075;&#x5FAA;&#x8FD9;&#x4E2A;&#x7ECF;&#x9A8C;&#x6CD5;&#x5219;&#xFF0C;&#x4F60;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x4F1A;&#x53D8;&#x5F97;&#x66F4;&#x5FEB;&#x3002;&#x6211;&#x4F1A;&#x5728;&#x540E;&#x9762;&#x7684;&#x8BFE;&#x7A0B;&#x4E2D;&#x66F4;&#x52A0;&#x8BE6;&#x7EC6;&#x5730;&#x89E3;&#x91CA;&#x8FD9;&#x6761;&#x7ECF;&#x9A8C;&#x6CD5;&#x5219;&#x3002;</p>
<p>&#x6700;&#x540E;&#x4E00;&#x70B9;&#xFF0C;&#x5C31;&#x7B97;&#x6CA1;&#x6709;&#x6D4B;&#x8BD5;&#x96C6;&#x4E5F;&#x4E0D;&#x8981;&#x7D27;&#xFF0C;&#x6D4B;&#x8BD5;&#x96C6;&#x7684;&#x76EE;&#x7684;&#x662F;&#x5BF9;&#x6700;&#x7EC8;&#x6240;&#x9009;&#x5B9A;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7CFB;&#x7EDF;&#x505A;&#x51FA;&#x65E0;&#x504F;&#x4F30;&#x8BA1;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x9700;&#x8981;&#x65E0;&#x504F;&#x4F30;&#x8BA1;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4E0D;&#x8BBE;&#x7F6E;&#x6D4B;&#x8BD5;&#x96C6;&#x3002;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x53EA;&#x6709;&#x9A8C;&#x8BC1;&#x96C6;&#xFF0C;&#x6CA1;&#x6709;&#x6D4B;&#x8BD5;&#x96C6;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#xFF0C;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x8BAD;&#x7EC3;&#xFF0C;&#x5C1D;&#x8BD5;&#x4E0D;&#x540C;&#x7684;&#x6A21;&#x578B;&#x6846;&#x67B6;&#xFF0C;&#x5728;&#x9A8C;&#x8BC1;&#x96C6;&#x4E0A;&#x8BC4;&#x4F30;&#x8FD9;&#x4E9B;&#x6A21;&#x578B;&#xFF0C;&#x7136;&#x540E;&#x8FED;&#x4EE3;&#x5E76;&#x9009;&#x51FA;&#x9002;&#x7528;&#x7684;&#x6A21;&#x578B;&#x3002;&#x56E0;&#x4E3A;&#x9A8C;&#x8BC1;&#x96C6;&#x4E2D;&#x5DF2;&#x7ECF;&#x6DB5;&#x76D6;&#x6D4B;&#x8BD5;&#x96C6;&#x6570;&#x636E;&#xFF0C;&#x5176;&#x4E0D;&#x518D;&#x63D0;&#x4F9B;&#x65E0;&#x504F;&#x6027;&#x80FD;&#x8BC4;&#x4F30;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x9700;&#x8981;&#x65E0;&#x504F;&#x4F30;&#x8BA1;&#xFF0C;&#x90A3;&#x5C31;&#x518D;&#x597D;&#x4E0D;&#x8FC7;&#x4E86;&#x3002;</p>
<p><img src="../images/658fc77a1ea588d5768dcd1a9a90761a.png" alt=""></p>
<p>&#x5728;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x8BAD;&#x7EC3;&#x96C6;&#x548C;&#x4E00;&#x4E2A;&#x9A8C;&#x8BC1;&#x96C6;&#xFF0C;&#x800C;&#x6CA1;&#x6709;&#x72EC;&#x7ACB;&#x7684;&#x6D4B;&#x8BD5;&#x96C6;&#xFF0C;&#x9047;&#x5230;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x8BAD;&#x7EC3;&#x96C6;&#x8FD8;&#x88AB;&#x4EBA;&#x4EEC;&#x79F0;&#x4E3A;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x800C;&#x9A8C;&#x8BC1;&#x96C6;&#x5219;&#x88AB;&#x79F0;&#x4E3A;&#x6D4B;&#x8BD5;&#x96C6;&#xFF0C;&#x4E0D;&#x8FC7;&#x5728;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x4E2D;&#xFF0C;&#x4EBA;&#x4EEC;&#x53EA;&#x662F;&#x628A;&#x6D4B;&#x8BD5;&#x96C6;&#x5F53;&#x6210;&#x7B80;&#x5355;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x96C6;&#x4F7F;&#x7528;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x5B8C;&#x5168;&#x5B9E;&#x73B0;&#x8BE5;&#x672F;&#x8BED;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x628A;&#x9A8C;&#x8BC1;&#x96C6;&#x6570;&#x636E;&#x8FC7;&#x5EA6;&#x62DF;&#x5408;&#x5230;&#x4E86;&#x6D4B;&#x8BD5;&#x96C6;&#x4E2D;&#x3002;&#x5982;&#x679C;&#x67D0;&#x56E2;&#x961F;&#x8DDF;&#x4F60;&#x8BF4;&#x4ED6;&#x4EEC;&#x53EA;&#x8BBE;&#x7F6E;&#x4E86;&#x4E00;&#x4E2A;&#x8BAD;&#x7EC3;&#x96C6;&#x548C;&#x4E00;&#x4E2A;&#x6D4B;&#x8BD5;&#x96C6;&#xFF0C;&#x6211;&#x4F1A;&#x5F88;&#x8C28;&#x614E;&#xFF0C;&#x5FC3;&#x60F3;&#x4ED6;&#x4EEC;&#x662F;&#x4E0D;&#x662F;&#x771F;&#x7684;&#x6709;&#x8BAD;&#x7EC3;&#x9A8C;&#x8BC1;&#x96C6;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x628A;&#x9A8C;&#x8BC1;&#x96C6;&#x6570;&#x636E;&#x8FC7;&#x5EA6;&#x62DF;&#x5408;&#x5230;&#x4E86;&#x6D4B;&#x8BD5;&#x96C6;&#x4E2D;&#xFF0C;&#x8BA9;&#x8FD9;&#x4E9B;&#x56E2;&#x961F;&#x6539;&#x53D8;&#x53EB;&#x6CD5;&#xFF0C;&#x6539;&#x79F0;&#x5176;&#x4E3A;&#x201C;&#x8BAD;&#x7EC3;&#x9A8C;&#x8BC1;&#x96C6;&#x201D;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x201C;&#x8BAD;&#x7EC3;&#x6D4B;&#x8BD5;&#x96C6;&#x201D;&#xFF0C;&#x53EF;&#x80FD;&#x4E0D;&#x592A;&#x5BB9;&#x6613;&#x3002;&#x5373;&#x4FBF;&#x6211;&#x8BA4;&#x4E3A;&#x201C;&#x8BAD;&#x7EC3;&#x9A8C;&#x8BC1;&#x96C6;&#x201C;&#x5728;&#x4E13;&#x4E1A;&#x7528;&#x8BCD;&#x4E0A;&#x66F4;&#x51C6;&#x786E;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x9700;&#x8981;&#x65E0;&#x504F;&#x8BC4;&#x4F30;&#x7B97;&#x6CD5;&#x6027;&#x80FD;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x6837;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#x3002;</p>
<p><img src="../images/02556a7f525c0ec016483644755c2231.png" alt=""></p>
<p>&#x6240;&#x4EE5;&#x8BF4;&#xFF0C;&#x642D;&#x5EFA;&#x8BAD;&#x7EC3;&#x9A8C;&#x8BC1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x80FD;&#x591F;&#x52A0;&#x901F;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x96C6;&#x6210;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x66F4;&#x6709;&#x6548;&#x5730;&#x8861;&#x91CF;&#x7B97;&#x6CD5;&#x5730;&#x504F;&#x5DEE;&#x548C;&#x65B9;&#x5DEE;&#xFF0C;&#x4ECE;&#x800C;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x66F4;&#x9AD8;&#x6548;&#x5730;&#x9009;&#x62E9;&#x5408;&#x9002;&#x65B9;&#x6CD5;&#x6765;&#x4F18;&#x5316;&#x7B97;&#x6CD5;&#x3002;</p>
<h3 id="12-&#x504F;&#x5DEE;&#xFF0C;&#x65B9;&#x5DEE;&#xFF08;bias-variance&#xFF09;">1.2 &#x504F;&#x5DEE;&#xFF0C;&#x65B9;&#x5DEE;&#xFF08;Bias /Variance&#xFF09;</h3>
<p>&#x6211;&#x6CE8;&#x610F;&#x5230;&#xFF0C;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4ECE;&#x4E1A;&#x4EBA;&#x5458;&#x90FD;&#x671F;&#x671B;&#x6DF1;&#x523B;&#x7406;&#x89E3;&#x504F;&#x5DEE;&#x548C;&#x65B9;&#x5DEE;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x6982;&#x5FF5;&#x6613;&#x5B66;&#x96BE;&#x7CBE;&#xFF0C;&#x5373;&#x4F7F;&#x4F60;&#x81EA;&#x5DF1;&#x8BA4;&#x4E3A;&#x5DF2;&#x7ECF;&#x7406;&#x89E3;&#x4E86;&#x504F;&#x5DEE;&#x548C;&#x65B9;&#x5DEE;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#xFF0C;&#x5374;&#x603B;&#x6709;&#x4E00;&#x4E9B;&#x610F;&#x60F3;&#x4E0D;&#x5230;&#x7684;&#x65B0;&#x4E1C;&#x897F;&#x51FA;&#x73B0;&#x3002;&#x5173;&#x4E8E;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x8BEF;&#x5DEE;&#x95EE;&#x9898;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x8D8B;&#x52BF;&#x662F;&#x5BF9;&#x504F;&#x5DEE;&#x548C;&#x65B9;&#x5DEE;&#x7684;&#x6743;&#x8861;&#x7814;&#x7A76;&#x751A;&#x6D45;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x542C;&#x8BF4;&#x8FC7;&#x8FD9;&#x4E24;&#x4E2A;&#x6982;&#x5FF5;&#xFF0C;&#x4F46;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x8BEF;&#x5DEE;&#x5F88;&#x5C11;&#x6743;&#x8861;&#x4E8C;&#x8005;&#xFF0C;&#x6211;&#x4EEC;&#x603B;&#x662F;&#x5206;&#x522B;&#x8003;&#x8651;&#x504F;&#x5DEE;&#x548C;&#x65B9;&#x5DEE;&#xFF0C;&#x5374;&#x5F88;&#x5C11;&#x8C08;&#x53CA;&#x504F;&#x5DEE;&#x548C;&#x65B9;&#x5DEE;&#x7684;&#x6743;&#x8861;&#x95EE;&#x9898;&#xFF0C;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x6765;&#x4E00;&#x63A2;&#x7A76;&#x7ADF;&#x3002;</p>
<p><img src="../images/e0ec4205933b7c2a9eaed9fbaa8d4afc.png" alt=""></p>
<p>&#x5047;&#x8BBE;&#x8FD9;&#x5C31;&#x662F;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x5982;&#x679C;&#x7ED9;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#x62DF;&#x5408;&#x4E00;&#x6761;&#x76F4;&#x7EBF;&#xFF0C;&#x53EF;&#x80FD;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x62DF;&#x5408;&#xFF0C;&#x4F46;&#x5B83;&#x5E76;&#x4E0D;&#x80FD;&#x5F88;&#x597D;&#x5730;&#x62DF;&#x5408;&#x8BE5;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x662F;&#x9AD8;&#x504F;&#x5DEE;&#xFF08;<strong>high bias</strong>&#xFF09;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x6211;&#x4EEC;&#x79F0;&#x4E3A;&#x201C;&#x6B20;&#x62DF;&#x5408;&#x201D;&#xFF08;<strong>underfitting</strong>&#xFF09;&#x3002;</p>
<p>&#x76F8;&#x53CD;&#x7684;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x62DF;&#x5408;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x590D;&#x6742;&#x7684;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x6BD4;&#x5982;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6216;&#x542B;&#x6709;&#x9690;&#x85CF;&#x5355;&#x5143;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x53EF;&#x80FD;&#x5C31;&#x975E;&#x5E38;&#x9002;&#x7528;&#x4E8E;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x770B;&#x8D77;&#x6765;&#x4E5F;&#x4E0D;&#x662F;&#x4E00;&#x79CD;&#x5F88;&#x597D;&#x7684;&#x62DF;&#x5408;&#x65B9;&#x5F0F;&#x5206;&#x7C7B;&#x5668;&#x65B9;&#x5DEE;&#x8F83;&#x9AD8;&#xFF08;<strong>high variance</strong>&#xFF09;&#xFF0C;&#x6570;&#x636E;&#x8FC7;&#x5EA6;&#x62DF;&#x5408;&#xFF08;<strong>overfitting</strong>&#xFF09;&#x3002;</p>
<p>&#x5728;&#x4E24;&#x8005;&#x4E4B;&#x95F4;&#xFF0C;&#x53EF;&#x80FD;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x50CF;&#x56FE;&#x4E2D;&#x8FD9;&#x6837;&#x7684;&#xFF0C;&#x590D;&#x6742;&#x7A0B;&#x5EA6;&#x9002;&#x4E2D;&#xFF0C;&#x6570;&#x636E;&#x62DF;&#x5408;&#x9002;&#x5EA6;&#x7684;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x62DF;&#x5408;&#x770B;&#x8D77;&#x6765;&#x66F4;&#x52A0;&#x5408;&#x7406;&#xFF0C;&#x6211;&#x4EEC;&#x79F0;&#x4E4B;&#x4E3A;&#x201C;&#x9002;&#x5EA6;&#x62DF;&#x5408;&#x201D;&#xFF08;<strong>just right</strong>&#xFF09;&#x662F;&#x4ECB;&#x4E8E;&#x8FC7;&#x5EA6;&#x62DF;&#x5408;&#x548C;&#x6B20;&#x62DF;&#x5408;&#x4E2D;&#x95F4;&#x7684;&#x4E00;&#x7C7B;&#x3002;</p>
<p><img src="../images/05ac08b96177b5d0aaae7b7bfea64f3a.png" alt=""></p>
<p>&#x5728;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x53EA;&#x6709;$x_1$&#x548C;$x_2$&#x4E24;&#x4E2A;&#x7279;&#x5F81;&#x7684;&#x4E8C;&#x7EF4;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7ED8;&#x5236;&#x6570;&#x636E;&#xFF0C;&#x5C06;&#x504F;&#x5DEE;&#x548C;&#x65B9;&#x5DEE;&#x53EF;&#x89C6;&#x5316;&#x3002;&#x5728;&#x591A;&#x7EF4;&#x7A7A;&#x95F4;&#x6570;&#x636E;&#x4E2D;&#xFF0C;&#x7ED8;&#x5236;&#x6570;&#x636E;&#x548C;&#x53EF;&#x89C6;&#x5316;&#x5206;&#x5272;&#x8FB9;&#x754C;&#x65E0;&#x6CD5;&#x5B9E;&#x73B0;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x51E0;&#x4E2A;&#x6307;&#x6807;&#xFF0C;&#x6765;&#x7814;&#x7A76;&#x504F;&#x5DEE;&#x548C;&#x65B9;&#x5DEE;&#x3002;</p>
<p><img src="../images/2efd9728b5f07f914903dde309167a5d.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x6CBF;&#x7528;&#x732B;&#x54AA;&#x56FE;&#x7247;&#x5206;&#x7C7B;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5DE6;&#x8FB9;&#x4E00;&#x5F20;&#x662F;&#x732B;&#x54AA;&#x56FE;&#x7247;&#xFF0C;&#x53F3;&#x8FB9;&#x4E00;&#x5F20;&#x4E0D;&#x662F;&#x3002;&#x7406;&#x89E3;&#x504F;&#x5DEE;&#x548C;&#x65B9;&#x5DEE;&#x7684;&#x4E24;&#x4E2A;&#x5173;&#x952E;&#x6570;&#x636E;&#x662F;&#x8BAD;&#x7EC3;&#x96C6;&#x8BEF;&#x5DEE;&#xFF08;<strong>Train set error</strong>&#xFF09;&#x548C;&#x9A8C;&#x8BC1;&#x96C6;&#x8BEF;&#x5DEE;&#xFF08;<strong>Dev set error</strong>&#xFF09;&#xFF0C;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x8BBA;&#x8BC1;&#xFF0C;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8FA8;&#x522B;&#x56FE;&#x7247;&#x4E2D;&#x7684;&#x5C0F;&#x732B;&#xFF0C;&#x6211;&#x4EEC;&#x7528;&#x8089;&#x773C;&#x8BC6;&#x522B;&#x51E0;&#x4E4E;&#x662F;&#x4E0D;&#x4F1A;&#x51FA;&#x9519;&#x7684;&#x3002;</p>
<p>&#x5047;&#x5B9A;&#x8BAD;&#x7EC3;&#x96C6;&#x8BEF;&#x5DEE;&#x662F;1%&#xFF0C;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x8BBA;&#x8BC1;&#xFF0C;&#x5047;&#x5B9A;&#x9A8C;&#x8BC1;&#x96C6;&#x8BEF;&#x5DEE;&#x662F;11%&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x8BAD;&#x7EC3;&#x96C6;&#x8BBE;&#x7F6E;&#x5F97;&#x975E;&#x5E38;&#x597D;&#xFF0C;&#x800C;&#x9A8C;&#x8BC1;&#x96C6;&#x8BBE;&#x7F6E;&#x76F8;&#x5BF9;&#x8F83;&#x5DEE;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x8FC7;&#x5EA6;&#x62DF;&#x5408;&#x4E86;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x5728;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#xFF0C;&#x9A8C;&#x8BC1;&#x96C6;&#x5E76;&#x6CA1;&#x6709;&#x5145;&#x5206;&#x5229;&#x7528;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x96C6;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x50CF;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x6211;&#x4EEC;&#x79F0;&#x4E4B;&#x4E3A;&#x201C;&#x9AD8;&#x65B9;&#x5DEE;&#x201D;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x67E5;&#x770B;&#x8BAD;&#x7EC3;&#x96C6;&#x8BEF;&#x5DEE;&#x548C;&#x9A8C;&#x8BC1;&#x96C6;&#x8BEF;&#x5DEE;&#xFF0C;&#x6211;&#x4EEC;&#x4FBF;&#x53EF;&#x4EE5;&#x8BCA;&#x65AD;&#x7B97;&#x6CD5;&#x662F;&#x5426;&#x5177;&#x6709;&#x9AD8;&#x65B9;&#x5DEE;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x8861;&#x91CF;&#x8BAD;&#x7EC3;&#x96C6;&#x548C;&#x9A8C;&#x8BC1;&#x96C6;&#x8BEF;&#x5DEE;&#x5C31;&#x53EF;&#x4EE5;&#x5F97;&#x51FA;&#x4E0D;&#x540C;&#x7ED3;&#x8BBA;&#x3002;</p>
<p>&#x5047;&#x8BBE;&#x8BAD;&#x7EC3;&#x96C6;&#x8BEF;&#x5DEE;&#x662F;15%&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x8BAD;&#x7EC3;&#x96C6;&#x8BEF;&#x5DEE;&#x5199;&#x5728;&#x9996;&#x884C;&#xFF0C;&#x9A8C;&#x8BC1;&#x96C6;&#x8BEF;&#x5DEE;&#x662F;16%&#xFF0C;&#x5047;&#x8BBE;&#x8BE5;&#x6848;&#x4F8B;&#x4E2D;&#x4EBA;&#x7684;&#x9519;&#x8BEF;&#x7387;&#x51E0;&#x4E4E;&#x4E3A;0%&#xFF0C;&#x4EBA;&#x4EEC;&#x6D4F;&#x89C8;&#x8FD9;&#x4E9B;&#x56FE;&#x7247;&#xFF0C;&#x5206;&#x8FA8;&#x51FA;&#x662F;&#x4E0D;&#x662F;&#x732B;&#x3002;&#x7B97;&#x6CD5;&#x5E76;&#x6CA1;&#x6709;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#x5F97;&#x5230;&#x5F88;&#x597D;&#x8BAD;&#x7EC3;&#xFF0C;&#x5982;&#x679C;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x7684;&#x62DF;&#x5408;&#x5EA6;&#x4E0D;&#x9AD8;&#xFF0C;&#x5C31;&#x662F;&#x6570;&#x636E;&#x6B20;&#x62DF;&#x5408;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x8BF4;&#x8FD9;&#x79CD;&#x7B97;&#x6CD5;&#x504F;&#x5DEE;&#x6BD4;&#x8F83;&#x9AD8;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5B83;&#x5BF9;&#x4E8E;&#x9A8C;&#x8BC1;&#x96C6;&#x4EA7;&#x751F;&#x7684;&#x7ED3;&#x679C;&#x5374;&#x662F;&#x5408;&#x7406;&#x7684;&#xFF0C;&#x9A8C;&#x8BC1;&#x96C6;&#x4E2D;&#x7684;&#x9519;&#x8BEF;&#x7387;&#x53EA;&#x6BD4;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x591A;&#x4E86;1%&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x79CD;&#x7B97;&#x6CD5;&#x504F;&#x5DEE;&#x9AD8;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x751A;&#x81F3;&#x4E0D;&#x80FD;&#x62DF;&#x5408;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x8FD9;&#x4E0E;&#x4E0A;&#x4E00;&#x5F20;&#x5E7B;&#x706F;&#x7247;&#x6700;&#x5DE6;&#x8FB9;&#x7684;&#x56FE;&#x7247;&#x76F8;&#x4F3C;&#x3002;</p>
<p>&#x518D;&#x4E3E;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x8BAD;&#x7EC3;&#x96C6;&#x8BEF;&#x5DEE;&#x662F;15%&#xFF0C;&#x504F;&#x5DEE;&#x76F8;&#x5F53;&#x9AD8;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x9A8C;&#x8BC1;&#x96C6;&#x7684;&#x8BC4;&#x4F30;&#x7ED3;&#x679C;&#x66F4;&#x7CDF;&#x7CD5;&#xFF0C;&#x9519;&#x8BEF;&#x7387;&#x8FBE;&#x5230;30%&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4F1A;&#x8BA4;&#x4E3A;&#x8FD9;&#x79CD;&#x7B97;&#x6CD5;&#x504F;&#x5DEE;&#x9AD8;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x7ED3;&#x679C;&#x4E0D;&#x7406;&#x60F3;&#xFF0C;&#x800C;&#x4E14;&#x65B9;&#x5DEE;&#x4E5F;&#x5F88;&#x9AD8;&#xFF0C;&#x8FD9;&#x662F;&#x65B9;&#x5DEE;&#x504F;&#x5DEE;&#x90FD;&#x5F88;&#x7CDF;&#x7CD5;&#x7684;&#x60C5;&#x51B5;&#x3002;</p>
<p>&#x518D;&#x770B;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x8BAD;&#x7EC3;&#x96C6;&#x8BEF;&#x5DEE;&#x662F;0.5%&#xFF0C;&#x9A8C;&#x8BC1;&#x96C6;&#x8BEF;&#x5DEE;&#x662F;1%&#xFF0C;&#x7528;&#x6237;&#x770B;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x7ED3;&#x679C;&#x4F1A;&#x5F88;&#x5F00;&#x5FC3;&#xFF0C;&#x732B;&#x54AA;&#x5206;&#x7C7B;&#x5668;&#x53EA;&#x6709;1%&#x7684;&#x9519;&#x8BEF;&#x7387;&#xFF0C;&#x504F;&#x5DEE;&#x548C;&#x65B9;&#x5DEE;&#x90FD;&#x5F88;&#x4F4E;&#x3002;</p>
<p>&#x6709;&#x4E00;&#x70B9;&#x6211;&#x5148;&#x5728;&#x8FD9;&#x4E2A;&#x7B80;&#x5355;&#x63D0;&#x4E00;&#x4E0B;&#xFF0C;&#x5177;&#x4F53;&#x7684;&#x7559;&#x5728;&#x540E;&#x9762;&#x8BFE;&#x7A0B;&#x91CC;&#x8BB2;&#xFF0C;&#x8FD9;&#x4E9B;&#x5206;&#x6790;&#x90FD;&#x662F;&#x57FA;&#x4E8E;&#x5047;&#x8BBE;&#x9884;&#x6D4B;&#x7684;&#xFF0C;&#x5047;&#x8BBE;&#x4EBA;&#x773C;&#x8FA8;&#x522B;&#x7684;&#x9519;&#x8BEF;&#x7387;&#x63A5;&#x8FD1;0%&#xFF0C;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x6700;&#x4F18;&#x8BEF;&#x5DEE;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;&#x8D1D;&#x53F6;&#x65AF;&#x8BEF;&#x5DEE;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x6700;&#x4F18;&#x8BEF;&#x5DEE;&#x63A5;&#x8FD1;0%&#xFF0C;&#x6211;&#x5C31;&#x4E0D;&#x5728;&#x8FD9;&#x91CC;&#x7EC6;&#x8BB2;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x6700;&#x4F18;&#x8BEF;&#x5DEE;&#x6216;&#x8D1D;&#x53F6;&#x65AF;&#x8BEF;&#x5DEE;&#x975E;&#x5E38;&#x9AD8;&#xFF0C;&#x6BD4;&#x5982;15%&#x3002;&#x6211;&#x4EEC;&#x518D;&#x770B;&#x770B;&#x8FD9;&#x4E2A;&#x5206;&#x7C7B;&#x5668;&#xFF08;&#x8BAD;&#x7EC3;&#x8BEF;&#x5DEE;15%&#xFF0C;&#x9A8C;&#x8BC1;&#x8BEF;&#x5DEE;16%&#xFF09;&#xFF0C;15%&#x7684;&#x9519;&#x8BEF;&#x7387;&#x5BF9;&#x8BAD;&#x7EC3;&#x96C6;&#x6765;&#x8BF4;&#x4E5F;&#x662F;&#x975E;&#x5E38;&#x5408;&#x7406;&#x7684;&#xFF0C;&#x504F;&#x5DEE;&#x4E0D;&#x9AD8;&#xFF0C;&#x65B9;&#x5DEE;&#x4E5F;&#x975E;&#x5E38;&#x4F4E;&#x3002;</p>
<p><img src="../images/c61d149beecddb96f0f93944320cf639.png" alt=""></p>
<p>&#x5F53;&#x6240;&#x6709;&#x5206;&#x7C7B;&#x5668;&#x90FD;&#x4E0D;&#x9002;&#x7528;&#x65F6;&#xFF0C;&#x5982;&#x4F55;&#x5206;&#x6790;&#x504F;&#x5DEE;&#x548C;&#x65B9;&#x5DEE;&#x5462;&#xFF1F;&#x6BD4;&#x5982;&#xFF0C;&#x56FE;&#x7247;&#x5F88;&#x6A21;&#x7CCA;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x4EBA;&#x773C;&#xFF0C;&#x6216;&#x8005;&#x6CA1;&#x6709;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x51C6;&#x786E;&#x65E0;&#x8BEF;&#x5730;&#x8BC6;&#x522B;&#x56FE;&#x7247;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6700;&#x4F18;&#x8BEF;&#x5DEE;&#x4F1A;&#x66F4;&#x9AD8;&#xFF0C;&#x90A3;&#x4E48;&#x5206;&#x6790;&#x8FC7;&#x7A0B;&#x5C31;&#x8981;&#x505A;&#x4E9B;&#x6539;&#x53D8;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x6682;&#x65F6;&#x5148;&#x4E0D;&#x8BA8;&#x8BBA;&#x8FD9;&#x4E9B;&#x7EC6;&#x5FAE;&#x5DEE;&#x522B;&#xFF0C;&#x91CD;&#x70B9;&#x662F;&#x901A;&#x8FC7;&#x67E5;&#x770B;&#x8BAD;&#x7EC3;&#x96C6;&#x8BEF;&#x5DEE;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5224;&#x65AD;&#x6570;&#x636E;&#x62DF;&#x5408;&#x60C5;&#x51B5;&#xFF0C;&#x81F3;&#x5C11;&#x5BF9;&#x4E8E;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x53EF;&#x4EE5;&#x5224;&#x65AD;&#x662F;&#x5426;&#x6709;&#x504F;&#x5DEE;&#x95EE;&#x9898;&#xFF0C;&#x7136;&#x540E;&#x67E5;&#x770B;&#x9519;&#x8BEF;&#x7387;&#x6709;&#x591A;&#x9AD8;&#x3002;&#x5F53;&#x5B8C;&#x6210;&#x8BAD;&#x7EC3;&#x96C6;&#x8BAD;&#x7EC3;&#xFF0C;&#x5F00;&#x59CB;&#x4F7F;&#x7528;&#x9A8C;&#x8BC1;&#x96C6;&#x9A8C;&#x8BC1;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5224;&#x65AD;&#x65B9;&#x5DEE;&#x662F;&#x5426;&#x8FC7;&#x9AD8;&#xFF0C;&#x4ECE;&#x8BAD;&#x7EC3;&#x96C6;&#x5230;&#x9A8C;&#x8BC1;&#x96C6;&#x7684;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5224;&#x65AD;&#x65B9;&#x5DEE;&#x662F;&#x5426;&#x8FC7;&#x9AD8;&#x3002;</p>
<p><img src="../images/fcdc2a7afbaaa07ca08b078bb4d37e8d.png" alt=""></p>
<p>&#x4EE5;&#x4E0A;&#x5206;&#x6790;&#x7684;&#x524D;&#x63D0;&#x90FD;&#x662F;&#x5047;&#x8BBE;&#x57FA;&#x672C;&#x8BEF;&#x5DEE;&#x5F88;&#x5C0F;&#xFF0C;&#x8BAD;&#x7EC3;&#x96C6;&#x548C;&#x9A8C;&#x8BC1;&#x96C6;&#x6570;&#x636E;&#x6765;&#x81EA;&#x76F8;&#x540C;&#x5206;&#x5E03;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x8FD9;&#x4E9B;&#x5047;&#x8BBE;&#x4F5C;&#x4E3A;&#x524D;&#x63D0;&#xFF0C;&#x5206;&#x6790;&#x8FC7;&#x7A0B;&#x66F4;&#x52A0;&#x590D;&#x6742;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x5728;&#x7A0D;&#x540E;&#x8BFE;&#x7A0B;&#x91CC;&#x8BA8;&#x8BBA;&#x3002;</p>
<p>&#x4E0A;&#x4E00;&#x5F20;&#x5E7B;&#x706F;&#x7247;&#xFF0C;&#x6211;&#x4EEC;&#x8BB2;&#x4E86;&#x9AD8;&#x504F;&#x5DEE;&#x548C;&#x9AD8;&#x65B9;&#x5DEE;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5927;&#x5BB6;&#x5E94;&#x8BE5;&#x5BF9;&#x4F18;&#x8D28;&#x5206;&#x7C7B;&#x5668;&#x6709;&#x4E86;&#x4E00;&#x5B9A;&#x7684;&#x8BA4;&#x8BC6;&#xFF0C;&#x504F;&#x5DEE;&#x548C;&#x65B9;&#x5DEE;&#x90FD;&#x9AD8;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#x5462;&#xFF1F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x5BF9;&#x4E8E;&#x4E24;&#x4E2A;&#x8861;&#x91CF;&#x6807;&#x51C6;&#x6765;&#x8BF4;&#x90FD;&#x662F;&#x975E;&#x5E38;&#x7CDF;&#x7CD5;&#x7684;&#x3002;</p>
<p><img src="../images/f8fdbf9ed01b8634573125e0fb2ca860.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x8BB2;&#x8FC7;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x4F1A;&#x4EA7;&#x751F;&#x9AD8;&#x504F;&#x5DEE;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x7684;&#x6570;&#x636E;&#x62DF;&#x5408;&#x5EA6;&#x4F4E;&#xFF0C;&#x50CF;&#x8FD9;&#x79CD;&#x63A5;&#x8FD1;&#x7EBF;&#x6027;&#x7684;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x6570;&#x636E;&#x62DF;&#x5408;&#x5EA6;&#x4F4E;&#x3002;</p>
<p><img src="../images/e9451f36e8baa41b74c95d9a09b0f028.png" alt=""></p>
<p>&#x4F46;&#x662F;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x7A0D;&#x5FAE;&#x6539;&#x53D8;&#x4E00;&#x4E0B;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x6211;&#x7528;&#x7D2B;&#x8272;&#x7B14;&#x753B;&#x51FA;&#xFF0C;&#x5B83;&#x4F1A;&#x8FC7;&#x5EA6;&#x62DF;&#x5408;&#x90E8;&#x5206;&#x6570;&#x636E;&#xFF0C;&#x7528;&#x7D2B;&#x8272;&#x7EBF;&#x753B;&#x51FA;&#x7684;&#x5206;&#x7C7B;&#x5668;&#x5177;&#x6709;&#x9AD8;&#x504F;&#x5DEE;&#x548C;&#x9AD8;&#x65B9;&#x5DEE;&#xFF0C;&#x504F;&#x5DEE;&#x9AD8;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x51E0;&#x4E4E;&#x662F;&#x4E00;&#x6761;&#x7EBF;&#x6027;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x5E76;&#x672A;&#x62DF;&#x5408;&#x6570;&#x636E;&#x3002;</p>
<p><img src="../images/6e86aa7d9b21b1a49bf4a084c7503527.png" alt=""></p>
<p>&#x8FD9;&#x79CD;&#x4E8C;&#x6B21;&#x66F2;&#x7EBF;&#x80FD;&#x591F;&#x5F88;&#x597D;&#x5730;&#x62DF;&#x5408;&#x6570;&#x636E;&#x3002;</p>
<p><img src="../images/67dc5997a956314e238e6fc362f9883d.png" alt=""></p>
<p>&#x8FD9;&#x6761;&#x66F2;&#x7EBF;&#x4E2D;&#x95F4;&#x90E8;&#x5206;&#x7075;&#x6D3B;&#x6027;&#x975E;&#x5E38;&#x9AD8;&#xFF0C;&#x5374;&#x8FC7;&#x5EA6;&#x62DF;&#x5408;&#x4E86;&#x8FD9;&#x4E24;&#x4E2A;&#x6837;&#x672C;&#xFF0C;&#x8FD9;&#x7C7B;&#x5206;&#x7C7B;&#x5668;&#x504F;&#x5DEE;&#x5F88;&#x9AD8;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x51E0;&#x4E4E;&#x662F;&#x7EBF;&#x6027;&#x7684;&#x3002;</p>
<p><img src="../images/6bf7e092ddf93104ea64a5ddecbb7c6d.png" alt=""></p>
<p>&#x800C;&#x91C7;&#x7528;&#x66F2;&#x7EBF;&#x51FD;&#x6570;&#x6216;&#x4E8C;&#x6B21;&#x5143;&#x51FD;&#x6570;&#x4F1A;&#x4EA7;&#x751F;&#x9AD8;&#x65B9;&#x5DEE;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x66F2;&#x7EBF;&#x7075;&#x6D3B;&#x6027;&#x592A;&#x9AD8;&#x4EE5;&#x81F4;&#x62DF;&#x5408;&#x4E86;&#x8FD9;&#x4E24;&#x4E2A;&#x9519;&#x8BEF;&#x6837;&#x672C;&#x548C;&#x4E2D;&#x95F4;&#x8FD9;&#x4E9B;&#x6D3B;&#x8DC3;&#x6570;&#x636E;&#x3002;</p>
<p>&#x8FD9;&#x770B;&#x8D77;&#x6765;&#x6709;&#x4E9B;&#x4E0D;&#x81EA;&#x7136;&#xFF0C;&#x4ECE;&#x4E24;&#x4E2A;&#x7EF4;&#x5EA6;&#x4E0A;&#x770B;&#x90FD;&#x4E0D;&#x592A;&#x81EA;&#x7136;&#xFF0C;&#x4F46;&#x5BF9;&#x4E8E;&#x9AD8;&#x7EF4;&#x6570;&#x636E;&#xFF0C;&#x6709;&#x4E9B;&#x6570;&#x636E;&#x533A;&#x57DF;&#x504F;&#x5DEE;&#x9AD8;&#xFF0C;&#x6709;&#x4E9B;&#x6570;&#x636E;&#x533A;&#x57DF;&#x65B9;&#x5DEE;&#x9AD8;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x9AD8;&#x7EF4;&#x6570;&#x636E;&#x4E2D;&#x91C7;&#x7528;&#x8FD9;&#x79CD;&#x5206;&#x7C7B;&#x5668;&#x770B;&#x8D77;&#x6765;&#x5C31;&#x4E0D;&#x4F1A;&#x90A3;&#x4E48;&#x7275;&#x5F3A;&#x4E86;&#x3002;</p>
<p>&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x8BB2;&#x4E86;&#x5982;&#x4F55;&#x901A;&#x8FC7;&#x5206;&#x6790;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x8BAD;&#x7EC3;&#x7B97;&#x6CD5;&#x4EA7;&#x751F;&#x7684;&#x8BEF;&#x5DEE;&#x548C;&#x9A8C;&#x8BC1;&#x96C6;&#x4E0A;&#x9A8C;&#x8BC1;&#x7B97;&#x6CD5;&#x4EA7;&#x751F;&#x7684;&#x8BEF;&#x5DEE;&#x6765;&#x8BCA;&#x65AD;&#x7B97;&#x6CD5;&#x662F;&#x5426;&#x5B58;&#x5728;&#x9AD8;&#x504F;&#x5DEE;&#x548C;&#x9AD8;&#x65B9;&#x5DEE;&#xFF0C;&#x662F;&#x5426;&#x4E24;&#x4E2A;&#x503C;&#x90FD;&#x9AD8;&#xFF0C;&#x6216;&#x8005;&#x4E24;&#x4E2A;&#x503C;&#x90FD;&#x4E0D;&#x9AD8;&#xFF0C;&#x6839;&#x636E;&#x7B97;&#x6CD5;&#x504F;&#x5DEE;&#x548C;&#x65B9;&#x5DEE;&#x7684;&#x5177;&#x4F53;&#x60C5;&#x51B5;&#x51B3;&#x5B9A;&#x63A5;&#x4E0B;&#x6765;&#x4F60;&#x8981;&#x505A;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x4E0B;&#x8282;&#x8BFE;&#xFF0C;&#x6211;&#x4F1A;&#x6839;&#x636E;&#x7B97;&#x6CD5;&#x504F;&#x5DEE;&#x548C;&#x65B9;&#x5DEE;&#x7684;&#x9AD8;&#x4F4E;&#x60C5;&#x51B5;&#x8BB2;&#x89E3;&#x4E00;&#x4E9B;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x57FA;&#x672C;&#x65B9;&#x6CD5;&#xFF0C;&#x5E2E;&#x52A9;&#x5927;&#x5BB6;&#x66F4;&#x7CFB;&#x7EDF;&#x5730;&#x4F18;&#x5316;&#x7B97;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x4E0B;&#x8282;&#x8BFE;&#x89C1;&#x3002;</p>
<h3 id="13-&#x673A;&#x5668;&#x5B66;&#x4E60;&#x57FA;&#x7840;&#xFF08;basic-recipe-for-machine-learning&#xFF09;">1.3 &#x673A;&#x5668;&#x5B66;&#x4E60;&#x57FA;&#x7840;&#xFF08;Basic Recipe for Machine Learning&#xFF09;</h3>
<p>&#x4E0A;&#x8282;&#x8BFE;&#x6211;&#x4EEC;&#x8BB2;&#x7684;&#x662F;&#x5982;&#x4F55;&#x901A;&#x8FC7;&#x8BAD;&#x7EC3;&#x8BEF;&#x5DEE;&#x548C;&#x9A8C;&#x8BC1;&#x96C6;&#x8BEF;&#x5DEE;&#x5224;&#x65AD;&#x7B97;&#x6CD5;&#x504F;&#x5DEE;&#x6216;&#x65B9;&#x5DEE;&#x662F;&#x5426;&#x504F;&#x9AD8;&#xFF0C;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x66F4;&#x52A0;&#x7CFB;&#x7EDF;&#x5730;&#x5728;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4E2D;&#x8FD0;&#x7528;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x6765;&#x4F18;&#x5316;&#x7B97;&#x6CD5;&#x6027;&#x80FD;&#x3002;</p>
<p>&#x4E0B;&#x56FE;&#x5C31;&#x662F;&#x6211;&#x5728;&#x8BAD;&#x7EC3;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7528;&#x5230;&#x7684;&#x57FA;&#x672C;&#x65B9;&#x6CD5;&#xFF1A;&#xFF08;&#x5C1D;&#x8BD5;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#xFF0C;&#x53EF;&#x80FD;&#x6709;&#x7528;&#xFF0C;&#x53EF;&#x80FD;&#x6CA1;&#x7528;&#xFF09;</p>
<p><img src="../images/L2_week1_8.png" alt=""></p>
<p>&#x8FD9;&#x662F;&#x6211;&#x5728;&#x8BAD;&#x7EC3;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x65F6;&#x7528;&#x5230;&#x5730;&#x57FA;&#x672C;&#x65B9;&#x6CD5;&#xFF0C;&#x521D;&#x59CB;&#x6A21;&#x578B;&#x8BAD;&#x7EC3;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x6211;&#x9996;&#x5148;&#x8981;&#x77E5;&#x9053;&#x7B97;&#x6CD5;&#x7684;&#x504F;&#x5DEE;&#x9AD8;&#x4E0D;&#x9AD8;&#xFF0C;&#x5982;&#x679C;&#x504F;&#x5DEE;&#x8F83;&#x9AD8;&#xFF0C;&#x8BD5;&#x7740;&#x8BC4;&#x4F30;&#x8BAD;&#x7EC3;&#x96C6;&#x6216;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x7684;&#x6027;&#x80FD;&#x3002;&#x5982;&#x679C;&#x504F;&#x5DEE;&#x7684;&#x786E;&#x5F88;&#x9AD8;&#xFF0C;&#x751A;&#x81F3;&#x65E0;&#x6CD5;&#x62DF;&#x5408;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x6BD4;&#x5982;&#x542B;&#x6709;&#x66F4;&#x591A;&#x9690;&#x85CF;&#x5C42;&#x6216;&#x8005;&#x9690;&#x85CF;&#x5355;&#x5143;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x6216;&#x8005;&#x82B1;&#x8D39;&#x66F4;&#x591A;&#x65F6;&#x95F4;&#x6765;&#x8BAD;&#x7EC3;&#x7F51;&#x7EDC;&#xFF0C;&#x6216;&#x8005;&#x5C1D;&#x8BD5;&#x66F4;&#x5148;&#x8FDB;&#x7684;&#x4F18;&#x5316;&#x7B97;&#x6CD5;&#xFF0C;&#x540E;&#x9762;&#x6211;&#x4EEC;&#x4F1A;&#x8BB2;&#x5230;&#x8FD9;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x3002;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x5176;&#x4ED6;&#x65B9;&#x6CD5;&#xFF0C;&#x53EF;&#x80FD;&#x6709;&#x7528;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x6CA1;&#x7528;&#x3002;</p>
<p>&#x4E00;&#x4F1A;&#x513F;&#x6211;&#x4EEC;&#x4F1A;&#x770B;&#x5230;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x67B6;&#x6784;&#xFF0C;&#x6216;&#x8BB8;&#x4F60;&#x80FD;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x66F4;&#x5408;&#x9002;&#x89E3;&#x51B3;&#x6B64;&#x95EE;&#x9898;&#x7684;&#x65B0;&#x7684;&#x7F51;&#x7EDC;&#x67B6;&#x6784;&#xFF0C;&#x52A0;&#x4E0A;&#x62EC;&#x53F7;&#xFF0C;&#x56E0;&#x4E3A;&#x5176;&#x4E2D;&#x4E00;&#x6761;&#x5C31;&#x662F;&#x4F60;&#x5FC5;&#x987B;&#x53BB;&#x5C1D;&#x8BD5;&#xFF0C;&#x53EF;&#x80FD;&#x6709;&#x7528;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x6CA1;&#x7528;&#xFF0C;&#x4E0D;&#x8FC7;&#x91C7;&#x7528;&#x89C4;&#x6A21;&#x66F4;&#x5927;&#x7684;&#x7F51;&#x7EDC;&#x901A;&#x5E38;&#x90FD;&#x4F1A;&#x6709;&#x6240;&#x5E2E;&#x52A9;&#xFF0C;&#x5EF6;&#x957F;&#x8BAD;&#x7EC3;&#x65F6;&#x95F4;&#x4E0D;&#x4E00;&#x5B9A;&#x6709;&#x7528;&#xFF0C;&#x4F46;&#x4E5F;&#x6CA1;&#x4EC0;&#x4E48;&#x574F;&#x5904;&#x3002;&#x8BAD;&#x7EC3;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x65F6;&#xFF0C;&#x6211;&#x4F1A;&#x4E0D;&#x65AD;&#x5C1D;&#x8BD5;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#xFF0C;&#x76F4;&#x5230;&#x89E3;&#x51B3;&#x6389;&#x504F;&#x5DEE;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x662F;&#x6700;&#x4F4E;&#x6807;&#x51C6;&#xFF0C;&#x53CD;&#x590D;&#x5C1D;&#x8BD5;&#xFF0C;&#x76F4;&#x5230;&#x53EF;&#x4EE5;&#x62DF;&#x5408;&#x6570;&#x636E;&#x4E3A;&#x6B62;&#xFF0C;&#x81F3;&#x5C11;&#x80FD;&#x591F;&#x62DF;&#x5408;&#x8BAD;&#x7EC3;&#x96C6;&#x3002;</p>
<p>&#x5982;&#x679C;&#x7F51;&#x7EDC;&#x8DB3;&#x591F;&#x5927;&#xFF0C;&#x901A;&#x5E38;&#x53EF;&#x4EE5;&#x5F88;&#x597D;&#x7684;&#x62DF;&#x5408;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x53EA;&#x8981;&#x4F60;&#x80FD;&#x6269;&#x5927;&#x7F51;&#x7EDC;&#x89C4;&#x6A21;&#xFF0C;&#x5982;&#x679C;&#x56FE;&#x7247;&#x5F88;&#x6A21;&#x7CCA;&#xFF0C;&#x7B97;&#x6CD5;&#x53EF;&#x80FD;&#x65E0;&#x6CD5;&#x62DF;&#x5408;&#x8BE5;&#x56FE;&#x7247;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x6709;&#x4EBA;&#x53EF;&#x4EE5;&#x5206;&#x8FA8;&#x51FA;&#x56FE;&#x7247;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x89C9;&#x5F97;&#x57FA;&#x672C;&#x8BEF;&#x5DEE;&#x4E0D;&#x662F;&#x5F88;&#x9AD8;&#xFF0C;&#x90A3;&#x4E48;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x4F60;&#x5C31;&#x5E94;&#x8BE5;&#x53EF;&#x4EE5;&#x2026;&#x2026;&#x81F3;&#x5C11;&#x53EF;&#x4EE5;&#x5F88;&#x597D;&#x5730;&#x62DF;&#x5408;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x81F3;&#x5C11;&#x53EF;&#x4EE5;&#x62DF;&#x5408;&#x6216;&#x8005;&#x8FC7;&#x62DF;&#x5408;&#x8BAD;&#x7EC3;&#x96C6;&#x3002;&#x4E00;&#x65E6;&#x504F;&#x5DEE;&#x964D;&#x4F4E;&#x5230;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x7684;&#x6570;&#x503C;&#xFF0C;&#x68C0;&#x67E5;&#x4E00;&#x4E0B;&#x65B9;&#x5DEE;&#x6709;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x4E3A;&#x4E86;&#x8BC4;&#x4F30;&#x65B9;&#x5DEE;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x67E5;&#x770B;&#x9A8C;&#x8BC1;&#x96C6;&#x6027;&#x80FD;&#xFF0C;&#x6211;&#x4EEC;&#x80FD;&#x4ECE;&#x4E00;&#x4E2A;&#x6027;&#x80FD;&#x7406;&#x60F3;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#x63A8;&#x65AD;&#x51FA;&#x9A8C;&#x8BC1;&#x96C6;&#x7684;&#x6027;&#x80FD;&#x662F;&#x5426;&#x4E5F;&#x7406;&#x60F3;&#xFF0C;&#x5982;&#x679C;&#x65B9;&#x5DEE;&#x9AD8;&#xFF0C;&#x6700;&#x597D;&#x7684;&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#x5C31;&#x662F;&#x91C7;&#x7528;&#x66F4;&#x591A;&#x6570;&#x636E;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x80FD;&#x505A;&#x5230;&#xFF0C;&#x4F1A;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x5E2E;&#x52A9;&#xFF0C;&#x4F46;&#x6709;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x83B7;&#x5F97;&#x66F4;&#x591A;&#x6570;&#x636E;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x901A;&#x8FC7;&#x6B63;&#x5219;&#x5316;&#x6765;&#x51CF;&#x5C11;&#x8FC7;&#x62DF;&#x5408;&#xFF0C;&#x8FD9;&#x4E2A;&#x6211;&#x4EEC;&#x4E0B;&#x8282;&#x8BFE;&#x4F1A;&#x8BB2;&#x3002;&#x6709;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x4E0D;&#x5F97;&#x4E0D;&#x53CD;&#x590D;&#x5C1D;&#x8BD5;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x80FD;&#x627E;&#x5230;&#x66F4;&#x5408;&#x9002;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6846;&#x67B6;&#xFF0C;&#x6709;&#x65F6;&#x5B83;&#x53EF;&#x80FD;&#x4F1A;&#x4E00;&#x7BAD;&#x53CC;&#x96D5;&#xFF0C;&#x540C;&#x65F6;&#x51CF;&#x5C11;&#x65B9;&#x5DEE;&#x548C;&#x504F;&#x5DEE;&#x3002;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x5462;&#xFF1F;&#x60F3;&#x7CFB;&#x7EDF;&#x5730;&#x8BF4;&#x51FA;&#x505A;&#x6CD5;&#x5F88;&#x96BE;&#xFF0C;&#x603B;&#x4E4B;&#x5C31;&#x662F;&#x4E0D;&#x65AD;&#x91CD;&#x590D;&#x5C1D;&#x8BD5;&#xFF0C;&#x76F4;&#x5230;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x4F4E;&#x504F;&#x5DEE;&#xFF0C;&#x4F4E;&#x65B9;&#x5DEE;&#x7684;&#x6846;&#x67B6;&#xFF0C;&#x8FD9;&#x65F6;&#x4F60;&#x5C31;&#x6210;&#x529F;&#x4E86;&#x3002;</p>
<p>&#x6709;&#x4E24;&#x70B9;&#x9700;&#x8981;&#x5927;&#x5BB6;&#x6CE8;&#x610F;&#xFF1A;</p>
<p>&#x7B2C;&#x4E00;&#x70B9;&#xFF0C;&#x9AD8;&#x504F;&#x5DEE;&#x548C;&#x9AD8;&#x65B9;&#x5DEE;&#x662F;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x6211;&#x4EEC;&#x540E;&#x7EED;&#x8981;&#x5C1D;&#x8BD5;&#x7684;&#x65B9;&#x6CD5;&#x4E5F;&#x53EF;&#x80FD;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#xFF0C;&#x6211;&#x901A;&#x5E38;&#x4F1A;&#x7528;&#x8BAD;&#x7EC3;&#x9A8C;&#x8BC1;&#x96C6;&#x6765;&#x8BCA;&#x65AD;&#x7B97;&#x6CD5;&#x662F;&#x5426;&#x5B58;&#x5728;&#x504F;&#x5DEE;&#x6216;&#x65B9;&#x5DEE;&#x95EE;&#x9898;&#xFF0C;&#x7136;&#x540E;&#x6839;&#x636E;&#x7ED3;&#x679C;&#x9009;&#x62E9;&#x5C1D;&#x8BD5;&#x90E8;&#x5206;&#x65B9;&#x6CD5;&#x3002;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5982;&#x679C;&#x7B97;&#x6CD5;&#x5B58;&#x5728;&#x9AD8;&#x504F;&#x5DEE;&#x95EE;&#x9898;&#xFF0C;&#x51C6;&#x5907;&#x66F4;&#x591A;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x5176;&#x5B9E;&#x4E5F;&#x6CA1;&#x4EC0;&#x4E48;&#x7528;&#x5904;&#xFF0C;&#x81F3;&#x5C11;&#x8FD9;&#x4E0D;&#x662F;&#x66F4;&#x6709;&#x6548;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x6240;&#x4EE5;&#x5927;&#x5BB6;&#x8981;&#x6E05;&#x695A;&#x5B58;&#x5728;&#x7684;&#x95EE;&#x9898;&#x662F;&#x504F;&#x5DEE;&#x8FD8;&#x662F;&#x65B9;&#x5DEE;&#xFF0C;&#x8FD8;&#x662F;&#x4E24;&#x8005;&#x90FD;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x660E;&#x786E;&#x8FD9;&#x4E00;&#x70B9;&#x6709;&#x52A9;&#x4E8E;&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x51FA;&#x6700;&#x6709;&#x6548;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x70B9;&#xFF0C;&#x5728;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x521D;&#x671F;&#x9636;&#x6BB5;&#xFF0C;&#x5173;&#x4E8E;&#x6240;&#x8C13;&#x7684;&#x504F;&#x5DEE;&#x65B9;&#x5DEE;&#x6743;&#x8861;&#x7684;&#x8BA8;&#x8BBA;&#x5C61;&#x89C1;&#x4E0D;&#x9C9C;&#xFF0C;&#x539F;&#x56E0;&#x662F;&#x6211;&#x4EEC;&#x80FD;&#x5C1D;&#x8BD5;&#x7684;&#x65B9;&#x6CD5;&#x6709;&#x5F88;&#x591A;&#x3002;&#x53EF;&#x4EE5;&#x589E;&#x52A0;&#x504F;&#x5DEE;&#xFF0C;&#x51CF;&#x5C11;&#x65B9;&#x5DEE;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x504F;&#x5DEE;&#xFF0C;&#x589E;&#x52A0;&#x65B9;&#x5DEE;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x65E9;&#x671F;&#x9636;&#x6BB5;&#xFF0C;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x592A;&#x591A;&#x5DE5;&#x5177;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x53EA;&#x51CF;&#x5C11;&#x504F;&#x5DEE;&#x6216;&#x65B9;&#x5DEE;&#x5374;&#x4E0D;&#x5F71;&#x54CD;&#x5230;&#x53E6;&#x4E00;&#x65B9;&#x3002;&#x4F46;&#x5728;&#x5F53;&#x524D;&#x7684;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x548C;&#x5927;&#x6570;&#x636E;&#x65F6;&#x4EE3;&#xFF0C;&#x53EA;&#x8981;&#x6301;&#x7EED;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x53EA;&#x8981;&#x51C6;&#x5907;&#x4E86;&#x66F4;&#x591A;&#x6570;&#x636E;&#xFF0C;&#x90A3;&#x4E48;&#x4E5F;&#x5E76;&#x975E;&#x53EA;&#x6709;&#x8FD9;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x6211;&#x4EEC;&#x5047;&#x5B9A;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;&#x53EA;&#x8981;&#x6B63;&#x5219;&#x9002;&#x5EA6;&#xFF0C;&#x901A;&#x5E38;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x7684;&#x7F51;&#x7EDC;&#x4FBF;&#x53EF;&#x4EE5;&#xFF0C;&#x5728;&#x4E0D;&#x5F71;&#x54CD;&#x65B9;&#x5DEE;&#x7684;&#x540C;&#x65F6;&#x51CF;&#x5C11;&#x504F;&#x5DEE;&#xFF0C;&#x800C;&#x91C7;&#x7528;&#x66F4;&#x591A;&#x6570;&#x636E;&#x901A;&#x5E38;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x8FC7;&#x591A;&#x5F71;&#x54CD;&#x504F;&#x5DEE;&#x7684;&#x540C;&#x65F6;&#x51CF;&#x5C11;&#x65B9;&#x5DEE;&#x3002;&#x8FD9;&#x4E24;&#x6B65;&#x5B9E;&#x9645;&#x8981;&#x505A;&#x7684;&#x5DE5;&#x4F5C;&#x662F;&#xFF1A;&#x8BAD;&#x7EC3;&#x7F51;&#x7EDC;&#xFF0C;&#x9009;&#x62E9;&#x7F51;&#x7EDC;&#x6216;&#x8005;&#x51C6;&#x5907;&#x66F4;&#x591A;&#x6570;&#x636E;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6709;&#x5DE5;&#x5177;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x5728;&#x51CF;&#x5C11;&#x504F;&#x5DEE;&#x6216;&#x65B9;&#x5DEE;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x4E0D;&#x5BF9;&#x53E6;&#x4E00;&#x65B9;&#x4EA7;&#x751F;&#x8FC7;&#x591A;&#x4E0D;&#x826F;&#x5F71;&#x54CD;&#x3002;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x5C31;&#x662F;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x5BF9;&#x76D1;&#x7763;&#x5F0F;&#x5B66;&#x4E60;&#x5927;&#x6709;&#x88E8;&#x76CA;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x539F;&#x56E0;&#xFF0C;&#x4E5F;&#x662F;&#x6211;&#x4EEC;&#x4E0D;&#x7528;&#x592A;&#x8FC7;&#x5173;&#x6CE8;&#x5982;&#x4F55;&#x5E73;&#x8861;&#x504F;&#x5DEE;&#x548C;&#x65B9;&#x5DEE;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x539F;&#x56E0;&#xFF0C;&#x4F46;&#x6709;&#x65F6;&#x6211;&#x4EEC;&#x6709;&#x5F88;&#x591A;&#x9009;&#x62E9;&#xFF0C;&#x51CF;&#x5C11;&#x504F;&#x5DEE;&#x6216;&#x65B9;&#x5DEE;&#x800C;&#x4E0D;&#x589E;&#x52A0;&#x53E6;&#x4E00;&#x65B9;&#x3002;&#x6700;&#x7EC8;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x89C4;&#x8303;&#x5316;&#x7684;&#x7F51;&#x7EDC;&#x3002;&#x4ECE;&#x4E0B;&#x8282;&#x8BFE;&#x5F00;&#x59CB;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8BB2;&#x89E3;&#x6B63;&#x5219;&#x5316;&#xFF0C;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x7684;&#x7F51;&#x7EDC;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x8D1F;&#x9762;&#x5F71;&#x54CD;&#xFF0C;&#x800C;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x5927;&#x578B;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x4E3B;&#x8981;&#x4EE3;&#x4EF7;&#x4E5F;&#x53EA;&#x662F;&#x8BA1;&#x7B97;&#x65F6;&#x95F4;&#xFF0C;&#x524D;&#x63D0;&#x662F;&#x7F51;&#x7EDC;&#x662F;&#x6BD4;&#x8F83;&#x89C4;&#x8303;&#x5316;&#x7684;&#x3002;</p>
<p> &#x4ECA;&#x5929;&#x6211;&#x4EEC;&#x8BB2;&#x4E86;&#x5982;&#x4F55;&#x901A;&#x8FC7;&#x7EC4;&#x7EC7;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6765;&#x8BCA;&#x65AD;&#x504F;&#x5DEE;&#x548C;&#x65B9;&#x5DEE;&#x7684;&#x57FA;&#x672C;&#x65B9;&#x6CD5;&#xFF0C;&#x7136;&#x540E;&#x9009;&#x62E9;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x6B63;&#x786E;&#x64CD;&#x4F5C;&#xFF0C;&#x5E0C;&#x671B;&#x5927;&#x5BB6;&#x6709;&#x6240;&#x4E86;&#x89E3;&#x548C;&#x8BA4;&#x8BC6;&#x3002;&#x6211;&#x5728;&#x8BFE;&#x4E0A;&#x4E0D;&#x6B62;&#x4E00;&#x6B21;&#x63D0;&#x5230;&#x4E86;&#x6B63;&#x5219;&#x5316;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x5B9E;&#x7528;&#x7684;&#x51CF;&#x5C11;&#x65B9;&#x5DEE;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x6B63;&#x5219;&#x5316;&#x65F6;&#x4F1A;&#x51FA;&#x73B0;&#x504F;&#x5DEE;&#x65B9;&#x5DEE;&#x6743;&#x8861;&#x95EE;&#x9898;&#xFF0C;&#x504F;&#x5DEE;&#x53EF;&#x80FD;&#x7565;&#x6709;&#x589E;&#x52A0;&#xFF0C;&#x5982;&#x679C;&#x7F51;&#x7EDC;&#x8DB3;&#x591F;&#x5927;&#xFF0C;&#x589E;&#x5E45;&#x901A;&#x5E38;&#x4E0D;&#x4F1A;&#x592A;&#x9AD8;&#xFF0C;&#x6211;&#x4EEC;&#x4E0B;&#x8282;&#x8BFE;&#x518D;&#x7EC6;&#x8BB2;&#xFF0C;&#x4EE5;&#x4FBF;&#x5927;&#x5BB6;&#x66F4;&#x597D;&#x7406;&#x89E3;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x6B63;&#x5219;&#x5316;&#x3002;</p>
<h3 id="14-&#x6B63;&#x5219;&#x5316;&#xFF08;regularization&#xFF09;">1.4 &#x6B63;&#x5219;&#x5316;&#xFF08;Regularization&#xFF09;</h3>
<p>&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x8FC7;&#x62DF;&#x5408;&#x95EE;&#x9898;&#x2014;&#x2014;&#x9AD8;&#x65B9;&#x5DEE;&#xFF0C;&#x6709;&#x4E24;&#x4E2A;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x6B63;&#x5219;&#x5316;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x662F;&#x51C6;&#x5907;&#x66F4;&#x591A;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x662F;&#x975E;&#x5E38;&#x53EF;&#x9760;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x4F60;&#x53EF;&#x80FD;&#x65E0;&#x6CD5;&#x65F6;&#x65F6;&#x523B;&#x523B;&#x51C6;&#x5907;&#x8DB3;&#x591F;&#x591A;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x6216;&#x8005;&#x83B7;&#x53D6;&#x66F4;&#x591A;&#x6570;&#x636E;&#x7684;&#x6210;&#x672C;&#x5F88;&#x9AD8;&#xFF0C;&#x4F46;&#x6B63;&#x5219;&#x5316;&#x901A;&#x5E38;&#x6709;&#x52A9;&#x4E8E;&#x907F;&#x514D;&#x8FC7;&#x62DF;&#x5408;&#x6216;&#x51CF;&#x5C11;&#x4F60;&#x7684;&#x7F51;&#x7EDC;&#x8BEF;&#x5DEE;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x6000;&#x7591;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8FC7;&#x5EA6;&#x62DF;&#x5408;&#x4E86;&#x6570;&#x636E;&#xFF0C;&#x5373;&#x5B58;&#x5728;&#x9AD8;&#x65B9;&#x5DEE;&#x95EE;&#x9898;&#xFF0C;&#x90A3;&#x4E48;&#x6700;&#x5148;&#x60F3;&#x5230;&#x7684;&#x65B9;&#x6CD5;&#x53EF;&#x80FD;&#x662F;&#x6B63;&#x5219;&#x5316;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x89E3;&#x51B3;&#x9AD8;&#x65B9;&#x5DEE;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x51C6;&#x5907;&#x66F4;&#x591A;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x975E;&#x5E38;&#x53EF;&#x9760;&#x7684;&#x529E;&#x6CD5;&#xFF0C;&#x4F46;&#x4F60;&#x53EF;&#x80FD;&#x65E0;&#x6CD5;&#x65F6;&#x65F6;&#x51C6;&#x5907;&#x8DB3;&#x591F;&#x591A;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#xFF0C;&#x6216;&#x8005;&#xFF0C;&#x83B7;&#x53D6;&#x66F4;&#x591A;&#x6570;&#x636E;&#x7684;&#x6210;&#x672C;&#x5F88;&#x9AD8;&#xFF0C;&#x4F46;&#x6B63;&#x5219;&#x5316;&#x6709;&#x52A9;&#x4E8E;&#x907F;&#x514D;&#x8FC7;&#x5EA6;&#x62DF;&#x5408;&#xFF0C;&#x6216;&#x8005;&#x51CF;&#x5C11;&#x7F51;&#x7EDC;&#x8BEF;&#x5DEE;&#xFF0C;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x5C31;&#x6765;&#x8BB2;&#x8BB2;&#x6B63;&#x5219;&#x5316;&#x7684;&#x4F5C;&#x7528;&#x539F;&#x7406;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x7528;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x6765;&#x5B9E;&#x73B0;&#x8FD9;&#x4E9B;&#x8BBE;&#x60F3;&#xFF0C;&#x6C42;&#x6210;&#x672C;&#x51FD;&#x6570;$J$&#x7684;&#x6700;&#x5C0F;&#x503C;&#xFF0C;&#x5B83;&#x662F;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x7684;&#x6210;&#x672C;&#x51FD;&#x6570;&#xFF0C;&#x53C2;&#x6570;&#x5305;&#x542B;&#x4E00;&#x4E9B;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x548C;&#x4E0D;&#x540C;&#x6570;&#x636E;&#x4E2D;&#x4E2A;&#x4F53;&#x9884;&#x6D4B;&#x7684;&#x635F;&#x5931;&#xFF0C;$w$&#x548C;$b$&#x662F;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x7684;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;$w$&#x662F;&#x4E00;&#x4E2A;&#x591A;&#x7EF4;&#x5EA6;&#x53C2;&#x6570;&#x77E2;&#x91CF;&#xFF0C;$b$&#x662F;&#x4E00;&#x4E2A;&#x5B9E;&#x6570;&#x3002;&#x5728;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x51FD;&#x6570;&#x4E2D;&#x52A0;&#x5165;&#x6B63;&#x5219;&#x5316;&#xFF0C;&#x53EA;&#x9700;&#x6DFB;&#x52A0;&#x53C2;&#x6570;&#x3BB;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6B63;&#x5219;&#x5316;&#x53C2;&#x6570;&#xFF0C;&#x4E00;&#x4F1A;&#x513F;&#x518D;&#x8BE6;&#x7EC6;&#x8BB2;&#x3002;</p>
<p>$\frac{\lambda}{2m}$&#x4E58;&#x4EE5;$w$&#x8303;&#x6570;&#x7684;&#x5E73;&#x65B9;&#xFF0C;&#x5176;&#x4E2D;$\left| w \right|<em>2^2$&#x662F;$w$&#x7684;&#x6B27;&#x51E0;&#x91CC;&#x5FB7;&#x8303;&#x6570;&#x7684;&#x5E73;&#x65B9;&#xFF0C;&#x7B49;&#x4E8E;$w</em>{j}$&#xFF08;$j$ &#x503C;&#x4ECE;1&#x5230;$n_{x}$&#xFF09;&#x5E73;&#x65B9;&#x7684;&#x548C;&#xFF0C;&#x4E5F;&#x53EF;&#x8868;&#x793A;&#x4E3A;$w^{T}w$&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5411;&#x91CF;&#x53C2;&#x6570;$w$ &#x7684;&#x6B27;&#x51E0;&#x91CC;&#x5FB7;&#x8303;&#x6570;&#xFF08;2&#x8303;&#x6570;&#xFF09;&#x7684;&#x5E73;&#x65B9;&#xFF0C;&#x6B64;&#x65B9;&#x6CD5;&#x79F0;&#x4E3A;$L2$&#x6B63;&#x5219;&#x5316;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x91CC;&#x7528;&#x4E86;&#x6B27;&#x51E0;&#x91CC;&#x5FB7;&#x8303;&#x6570;&#xFF0C;&#x88AB;&#x79F0;&#x4E3A;&#x5411;&#x91CF;&#x53C2;&#x6570;$w$&#x7684;$L2$&#x8303;&#x6570;&#x3002;</p>
<p><img src="../images/fa185e95684bbe6c0e9100164aff2ee5.png" alt=""></p>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x53EA;&#x6B63;&#x5219;&#x5316;&#x53C2;&#x6570;$w$&#xFF1F;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x518D;&#x52A0;&#x4E0A;&#x53C2;&#x6570; $b$ &#x5462;&#xFF1F;&#x4F60;&#x53EF;&#x4EE5;&#x8FD9;&#x4E48;&#x505A;&#xFF0C;&#x53EA;&#x662F;&#x6211;&#x4E60;&#x60EF;&#x7701;&#x7565;&#x4E0D;&#x5199;&#xFF0C;&#x56E0;&#x4E3A;$w$&#x901A;&#x5E38;&#x662F;&#x4E00;&#x4E2A;&#x9AD8;&#x7EF4;&#x53C2;&#x6570;&#x77E2;&#x91CF;&#xFF0C;&#x5DF2;&#x7ECF;&#x53EF;&#x4EE5;&#x8868;&#x8FBE;&#x9AD8;&#x504F;&#x5DEE;&#x95EE;&#x9898;&#xFF0C;$w$&#x53EF;&#x80FD;&#x5305;&#x542B;&#x6709;&#x5F88;&#x591A;&#x53C2;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x53EF;&#x80FD;&#x62DF;&#x5408;&#x6240;&#x6709;&#x53C2;&#x6570;&#xFF0C;&#x800C;$b$&#x53EA;&#x662F;&#x5355;&#x4E2A;&#x6570;&#x5B57;&#xFF0C;&#x6240;&#x4EE5;$w$&#x51E0;&#x4E4E;&#x6DB5;&#x76D6;&#x6240;&#x6709;&#x53C2;&#x6570;&#xFF0C;&#x800C;&#x4E0D;&#x662F;$b$&#xFF0C;&#x5982;&#x679C;&#x52A0;&#x4E86;&#x53C2;&#x6570;$b$&#xFF0C;&#x5176;&#x5B9E;&#x4E5F;&#x6CA1;&#x592A;&#x5927;&#x5F71;&#x54CD;&#xFF0C;&#x56E0;&#x4E3A;$b$&#x53EA;&#x662F;&#x4F17;&#x591A;&#x53C2;&#x6570;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x901A;&#x5E38;&#x7701;&#x7565;&#x4E0D;&#x8BA1;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x52A0;&#x4E0A;&#x8FD9;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x5B8C;&#x5168;&#x6CA1;&#x95EE;&#x9898;&#x3002;</p>
<p><img src="../images/84c4e19130a91a09120087dd704bbaa4.png" alt=""></p>
<p>$L2$&#x6B63;&#x5219;&#x5316;&#x662F;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x6B63;&#x5219;&#x5316;&#x7C7B;&#x578B;&#xFF0C;&#x4F60;&#x4EEC;&#x53EF;&#x80FD;&#x542C;&#x8BF4;&#x8FC7;$L1$&#x6B63;&#x5219;&#x5316;&#xFF0C;$L1$&#x6B63;&#x5219;&#x5316;&#xFF0C;&#x52A0;&#x7684;&#x4E0D;&#x662F;$L2$&#x8303;&#x6570;&#xFF0C;&#x800C;&#x662F;&#x6B63;&#x5219;&#x9879;$\frac{\lambda}{m}$&#x4E58;&#x4EE5;$\sum<em>{j= 1}^{n</em>{x}}{|w|}$&#xFF0C;$\sum<em>{j =1}^{n</em>{x}}{|w|}$&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;&#x53C2;&#x6570;$w$&#x5411;&#x91CF;&#x7684;$L1$&#x8303;&#x6570;&#xFF0C;&#x65E0;&#x8BBA;&#x5206;&#x6BCD;&#x662F;$m$&#x8FD8;&#x662F;$2m$&#xFF0C;&#x5B83;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x6BD4;&#x4F8B;&#x5E38;&#x91CF;&#x3002;</p>
<p><img src="../images/5190dbc5a98db7a248499f54a04257cc.png" alt=""></p>
<p>&#x5982;&#x679C;&#x7528;&#x7684;&#x662F;$L1$&#x6B63;&#x5219;&#x5316;&#xFF0C;$w$&#x6700;&#x7EC8;&#x4F1A;&#x662F;&#x7A00;&#x758F;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;$w$&#x5411;&#x91CF;&#x4E2D;&#x6709;&#x5F88;&#x591A;0&#xFF0C;&#x6709;&#x4EBA;&#x8BF4;&#x8FD9;&#x6837;&#x6709;&#x5229;&#x4E8E;&#x538B;&#x7F29;&#x6A21;&#x578B;&#xFF0C;&#x56E0;&#x4E3A;&#x96C6;&#x5408;&#x4E2D;&#x53C2;&#x6570;&#x5747;&#x4E3A;0&#xFF0C;&#x5B58;&#x50A8;&#x6A21;&#x578B;&#x6240;&#x5360;&#x7528;&#x7684;&#x5185;&#x5B58;&#x66F4;&#x5C11;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x867D;&#x7136;$L1$&#x6B63;&#x5219;&#x5316;&#x4F7F;&#x6A21;&#x578B;&#x53D8;&#x5F97;&#x7A00;&#x758F;&#xFF0C;&#x5374;&#x6CA1;&#x6709;&#x964D;&#x4F4E;&#x592A;&#x591A;&#x5B58;&#x50A8;&#x5185;&#x5B58;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x8BA4;&#x4E3A;&#x8FD9;&#x5E76;&#x4E0D;&#x662F;$L1$&#x6B63;&#x5219;&#x5316;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x81F3;&#x5C11;&#x4E0D;&#x662F;&#x4E3A;&#x4E86;&#x538B;&#x7F29;&#x6A21;&#x578B;&#xFF0C;&#x4EBA;&#x4EEC;&#x5728;&#x8BAD;&#x7EC3;&#x7F51;&#x7EDC;&#x65F6;&#xFF0C;&#x8D8A;&#x6765;&#x8D8A;&#x503E;&#x5411;&#x4E8E;&#x4F7F;&#x7528;$L2$&#x6B63;&#x5219;&#x5316;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6765;&#x770B;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x7EC6;&#x8282;&#xFF0C;$\lambda$&#x662F;&#x6B63;&#x5219;&#x5316;&#x53C2;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x9A8C;&#x8BC1;&#x96C6;&#x6216;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x96C6;&#x6765;&#x914D;&#x7F6E;&#x8FD9;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x5C1D;&#x8BD5;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5BFB;&#x627E;&#x6700;&#x597D;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x8003;&#x8651;&#x8BAD;&#x7EC3;&#x96C6;&#x4E4B;&#x95F4;&#x7684;&#x6743;&#x8861;&#xFF0C;&#x628A;&#x53C2;&#x6570;&#x8BBE;&#x7F6E;&#x4E3A;&#x8F83;&#x5C0F;&#x503C;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x8FC7;&#x62DF;&#x5408;&#xFF0C;&#x6240;&#x4EE5;&#x3BB;&#x662F;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x9700;&#x8981;&#x8C03;&#x6574;&#x7684;&#x8D85;&#x7EA7;&#x53C2;&#x6570;&#xFF0C;&#x987A;&#x4FBF;&#x8BF4;&#x4E00;&#x4E0B;&#xFF0C;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x5199;&#x4EE3;&#x7801;&#xFF0C;&#x5728;<strong>Python</strong>&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;$\lambda$&#x662F;&#x4E00;&#x4E2A;&#x4FDD;&#x7559;&#x5B57;&#x6BB5;&#xFF0C;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x5220;&#x6389;$a$&#xFF0C;&#x5199;&#x6210;$lambd$&#xFF0C;&#x4EE5;&#x514D;&#x4E0E;<strong>Python</strong>&#x4E2D;&#x7684;&#x4FDD;&#x7559;&#x5B57;&#x6BB5;&#x51B2;&#x7A81;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x5728;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x51FD;&#x6570;&#x4E2D;&#x5B9E;&#x73B0;$L2$&#x6B63;&#x5219;&#x5316;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5982;&#x4F55;&#x5728;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x5B9E;&#x73B0;$L2$&#x6B63;&#x5219;&#x5316;&#x5462;&#xFF1F;</p>
<p><img src="../images/2e88bd6f30a8ff8014d6d7dbe6d0488a.png" alt=""></p>
<p>&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x542B;&#x6709;&#x4E00;&#x4E2A;&#x6210;&#x672C;&#x51FD;&#x6570;&#xFF0C;&#x8BE5;&#x51FD;&#x6570;&#x5305;&#x542B;$W^{[1]}$&#xFF0C;$b^{[1]}$&#x5230;$W^{[l]}$&#xFF0C;$b^{[l]}$&#x6240;&#x6709;&#x53C2;&#x6570;&#xFF0C;&#x5B57;&#x6BCD;$L$&#x662F;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6240;&#x542B;&#x7684;&#x5C42;&#x6570;&#xFF0C;&#x56E0;&#x6B64;&#x6210;&#x672C;&#x51FD;&#x6570;&#x7B49;&#x4E8E;$m$&#x4E2A;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#x635F;&#x5931;&#x51FD;&#x6570;&#x7684;&#x603B;&#x548C;&#x4E58;&#x4EE5;$\frac{1}{m}$&#xFF0C;&#x6B63;&#x5219;&#x9879;&#x4E3A;$\frac{\lambda }{2m}&#xFF5B;&#xFF5B;\sum\nolimits_{1}^{L}{| &#xFF5B;&#xFF5B;W}^{[l]}}|}}^{2}}$&#xFF0C;&#x6211;&#x4EEC;&#x79F0;${||W^{\left[l\right]}||}^{2}$&#x4E3A;&#x8303;&#x6570;&#x5E73;&#x65B9;&#xFF0C;&#x8FD9;&#x4E2A;&#x77E9;&#x9635;&#x8303;&#x6570;${||W^{\left[l\right]}||}^{2}$&#xFF08;&#x5373;&#x5E73;&#x65B9;&#x8303;&#x6570;&#xFF09;&#xFF0C;&#x88AB;&#x5B9A;&#x4E49;&#x4E3A;&#x77E9;&#x9635;&#x4E2D;&#x6240;&#x6709;&#x5143;&#x7D20;&#x7684;&#x5E73;&#x65B9;&#x6C42;&#x548C;&#xFF0C;</p>
<p><img src="../images/a8336b2cfeed4128a23f20fab843d226.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x770B;&#x4E0B;&#x6C42;&#x548C;&#x516C;&#x5F0F;&#x7684;&#x5177;&#x4F53;&#x53C2;&#x6570;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x6C42;&#x548C;&#x7B26;&#x53F7;&#x5176;&#x503C;$i$&#x4ECE;1&#x5230;$n^{[l - 1]}$&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x5176;$J$&#x503C;&#x4ECE;1&#x5230;$n^{[l]}$&#xFF0C;&#x56E0;&#x4E3A;$W$&#x662F;&#x4E00;&#x4E2A;$n^{[l]}\times n^{[l-1]}$&#x7684;&#x591A;&#x7EF4;&#x77E9;&#x9635;&#xFF0C;$n^{[l]}$&#x8868;&#x793A;$l$ &#x5C42;&#x5355;&#x5143;&#x7684;&#x6570;&#x91CF;&#xFF0C;$n^{[l-1]}$&#x8868;&#x793A;&#x7B2C;$l-1$&#x5C42;&#x9690;&#x85CF;&#x5355;&#x5143;&#x7684;&#x6570;&#x91CF;&#x3002;</p>
<p><img src="../images/5663bd9360df02b7e5a04c01d4e1bbc7.png" alt=""></p>
<p>&#x8BE5;&#x77E9;&#x9635;&#x8303;&#x6570;&#x88AB;&#x79F0;&#x4F5C;&#x201C;&#x5F17;&#x7F57;&#x8D1D;&#x5C3C;&#x4E4C;&#x65AF;&#x8303;&#x6570;&#x201D;&#xFF0C;&#x7528;&#x4E0B;&#x6807;$F$&#x6807;&#x6CE8;&#x201D;&#xFF0C;&#x9274;&#x4E8E;&#x7EBF;&#x6027;&#x4EE3;&#x6570;&#x4E2D;&#x4E00;&#x4E9B;&#x795E;&#x79D8;&#x6666;&#x6DA9;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x79F0;&#x4E4B;&#x4E3A;&#x201C;&#x77E9;&#x9635;$L2$&#x8303;&#x6570;&#x201D;&#xFF0C;&#x800C;&#x79F0;&#x5B83;&#x4E3A;&#x201C;&#x5F17;&#x7F57;&#x8D1D;&#x5C3C;&#x4E4C;&#x65AF;&#x8303;&#x6570;&#x201D;&#xFF0C;&#x77E9;&#x9635;$L2$&#x8303;&#x6570;&#x542C;&#x8D77;&#x6765;&#x66F4;&#x81EA;&#x7136;&#xFF0C;&#x4F46;&#x9274;&#x4E8E;&#x4E00;&#x4E9B;&#x5927;&#x5BB6;&#x65E0;&#x987B;&#x77E5;&#x9053;&#x7684;&#x7279;&#x6B8A;&#x539F;&#x56E0;&#xFF0C;&#x6309;&#x7167;&#x60EF;&#x4F8B;&#xFF0C;&#x6211;&#x4EEC;&#x79F0;&#x4E4B;&#x4E3A;&#x201C;&#x5F17;&#x7F57;&#x8D1D;&#x5C3C;&#x4E4C;&#x65AF;&#x8303;&#x6570;&#x201D;&#xFF0C;&#x5B83;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x77E9;&#x9635;&#x4E2D;&#x6240;&#x6709;&#x5143;&#x7D20;&#x7684;&#x5E73;&#x65B9;&#x548C;&#x3002;</p>
<p><img src="../images/dffec3cca0e523e22646704e5e76c39a.png" alt=""></p>
<p>&#x8BE5;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x8BE5;&#x8303;&#x6570;&#x5B9E;&#x73B0;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x5462;&#xFF1F;</p>
<p>&#x7528;<strong>backprop</strong>&#x8BA1;&#x7B97;&#x51FA;$dW&#x200B;$&#x7684;&#x503C;&#xFF0C;<strong>backprop</strong>&#x4F1A;&#x7ED9;&#x51FA;$J$&#x5BF9;&#x200B;$W$&#x7684;&#x504F;&#x5BFC;&#x6570;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x200B;$ W^{[l]}$&#xFF0C;&#x628A;&#x200B;$W^{[l]}$&#x66FF;&#x6362;&#x4E3A;&#x200B;$W^{[l]}$&#x51CF;&#x53BB;&#x5B66;&#x4E60;&#x7387;&#x4E58;&#x4EE5;&#x200B;$dW$&#x3002;</p>
<p><img src="../images/b6856a371ed552fd6b9ada2068ab4c2c.png" alt=""></p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x4E4B;&#x524D;&#x6211;&#x4EEC;&#x989D;&#x5916;&#x589E;&#x52A0;&#x7684;&#x6B63;&#x5219;&#x5316;&#x9879;&#xFF0C;&#x65E2;&#x7136;&#x5DF2;&#x7ECF;&#x589E;&#x52A0;&#x4E86;&#x8FD9;&#x4E2A;&#x6B63;&#x5219;&#x9879;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x7ED9;$dW$&#x52A0;&#x4E0A;&#x8FD9;&#x4E00;&#x9879;$\frac {\lambda}{m}W^{[l]}$&#xFF0C;&#x7136;&#x540E;&#x8BA1;&#x7B97;&#x8FD9;&#x4E2A;&#x66F4;&#x65B0;&#x9879;&#xFF0C;&#x4F7F;&#x7528;&#x65B0;&#x5B9A;&#x4E49;&#x7684;$dW^{[l]}$&#xFF0C;&#x5B83;&#x7684;&#x5B9A;&#x4E49;&#x542B;&#x6709;&#x76F8;&#x5173;&#x53C2;&#x6570;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x5BFC;&#x6570;&#x548C;&#xFF0C;&#x4EE5;&#x53CA;&#x6700;&#x540E;&#x6DFB;&#x52A0;&#x7684;&#x989D;&#x5916;&#x6B63;&#x5219;&#x9879;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;$L2$&#x6B63;&#x5219;&#x5316;&#x6709;&#x65F6;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x6743;&#x91CD;&#x8870;&#x51CF;&#x201D;&#x7684;&#x539F;&#x56E0;&#x3002;</p>
<p><img src="../images/dafb163da5b9c3ece677a7ebce05b680.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x7528;$ dW^{[l]}$&#x7684;&#x5B9A;&#x4E49;&#x66FF;&#x6362;&#x6B64;&#x5904;&#x7684;$dW^{[l]}$&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;$W^{[l]}$&#x7684;&#x5B9A;&#x4E49;&#x88AB;&#x66F4;&#x65B0;&#x4E3A;$W^{[l]}$&#x51CF;&#x53BB;&#x5B66;&#x4E60;&#x7387;$\alpha$ &#x4E58;&#x4EE5;<strong>backprop</strong> &#x518D;&#x52A0;&#x4E0A;$\frac{\lambda}{m}W^{[l]}$&#x3002;</p>
<p><img src="../images/f752bc74e0978320a72bcb15d1777cf8.png" alt=""></p>
<p>&#x8BE5;&#x6B63;&#x5219;&#x9879;&#x8BF4;&#x660E;&#xFF0C;&#x4E0D;&#x8BBA;$W^{[l]}$&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x8BD5;&#x56FE;&#x8BA9;&#x5B83;&#x53D8;&#x5F97;&#x66F4;&#x5C0F;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;&#x6211;&#x4EEC;&#x7ED9;&#x77E9;&#x9635;W&#x4E58;&#x4EE5;$(1 - \alpha\frac{\lambda}{m})$&#x500D;&#x7684;&#x6743;&#x91CD;&#xFF0C;&#x77E9;&#x9635;$W$&#x51CF;&#x53BB;$\alpha\frac{\lambda}{m}$&#x500D;&#x7684;&#x5B83;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x7528;&#x8FD9;&#x4E2A;&#x7CFB;&#x6570;$(1-\alpha\frac{\lambda}{m})$&#x4E58;&#x4EE5;&#x77E9;&#x9635;$W$&#xFF0C;&#x8BE5;&#x7CFB;&#x6570;&#x5C0F;&#x4E8E;1&#xFF0C;&#x56E0;&#x6B64;$L2$&#x8303;&#x6570;&#x6B63;&#x5219;&#x5316;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x6743;&#x91CD;&#x8870;&#x51CF;&#x201D;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5C31;&#x50CF;&#x4E00;&#x822C;&#x7684;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#xFF0C;$W$&#x88AB;&#x66F4;&#x65B0;&#x4E3A;&#x5C11;&#x4E86;$\alpha$&#x4E58;&#x4EE5;<strong>backprop</strong>&#x8F93;&#x51FA;&#x7684;&#x6700;&#x521D;&#x68AF;&#x5EA6;&#x503C;&#xFF0C;&#x540C;&#x65F6;$W$&#x4E5F;&#x4E58;&#x4EE5;&#x4E86;&#x8FD9;&#x4E2A;&#x7CFB;&#x6570;&#xFF0C;&#x8FD9;&#x4E2A;&#x7CFB;&#x6570;&#x5C0F;&#x4E8E;1&#xFF0C;&#x56E0;&#x6B64;$L2$&#x6B63;&#x5219;&#x5316;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x6743;&#x91CD;&#x8870;&#x51CF;&#x201D;&#x3002;</p>
<p><img src="../images/cba0f1c7a480139acb04e762e4fe57f8.png" alt=""></p>
<p>&#x6211;&#x4E0D;&#x6253;&#x7B97;&#x8FD9;&#x4E48;&#x53EB;&#x5B83;&#xFF0C;&#x4E4B;&#x6240;&#x4EE5;&#x53EB;&#x5B83;&#x201C;&#x6743;&#x91CD;&#x8870;&#x51CF;&#x201D;&#x662F;&#x56E0;&#x4E3A;&#x8FD9;&#x4E24;&#x9879;&#x76F8;&#x7B49;&#xFF0C;&#x6743;&#x91CD;&#x6307;&#x6807;&#x4E58;&#x4EE5;&#x4E86;&#x4E00;&#x4E2A;&#x5C0F;&#x4E8E;1&#x7684;&#x7CFB;&#x6570;&#x3002;</p>
<p>&#x4EE5;&#x4E0A;&#x5C31;&#x662F;&#x5728;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x5E94;&#x7528;$L2$&#x6B63;&#x5219;&#x5316;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x6709;&#x4EBA;&#x4F1A;&#x95EE;&#x6211;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x6B63;&#x5219;&#x5316;&#x53EF;&#x4EE5;&#x9884;&#x9632;&#x8FC7;&#x62DF;&#x5408;&#xFF0C;&#x6211;&#x4EEC;&#x653E;&#x5728;&#x4E0B;&#x8282;&#x8BFE;&#x8BB2;&#xFF0C;&#x540C;&#x65F6;&#x76F4;&#x89C2;&#x611F;&#x53D7;&#x4E00;&#x4E0B;&#x6B63;&#x5219;&#x5316;&#x662F;&#x5982;&#x4F55;&#x9884;&#x9632;&#x8FC7;&#x62DF;&#x5408;&#x7684;&#x3002;</p>
<h3 id="15-&#x4E3A;&#x4EC0;&#x4E48;&#x6B63;&#x5219;&#x5316;&#x6709;&#x5229;&#x4E8E;&#x9884;&#x9632;&#x8FC7;&#x62DF;&#x5408;&#x5462;&#xFF1F;&#xFF08;why-regularization-reduces-overfitting&#xFF09;">1.5 &#x4E3A;&#x4EC0;&#x4E48;&#x6B63;&#x5219;&#x5316;&#x6709;&#x5229;&#x4E8E;&#x9884;&#x9632;&#x8FC7;&#x62DF;&#x5408;&#x5462;&#xFF1F;&#xFF08;Why regularization reduces overfitting?&#xFF09;</h3>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x6B63;&#x5219;&#x5316;&#x6709;&#x5229;&#x4E8E;&#x9884;&#x9632;&#x8FC7;&#x62DF;&#x5408;&#x5462;&#xFF1F;&#x4E3A;&#x4EC0;&#x4E48;&#x5B83;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x65B9;&#x5DEE;&#x95EE;&#x9898;&#xFF1F;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x4E24;&#x4E2A;&#x4F8B;&#x5B50;&#x6765;&#x76F4;&#x89C2;&#x4F53;&#x4F1A;&#x4E00;&#x4E0B;&#x3002;</p>
<p><img src="../images/15d5607b8ac1c1fbaa023cb6060633f2.png" alt=""></p>
<p><img src="../images/1a6c47e64293cde6a0facb3872701db2.png" alt=""></p>
<p>&#x5DE6;&#x56FE;&#x662F;&#x9AD8;&#x504F;&#x5DEE;&#xFF0C;&#x53F3;&#x56FE;&#x662F;&#x9AD8;&#x65B9;&#x5DEE;&#xFF0C;&#x4E2D;&#x95F4;&#x662F;<strong>Just Right</strong>&#xFF0C;&#x8FD9;&#x51E0;&#x5F20;&#x56FE;&#x6211;&#x4EEC;&#x5728;&#x524D;&#x9762;&#x8BFE;&#x7A0B;&#x4E2D;&#x770B;&#x5230;&#x8FC7;&#x3002;</p>
<p><img src="../images/d5ee6f2b60ff7601d50967f4365d0ecb.png" alt=""></p>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E0B;&#x8FD9;&#x4E2A;&#x5E9E;&#x5927;&#x7684;&#x6DF1;&#x5EA6;&#x62DF;&#x5408;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;&#x6211;&#x77E5;&#x9053;&#x8FD9;&#x5F20;&#x56FE;&#x4E0D;&#x591F;&#x5927;&#xFF0C;&#x6DF1;&#x5EA6;&#x4E5F;&#x4E0D;&#x591F;&#xFF0C;&#x4F46;&#x4F60;&#x53EF;&#x4EE5;&#x60F3;&#x8C61;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x8FC7;&#x62DF;&#x5408;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;&#x8FD9;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;$J$&#xFF0C;&#x542B;&#x6709;&#x53C2;&#x6570;$W$&#xFF0C;$b$&#x3002;&#x6211;&#x4EEC;&#x6DFB;&#x52A0;&#x6B63;&#x5219;&#x9879;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x6570;&#x636E;&#x6743;&#x503C;&#x77E9;&#x9635;&#x8FC7;&#x5927;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x5F17;&#x7F57;&#x8D1D;&#x5C3C;&#x4E4C;&#x65AF;&#x8303;&#x6570;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x538B;&#x7F29;$L2$&#x8303;&#x6570;&#xFF0C;&#x6216;&#x8005;&#x5F17;&#x7F57;&#x8D1D;&#x5C3C;&#x4E4C;&#x65AF;&#x8303;&#x6570;&#x6216;&#x8005;&#x53C2;&#x6570;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x8FC7;&#x62DF;&#x5408;&#xFF1F;</p>
<p>&#x76F4;&#x89C2;&#x4E0A;&#x7406;&#x89E3;&#x5C31;&#x662F;&#x5982;&#x679C;&#x6B63;&#x5219;&#x5316;$\lambda$&#x8BBE;&#x7F6E;&#x5F97;&#x8DB3;&#x591F;&#x5927;&#xFF0C;&#x6743;&#x91CD;&#x77E9;&#x9635;$W$&#x88AB;&#x8BBE;&#x7F6E;&#x4E3A;&#x63A5;&#x8FD1;&#x4E8E;0&#x7684;&#x503C;&#xFF0C;&#x76F4;&#x89C2;&#x7406;&#x89E3;&#x5C31;&#x662F;&#x628A;&#x591A;&#x9690;&#x85CF;&#x5355;&#x5143;&#x7684;&#x6743;&#x91CD;&#x8BBE;&#x4E3A;0&#xFF0C;&#x4E8E;&#x662F;&#x57FA;&#x672C;&#x4E0A;&#x6D88;&#x9664;&#x4E86;&#x8FD9;&#x4E9B;&#x9690;&#x85CF;&#x5355;&#x5143;&#x7684;&#x8BB8;&#x591A;&#x5F71;&#x54CD;&#x3002;&#x5982;&#x679C;&#x662F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x8FD9;&#x4E2A;&#x88AB;&#x5927;&#x5927;&#x7B80;&#x5316;&#x4E86;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4F1A;&#x53D8;&#x6210;&#x4E00;&#x4E2A;&#x5F88;&#x5C0F;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x5C0F;&#x5230;&#x5982;&#x540C;&#x4E00;&#x4E2A;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x5355;&#x5143;&#xFF0C;&#x53EF;&#x662F;&#x6DF1;&#x5EA6;&#x5374;&#x5F88;&#x5927;&#xFF0C;&#x5B83;&#x4F1A;&#x4F7F;&#x8FD9;&#x4E2A;&#x7F51;&#x7EDC;&#x4ECE;&#x8FC7;&#x5EA6;&#x62DF;&#x5408;&#x7684;&#x72B6;&#x6001;&#x66F4;&#x63A5;&#x8FD1;&#x5DE6;&#x56FE;&#x7684;&#x9AD8;&#x504F;&#x5DEE;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x4F46;&#x662F;$\lambda$&#x4F1A;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x4E2D;&#x95F4;&#x503C;&#xFF0C;&#x4E8E;&#x662F;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x63A5;&#x8FD1;&#x201C;<strong>Just Right</strong>&#x201D;&#x7684;&#x4E2D;&#x95F4;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x76F4;&#x89C2;&#x7406;&#x89E3;&#x5C31;&#x662F;$\lambda$&#x589E;&#x52A0;&#x5230;&#x8DB3;&#x591F;&#x5927;&#xFF0C;$W$&#x4F1A;&#x63A5;&#x8FD1;&#x4E8E;0&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x5C1D;&#x8BD5;&#x6D88;&#x9664;&#x6216;&#x81F3;&#x5C11;&#x51CF;&#x5C11;&#x8BB8;&#x591A;&#x9690;&#x85CF;&#x5355;&#x5143;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x6700;&#x7EC8;&#x8FD9;&#x4E2A;&#x7F51;&#x7EDC;&#x4F1A;&#x53D8;&#x5F97;&#x66F4;&#x7B80;&#x5355;&#xFF0C;&#x8FD9;&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8D8A;&#x6765;&#x8D8A;&#x63A5;&#x8FD1;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#xFF0C;&#x6211;&#x4EEC;&#x76F4;&#x89C9;&#x4E0A;&#x8BA4;&#x4E3A;&#x5927;&#x91CF;&#x9690;&#x85CF;&#x5355;&#x5143;&#x88AB;&#x5B8C;&#x5168;&#x6D88;&#x9664;&#x4E86;&#xFF0C;&#x5176;&#x5B9E;&#x4E0D;&#x7136;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x8BE5;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x6240;&#x6709;&#x9690;&#x85CF;&#x5355;&#x5143;&#x4F9D;&#x7136;&#x5B58;&#x5728;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x7684;&#x5F71;&#x54CD;&#x53D8;&#x5F97;&#x66F4;&#x5C0F;&#x4E86;&#x3002;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x53D8;&#x5F97;&#x66F4;&#x7B80;&#x5355;&#x4E86;&#xFF0C;&#x8C8C;&#x4F3C;&#x8FD9;&#x6837;&#x66F4;&#x4E0D;&#x5BB9;&#x6613;&#x53D1;&#x751F;&#x8FC7;&#x62DF;&#x5408;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4E0D;&#x786E;&#x5B9A;&#x8FD9;&#x4E2A;&#x76F4;&#x89C9;&#x7ECF;&#x9A8C;&#x662F;&#x5426;&#x6709;&#x7528;&#xFF0C;&#x4E0D;&#x8FC7;&#x5728;&#x7F16;&#x7A0B;&#x4E2D;&#x6267;&#x884C;&#x6B63;&#x5219;&#x5316;&#x65F6;&#xFF0C;&#x4F60;&#x5B9E;&#x9645;&#x770B;&#x5230;&#x4E00;&#x4E9B;&#x65B9;&#x5DEE;&#x51CF;&#x5C11;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p><img src="../images/2aafa244c3f184cc271b26d1d95d70c9.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x518D;&#x6765;&#x76F4;&#x89C2;&#x611F;&#x53D7;&#x4E00;&#x4E0B;&#xFF0C;&#x6B63;&#x5219;&#x5316;&#x4E3A;&#x4EC0;&#x4E48;&#x53EF;&#x4EE5;&#x9884;&#x9632;&#x8FC7;&#x62DF;&#x5408;&#xFF0C;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x7528;&#x7684;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x53CC;&#x66F2;&#x7EBF;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x3002;</p>
<p><img src="../images/f35d94efc03123e4a5de6496c1b896c0.png" alt=""></p>
<p>&#x7528;$g(z)$&#x8868;&#x793A;$tanh(z)$&#xFF0C;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x5982;&#x679C; <em>z</em> &#x975E;&#x5E38;&#x5C0F;&#xFF0C;&#x6BD4;&#x5982; <em>z</em> &#x53EA;&#x6D89;&#x53CA;&#x5F88;&#x5C0F;&#x8303;&#x56F4;&#x7684;&#x53C2;&#x6570;&#xFF08;&#x56FE;&#x4E2D;&#x539F;&#x70B9;&#x9644;&#x8FD1;&#x7684;&#x7EA2;&#x8272;&#x533A;&#x57DF;&#xFF09;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x5229;&#x7528;&#x4E86;&#x53CC;&#x66F2;&#x6B63;&#x5207;&#x51FD;&#x6570;&#x7684;&#x7EBF;&#x6027;&#x72B6;&#x6001;&#xFF0C;&#x53EA;&#x8981;$z$&#x53EF;&#x4EE5;&#x6269;&#x5C55;&#x4E3A;&#x8FD9;&#x6837;&#x7684;&#x66F4;&#x5927;&#x503C;&#x6216;&#x8005;&#x66F4;&#x5C0F;&#x503C;&#xFF0C;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x5F00;&#x59CB;&#x53D8;&#x5F97;&#x975E;&#x7EBF;&#x6027;&#x3002;</p>
<p><img src="../images/884d5768243f4badc77356f843cb8c0c.png" alt=""></p>
<p>&#x73B0;&#x5728;&#x4F60;&#x5E94;&#x8BE5;&#x6452;&#x5F03;&#x8FD9;&#x4E2A;&#x76F4;&#x89C9;&#xFF0C;&#x5982;&#x679C;&#x6B63;&#x5219;&#x5316;&#x53C2;&#x6570;&#x3BB;&#x5F88;&#x5927;&#xFF0C;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x7684;&#x53C2;&#x6570;&#x4F1A;&#x76F8;&#x5BF9;&#x8F83;&#x5C0F;&#xFF0C;&#x56E0;&#x4E3A;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x4E2D;&#x7684;&#x53C2;&#x6570;&#x53D8;&#x5927;&#x4E86;&#xFF0C;&#x5982;&#x679C;$W$&#x5F88;&#x5C0F;&#xFF0C;</p>
<p><img src="../images/63fa65e2609fe7a6909544247855d1a5.png" alt=""></p>
<p>&#x5982;&#x679C;$W$&#x5F88;&#x5C0F;&#xFF0C;&#x76F8;&#x5BF9;&#x6765;&#x8BF4;&#xFF0C;$z$&#x4E5F;&#x4F1A;&#x5F88;&#x5C0F;&#x3002;</p>
<p><img src="../images/fcdff0820223fb8a5756ad0bf99991fe.png" alt=""></p>
<p>&#x7279;&#x522B;&#x662F;&#xFF0C;&#x5982;&#x679C;$z$&#x7684;&#x503C;&#x6700;&#x7EC8;&#x5728;&#x8FD9;&#x4E2A;&#x8303;&#x56F4;&#x5185;&#xFF0C;&#x90FD;&#x662F;&#x76F8;&#x5BF9;&#x8F83;&#x5C0F;&#x7684;&#x503C;&#xFF0C;$g(z)$&#x5927;&#x81F4;&#x5448;&#x7EBF;&#x6027;&#xFF0C;&#x6BCF;&#x5C42;&#x51E0;&#x4E4E;&#x90FD;&#x662F;&#x7EBF;&#x6027;&#x7684;&#xFF0C;&#x548C;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x51FD;&#x6570;&#x4E00;&#x6837;&#x3002;</p>
<p><img src="../images/8248be8e83121535b73969a4599fbb08.png" alt=""></p>
<p>&#x7B2C;&#x4E00;&#x8282;&#x8BFE;&#x6211;&#x4EEC;&#x8BB2;&#x8FC7;&#xFF0C;&#x5982;&#x679C;&#x6BCF;&#x5C42;&#x90FD;&#x662F;&#x7EBF;&#x6027;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x6574;&#x4E2A;&#x7F51;&#x7EDC;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x7EBF;&#x6027;&#x7F51;&#x7EDC;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x6DF1;&#x7684;&#x6DF1;&#x5C42;&#x7F51;&#x7EDC;&#xFF0C;&#x56E0;&#x5177;&#x6709;&#x7EBF;&#x6027;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x6700;&#x7EC8;&#x6211;&#x4EEC;&#x53EA;&#x80FD;&#x8BA1;&#x7B97;&#x7EBF;&#x6027;&#x51FD;&#x6570;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x5B83;&#x4E0D;&#x9002;&#x7528;&#x4E8E;&#x975E;&#x5E38;&#x590D;&#x6742;&#x7684;&#x51B3;&#x7B56;&#xFF0C;&#x4EE5;&#x53CA;&#x8FC7;&#x5EA6;&#x62DF;&#x5408;&#x6570;&#x636E;&#x96C6;&#x7684;&#x975E;&#x7EBF;&#x6027;&#x51B3;&#x7B56;&#x8FB9;&#x754C;&#xFF0C;&#x5982;&#x540C;&#x6211;&#x4EEC;&#x5728;&#x5E7B;&#x706F;&#x7247;&#x4E2D;&#x770B;&#x5230;&#x7684;&#x8FC7;&#x5EA6;&#x62DF;&#x5408;&#x9AD8;&#x65B9;&#x5DEE;&#x7684;&#x60C5;&#x51B5;&#x3002;</p>
<p><img src="../images/307675386a412e57cf60be3381f02a64.png" alt=""></p>
<p>&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x6B63;&#x5219;&#x5316;&#x53C2;&#x6570;&#x53D8;&#x5F97;&#x5F88;&#x5927;&#xFF0C;&#x53C2;&#x6570;$W$&#x5F88;&#x5C0F;&#xFF0C;$z$&#x4E5F;&#x4F1A;&#x76F8;&#x5BF9;&#x53D8;&#x5C0F;&#xFF0C;&#x6B64;&#x65F6;&#x5FFD;&#x7565;$b$&#x7684;&#x5F71;&#x54CD;&#xFF0C;$z$&#x4F1A;&#x76F8;&#x5BF9;&#x53D8;&#x5C0F;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;$z$&#x7684;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x5F88;&#x5C0F;&#xFF0C;&#x8FD9;&#x4E2A;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x66F2;&#x7EBF;&#x51FD;&#x6570;$tanh$&#x4F1A;&#x76F8;&#x5BF9;&#x5448;&#x7EBF;&#x6027;&#xFF0C;&#x6574;&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4F1A;&#x8BA1;&#x7B97;&#x79BB;&#x7EBF;&#x6027;&#x51FD;&#x6570;&#x8FD1;&#x7684;&#x503C;&#xFF0C;&#x8FD9;&#x4E2A;&#x7EBF;&#x6027;&#x51FD;&#x6570;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x6781;&#x590D;&#x6742;&#x7684;&#x9AD8;&#x5EA6;&#x975E;&#x7EBF;&#x6027;&#x51FD;&#x6570;&#xFF0C;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x8FC7;&#x62DF;&#x5408;&#x3002;</p>
<p>&#x5927;&#x5BB6;&#x5728;&#x7F16;&#x7A0B;&#x4F5C;&#x4E1A;&#x91CC;&#x5B9E;&#x73B0;&#x6B63;&#x5219;&#x5316;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F1A;&#x4EB2;&#x773C;&#x770B;&#x5230;&#x8FD9;&#x4E9B;&#x7ED3;&#x679C;&#xFF0C;&#x603B;&#x7ED3;&#x6B63;&#x5219;&#x5316;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x7ED9;&#x5927;&#x5BB6;&#x4E00;&#x4E2A;&#x6267;&#x884C;&#x65B9;&#x9762;&#x7684;&#x5C0F;&#x5EFA;&#x8BAE;&#xFF0C;&#x5728;&#x589E;&#x52A0;&#x6B63;&#x5219;&#x5316;&#x9879;&#x65F6;&#xFF0C;&#x5E94;&#x7528;&#x4E4B;&#x524D;&#x5B9A;&#x4E49;&#x7684;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;$J$&#xFF0C;&#x6211;&#x4EEC;&#x505A;&#x8FC7;&#x4FEE;&#x6539;&#xFF0C;&#x589E;&#x52A0;&#x4E86;&#x4E00;&#x9879;&#xFF0C;&#x76EE;&#x7684;&#x662F;&#x9884;&#x9632;&#x6743;&#x91CD;&#x8FC7;&#x5927;&#x3002;</p>
<p><img src="../images/b84cc50eb967cd177007e21e93960b5c.png" alt=""></p>
<p>&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x51FD;&#x6570;&#xFF0C;&#x5728;&#x8C03;&#x8BD5;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x65F6;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x6B65;&#x5C31;&#x662F;&#x628A;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;$J$&#x8BBE;&#x8BA1;&#x6210;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x5728;&#x8C03;&#x8BD5;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x65F6;&#xFF0C;&#x5B83;&#x4EE3;&#x8868;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7684;&#x8C03;&#x5E45;&#x6570;&#x91CF;&#x3002;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x5BF9;&#x4E8E;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7684;&#x6BCF;&#x4E2A;&#x8C03;&#x5E45;&#x90FD;&#x5355;&#x8C03;&#x9012;&#x51CF;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5B9E;&#x65BD;&#x7684;&#x662F;&#x6B63;&#x5219;&#x5316;&#x51FD;&#x6570;&#xFF0C;&#x8BF7;&#x7262;&#x8BB0;&#xFF0C;$J$&#x5DF2;&#x7ECF;&#x6709;&#x4E00;&#x4E2A;&#x5168;&#x65B0;&#x7684;&#x5B9A;&#x4E49;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7528;&#x7684;&#x662F;&#x539F;&#x51FD;&#x6570;$J$&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8FD9;&#x7B2C;&#x4E00;&#x4E2A;&#x9879;&#x6B63;&#x5219;&#x5316;&#x9879;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x770B;&#x4E0D;&#x5230;&#x5355;&#x8C03;&#x9012;&#x51CF;&#x73B0;&#x8C61;&#xFF0C;&#x4E3A;&#x4E86;&#x8C03;&#x8BD5;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#xFF0C;&#x8BF7;&#x52A1;&#x5FC5;&#x4F7F;&#x7528;&#x65B0;&#x5B9A;&#x4E49;&#x7684;$J$&#x51FD;&#x6570;&#xFF0C;&#x5B83;&#x5305;&#x542B;&#x7B2C;&#x4E8C;&#x4E2A;&#x6B63;&#x5219;&#x5316;&#x9879;&#xFF0C;&#x5426;&#x5219;&#x51FD;&#x6570;$J$&#x53EF;&#x80FD;&#x4E0D;&#x4F1A;&#x5728;&#x6240;&#x6709;&#x8C03;&#x5E45;&#x8303;&#x56F4;&#x5185;&#x90FD;&#x5355;&#x8C03;&#x9012;&#x51CF;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;$L2$&#x6B63;&#x5219;&#x5316;&#xFF0C;&#x5B83;&#x662F;&#x6211;&#x5728;&#x8BAD;&#x7EC3;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x6A21;&#x578B;&#x65F6;&#x6700;&#x5E38;&#x7528;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x3002;&#x5728;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x4E2D;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x4E5F;&#x7528;&#x5230;&#x4E86;&#x6B63;&#x5219;&#x5316;&#xFF0C;&#x5C31;&#x662F;<strong>dropout</strong>&#x6B63;&#x5219;&#x5316;&#xFF0C;&#x6211;&#x4EEC;&#x4E0B;&#x8282;&#x8BFE;&#x518D;&#x8BB2;&#x3002;</p>
<h3 id="16-dropout-&#x6B63;&#x5219;&#x5316;&#xFF08;dropout-regularization&#xFF09;">1.6 dropout &#x6B63;&#x5219;&#x5316;&#xFF08;Dropout Regularization&#xFF09;</h3>
<p>&#x9664;&#x4E86;$L2$&#x6B63;&#x5219;&#x5316;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x5B9E;&#x7528;&#x7684;&#x6B63;&#x5219;&#x5316;&#x65B9;&#x6CD5;&#x2014;&#x2014;&#x201C;<strong>Dropout</strong>&#xFF08;&#x968F;&#x673A;&#x5931;&#x6D3B;&#xFF09;&#x201D;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;&#x5B83;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x3002;</p>
<p><img src="../images/97e37bf0d2893f890561cda932ba8c42.png" alt=""></p>
<p>&#x5047;&#x8BBE;&#x4F60;&#x5728;&#x8BAD;&#x7EC3;&#x4E0A;&#x56FE;&#x8FD9;&#x6837;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x5B83;&#x5B58;&#x5728;&#x8FC7;&#x62DF;&#x5408;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;<strong>dropout</strong>&#x6240;&#x8981;&#x5904;&#x7406;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x590D;&#x5236;&#x8FD9;&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;<strong>dropout</strong>&#x4F1A;&#x904D;&#x5386;&#x7F51;&#x7EDC;&#x7684;&#x6BCF;&#x4E00;&#x5C42;&#xFF0C;&#x5E76;&#x8BBE;&#x7F6E;&#x6D88;&#x9664;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x8282;&#x70B9;&#x7684;&#x6982;&#x7387;&#x3002;&#x5047;&#x8BBE;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x5C42;&#xFF0C;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x90FD;&#x4EE5;&#x629B;&#x786C;&#x5E01;&#x7684;&#x65B9;&#x5F0F;&#x8BBE;&#x7F6E;&#x6982;&#x7387;&#xFF0C;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x5F97;&#x4EE5;&#x4FDD;&#x7559;&#x548C;&#x6D88;&#x9664;&#x7684;&#x6982;&#x7387;&#x90FD;&#x662F;0.5&#xFF0C;&#x8BBE;&#x7F6E;&#x5B8C;&#x8282;&#x70B9;&#x6982;&#x7387;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x6D88;&#x9664;&#x4E00;&#x4E9B;&#x8282;&#x70B9;&#xFF0C;&#x7136;&#x540E;&#x5220;&#x9664;&#x6389;&#x4ECE;&#x8BE5;&#x8282;&#x70B9;&#x8FDB;&#x51FA;&#x7684;&#x8FDE;&#x7EBF;&#xFF0C;&#x6700;&#x540E;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x66F4;&#x5C11;&#xFF0C;&#x89C4;&#x6A21;&#x66F4;&#x5C0F;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x7136;&#x540E;&#x7528;<strong>backprop</strong>&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#x3002;</p>
<p><img src="../images/e45f9a948989b365650ddf16f62b097e.png" alt=""></p>
<p><img src="../images/9fa7196adeeaf88eb386fda2e9fa9909.png" alt=""></p>
<p>&#x8FD9;&#x662F;&#x7F51;&#x7EDC;&#x8282;&#x70B9;&#x7CBE;&#x7B80;&#x540E;&#x7684;&#x4E00;&#x4E2A;&#x6837;&#x672C;&#xFF0C;&#x5BF9;&#x4E8E;&#x5176;&#x5B83;&#x6837;&#x672C;&#xFF0C;&#x6211;&#x4EEC;&#x7167;&#x65E7;&#x4EE5;&#x629B;&#x786C;&#x5E01;&#x7684;&#x65B9;&#x5F0F;&#x8BBE;&#x7F6E;&#x6982;&#x7387;&#xFF0C;&#x4FDD;&#x7559;&#x4E00;&#x7C7B;&#x8282;&#x70B9;&#x96C6;&#x5408;&#xFF0C;&#x5220;&#x9664;&#x5176;&#x5B83;&#x7C7B;&#x578B;&#x7684;&#x8282;&#x70B9;&#x96C6;&#x5408;&#x3002;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x5C06;&#x91C7;&#x7528;&#x4E00;&#x4E2A;&#x7CBE;&#x7B80;&#x540E;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6765;&#x8BAD;&#x7EC3;&#x5B83;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x4F3C;&#x4E4E;&#x6709;&#x70B9;&#x602A;&#xFF0C;&#x5355;&#x7EAF;&#x904D;&#x5386;&#x8282;&#x70B9;&#xFF0C;&#x7F16;&#x7801;&#x4E5F;&#x662F;&#x968F;&#x673A;&#x7684;&#xFF0C;&#x53EF;&#x5B83;&#x771F;&#x7684;&#x6709;&#x6548;&#x3002;&#x4E0D;&#x8FC7;&#x53EF;&#x60F3;&#x800C;&#x77E5;&#xFF0C;&#x6211;&#x4EEC;&#x9488;&#x5BF9;&#x6BCF;&#x4E2A;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#x8BAD;&#x7EC3;&#x89C4;&#x6A21;&#x5C0F;&#x5F97;&#x591A;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x6700;&#x540E;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x8BA4;&#x8BC6;&#x5230;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x6B63;&#x5219;&#x5316;&#x7F51;&#x7EDC;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5728;&#x8BAD;&#x7EC3;&#x89C4;&#x6A21;&#x5C0F;&#x5F97;&#x591A;&#x7684;&#x7F51;&#x7EDC;&#x3002;</p>
<p><img src="../images/70b248490e496fed9b8d1d616e4d8303.png" alt=""></p>
<p>&#x5982;&#x4F55;&#x5B9E;&#x65BD;<strong>dropout</strong>&#x5462;&#xFF1F;&#x65B9;&#x6CD5;&#x6709;&#x51E0;&#x79CD;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x8981;&#x8BB2;&#x7684;&#x662F;&#x6700;&#x5E38;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5373;<strong>inverted dropout</strong>&#xFF08;&#x53CD;&#x5411;&#x968F;&#x673A;&#x5931;&#x6D3B;&#xFF09;&#xFF0C;&#x51FA;&#x4E8E;&#x5B8C;&#x6574;&#x6027;&#x8003;&#x8651;&#xFF0C;&#x6211;&#x4EEC;&#x7528;&#x4E00;&#x4E2A;&#x4E09;&#x5C42;&#xFF08;$l=3$&#xFF09;&#x7F51;&#x7EDC;&#x6765;&#x4E3E;&#x4F8B;&#x8BF4;&#x660E;&#x3002;&#x7F16;&#x7801;&#x4E2D;&#x4F1A;&#x6709;&#x5F88;&#x591A;&#x6D89;&#x53CA;&#x5230;3&#x7684;&#x5730;&#x65B9;&#x3002;&#x6211;&#x53EA;&#x4E3E;&#x4F8B;&#x8BF4;&#x660E;&#x5982;&#x4F55;&#x5728;&#x67D0;&#x4E00;&#x5C42;&#x4E2D;&#x5B9E;&#x65BD;<strong>dropout</strong>&#x3002;</p>
<p>&#x9996;&#x5148;&#x8981;&#x5B9A;&#x4E49;&#x5411;&#x91CF;$d$&#xFF0C;$d^{[3]}$&#x8868;&#x793A;&#x7F51;&#x7EDC;&#x7B2C;&#x4E09;&#x5C42;&#x7684;<strong>dropout</strong>&#x5411;&#x91CF;&#xFF1A;</p>
<p><code>d3 = np.random.rand(a3.shape[0],a3.shape[1])</code></p>
<p>&#x7136;&#x540E;&#x770B;&#x5B83;&#x662F;&#x5426;&#x5C0F;&#x4E8E;&#x67D0;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x79F0;&#x4E4B;&#x4E3A;<strong>keep-prob</strong>&#xFF0C;<strong>keep-prob</strong>&#x662F;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x6570;&#x5B57;&#xFF0C;&#x4E0A;&#x4E2A;&#x793A;&#x4F8B;&#x4E2D;&#x5B83;&#x662F;0.5&#xFF0C;&#x800C;&#x672C;&#x4F8B;&#x4E2D;&#x5B83;&#x662F;0.8&#xFF0C;&#x5B83;&#x8868;&#x793A;&#x4FDD;&#x7559;&#x67D0;&#x4E2A;&#x9690;&#x85CF;&#x5355;&#x5143;&#x7684;&#x6982;&#x7387;&#xFF0C;&#x6B64;&#x5904;<strong>keep-prob</strong>&#x7B49;&#x4E8E;0.8&#xFF0C;&#x5B83;&#x610F;&#x5473;&#x7740;&#x6D88;&#x9664;&#x4EFB;&#x610F;&#x4E00;&#x4E2A;&#x9690;&#x85CF;&#x5355;&#x5143;&#x7684;&#x6982;&#x7387;&#x662F;0.2&#xFF0C;&#x5B83;&#x7684;&#x4F5C;&#x7528;&#x5C31;&#x662F;&#x751F;&#x6210;&#x968F;&#x673A;&#x77E9;&#x9635;&#xFF0C;&#x5982;&#x679C;&#x5BF9;$a^{[3]}$&#x8FDB;&#x884C;&#x56E0;&#x5B50;&#x5206;&#x89E3;&#xFF0C;&#x6548;&#x679C;&#x4E5F;&#x662F;&#x4E00;&#x6837;&#x7684;&#x3002;$d^{[3]}$&#x662F;&#x4E00;&#x4E2A;&#x77E9;&#x9635;&#xFF0C;&#x6BCF;&#x4E2A;&#x6837;&#x672C;&#x548C;&#x6BCF;&#x4E2A;&#x9690;&#x85CF;&#x5355;&#x5143;&#xFF0C;&#x5176;&#x4E2D;$d^{[3]}$&#x4E2D;&#x7684;&#x5BF9;&#x5E94;&#x503C;&#x4E3A;1&#x7684;&#x6982;&#x7387;&#x90FD;&#x662F;0.8&#xFF0C;&#x5BF9;&#x5E94;&#x4E3A;0&#x7684;&#x6982;&#x7387;&#x662F;0.2&#xFF0C;&#x968F;&#x673A;&#x6570;&#x5B57;&#x5C0F;&#x4E8E;0.8&#x3002;&#x5B83;&#x7B49;&#x4E8E;1&#x7684;&#x6982;&#x7387;&#x662F;0.8&#xFF0C;&#x7B49;&#x4E8E;0&#x7684;&#x6982;&#x7387;&#x662F;0.2&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x4ECE;&#x7B2C;&#x4E09;&#x5C42;&#x4E2D;&#x83B7;&#x53D6;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x53EB;&#x5B83;$a^{[3]}$&#xFF0C;$a^{[3]}$&#x542B;&#x6709;&#x8981;&#x8BA1;&#x7B97;&#x7684;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF0C;$a^{[3]}$&#x7B49;&#x4E8E;&#x4E0A;&#x9762;&#x7684;$a^{[3]}$&#x4E58;&#x4EE5;$d^{[3]}$&#xFF0C;<code>a3 =np.multiply(a3,d3)</code>&#xFF0C;&#x8FD9;&#x91CC;&#x662F;&#x5143;&#x7D20;&#x76F8;&#x4E58;&#xFF0C;&#x4E5F;&#x53EF;&#x5199;&#x4E3A;$a3*=d3$&#xFF0C;&#x5B83;&#x7684;&#x4F5C;&#x7528;&#x5C31;&#x662F;&#x8BA9;$d^{[3]}$&#x4E2D;&#x6240;&#x6709;&#x7B49;&#x4E8E;0&#x7684;&#x5143;&#x7D20;&#xFF08;&#x8F93;&#x51FA;&#xFF09;&#xFF0C;&#x800C;&#x5404;&#x4E2A;&#x5143;&#x7D20;&#x7B49;&#x4E8E;0&#x7684;&#x6982;&#x7387;&#x53EA;&#x6709;20%&#xFF0C;&#x4E58;&#x6CD5;&#x8FD0;&#x7B97;&#x6700;&#x7EC8;&#x628A;$d^{\left\lbrack3 \right]}$&#x4E2D;&#x76F8;&#x5E94;&#x5143;&#x7D20;&#x8F93;&#x51FA;&#xFF0C;&#x5373;&#x8BA9;$d^{[3]}$&#x4E2D;0&#x5143;&#x7D20;&#x4E0E;$a^{[3]}$&#x4E2D;&#x76F8;&#x5BF9;&#x5143;&#x7D20;&#x5F52;&#x96F6;&#x3002;</p>
<p><img src="../images/c75fe55c6bc17b60b00f5360aab180f4.png" alt=""></p>
<p>&#x5982;&#x679C;&#x7528;<strong>python</strong>&#x5B9E;&#x73B0;&#x8BE5;&#x7B97;&#x6CD5;&#x7684;&#x8BDD;&#xFF0C;$d^{[3]}$&#x5219;&#x662F;&#x4E00;&#x4E2A;&#x5E03;&#x5C14;&#x578B;&#x6570;&#x7EC4;&#xFF0C;&#x503C;&#x4E3A;<strong>true</strong>&#x548C;<strong>false</strong>&#xFF0C;&#x800C;&#x4E0D;&#x662F;1&#x548C;0&#xFF0C;&#x4E58;&#x6CD5;&#x8FD0;&#x7B97;&#x4F9D;&#x7136;&#x6709;&#x6548;&#xFF0C;<strong>python</strong>&#x4F1A;&#x628A;<strong>true</strong>&#x548C;<strong>false</strong>&#x7FFB;&#x8BD1;&#x4E3A;1&#x548C;0&#xFF0C;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x7528;<strong>python</strong>&#x5C1D;&#x8BD5;&#x4E00;&#x4E0B;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5411;&#x5916;&#x6269;&#x5C55;$a^{[3]}$&#xFF0C;&#x7528;&#x5B83;&#x9664;&#x4EE5;0.8&#xFF0C;&#x6216;&#x8005;&#x9664;&#x4EE5;<strong>keep-prob</strong>&#x53C2;&#x6570;&#x3002;</p>
<p><img src="../images/6ba17ffcb3ff22a4a0ec857e66946086.png" alt=""></p>
<p>&#x4E0B;&#x9762;&#x6211;&#x89E3;&#x91CA;&#x4E00;&#x4E0B;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x8FD9;&#x4E48;&#x505A;&#xFF0C;&#x4E3A;&#x65B9;&#x4FBF;&#x8D77;&#x89C1;&#xFF0C;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x7B2C;&#x4E09;&#x9690;&#x85CF;&#x5C42;&#x4E0A;&#x6709;50&#x4E2A;&#x5355;&#x5143;&#x6216;50&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#xFF0C;&#x5728;&#x4E00;&#x7EF4;&#x4E0A;$a^{[3]}$&#x662F;50&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x56E0;&#x5B50;&#x5206;&#x89E3;&#x5C06;&#x5B83;&#x62C6;&#x5206;&#x6210;$50&#xD7;m$&#x7EF4;&#x7684;&#xFF0C;&#x4FDD;&#x7559;&#x548C;&#x5220;&#x9664;&#x5B83;&#x4EEC;&#x7684;&#x6982;&#x7387;&#x5206;&#x522B;&#x4E3A;80%&#x548C;20%&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6700;&#x540E;&#x88AB;&#x5220;&#x9664;&#x6216;&#x5F52;&#x96F6;&#x7684;&#x5355;&#x5143;&#x5E73;&#x5747;&#x6709;10&#xFF08;50&#xD7;20%=10&#xFF09;&#x4E2A;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x770B;&#x4E0B;$z^{\lbrack4]}$&#xFF0C;$z^{[4]} = w^{[4]} a^{[3]} + b^{[4]}$&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x9884;&#x671F;&#x662F;&#xFF0C;$a^{[3]}$&#x51CF;&#x5C11;20%&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;$a^{[3]}$&#x4E2D;&#x6709;20%&#x7684;&#x5143;&#x7D20;&#x88AB;&#x5F52;&#x96F6;&#xFF0C;&#x4E3A;&#x4E86;&#x4E0D;&#x5F71;&#x54CD;$z^{\lbrack4]}$&#x7684;&#x671F;&#x671B;&#x503C;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7528;$w^{[4]} a^{[3]}/0.8$&#xFF0C;&#x5B83;&#x5C06;&#x4F1A;&#x4FEE;&#x6B63;&#x6216;&#x5F25;&#x8865;&#x6211;&#x4EEC;&#x6240;&#x9700;&#x7684;&#x90A3;20%&#xFF0C;$a^{[3]}$&#x7684;&#x671F;&#x671B;&#x503C;&#x4E0D;&#x4F1A;&#x53D8;&#xFF0C;&#x5212;&#x7EBF;&#x90E8;&#x5206;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684;<strong>dropout</strong>&#x65B9;&#x6CD5;&#x3002;</p>
<p><img src="../images/272d902720be9993454c6d9a5f0bec49.png" alt=""></p>
<p>&#x5B83;&#x7684;&#x529F;&#x80FD;&#x662F;&#xFF0C;&#x4E0D;&#x8BBA;<strong>keep-prop</strong>&#x7684;&#x503C;&#x662F;&#x591A;&#x5C11;0.8&#xFF0C;0.9&#x751A;&#x81F3;&#x662F;1&#xFF0C;&#x5982;&#x679C;<strong>keep-prop</strong>&#x8BBE;&#x7F6E;&#x4E3A;1&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x4E0D;&#x5B58;&#x5728;<strong>dropout</strong>&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4F1A;&#x4FDD;&#x7559;&#x6240;&#x6709;&#x8282;&#x70B9;&#x3002;&#x53CD;&#x5411;&#x968F;&#x673A;&#x5931;&#x6D3B;&#xFF08;<strong>inverted dropout</strong>&#xFF09;&#x65B9;&#x6CD5;&#x901A;&#x8FC7;&#x9664;&#x4EE5;<strong>keep-prob</strong>&#xFF0C;&#x786E;&#x4FDD;$a^{[3]}$&#x7684;&#x671F;&#x671B;&#x503C;&#x4E0D;&#x53D8;&#x3002;</p>
<p>&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#xFF0C;&#x5728;&#x6D4B;&#x8BD5;&#x9636;&#x6BB5;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x8BC4;&#x4F30;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x65F6;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x7528;&#x7EFF;&#x7EBF;&#x6846;&#x6807;&#x6CE8;&#x7684;&#x53CD;&#x5411;&#x968F;&#x673A;&#x5931;&#x6D3B;&#x65B9;&#x6CD5;&#xFF0C;&#x4F7F;&#x6D4B;&#x8BD5;&#x9636;&#x6BB5;&#x53D8;&#x5F97;&#x66F4;&#x5BB9;&#x6613;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x7684;&#x6570;&#x636E;&#x6269;&#x5C55;&#x95EE;&#x9898;&#x53D8;&#x5C11;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x4E0B;&#x8282;&#x8BFE;&#x8BA8;&#x8BBA;&#x3002;</p>
<p>&#x636E;&#x6211;&#x4E86;&#x89E3;&#xFF0C;&#x76EE;&#x524D;&#x5B9E;&#x65BD;<strong>dropout</strong>&#x6700;&#x5E38;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x662F;<strong>Inverted dropout</strong>&#xFF0C;&#x5EFA;&#x8BAE;&#x5927;&#x5BB6;&#x52A8;&#x624B;&#x5B9E;&#x8DF5;&#x4E00;&#x4E0B;&#x3002;<strong>Dropout</strong>&#x65E9;&#x671F;&#x7684;&#x8FED;&#x4EE3;&#x7248;&#x672C;&#x90FD;&#x6CA1;&#x6709;&#x9664;&#x4EE5;<strong>keep-prob</strong>&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x6D4B;&#x8BD5;&#x9636;&#x6BB5;&#xFF0C;&#x5E73;&#x5747;&#x503C;&#x4F1A;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x590D;&#x6742;&#xFF0C;&#x4E0D;&#x8FC7;&#x90A3;&#x4E9B;&#x7248;&#x672C;&#x5DF2;&#x7ECF;&#x4E0D;&#x518D;&#x4F7F;&#x7528;&#x4E86;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x4F60;&#x4F7F;&#x7528;&#x7684;&#x662F;$d$&#x5411;&#x91CF;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#xFF0C;&#x6E05;&#x9664;&#x4E0D;&#x540C;&#x7684;&#x9690;&#x85CF;&#x5355;&#x5143;&#x4E5F;&#x4E0D;&#x540C;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x901A;&#x8FC7;&#x76F8;&#x540C;&#x8BAD;&#x7EC3;&#x96C6;&#x591A;&#x6B21;&#x4F20;&#x9012;&#x6570;&#x636E;&#xFF0C;&#x6BCF;&#x6B21;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x7684;&#x68AF;&#x5EA6;&#x4E0D;&#x540C;&#xFF0C;&#x5219;&#x968F;&#x673A;&#x5BF9;&#x4E0D;&#x540C;&#x9690;&#x85CF;&#x5355;&#x5143;&#x5F52;&#x96F6;&#xFF0C;&#x6709;&#x65F6;&#x5374;&#x5E76;&#x975E;&#x5982;&#x6B64;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x9700;&#x8981;&#x5C06;&#x76F8;&#x540C;&#x9690;&#x85CF;&#x5355;&#x5143;&#x5F52;&#x96F6;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x8FED;&#x4EE3;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x65F6;&#xFF0C;&#x628A;&#x4E00;&#x4E9B;&#x9690;&#x85CF;&#x5355;&#x5143;&#x5F52;&#x96F6;&#xFF0C;&#x7B2C;&#x4E8C;&#x6B21;&#x8FED;&#x4EE3;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x65F6;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x7B2C;&#x4E8C;&#x6B21;&#x904D;&#x5386;&#x8BAD;&#x7EC3;&#x96C6;&#x65F6;&#xFF0C;&#x5BF9;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x9690;&#x85CF;&#x5C42;&#x5355;&#x5143;&#x5F52;&#x96F6;&#x3002;&#x5411;&#x91CF;$d$&#x6216;$d^{[3]}$&#x7528;&#x6765;&#x51B3;&#x5B9A;&#x7B2C;&#x4E09;&#x5C42;&#x4E2D;&#x54EA;&#x4E9B;&#x5355;&#x5143;&#x5F52;&#x96F6;&#xFF0C;&#x65E0;&#x8BBA;&#x7528;<strong>foreprop</strong>&#x8FD8;&#x662F;<strong>backprop</strong>&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x53EA;&#x4ECB;&#x7ECD;&#x4E86;<strong>foreprob</strong>&#x3002;</p>
<p>&#x5982;&#x4F55;&#x5728;&#x6D4B;&#x8BD5;&#x9636;&#x6BB5;&#x8BAD;&#x7EC3;&#x7B97;&#x6CD5;&#xFF0C;&#x5728;&#x6D4B;&#x8BD5;&#x9636;&#x6BB5;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x7ED9;&#x51FA;&#x4E86;$x$&#xFF0C;&#x6216;&#x662F;&#x60F3;&#x9884;&#x6D4B;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x7528;&#x7684;&#x662F;&#x6807;&#x51C6;&#x8BA1;&#x6570;&#x6CD5;&#x3002;&#x6211;&#x7528;$a^{\lbrack0]}$&#xFF0C;&#x7B2C;0&#x5C42;&#x7684;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x6807;&#x6CE8;&#x4E3A;&#x6D4B;&#x8BD5;&#x6837;&#x672C;$x$&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x6D4B;&#x8BD5;&#x9636;&#x6BB5;&#x4E0D;&#x4F7F;&#x7528;<strong>dropout</strong>&#x51FD;&#x6570;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x50CF;&#x4E0B;&#x5217;&#x60C5;&#x51B5;&#xFF1A;</p>
<p>$z^{[1]} = w^{[1]} a^{[0]} + b^{[1]}$</p>
<p>$a^{[1]} = g^{[1]}(z^{[1]})$</p>
<p>$z^{[2]} = \ w^{[2]} a^{[1]} + b^{[2]}$</p>
<p>$a^{[2]} = \ldots$</p>
<p>&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#x76F4;&#x5230;&#x6700;&#x540E;&#x4E00;&#x5C42;&#xFF0C;&#x9884;&#x6D4B;&#x503C;&#x4E3A;$\hat{y}$&#x3002;</p>
<p><img src="../images/de49d4e160f29544055819c5ab1dd9c0.png" alt=""></p>
<p>&#x663E;&#x7136;&#x5728;&#x6D4B;&#x8BD5;&#x9636;&#x6BB5;&#xFF0C;&#x6211;&#x4EEC;&#x5E76;&#x672A;&#x4F7F;&#x7528;<strong>dropout</strong>&#xFF0C;&#x81EA;&#x7136;&#x4E5F;&#x5C31;&#x4E0D;&#x7528;&#x629B;&#x786C;&#x5E01;&#x6765;&#x51B3;&#x5B9A;&#x5931;&#x6D3B;&#x6982;&#x7387;&#xFF0C;&#x4EE5;&#x53CA;&#x8981;&#x6D88;&#x9664;&#x54EA;&#x4E9B;&#x9690;&#x85CF;&#x5355;&#x5143;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x6D4B;&#x8BD5;&#x9636;&#x6BB5;&#x8FDB;&#x884C;&#x9884;&#x6D4B;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x671F;&#x671B;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x662F;&#x968F;&#x673A;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x6D4B;&#x8BD5;&#x9636;&#x6BB5;&#x5E94;&#x7528;<strong>dropout</strong>&#x51FD;&#x6570;&#xFF0C;&#x9884;&#x6D4B;&#x4F1A;&#x53D7;&#x5230;&#x5E72;&#x6270;&#x3002;&#x7406;&#x8BBA;&#x4E0A;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x591A;&#x6B21;&#x8FD0;&#x884C;&#x9884;&#x6D4B;&#x5904;&#x7406;&#x8FC7;&#x7A0B;&#xFF0C;&#x6BCF;&#x4E00;&#x6B21;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x9690;&#x85CF;&#x5355;&#x5143;&#x4F1A;&#x88AB;&#x968F;&#x673A;&#x5F52;&#x96F6;&#xFF0C;&#x9884;&#x6D4B;&#x5904;&#x7406;&#x904D;&#x5386;&#x5B83;&#x4EEC;&#xFF0C;&#x4F46;&#x8BA1;&#x7B97;&#x6548;&#x7387;&#x4F4E;&#xFF0C;&#x5F97;&#x51FA;&#x7684;&#x7ED3;&#x679C;&#x4E5F;&#x51E0;&#x4E4E;&#x76F8;&#x540C;&#xFF0C;&#x4E0E;&#x8FD9;&#x4E2A;&#x4E0D;&#x540C;&#x7A0B;&#x5E8F;&#x4EA7;&#x751F;&#x7684;&#x7ED3;&#x679C;&#x6781;&#x4E3A;&#x76F8;&#x4F3C;&#x3002;</p>
<p><strong>Inverted dropout</strong>&#x51FD;&#x6570;&#x5728;&#x9664;&#x4EE5;<strong>keep-prob</strong>&#x65F6;&#x53EF;&#x4EE5;&#x8BB0;&#x4F4F;&#x4E0A;&#x4E00;&#x6B65;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x76EE;&#x7684;&#x662F;&#x786E;&#x4FDD;&#x5373;&#x4F7F;&#x5728;&#x6D4B;&#x8BD5;&#x9636;&#x6BB5;&#x4E0D;&#x6267;&#x884C;<strong>dropout</strong>&#x6765;&#x8C03;&#x6574;&#x6570;&#x503C;&#x8303;&#x56F4;&#xFF0C;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x7684;&#x9884;&#x671F;&#x7ED3;&#x679C;&#x4E5F;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF0C;&#x6240;&#x4EE5;&#x6CA1;&#x5FC5;&#x8981;&#x5728;&#x6D4B;&#x8BD5;&#x9636;&#x6BB5;&#x989D;&#x5916;&#x6DFB;&#x52A0;&#x5C3A;&#x5EA6;&#x53C2;&#x6570;&#xFF0C;&#x8FD9;&#x4E0E;&#x8BAD;&#x7EC3;&#x9636;&#x6BB5;&#x4E0D;&#x540C;&#x3002;</p>
<p>$l=keep-prob$</p>
<p>&#x8FD9;&#x5C31;&#x662F;<strong>dropout</strong>&#xFF0C;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x672C;&#x5468;&#x7684;&#x7F16;&#x7A0B;&#x7EC3;&#x4E60;&#x6765;&#x6267;&#x884C;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x4EB2;&#x8EAB;&#x5B9E;&#x8DF5;&#x4E00;&#x4E0B;&#x3002;</p>
<p>&#x4E3A;&#x4EC0;&#x4E48;<strong>dropout</strong>&#x4F1A;&#x8D77;&#x4F5C;&#x7528;&#x5462;&#xFF1F;&#x4E0B;&#x8282;&#x8BFE;&#x6211;&#x4EEC;&#x5C06;&#x66F4;&#x52A0;&#x76F4;&#x89C2;&#x5730;&#x4E86;&#x89E3;<strong>dropout</strong>&#x7684;&#x5177;&#x4F53;&#x529F;&#x80FD;&#x3002;</p>
<h3 id="17-&#x7406;&#x89E3;-dropout&#xFF08;understanding-dropout&#xFF09;">1.7 &#x7406;&#x89E3; dropout&#xFF08;Understanding Dropout&#xFF09;</h3>
<p><strong>Dropout</strong>&#x53EF;&#x4EE5;&#x968F;&#x673A;&#x5220;&#x9664;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x795E;&#x7ECF;&#x5355;&#x5143;&#xFF0C;&#x4ED6;&#x4E3A;&#x4EC0;&#x4E48;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6B63;&#x5219;&#x5316;&#x53D1;&#x6325;&#x5982;&#x6B64;&#x5927;&#x7684;&#x4F5C;&#x7528;&#x5462;&#xFF1F;</p>
<p>&#x76F4;&#x89C2;&#x4E0A;&#x7406;&#x89E3;&#xFF1A;&#x4E0D;&#x8981;&#x4F9D;&#x8D56;&#x4E8E;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x7279;&#x5F81;&#xFF0C;&#x56E0;&#x4E3A;&#x8BE5;&#x5355;&#x5143;&#x7684;&#x8F93;&#x5165;&#x53EF;&#x80FD;&#x968F;&#x65F6;&#x88AB;&#x6E05;&#x9664;&#xFF0C;&#x56E0;&#x6B64;&#x8BE5;&#x5355;&#x5143;&#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x4F20;&#x64AD;&#x4E0B;&#x53BB;&#xFF0C;&#x5E76;&#x4E3A;&#x5355;&#x5143;&#x7684;&#x56DB;&#x4E2A;&#x8F93;&#x5165;&#x589E;&#x52A0;&#x4E00;&#x70B9;&#x6743;&#x91CD;&#xFF0C;&#x901A;&#x8FC7;&#x4F20;&#x64AD;&#x6240;&#x6709;&#x6743;&#x91CD;&#xFF0C;<strong>dropout</strong>&#x5C06;&#x4EA7;&#x751F;&#x6536;&#x7F29;&#x6743;&#x91CD;&#x7684;&#x5E73;&#x65B9;&#x8303;&#x6570;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x548C;&#x4E4B;&#x524D;&#x8BB2;&#x7684;$L2$&#x6B63;&#x5219;&#x5316;&#x7C7B;&#x4F3C;&#xFF1B;&#x5B9E;&#x65BD;<strong>dropout</strong>&#x7684;&#x7ED3;&#x679C;&#x5B9E;&#x5B83;&#x4F1A;&#x538B;&#x7F29;&#x6743;&#x91CD;&#xFF0C;&#x5E76;&#x5B8C;&#x6210;&#x4E00;&#x4E9B;&#x9884;&#x9632;&#x8FC7;&#x62DF;&#x5408;&#x7684;&#x5916;&#x5C42;&#x6B63;&#x5219;&#x5316;&#xFF1B;$L2$&#x5BF9;&#x4E0D;&#x540C;&#x6743;&#x91CD;&#x7684;&#x8870;&#x51CF;&#x662F;&#x4E0D;&#x540C;&#x7684;&#xFF0C;&#x5B83;&#x53D6;&#x51B3;&#x4E8E;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x500D;&#x589E;&#x7684;&#x5927;&#x5C0F;&#x3002;</p>
<p>&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#xFF0C;<strong>dropout</strong>&#x7684;&#x529F;&#x80FD;&#x7C7B;&#x4F3C;&#x4E8E;$L2$&#x6B63;&#x5219;&#x5316;&#xFF0C;&#x4E0E;$L2$&#x6B63;&#x5219;&#x5316;&#x4E0D;&#x540C;&#x7684;&#x662F;&#x5E94;&#x7528;&#x65B9;&#x5F0F;&#x4E0D;&#x540C;&#x4F1A;&#x5E26;&#x6765;&#x4E00;&#x70B9;&#x70B9;&#x5C0F;&#x53D8;&#x5316;&#xFF0C;&#x751A;&#x81F3;&#x66F4;&#x9002;&#x7528;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x8F93;&#x5165;&#x8303;&#x56F4;&#x3002;</p>
<p><img src="../images/L2_week1_16.png" alt=""></p>
<p>&#x7B2C;&#x4E8C;&#x4E2A;&#x76F4;&#x89C2;&#x8BA4;&#x8BC6;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x4ECE;&#x5355;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x5165;&#x624B;&#xFF0C;&#x5982;&#x56FE;&#xFF0C;&#x8FD9;&#x4E2A;&#x5355;&#x5143;&#x7684;&#x5DE5;&#x4F5C;&#x5C31;&#x662F;&#x8F93;&#x5165;&#x5E76;&#x751F;&#x6210;&#x4E00;&#x4E9B;&#x6709;&#x610F;&#x4E49;&#x7684;&#x8F93;&#x51FA;&#x3002;&#x901A;&#x8FC7;<strong>dropout</strong>&#xFF0C;&#x8BE5;&#x5355;&#x5143;&#x7684;&#x8F93;&#x5165;&#x51E0;&#x4E4E;&#x88AB;&#x6D88;&#x9664;&#xFF0C;&#x6709;&#x65F6;&#x8FD9;&#x4E24;&#x4E2A;&#x5355;&#x5143;&#x4F1A;&#x88AB;&#x5220;&#x9664;&#xFF0C;&#x6709;&#x65F6;&#x4F1A;&#x5220;&#x9664;&#x5176;&#x5B83;&#x5355;&#x5143;&#xFF0C;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x6211;&#x7528;&#x7D2B;&#x8272;&#x5708;&#x8D77;&#x6765;&#x7684;&#x8FD9;&#x4E2A;&#x5355;&#x5143;&#xFF0C;&#x5B83;&#x4E0D;&#x80FD;&#x4F9D;&#x9760;&#x4EFB;&#x4F55;&#x7279;&#x5F81;&#xFF0C;&#x56E0;&#x4E3A;&#x7279;&#x5F81;&#x90FD;&#x6709;&#x53EF;&#x80FD;&#x88AB;&#x968F;&#x673A;&#x6E05;&#x9664;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x8BE5;&#x5355;&#x5143;&#x7684;&#x8F93;&#x5165;&#x4E5F;&#x90FD;&#x53EF;&#x80FD;&#x88AB;&#x968F;&#x673A;&#x6E05;&#x9664;&#x3002;&#x6211;&#x4E0D;&#x613F;&#x610F;&#x628A;&#x6240;&#x6709;&#x8D4C;&#x6CE8;&#x90FD;&#x653E;&#x5728;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#xFF0C;&#x4E0D;&#x613F;&#x610F;&#x7ED9;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#x52A0;&#x4E0A;&#x592A;&#x591A;&#x6743;&#x91CD;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x5220;&#x9664;&#xFF0C;&#x56E0;&#x6B64;&#x8BE5;&#x5355;&#x5143;&#x5C06;&#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x79EF;&#x6781;&#x5730;&#x4F20;&#x64AD;&#x5F00;&#xFF0C;&#x5E76;&#x4E3A;&#x5355;&#x5143;&#x7684;&#x56DB;&#x4E2A;&#x8F93;&#x5165;&#x589E;&#x52A0;&#x4E00;&#x70B9;&#x6743;&#x91CD;&#xFF0C;&#x901A;&#x8FC7;&#x4F20;&#x64AD;&#x6240;&#x6709;&#x6743;&#x91CD;&#xFF0C;<strong>dropout</strong>&#x5C06;&#x4EA7;&#x751F;&#x6536;&#x7F29;&#x6743;&#x91CD;&#x7684;&#x5E73;&#x65B9;&#x8303;&#x6570;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x548C;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x8BB2;&#x8FC7;&#x7684;$L2$&#x6B63;&#x5219;&#x5316;&#x7C7B;&#x4F3C;&#xFF0C;&#x5B9E;&#x65BD;<strong>dropout</strong>&#x7684;&#x7ED3;&#x679C;&#x662F;&#x5B83;&#x4F1A;&#x538B;&#x7F29;&#x6743;&#x91CD;&#xFF0C;&#x5E76;&#x5B8C;&#x6210;&#x4E00;&#x4E9B;&#x9884;&#x9632;&#x8FC7;&#x62DF;&#x5408;&#x7684;&#x5916;&#x5C42;&#x6B63;&#x5219;&#x5316;&#x3002;</p>
<p>&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#xFF0C;<strong>dropout</strong>&#x88AB;&#x6B63;&#x5F0F;&#x5730;&#x4F5C;&#x4E3A;&#x4E00;&#x79CD;&#x6B63;&#x5219;&#x5316;&#x7684;&#x66FF;&#x4EE3;&#x5F62;&#x5F0F;&#xFF0C;$L2$&#x5BF9;&#x4E0D;&#x540C;&#x6743;&#x91CD;&#x7684;&#x8870;&#x51CF;&#x662F;&#x4E0D;&#x540C;&#x7684;&#xFF0C;&#x5B83;&#x53D6;&#x51B3;&#x4E8E;&#x500D;&#x589E;&#x7684;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x7684;&#x5927;&#x5C0F;&#x3002;</p>
<p>&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#xFF0C;<strong>dropout</strong>&#x7684;&#x529F;&#x80FD;&#x7C7B;&#x4F3C;&#x4E8E;$L2$&#x6B63;&#x5219;&#x5316;&#xFF0C;&#x4E0E;$L2$&#x6B63;&#x5219;&#x5316;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF0C;&#x88AB;&#x5E94;&#x7528;&#x7684;&#x65B9;&#x5F0F;&#x4E0D;&#x540C;&#xFF0C;<strong>dropout</strong>&#x4E5F;&#x4F1A;&#x6709;&#x6240;&#x4E0D;&#x540C;&#xFF0C;&#x751A;&#x81F3;&#x66F4;&#x9002;&#x7528;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x8F93;&#x5165;&#x8303;&#x56F4;&#x3002;</p>
<p><img src="../images/9b9f963a73e3ef9fcac008b179b6cf74.png" alt=""></p>
<p>&#x5B9E;&#x65BD;<strong>dropout</strong>&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x7EC6;&#x8282;&#x662F;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x62E5;&#x6709;&#x4E09;&#x4E2A;&#x8F93;&#x5165;&#x7279;&#x5F81;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x8981;&#x9009;&#x62E9;&#x7684;&#x53C2;&#x6570;&#x662F;<strong>keep-prob</strong>&#xFF0C;&#x5B83;&#x4EE3;&#x8868;&#x6BCF;&#x4E00;&#x5C42;&#x4E0A;&#x4FDD;&#x7559;&#x5355;&#x5143;&#x7684;&#x6982;&#x7387;&#x3002;&#x6240;&#x4EE5;&#x4E0D;&#x540C;&#x5C42;&#x7684;<strong>keep-prob</strong>&#x4E5F;&#x53EF;&#x4EE5;&#x53D8;&#x5316;&#x3002;&#x7B2C;&#x4E00;&#x5C42;&#xFF0C;&#x77E9;&#x9635;$W^{[1]}$&#x662F;7&#xD7;3&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x6743;&#x91CD;&#x77E9;&#x9635;$W^{[2]}$&#x662F;7&#xD7;7&#xFF0C;&#x7B2C;&#x4E09;&#x4E2A;&#x6743;&#x91CD;&#x77E9;&#x9635;$W^{[3]}$&#x662F;3&#xD7;7&#xFF0C;&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#xFF0C;$W^{[2]}$&#x662F;&#x6700;&#x5927;&#x7684;&#x6743;&#x91CD;&#x77E9;&#x9635;&#xFF0C;&#x56E0;&#x4E3A;$W^{[2]}$&#x62E5;&#x6709;&#x6700;&#x5927;&#x53C2;&#x6570;&#x96C6;&#xFF0C;&#x5373;7&#xD7;7&#xFF0C;&#x4E3A;&#x4E86;&#x9884;&#x9632;&#x77E9;&#x9635;&#x7684;&#x8FC7;&#x62DF;&#x5408;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E00;&#x5C42;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x8FD9;&#x662F;&#x7B2C;&#x4E8C;&#x5C42;&#xFF0C;&#x5B83;&#x7684;<strong>keep-prob</strong>&#x503C;&#x5E94;&#x8BE5;&#x76F8;&#x5BF9;&#x8F83;&#x4F4E;&#xFF0C;&#x5047;&#x8BBE;&#x662F;0.5&#x3002;&#x5BF9;&#x4E8E;&#x5176;&#x5B83;&#x5C42;&#xFF0C;&#x8FC7;&#x62DF;&#x5408;&#x7684;&#x7A0B;&#x5EA6;&#x53EF;&#x80FD;&#x6CA1;&#x90A3;&#x4E48;&#x4E25;&#x91CD;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;<strong>keep-prob</strong>&#x503C;&#x53EF;&#x80FD;&#x9AD8;&#x4E00;&#x4E9B;&#xFF0C;&#x53EF;&#x80FD;&#x662F;0.7&#xFF0C;&#x8FD9;&#x91CC;&#x662F;0.7&#x3002;&#x5982;&#x679C;&#x5728;&#x67D0;&#x4E00;&#x5C42;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x5FC5;&#x62C5;&#x5FC3;&#x5176;&#x8FC7;&#x62DF;&#x5408;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x90A3;&#x4E48;<strong>keep-prob</strong>&#x53EF;&#x4EE5;&#x4E3A;1&#xFF0C;&#x4E3A;&#x4E86;&#x8868;&#x8FBE;&#x6E05;&#x9664;&#xFF0C;&#x6211;&#x7528;&#x7D2B;&#x8272;&#x7EBF;&#x7B14;&#x628A;&#x5B83;&#x4EEC;&#x5708;&#x51FA;&#x6765;&#xFF0C;&#x6BCF;&#x5C42;<strong>keep-prob</strong>&#x7684;&#x503C;&#x53EF;&#x80FD;&#x4E0D;&#x540C;&#x3002;</p>
<p><img src="../images/5fcb1441866d6d3eff1164ed4ea38cfe.png" alt=""></p>
<p>&#x6CE8;&#x610F;<strong>keep-prob</strong>&#x7684;&#x503C;&#x662F;1&#xFF0C;&#x610F;&#x5473;&#x7740;&#x4FDD;&#x7559;&#x6240;&#x6709;&#x5355;&#x5143;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x5728;&#x8FD9;&#x4E00;&#x5C42;&#x4F7F;&#x7528;<strong>dropout</strong>&#xFF0C;&#x5BF9;&#x4E8E;&#x6709;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x8FC7;&#x62DF;&#x5408;&#xFF0C;&#x4E14;&#x542B;&#x6709;&#x8BF8;&#x591A;&#x53C2;&#x6570;&#x7684;&#x5C42;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x628A;<strong>keep-prob</strong>&#x8BBE;&#x7F6E;&#x6210;&#x6BD4;&#x8F83;&#x5C0F;&#x7684;&#x503C;&#xFF0C;&#x4EE5;&#x4FBF;&#x5E94;&#x7528;&#x66F4;&#x5F3A;&#x5927;&#x7684;<strong>dropout</strong>&#xFF0C;&#x6709;&#x70B9;&#x50CF;&#x5728;&#x5904;&#x7406;$L2$&#x6B63;&#x5219;&#x5316;&#x7684;&#x6B63;&#x5219;&#x5316;&#x53C2;&#x6570;$\lambda$&#xFF0C;&#x6211;&#x4EEC;&#x5C1D;&#x8BD5;&#x5BF9;&#x67D0;&#x4E9B;&#x5C42;&#x65BD;&#x884C;&#x66F4;&#x591A;&#x6B63;&#x5219;&#x5316;&#xFF0C;&#x4ECE;&#x6280;&#x672F;&#x4E0A;&#x8BB2;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x5BF9;&#x8F93;&#x5165;&#x5C42;&#x5E94;&#x7528;<strong>dropout</strong>&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x673A;&#x4F1A;&#x5220;&#x9664;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x8F93;&#x5165;&#x7279;&#x5F81;&#xFF0C;&#x867D;&#x7136;&#x73B0;&#x5B9E;&#x4E2D;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x4E0D;&#x8FD9;&#x4E48;&#x505A;&#xFF0C;<strong>keep-prob</strong>&#x7684;&#x503C;&#x4E3A;1&#xFF0C;&#x662F;&#x975E;&#x5E38;&#x5E38;&#x7528;&#x7684;&#x8F93;&#x5165;&#x503C;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x66F4;&#x5927;&#x7684;&#x503C;&#xFF0C;&#x6216;&#x8BB8;&#x662F;0.9&#x3002;&#x4F46;&#x662F;&#x6D88;&#x9664;&#x4E00;&#x534A;&#x7684;&#x8F93;&#x5165;&#x7279;&#x5F81;&#x662F;&#x4E0D;&#x592A;&#x53EF;&#x80FD;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x9075;&#x5B88;&#x8FD9;&#x4E2A;&#x51C6;&#x5219;&#xFF0C;<strong>keep-prob</strong>&#x4F1A;&#x63A5;&#x8FD1;&#x4E8E;1&#xFF0C;&#x5373;&#x4F7F;&#x4F60;&#x5BF9;&#x8F93;&#x5165;&#x5C42;&#x5E94;&#x7528;<strong>dropout</strong>&#x3002;</p>
<p>&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x62C5;&#x5FC3;&#x67D0;&#x4E9B;&#x5C42;&#x6BD4;&#x5176;&#x5B83;&#x5C42;&#x66F4;&#x5BB9;&#x6613;&#x53D1;&#x751F;&#x8FC7;&#x62DF;&#x5408;&#xFF0C;&#x53EF;&#x4EE5;&#x628A;&#x67D0;&#x4E9B;&#x5C42;&#x7684;<strong>keep-prob</strong>&#x503C;&#x8BBE;&#x7F6E;&#x5F97;&#x6BD4;&#x5176;&#x5B83;&#x5C42;&#x66F4;&#x4F4E;&#xFF0C;&#x7F3A;&#x70B9;&#x662F;&#x4E3A;&#x4E86;&#x4F7F;&#x7528;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#xFF0C;&#x4F60;&#x8981;&#x641C;&#x7D22;&#x66F4;&#x591A;&#x7684;&#x8D85;&#x7EA7;&#x53C2;&#x6570;&#xFF0C;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6848;&#x662F;&#x5728;&#x4E00;&#x4E9B;&#x5C42;&#x4E0A;&#x5E94;&#x7528;<strong>dropout</strong>&#xFF0C;&#x800C;&#x6709;&#x4E9B;&#x5C42;&#x4E0D;&#x7528;<strong>dropout</strong>&#xFF0C;&#x5E94;&#x7528;<strong>dropout</strong>&#x7684;&#x5C42;&#x53EA;&#x542B;&#x6709;&#x4E00;&#x4E2A;&#x8D85;&#x7EA7;&#x53C2;&#x6570;&#xFF0C;&#x5C31;&#x662F;<strong>keep-prob</strong>&#x3002;</p>
<p>&#x7ED3;&#x675F;&#x524D;&#x5206;&#x4EAB;&#x4E24;&#x4E2A;&#x5B9E;&#x65BD;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x6280;&#x5DE7;&#xFF0C;&#x5B9E;&#x65BD;<strong>dropout</strong>&#xFF0C;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x9886;&#x57DF;&#x6709;&#x5F88;&#x591A;&#x6210;&#x529F;&#x7684;&#x7B2C;&#x4E00;&#x6B21;&#x3002;&#x8BA1;&#x7B97;&#x89C6;&#x89C9;&#x4E2D;&#x7684;&#x8F93;&#x5165;&#x91CF;&#x975E;&#x5E38;&#x5927;&#xFF0C;&#x8F93;&#x5165;&#x592A;&#x591A;&#x50CF;&#x7D20;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6240;&#x4EE5;<strong>dropout</strong>&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x4E2D;&#x5E94;&#x7528;&#x5F97;&#x6BD4;&#x8F83;&#x9891;&#x7E41;&#xFF0C;&#x6709;&#x4E9B;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x975E;&#x5E38;&#x559C;&#x6B22;&#x7528;&#x5B83;&#xFF0C;&#x51E0;&#x4E4E;&#x6210;&#x4E86;&#x9ED8;&#x8BA4;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x4F46;&#x8981;&#x7262;&#x8BB0;&#x4E00;&#x70B9;&#xFF0C;<strong>dropout</strong>&#x662F;&#x4E00;&#x79CD;&#x6B63;&#x5219;&#x5316;&#x65B9;&#x6CD5;&#xFF0C;&#x5B83;&#x6709;&#x52A9;&#x4E8E;&#x9884;&#x9632;&#x8FC7;&#x62DF;&#x5408;&#xFF0C;&#x56E0;&#x6B64;&#x9664;&#x975E;&#x7B97;&#x6CD5;&#x8FC7;&#x62DF;&#x5408;&#xFF0C;&#x4E0D;&#x7136;&#x6211;&#x662F;&#x4E0D;&#x4F1A;&#x4F7F;&#x7528;<strong>dropout</strong>&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x5728;&#x5176;&#x5B83;&#x9886;&#x57DF;&#x5E94;&#x7528;&#x5F97;&#x6BD4;&#x8F83;&#x5C11;&#xFF0C;&#x4E3B;&#x8981;&#x5B58;&#x5728;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x9886;&#x57DF;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6240;&#x4EE5;&#x4E00;&#x76F4;&#x5B58;&#x5728;&#x8FC7;&#x62DF;&#x5408;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6709;&#x4E9B;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x5982;&#x6B64;&#x949F;&#x60C5;&#x4E8E;<strong>dropout</strong>&#x51FD;&#x6570;&#x7684;&#x539F;&#x56E0;&#x3002;&#x76F4;&#x89C2;&#x4E0A;&#x6211;&#x8BA4;&#x4E3A;&#x4E0D;&#x80FD;&#x6982;&#x62EC;&#x5176;&#x5B83;&#x5B66;&#x79D1;&#x3002;</p>
<p><img src="../images/13987e28fa537a110c6b123fc4455f7c.png" alt=""></p>
<p><strong>dropout</strong>&#x4E00;&#x5927;&#x7F3A;&#x70B9;&#x5C31;&#x662F;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;$J$&#x4E0D;&#x518D;&#x88AB;&#x660E;&#x786E;&#x5B9A;&#x4E49;&#xFF0C;&#x6BCF;&#x6B21;&#x8FED;&#x4EE3;&#xFF0C;&#x90FD;&#x4F1A;&#x968F;&#x673A;&#x79FB;&#x9664;&#x4E00;&#x4E9B;&#x8282;&#x70B9;&#xFF0C;&#x5982;&#x679C;&#x518D;&#x4E09;&#x68C0;&#x67E5;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x5F88;&#x96BE;&#x8FDB;&#x884C;&#x590D;&#x67E5;&#x7684;&#x3002;&#x5B9A;&#x4E49;&#x660E;&#x786E;&#x7684;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;$J$&#x6BCF;&#x6B21;&#x8FED;&#x4EE3;&#x540E;&#x90FD;&#x4F1A;&#x4E0B;&#x964D;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x6240;&#x4F18;&#x5316;&#x7684;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;$J$&#x5B9E;&#x9645;&#x4E0A;&#x5E76;&#x6CA1;&#x6709;&#x660E;&#x786E;&#x5B9A;&#x4E49;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x5728;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x5F88;&#x96BE;&#x8BA1;&#x7B97;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5931;&#x53BB;&#x4E86;&#x8C03;&#x8BD5;&#x5DE5;&#x5177;&#x6765;&#x7ED8;&#x5236;&#x8FD9;&#x6837;&#x7684;&#x56FE;&#x7247;&#x3002;&#x6211;&#x901A;&#x5E38;&#x4F1A;&#x5173;&#x95ED;<strong>dropout</strong>&#x51FD;&#x6570;&#xFF0C;&#x5C06;<strong>keep-prob</strong>&#x7684;&#x503C;&#x8BBE;&#x4E3A;1&#xFF0C;&#x8FD0;&#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x786E;&#x4FDD;J&#x51FD;&#x6570;&#x5355;&#x8C03;&#x9012;&#x51CF;&#x3002;&#x7136;&#x540E;&#x6253;&#x5F00;<strong>dropout</strong>&#x51FD;&#x6570;&#xFF0C;&#x5E0C;&#x671B;&#x5728;<strong>dropout</strong>&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4EE3;&#x7801;&#x5E76;&#x672A;&#x5F15;&#x5165;<strong>bug</strong>&#x3002;&#x6211;&#x89C9;&#x5F97;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x5176;&#x5B83;&#x65B9;&#x6CD5;&#xFF0C;&#x867D;&#x7136;&#x6211;&#x4EEC;&#x5E76;&#x6CA1;&#x6709;&#x5173;&#x4E8E;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x6027;&#x80FD;&#x7684;&#x6570;&#x636E;&#x7EDF;&#x8BA1;&#xFF0C;&#x4F46;&#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x5B83;&#x4EEC;&#x4E0E;<strong>dropout</strong>&#x65B9;&#x6CD5;&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#x3002;</p>
<h3 id="18-&#x5176;&#x4ED6;&#x6B63;&#x5219;&#x5316;&#x65B9;&#x6CD5;&#xFF08;other-regularization-methods&#xFF09;">1.8 &#x5176;&#x4ED6;&#x6B63;&#x5219;&#x5316;&#x65B9;&#x6CD5;&#xFF08;Other regularization methods&#xFF09;</h3>
<p>&#x9664;&#x4E86;$L2$&#x6B63;&#x5219;&#x5316;&#x548C;&#x968F;&#x673A;&#x5931;&#x6D3B;&#xFF08;<strong>dropout</strong>&#xFF09;&#x6B63;&#x5219;&#x5316;&#xFF0C;&#x8FD8;&#x6709;&#x51E0;&#x79CD;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x8FC7;&#x62DF;&#x5408;:</p>
<p><img src="../images/L2_week1_17.png" alt=""></p>
<p>&#x4E00;.&#x6570;&#x636E;&#x6269;&#x589E;</p>
<p>&#x5047;&#x8BBE;&#x4F60;&#x6B63;&#x5728;&#x62DF;&#x5408;&#x732B;&#x54AA;&#x56FE;&#x7247;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x901A;&#x8FC7;&#x6269;&#x589E;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x6765;&#x89E3;&#x51B3;&#x8FC7;&#x62DF;&#x5408;&#xFF0C;&#x4F46;&#x6269;&#x589E;&#x6570;&#x636E;&#x4EE3;&#x4EF7;&#x9AD8;&#xFF0C;&#x800C;&#x4E14;&#x6709;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x6269;&#x589E;&#x6570;&#x636E;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6DFB;&#x52A0;&#x8FD9;&#x7C7B;&#x56FE;&#x7247;&#x6765;&#x589E;&#x52A0;&#x8BAD;&#x7EC3;&#x96C6;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6C34;&#x5E73;&#x7FFB;&#x8F6C;&#x56FE;&#x7247;&#xFF0C;&#x5E76;&#x628A;&#x5B83;&#x6DFB;&#x52A0;&#x5230;&#x8BAD;&#x7EC3;&#x96C6;&#x3002;&#x6240;&#x4EE5;&#x73B0;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#x6709;&#x539F;&#x56FE;&#xFF0C;&#x8FD8;&#x6709;&#x7FFB;&#x8F6C;&#x540E;&#x7684;&#x8FD9;&#x5F20;&#x56FE;&#x7247;&#xFF0C;&#x6240;&#x4EE5;&#x901A;&#x8FC7;&#x6C34;&#x5E73;&#x7FFB;&#x8F6C;&#x56FE;&#x7247;&#xFF0C;&#x8BAD;&#x7EC3;&#x96C6;&#x5219;&#x53EF;&#x4EE5;&#x589E;&#x5927;&#x4E00;&#x500D;&#xFF0C;&#x56E0;&#x4E3A;&#x8BAD;&#x7EC3;&#x96C6;&#x6709;&#x5197;&#x4F59;&#xFF0C;&#x8FD9;&#x867D;&#x7136;&#x4E0D;&#x5982;&#x6211;&#x4EEC;&#x989D;&#x5916;&#x6536;&#x96C6;&#x4E00;&#x7EC4;&#x65B0;&#x56FE;&#x7247;&#x90A3;&#x4E48;&#x597D;&#xFF0C;&#x4F46;&#x8FD9;&#x6837;&#x505A;&#x8282;&#x7701;&#x4E86;&#x83B7;&#x53D6;&#x66F4;&#x591A;&#x732B;&#x54AA;&#x56FE;&#x7247;&#x7684;&#x82B1;&#x8D39;&#x3002;</p>
<p><img src="../images/2e2ccf4a2bb9156f876321ce07b006ca.png" alt=""></p>
<p>&#x9664;&#x4E86;&#x6C34;&#x5E73;&#x7FFB;&#x8F6C;&#x56FE;&#x7247;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x968F;&#x610F;&#x88C1;&#x526A;&#x56FE;&#x7247;&#xFF0C;&#x8FD9;&#x5F20;&#x56FE;&#x662F;&#x628A;&#x539F;&#x56FE;&#x65CB;&#x8F6C;&#x5E76;&#x968F;&#x610F;&#x653E;&#x5927;&#x540E;&#x88C1;&#x526A;&#x7684;&#xFF0C;&#x4ECD;&#x80FD;&#x8FA8;&#x522B;&#x51FA;&#x56FE;&#x7247;&#x4E2D;&#x7684;&#x732B;&#x54AA;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x968F;&#x610F;&#x7FFB;&#x8F6C;&#x548C;&#x88C1;&#x526A;&#x56FE;&#x7247;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x589E;&#x5927;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x989D;&#x5916;&#x751F;&#x6210;&#x5047;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x3002;&#x548C;&#x5168;&#x65B0;&#x7684;&#xFF0C;&#x72EC;&#x7ACB;&#x7684;&#x732B;&#x54AA;&#x56FE;&#x7247;&#x6570;&#x636E;&#x76F8;&#x6BD4;&#xFF0C;&#x8FD9;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x5047;&#x7684;&#x6570;&#x636E;&#x65E0;&#x6CD5;&#x5305;&#x542B;&#x50CF;&#x5168;&#x65B0;&#x6570;&#x636E;&#x90A3;&#x4E48;&#x591A;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x8FD9;&#x4E48;&#x505A;&#x57FA;&#x672C;&#x6CA1;&#x6709;&#x82B1;&#x8D39;&#xFF0C;&#x4EE3;&#x4EF7;&#x51E0;&#x4E4E;&#x4E3A;&#x96F6;&#xFF0C;&#x9664;&#x4E86;&#x4E00;&#x4E9B;&#x5BF9;&#x6297;&#x6027;&#x4EE3;&#x4EF7;&#x3002;&#x4EE5;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x6269;&#x589E;&#x7B97;&#x6CD5;&#x6570;&#x636E;&#xFF0C;&#x8FDB;&#x800C;&#x6B63;&#x5219;&#x5316;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x51CF;&#x5C11;&#x8FC7;&#x62DF;&#x5408;&#x6BD4;&#x8F83;&#x5EC9;&#x4EF7;&#x3002;</p>
<p><img src="../images/dd9a0f8209e53fdab8030b98d39e11eb.png" alt=""></p>
<p>&#x50CF;&#x8FD9;&#x6837;&#x4EBA;&#x5DE5;&#x5408;&#x6210;&#x6570;&#x636E;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x901A;&#x8FC7;&#x7B97;&#x6CD5;&#x9A8C;&#x8BC1;&#xFF0C;&#x56FE;&#x7247;&#x4E2D;&#x7684;&#x732B;&#x7ECF;&#x8FC7;&#x6C34;&#x5E73;&#x7FFB;&#x8F6C;&#x4E4B;&#x540E;&#x4F9D;&#x7136;&#x662F;&#x732B;&#x3002;&#x5927;&#x5BB6;&#x6CE8;&#x610F;&#xFF0C;&#x6211;&#x5E76;&#x6CA1;&#x6709;&#x5782;&#x76F4;&#x7FFB;&#x8F6C;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x4E0D;&#x60F3;&#x4E0A;&#x4E0B;&#x98A0;&#x5012;&#x56FE;&#x7247;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x968F;&#x673A;&#x9009;&#x53D6;&#x653E;&#x5927;&#x540E;&#x7684;&#x90E8;&#x5206;&#x56FE;&#x7247;&#xFF0C;&#x732B;&#x53EF;&#x80FD;&#x8FD8;&#x5728;&#x4E0A;&#x9762;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x5149;&#x5B66;&#x5B57;&#x7B26;&#x8BC6;&#x522B;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6DFB;&#x52A0;&#x6570;&#x5B57;&#xFF0C;&#x968F;&#x610F;&#x65CB;&#x8F6C;&#x6216;&#x626D;&#x66F2;&#x6570;&#x5B57;&#x6765;&#x6269;&#x589E;&#x6570;&#x636E;&#xFF0C;&#x628A;&#x8FD9;&#x4E9B;&#x6570;&#x5B57;&#x6DFB;&#x52A0;&#x5230;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x5B83;&#x4EEC;&#x4ECD;&#x7136;&#x662F;&#x6570;&#x5B57;&#x3002;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x8BF4;&#x660E;&#xFF0C;&#x6211;&#x5BF9;&#x5B57;&#x7B26;&#x505A;&#x4E86;&#x5F3A;&#x53D8;&#x5F62;&#x5904;&#x7406;&#xFF0C;&#x6240;&#x4EE5;&#x6570;&#x5B57;4&#x770B;&#x8D77;&#x6765;&#x662F;&#x6CE2;&#x5F62;&#x7684;&#xFF0C;&#x5176;&#x5B9E;&#x4E0D;&#x7528;&#x5BF9;&#x6570;&#x5B57;4&#x505A;&#x8FD9;&#x4E48;&#x5938;&#x5F20;&#x7684;&#x626D;&#x66F2;&#xFF0C;&#x53EA;&#x8981;&#x8F7B;&#x5FAE;&#x7684;&#x53D8;&#x5F62;&#x5C31;&#x597D;&#xFF0C;&#x6211;&#x505A;&#x6210;&#x8FD9;&#x6837;&#x662F;&#x4E3A;&#x4E86;&#x8BA9;&#x5927;&#x5BB6;&#x770B;&#x7684;&#x66F4;&#x6E05;&#x695A;&#x3002;&#x5B9E;&#x9645;&#x64CD;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x5BF9;&#x5B57;&#x7B26;&#x505A;&#x66F4;&#x8F7B;&#x5FAE;&#x7684;&#x53D8;&#x5F62;&#x5904;&#x7406;&#x3002;&#x56E0;&#x4E3A;&#x8FD9;&#x51E0;&#x4E2A;4&#x770B;&#x8D77;&#x6765;&#x6709;&#x70B9;&#x626D;&#x66F2;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6570;&#x636E;&#x6269;&#x589E;&#x53EF;&#x4F5C;&#x4E3A;&#x6B63;&#x5219;&#x5316;&#x65B9;&#x6CD5;&#x4F7F;&#x7528;&#xFF0C;&#x5B9E;&#x9645;&#x529F;&#x80FD;&#x4E0A;&#x4E5F;&#x4E0E;&#x6B63;&#x5219;&#x5316;&#x76F8;&#x4F3C;&#x3002;</p>
<p>&#x4E8C;.<strong>early stopping</strong></p>
<p>&#x8FD8;&#x6709;&#x53E6;&#x5916;&#x4E00;&#x79CD;&#x5E38;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x53EB;&#x4F5C;<strong>early stopping</strong>&#xFF0C;&#x8FD0;&#x884C;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7ED8;&#x5236;&#x8BAD;&#x7EC3;&#x8BEF;&#x5DEE;&#xFF0C;&#x6216;&#x53EA;&#x7ED8;&#x5236;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;$J$&#x7684;&#x4F18;&#x5316;&#x8FC7;&#x7A0B;&#xFF0C;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x7528;0-1&#x8BB0;&#x5F55;&#x5206;&#x7C7B;&#x8BEF;&#x5DEE;&#x6B21;&#x6570;&#x3002;&#x5448;&#x5355;&#x8C03;&#x4E0B;&#x964D;&#x8D8B;&#x52BF;&#xFF0C;&#x5982;&#x56FE;&#x3002;</p>
<p><img src="../images/69d92a8de8f62ab602d2bc022591d3c9.png" alt=""></p>
<p>&#x56E0;&#x4E3A;&#x5728;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x8BAD;&#x7EC3;&#x8BEF;&#x5DEE;&#xFF0C;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;$J$&#x90FD;&#x5728;&#x4E0B;&#x964D;&#xFF0C;&#x901A;&#x8FC7;<strong>early stopping</strong>&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x4F46;&#x53EF;&#x4EE5;&#x7ED8;&#x5236;&#x4E0A;&#x9762;&#x8FD9;&#x4E9B;&#x5185;&#x5BB9;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x7ED8;&#x5236;&#x9A8C;&#x8BC1;&#x96C6;&#x8BEF;&#x5DEE;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x662F;&#x9A8C;&#x8BC1;&#x96C6;&#x4E0A;&#x7684;&#x5206;&#x7C7B;&#x8BEF;&#x5DEE;&#xFF0C;&#x6216;&#x9A8C;&#x8BC1;&#x96C6;&#x4E0A;&#x7684;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#xFF0C;&#x903B;&#x8F91;&#x635F;&#x5931;&#x548C;&#x5BF9;&#x6570;&#x635F;&#x5931;&#x7B49;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x9A8C;&#x8BC1;&#x96C6;&#x8BEF;&#x5DEE;&#x901A;&#x5E38;&#x4F1A;&#x5148;&#x5448;&#x4E0B;&#x964D;&#x8D8B;&#x52BF;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x67D0;&#x4E2A;&#x8282;&#x70B9;&#x5904;&#x5F00;&#x59CB;&#x4E0A;&#x5347;&#xFF0C;<strong>early stopping</strong>&#x7684;&#x4F5C;&#x7528;&#x662F;&#xFF0C;&#x4F60;&#x4F1A;&#x8BF4;&#xFF0C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5DF2;&#x7ECF;&#x5728;&#x8FD9;&#x4E2A;&#x8FED;&#x4EE3;&#x8FC7;&#x7A0B;&#x4E2D;&#x8868;&#x73B0;&#x5F97;&#x5F88;&#x597D;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x6B64;&#x505C;&#x6B62;&#x8BAD;&#x7EC3;&#x5427;&#xFF0C;&#x5F97;&#x5230;&#x9A8C;&#x8BC1;&#x96C6;&#x8BEF;&#x5DEE;&#xFF0C;&#x5B83;&#x662F;&#x600E;&#x4E48;&#x53D1;&#x6325;&#x4F5C;&#x7528;&#x7684;&#xFF1F;</p>
<p><img src="../images/9d0db64a9c9b050466a039c935f36f93.png" alt=""></p>
<p>&#x5F53;&#x4F60;&#x8FD8;&#x672A;&#x5728;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E0A;&#x8FD0;&#x884C;&#x592A;&#x591A;&#x8FED;&#x4EE3;&#x8FC7;&#x7A0B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53C2;&#x6570;$w$&#x63A5;&#x8FD1;0&#xFF0C;&#x56E0;&#x4E3A;&#x968F;&#x673A;&#x521D;&#x59CB;&#x5316;$w$&#x503C;&#x65F6;&#xFF0C;&#x5B83;&#x7684;&#x503C;&#x53EF;&#x80FD;&#x90FD;&#x662F;&#x8F83;&#x5C0F;&#x7684;&#x968F;&#x673A;&#x503C;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x4F60;&#x957F;&#x671F;&#x8BAD;&#x7EC3;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E4B;&#x524D;$w$&#x4F9D;&#x7136;&#x5F88;&#x5C0F;&#xFF0C;&#x5728;&#x8FED;&#x4EE3;&#x8FC7;&#x7A0B;&#x548C;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#x4E2D;$w$&#x7684;&#x503C;&#x4F1A;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x5927;&#xFF0C;&#x6BD4;&#x5982;&#x5728;&#x8FD9;&#x513F;&#xFF0C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x53C2;&#x6570;$w$&#x7684;&#x503C;&#x5DF2;&#x7ECF;&#x975E;&#x5E38;&#x5927;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;<strong>early stopping</strong>&#x8981;&#x505A;&#x5C31;&#x662F;&#x5728;&#x4E2D;&#x95F4;&#x70B9;&#x505C;&#x6B62;&#x8FED;&#x4EE3;&#x8FC7;&#x7A0B;&#xFF0C;&#x6211;&#x4EEC;&#x5F97;&#x5230;&#x4E00;&#x4E2A;$w$&#x503C;&#x4E2D;&#x7B49;&#x5927;&#x5C0F;&#x7684;&#x5F17;&#x7F57;&#x8D1D;&#x5C3C;&#x4E4C;&#x65AF;&#x8303;&#x6570;&#xFF0C;&#x4E0E;$L2$&#x6B63;&#x5219;&#x5316;&#x76F8;&#x4F3C;&#xFF0C;&#x9009;&#x62E9;&#x53C2;&#x6570;w&#x8303;&#x6570;&#x8F83;&#x5C0F;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x4F46;&#x613F;&#x4F60;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8FC7;&#x5EA6;&#x62DF;&#x5408;&#x4E0D;&#x4E25;&#x91CD;&#x3002;</p>
<p><img src="../images/51ca931387ed9fb80313263113c56e8e.png" alt=""></p>
<p>&#x672F;&#x8BED;<strong>early stopping</strong>&#x4EE3;&#x8868;&#x63D0;&#x65E9;&#x505C;&#x6B62;&#x8BAD;&#x7EC3;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x8BAD;&#x7EC3;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x65F6;&#xFF0C;&#x6211;&#x6709;&#x65F6;&#x4F1A;&#x7528;&#x5230;<strong>early stopping</strong>&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4E5F;&#x6709;&#x4E00;&#x4E2A;&#x7F3A;&#x70B9;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x4E86;&#x89E3;&#x4E00;&#x4E0B;&#x3002;</p>
<p>&#x6211;&#x8BA4;&#x4E3A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x8FC7;&#x7A0B;&#x5305;&#x62EC;&#x51E0;&#x4E2A;&#x6B65;&#x9AA4;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x6B65;&#x662F;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x7B97;&#x6CD5;&#x6765;&#x4F18;&#x5316;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;$J$&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x5F88;&#x591A;&#x79CD;&#x5DE5;&#x5177;&#x6765;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#xFF0C;&#x540E;&#x9762;&#x6211;&#x4F1A;&#x4ECB;&#x7ECD;&#x5176;&#x5B83;&#x7B97;&#x6CD5;&#xFF0C;&#x4F8B;&#x5982;<strong>Momentum</strong>&#xFF0C;<strong>RMSprop</strong>&#x548C;<strong>Adam</strong>&#x7B49;&#x7B49;&#xFF0C;&#x4F46;&#x662F;&#x4F18;&#x5316;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;$J$&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4E5F;&#x4E0D;&#x60F3;&#x53D1;&#x751F;&#x8FC7;&#x62DF;&#x5408;&#xFF0C;&#x4E5F;&#x6709;&#x4E00;&#x4E9B;&#x5DE5;&#x5177;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x8BE5;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#x6B63;&#x5219;&#x5316;&#xFF0C;&#x6269;&#x589E;&#x6570;&#x636E;&#x7B49;&#x7B49;&#x3002;</p>
<p><img src="../images/f5fd5df8235145c54aece1a5bf7b31f6.png" alt=""></p>
<p>&#x5728;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4E2D;&#xFF0C;&#x8D85;&#x7EA7;&#x53C2;&#x6570;&#x6FC0;&#x589E;&#xFF0C;&#x9009;&#x51FA;&#x53EF;&#x884C;&#x7684;&#x7B97;&#x6CD5;&#x4E5F;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x590D;&#x6742;&#x3002;&#x6211;&#x53D1;&#x73B0;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x7528;&#x4E00;&#x7EC4;&#x5DE5;&#x5177;&#x4F18;&#x5316;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;$J$&#xFF0C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5C31;&#x4F1A;&#x53D8;&#x5F97;&#x66F4;&#x7B80;&#x5355;&#xFF0C;&#x5728;&#x91CD;&#x70B9;&#x4F18;&#x5316;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;$J$&#x65F6;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x7559;&#x610F;$w$&#x548C;$b$&#xFF0C;$J(w,b)$&#x7684;&#x503C;&#x8D8A;&#x5C0F;&#x8D8A;&#x597D;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x60F3;&#x529E;&#x6CD5;&#x51CF;&#x5C0F;&#x8FD9;&#x4E2A;&#x503C;&#xFF0C;&#x5176;&#x5B83;&#x7684;&#x4E0D;&#x7528;&#x5173;&#x6CE8;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x9884;&#x9632;&#x8FC7;&#x62DF;&#x5408;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x4EFB;&#x52A1;&#xFF0C;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#x5C31;&#x662F;&#x51CF;&#x5C11;&#x65B9;&#x5DEE;&#xFF0C;&#x8FD9;&#x4E00;&#x6B65;&#x6211;&#x4EEC;&#x7528;&#x53E6;&#x5916;&#x4E00;&#x5957;&#x5DE5;&#x5177;&#x6765;&#x5B9E;&#x73B0;&#xFF0C;&#x8FD9;&#x4E2A;&#x539F;&#x7406;&#x6709;&#x65F6;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x6B63;&#x4EA4;&#x5316;&#x201D;&#x3002;&#x601D;&#x8DEF;&#x5C31;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x505A;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#xFF0C;&#x540E;&#x9762;&#x8BFE;&#x4E0A;&#x6211;&#x4F1A;&#x5177;&#x4F53;&#x4ECB;&#x7ECD;&#x6B63;&#x4EA4;&#x5316;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8FD8;&#x4E0D;&#x4E86;&#x89E3;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#xFF0C;&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#x3002;</p>
<p>&#x4F46;&#x5BF9;&#x6211;&#x6765;&#x8BF4;<strong>early stopping</strong>&#x7684;&#x4E3B;&#x8981;&#x7F3A;&#x70B9;&#x5C31;&#x662F;&#x4F60;&#x4E0D;&#x80FD;&#x72EC;&#x7ACB;&#x5730;&#x5904;&#x7406;&#x8FD9;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x63D0;&#x65E9;&#x505C;&#x6B62;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x505C;&#x6B62;&#x4E86;&#x4F18;&#x5316;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;$J$&#xFF0C;&#x56E0;&#x4E3A;&#x73B0;&#x5728;&#x4F60;&#x4E0D;&#x518D;&#x5C1D;&#x8BD5;&#x964D;&#x4F4E;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;$J$&#xFF0C;&#x6240;&#x4EE5;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;$J$&#x7684;&#x503C;&#x53EF;&#x80FD;&#x4E0D;&#x591F;&#x5C0F;&#xFF0C;&#x540C;&#x65F6;&#x4F60;&#x53C8;&#x5E0C;&#x671B;&#x4E0D;&#x51FA;&#x73B0;&#x8FC7;&#x62DF;&#x5408;&#xFF0C;&#x4F60;&#x6CA1;&#x6709;&#x91C7;&#x53D6;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x89E3;&#x51B3;&#x8FD9;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x662F;&#x7528;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x540C;&#x65F6;&#x89E3;&#x51B3;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x6837;&#x505A;&#x7684;&#x7ED3;&#x679C;&#x662F;&#x6211;&#x8981;&#x8003;&#x8651;&#x7684;&#x4E1C;&#x897F;&#x53D8;&#x5F97;&#x66F4;&#x590D;&#x6742;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4E0D;&#x7528;<strong>early stopping</strong>&#xFF0C;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x5C31;&#x662F;$L2$&#x6B63;&#x5219;&#x5316;&#xFF0C;&#x8BAD;&#x7EC3;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x65F6;&#x95F4;&#x5C31;&#x53EF;&#x80FD;&#x5F88;&#x957F;&#x3002;&#x6211;&#x53D1;&#x73B0;&#xFF0C;&#x8FD9;&#x5BFC;&#x81F4;&#x8D85;&#x7EA7;&#x53C2;&#x6570;&#x641C;&#x7D22;&#x7A7A;&#x95F4;&#x66F4;&#x5BB9;&#x6613;&#x5206;&#x89E3;&#xFF0C;&#x4E5F;&#x66F4;&#x5BB9;&#x6613;&#x641C;&#x7D22;&#xFF0C;&#x4F46;&#x662F;&#x7F3A;&#x70B9;&#x5728;&#x4E8E;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x5C1D;&#x8BD5;&#x5F88;&#x591A;&#x6B63;&#x5219;&#x5316;&#x53C2;&#x6570;$\lambda$&#x7684;&#x503C;&#xFF0C;&#x8FD9;&#x4E5F;&#x5BFC;&#x81F4;&#x641C;&#x7D22;&#x5927;&#x91CF;$\lambda$&#x503C;&#x7684;&#x8BA1;&#x7B97;&#x4EE3;&#x4EF7;&#x592A;&#x9AD8;&#x3002;</p>
<p><strong>Early stopping</strong>&#x7684;&#x4F18;&#x70B9;&#x662F;&#xFF0C;&#x53EA;&#x8FD0;&#x884C;&#x4E00;&#x6B21;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x627E;&#x51FA;$w$&#x7684;&#x8F83;&#x5C0F;&#x503C;&#xFF0C;&#x4E2D;&#x95F4;&#x503C;&#x548C;&#x8F83;&#x5927;&#x503C;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x5C1D;&#x8BD5;$L2$&#x6B63;&#x5219;&#x5316;&#x8D85;&#x7EA7;&#x53C2;&#x6570;$\lambda$&#x7684;&#x5F88;&#x591A;&#x503C;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x8FD8;&#x4E0D;&#x80FD;&#x5B8C;&#x5168;&#x7406;&#x89E3;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#xFF0C;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x4E0B;&#x8282;&#x8BFE;&#x6211;&#x4EEC;&#x4F1A;&#x8BE6;&#x7EC6;&#x8BB2;&#x89E3;&#x6B63;&#x4EA4;&#x5316;&#xFF0C;&#x8FD9;&#x6837;&#x4F1A;&#x66F4;&#x597D;&#x7406;&#x89E3;&#x3002;</p>
<p>&#x867D;&#x7136;$L2$&#x6B63;&#x5219;&#x5316;&#x6709;&#x7F3A;&#x70B9;&#xFF0C;&#x53EF;&#x8FD8;&#x662F;&#x6709;&#x5F88;&#x591A;&#x4EBA;&#x613F;&#x610F;&#x7528;&#x5B83;&#x3002;&#x5434;&#x6069;&#x8FBE;&#x8001;&#x5E08;&#x4E2A;&#x4EBA;&#x66F4;&#x503E;&#x5411;&#x4E8E;&#x4F7F;&#x7528;$L2$&#x6B63;&#x5219;&#x5316;&#xFF0C;&#x5C1D;&#x8BD5;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x7684;$\lambda$&#x503C;&#xFF0C;&#x5047;&#x8BBE;&#x4F60;&#x53EF;&#x4EE5;&#x8D1F;&#x62C5;&#x5927;&#x91CF;&#x8BA1;&#x7B97;&#x7684;&#x4EE3;&#x4EF7;&#x3002;&#x800C;&#x4F7F;&#x7528;<strong>early stopping</strong>&#x4E5F;&#x80FD;&#x5F97;&#x5230;&#x76F8;&#x4F3C;&#x7ED3;&#x679C;&#xFF0C;&#x8FD8;&#x4E0D;&#x7528;&#x5C1D;&#x8BD5;&#x8FD9;&#x4E48;&#x591A;$\lambda$&#x503C;&#x3002;</p>
<p>&#x8FD9;&#x8282;&#x8BFE;&#x6211;&#x4EEC;&#x8BB2;&#x4E86;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x6269;&#x589E;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x4F7F;&#x7528;<strong>early stopping</strong>&#x964D;&#x4F4E;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x65B9;&#x5DEE;&#x6216;&#x9884;&#x9632;&#x8FC7;&#x62DF;&#x5408;&#x3002;</p>
<h3 id="19-&#x5F52;&#x4E00;&#x5316;&#x8F93;&#x5165;&#xFF08;normalizing-inputs&#xFF09;">1.9 &#x5F52;&#x4E00;&#x5316;&#x8F93;&#x5165;&#xFF08;Normalizing inputs&#xFF09;</h3>
<p>&#x8BAD;&#x7EC3;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x52A0;&#x901F;&#x8BAD;&#x7EC3;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x5F52;&#x4E00;&#x5316;&#x8F93;&#x5165;&#x3002;&#x5047;&#x8BBE;&#x4E00;&#x4E2A;&#x8BAD;&#x7EC3;&#x96C6;&#x6709;&#x4E24;&#x4E2A;&#x7279;&#x5F81;&#xFF0C;&#x8F93;&#x5165;&#x7279;&#x5F81;&#x4E3A;2&#x7EF4;&#xFF0C;&#x5F52;&#x4E00;&#x5316;&#x9700;&#x8981;&#x4E24;&#x4E2A;&#x6B65;&#x9AA4;&#xFF1A;</p>
<ol>
<li><p>&#x96F6;&#x5747;&#x503C;</p>
</li>
<li><p>&#x5F52;&#x4E00;&#x5316;&#x65B9;&#x5DEE;&#xFF1B;</p>
<p>&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x65E0;&#x8BBA;&#x662F;&#x8BAD;&#x7EC3;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x90FD;&#x662F;&#x901A;&#x8FC7;&#x76F8;&#x540C;&#x7684;$&#x3BC;$&#x548C;$&#x3C3;^2$&#x5B9A;&#x4E49;&#x7684;&#x6570;&#x636E;&#x8F6C;&#x6362;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x662F;&#x7531;&#x8BAD;&#x7EC3;&#x96C6;&#x5F97;&#x51FA;&#x6765;&#x7684;&#x3002;</p>
</li>
</ol>
<p><img src="../images/L2_week1_19.png" alt=""></p>
<p>&#x7B2C;&#x4E00;&#x6B65;&#x662F;&#x96F6;&#x5747;&#x503C;&#x5316;&#xFF0C;$\mu = \frac{1}{m}\sum_{i =1}^{m}x^{(i)}$&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x5411;&#x91CF;&#xFF0C;$x$&#x7B49;&#x4E8E;&#x6BCF;&#x4E2A;&#x8BAD;&#x7EC3;&#x6570;&#x636E; $x$&#x51CF;&#x53BB;$\mu$&#xFF0C;&#x610F;&#x601D;&#x662F;&#x79FB;&#x52A8;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x76F4;&#x5230;&#x5B83;&#x5B8C;&#x6210;&#x96F6;&#x5747;&#x503C;&#x5316;&#x3002;</p>
<p><img src="../images/5e49434607f22caf087f7730177931bf.png" alt=""></p>
<p>&#x7B2C;&#x4E8C;&#x6B65;&#x662F;&#x5F52;&#x4E00;&#x5316;&#x65B9;&#x5DEE;&#xFF0C;&#x6CE8;&#x610F;&#x7279;&#x5F81;$x<em>{1}$&#x7684;&#x65B9;&#x5DEE;&#x6BD4;&#x7279;&#x5F81;$x</em>{2}$&#x7684;&#x65B9;&#x5DEE;&#x8981;&#x5927;&#x5F97;&#x591A;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x505A;&#x7684;&#x662F;&#x7ED9;$\sigma$&#x8D4B;&#x503C;&#xFF0C;$\sigma^{2}= \frac{1}{m}\sum_{i =1}^{m}{({x^{(i)})}^{2}}$&#xFF0C;&#x8FD9;&#x662F;&#x8282;&#x70B9;$y$ &#x7684;&#x5E73;&#x65B9;&#xFF0C;$\sigma^{2}$&#x662F;&#x4E00;&#x4E2A;&#x5411;&#x91CF;&#xFF0C;&#x5B83;&#x7684;&#x6BCF;&#x4E2A;&#x7279;&#x5F81;&#x90FD;&#x6709;&#x65B9;&#x5DEE;&#xFF0C;&#x6CE8;&#x610F;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#x96F6;&#x503C;&#x5747;&#x5316;&#xFF0C;$({x^{(i)})}^{2}$&#x5143;&#x7D20;$y^{2}$&#x5C31;&#x662F;&#x65B9;&#x5DEE;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x6240;&#x6709;&#x6570;&#x636E;&#x9664;&#x4EE5;&#x5411;&#x91CF;$\sigma^{2}$&#xFF0C;&#x6700;&#x540E;&#x53D8;&#x6210;&#x4E0A;&#x56FE;&#x5F62;&#x5F0F;&#x3002;</p>
<p>$x<em>{1}$&#x548C;$x</em>{2}$&#x7684;&#x65B9;&#x5DEE;&#x90FD;&#x7B49;&#x4E8E;1&#x3002;&#x63D0;&#x793A;&#x4E00;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7528;&#x5B83;&#x6765;&#x8C03;&#x6574;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#xFF0C;&#x90A3;&#x4E48;&#x7528;&#x76F8;&#x540C;&#x7684; $&#x3BC;$ &#x548C; $\sigma^{2}$&#x6765;&#x5F52;&#x4E00;&#x5316;&#x6D4B;&#x8BD5;&#x96C6;&#x3002;&#x5C24;&#x5176;&#x662F;&#xFF0C;&#x4F60;&#x4E0D;&#x5E0C;&#x671B;&#x8BAD;&#x7EC3;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x7684;&#x5F52;&#x4E00;&#x5316;&#x6709;&#x6240;&#x4E0D;&#x540C;&#xFF0C;&#x4E0D;&#x8BBA;$&#x3BC;$&#x7684;&#x503C;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x4E5F;&#x4E0D;&#x8BBA;$\sigma^{2}$&#x7684;&#x503C;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x516C;&#x5F0F;&#x4E2D;&#x90FD;&#x4F1A;&#x7528;&#x5230;&#x5B83;&#x4EEC;&#x3002;&#x6240;&#x4EE5;&#x4F60;&#x8981;&#x7528;&#x540C;&#x6837;&#x7684;&#x65B9;&#x6CD5;&#x8C03;&#x6574;&#x6D4B;&#x8BD5;&#x96C6;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x4E0A;&#x5206;&#x522B;&#x9884;&#x4F30;$&#x3BC;$ &#x548C; $\sigma^{2}$&#x3002;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x4E0D;&#x8BBA;&#x662F;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x8FD8;&#x662F;&#x6D4B;&#x8BD5;&#x6570;&#x636E;&#xFF0C;&#x90FD;&#x662F;&#x901A;&#x8FC7;&#x76F8;&#x540C;&#x3BC;&#x548C;$\sigma^{2}$&#x5B9A;&#x4E49;&#x7684;&#x76F8;&#x540C;&#x6570;&#x636E;&#x8F6C;&#x6362;&#xFF0C;&#x5176;&#x4E2D;$&#x3BC;$&#x548C;$\sigma^{2}$&#x662F;&#x7531;&#x8BAD;&#x7EC3;&#x96C6;&#x6570;&#x636E;&#x8BA1;&#x7B97;&#x5F97;&#x6765;&#x7684;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x8FD9;&#x4E48;&#x505A;&#x5462;&#xFF1F;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x5F52;&#x4E00;&#x5316;&#x8F93;&#x5165;&#x7279;&#x5F81;&#xFF0C;&#x56DE;&#x60F3;&#x4E00;&#x4E0B;&#x53F3;&#x4E0A;&#x89D2;&#x6240;&#x5B9A;&#x4E49;&#x7684;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x3002;</p>
<p>$J(w,b)=\frac{1}{m}\sum\limits_{i=1}^{m}{L(&#xFF5B;&#xFF5B;{\hat{y}}}^{(i)}},&#xFF5B;&#xFF5B;y}^{(i)}})}$</p>
<p>&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;&#x975E;&#x5F52;&#x4E00;&#x5316;&#x7684;&#x8F93;&#x5165;&#x7279;&#x5F81;&#xFF0C;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x4F1A;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<p><img src="../images/bc4eccfb6c9dbef6cc81636d5ce60390.png" alt=""></p>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x7EC6;&#x957F;&#x72ED;&#x7A84;&#x7684;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#xFF0C;&#x4F60;&#x8981;&#x627E;&#x7684;&#x6700;&#x5C0F;&#x503C;&#x5E94;&#x8BE5;&#x5728;&#x8FD9;&#x91CC;&#x3002;&#x4F46;&#x5982;&#x679C;&#x7279;&#x5F81;&#x503C;&#x5728;&#x4E0D;&#x540C;&#x8303;&#x56F4;&#xFF0C;&#x5047;&#x5982;$x<em>{1}$&#x53D6;&#x503C;&#x8303;&#x56F4;&#x4ECE;1&#x5230;1000&#xFF0C;&#x7279;&#x5F81;$x</em>{2}$&#x7684;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x4ECE;0&#x5230;1&#xFF0C;&#x7ED3;&#x679C;&#x662F;&#x53C2;&#x6570;$w<em>{1}$&#x548C;$w</em>{2}$&#x503C;&#x7684;&#x8303;&#x56F4;&#x6216;&#x6BD4;&#x7387;&#x5C06;&#x4F1A;&#x975E;&#x5E38;&#x4E0D;&#x540C;&#xFF0C;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x8F74;&#x5E94;&#x8BE5;&#x662F;$w<em>{1}$&#x548C;$w</em>{2}$&#xFF0C;&#x4F46;&#x76F4;&#x89C2;&#x7406;&#x89E3;&#xFF0C;&#x6211;&#x6807;&#x8BB0;&#x4E3A;$w$&#x548C;$b$&#xFF0C;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x5C31;&#x6709;&#x70B9;&#x50CF;&#x72ED;&#x957F;&#x7684;&#x7897;&#x4E00;&#x6837;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x80FD;&#x753B;&#x51FA;&#x8BE5;&#x51FD;&#x6570;&#x7684;&#x90E8;&#x5206;&#x8F6E;&#x5ED3;&#xFF0C;&#x5B83;&#x4F1A;&#x662F;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x72ED;&#x957F;&#x7684;&#x51FD;&#x6570;&#x3002;</p>
<p>&#x7136;&#x800C;&#x5982;&#x679C;&#x4F60;&#x5F52;&#x4E00;&#x5316;&#x7279;&#x5F81;&#xFF0C;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x5E73;&#x5747;&#x8D77;&#x6765;&#x770B;&#x66F4;&#x5BF9;&#x79F0;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5728;&#x4E0A;&#x56FE;&#x8FD9;&#x6837;&#x7684;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x4E0A;&#x8FD0;&#x884C;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x6CD5;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x5C0F;&#x7684;&#x5B66;&#x4E60;&#x7387;&#x3002;&#x56E0;&#x4E3A;&#x5982;&#x679C;&#x662F;&#x5728;&#x8FD9;&#x4E2A;&#x4F4D;&#x7F6E;&#xFF0C;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x6CD5;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x591A;&#x6B21;&#x8FED;&#x4EE3;&#x8FC7;&#x7A0B;&#xFF0C;&#x76F4;&#x5230;&#x6700;&#x540E;&#x627E;&#x5230;&#x6700;&#x5C0F;&#x503C;&#x3002;&#x4F46;&#x5982;&#x679C;&#x51FD;&#x6570;&#x662F;&#x4E00;&#x4E2A;&#x66F4;&#x5706;&#x7684;&#x7403;&#x5F62;&#x8F6E;&#x5ED3;&#xFF0C;&#x90A3;&#x4E48;&#x4E0D;&#x8BBA;&#x4ECE;&#x54EA;&#x4E2A;&#x4F4D;&#x7F6E;&#x5F00;&#x59CB;&#xFF0C;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x6CD5;&#x90FD;&#x80FD;&#x591F;&#x66F4;&#x76F4;&#x63A5;&#x5730;&#x627E;&#x5230;&#x6700;&#x5C0F;&#x503C;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x6CD5;&#x4E2D;&#x4F7F;&#x7528;&#x8F83;&#x5927;&#x6B65;&#x957F;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x50CF;&#x5728;&#x5DE6;&#x56FE;&#x4E2D;&#x90A3;&#x6837;&#x53CD;&#x590D;&#x6267;&#x884C;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;$w$&#x662F;&#x4E00;&#x4E2A;&#x9AD8;&#x7EF4;&#x5411;&#x91CF;&#xFF0C;&#x56E0;&#x6B64;&#x7528;&#x4E8C;&#x7EF4;&#x7ED8;&#x5236;$w$&#x5E76;&#x4E0D;&#x80FD;&#x6B63;&#x786E;&#x5730;&#x4F20;&#x8FBE;&#x5E76;&#x76F4;&#x89C2;&#x7406;&#x89E3;&#xFF0C;&#x4F46;&#x603B;&#x5730;&#x76F4;&#x89C2;&#x7406;&#x89E3;&#x662F;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x4F1A;&#x66F4;&#x5706;&#x4E00;&#x4E9B;&#xFF0C;&#x800C;&#x4E14;&#x66F4;&#x5BB9;&#x6613;&#x4F18;&#x5316;&#xFF0C;&#x524D;&#x63D0;&#x662F;&#x7279;&#x5F81;&#x90FD;&#x5728;&#x76F8;&#x4F3C;&#x8303;&#x56F4;&#x5185;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4ECE;1&#x5230;1000&#xFF0C;0&#x5230;1&#x7684;&#x8303;&#x56F4;&#xFF0C;&#x800C;&#x662F;&#x5728;-1&#x5230;1&#x8303;&#x56F4;&#x5185;&#x6216;&#x76F8;&#x4F3C;&#x504F;&#x5DEE;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;$J$&#x4F18;&#x5316;&#x8D77;&#x6765;&#x66F4;&#x7B80;&#x5355;&#x5FEB;&#x901F;&#x3002;</p>
<p><img src="../images/4d0c183882a140ecd205f1618243d7f8.png" alt=""></p>
<p>&#x5B9E;&#x9645;&#x4E0A;&#x5982;&#x679C;&#x5047;&#x8BBE;&#x7279;&#x5F81;$x<em>{1}$&#x8303;&#x56F4;&#x5728;0-1&#x4E4B;&#x95F4;&#xFF0C;$x</em>{2}$&#x7684;&#x8303;&#x56F4;&#x5728;-1&#x5230;1&#x4E4B;&#x95F4;&#xFF0C;$x_{3}$&#x8303;&#x56F4;&#x5728;1-2&#x4E4B;&#x95F4;&#xFF0C;&#x5B83;&#x4EEC;&#x662F;&#x76F8;&#x4F3C;&#x8303;&#x56F4;&#xFF0C;&#x6240;&#x4EE5;&#x4F1A;&#x8868;&#x73B0;&#x5F97;&#x5F88;&#x597D;&#x3002;</p>
<p>&#x5F53;&#x5B83;&#x4EEC;&#x5728;&#x975E;&#x5E38;&#x4E0D;&#x540C;&#x7684;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x5185;&#xFF0C;&#x5982;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x4ECE;1&#x5230;1000&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x4ECE;0&#x5230;1&#xFF0C;&#x8FD9;&#x5BF9;&#x4F18;&#x5316;&#x7B97;&#x6CD5;&#x975E;&#x5E38;&#x4E0D;&#x5229;&#x3002;&#x4F46;&#x662F;&#x4EC5;&#x5C06;&#x5B83;&#x4EEC;&#x8BBE;&#x7F6E;&#x4E3A;&#x5747;&#x5316;&#x96F6;&#x503C;&#xFF0C;&#x5047;&#x8BBE;&#x65B9;&#x5DEE;&#x4E3A;1&#xFF0C;&#x5C31;&#x50CF;&#x4E0A;&#x4E00;&#x5F20;&#x5E7B;&#x706F;&#x7247;&#x91CC;&#x8BBE;&#x5B9A;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x786E;&#x4FDD;&#x6240;&#x6709;&#x7279;&#x5F81;&#x90FD;&#x5728;&#x76F8;&#x4F3C;&#x8303;&#x56F4;&#x5185;&#xFF0C;&#x901A;&#x5E38;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x8FD0;&#x884C;&#x5F97;&#x66F4;&#x5FEB;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x5982;&#x679C;&#x8F93;&#x5165;&#x7279;&#x5F81;&#x5904;&#x4E8E;&#x4E0D;&#x540C;&#x8303;&#x56F4;&#x5185;&#xFF0C;&#x53EF;&#x80FD;&#x6709;&#x4E9B;&#x7279;&#x5F81;&#x503C;&#x4ECE;0&#x5230;1&#xFF0C;&#x6709;&#x4E9B;&#x4ECE;1&#x5230;1000&#xFF0C;&#x90A3;&#x4E48;&#x5F52;&#x4E00;&#x5316;&#x7279;&#x5F81;&#x503C;&#x5C31;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x4E86;&#x3002;&#x5982;&#x679C;&#x7279;&#x5F81;&#x503C;&#x5904;&#x4E8E;&#x76F8;&#x4F3C;&#x8303;&#x56F4;&#x5185;&#xFF0C;&#x90A3;&#x4E48;&#x5F52;&#x4E00;&#x5316;&#x5C31;&#x4E0D;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x4E86;&#x3002;&#x6267;&#x884C;&#x8FD9;&#x7C7B;&#x5F52;&#x4E00;&#x5316;&#x5E76;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x4EC0;&#x4E48;&#x5371;&#x5BB3;&#xFF0C;&#x6211;&#x901A;&#x5E38;&#x4F1A;&#x505A;&#x5F52;&#x4E00;&#x5316;&#x5904;&#x7406;&#xFF0C;&#x867D;&#x7136;&#x6211;&#x4E0D;&#x786E;&#x5B9A;&#x5B83;&#x80FD;&#x5426;&#x63D0;&#x9AD8;&#x8BAD;&#x7EC3;&#x6216;&#x7B97;&#x6CD5;&#x901F;&#x5EA6;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x5F52;&#x4E00;&#x5316;&#x7279;&#x5F81;&#x8F93;&#x5165;&#xFF0C;&#x4E0B;&#x8282;&#x8BFE;&#x6211;&#x4EEC;&#x5C06;&#x7EE7;&#x7EED;&#x8BA8;&#x8BBA;&#x63D0;&#x5347;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8BAD;&#x7EC3;&#x901F;&#x5EA6;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<h3 id="110-&#x68AF;&#x5EA6;&#x6D88;&#x5931;&#x68AF;&#x5EA6;&#x7206;&#x70B8;&#xFF08;vanishing--exploding-gradients&#xFF09;">1.10 &#x68AF;&#x5EA6;&#x6D88;&#x5931;/&#x68AF;&#x5EA6;&#x7206;&#x70B8;&#xFF08;Vanishing / Exploding gradients&#xFF09;</h3>
<p>&#x8BAD;&#x7EC3;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x6240;&#x9762;&#x4E34;&#x7684;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x68AF;&#x5EA6;&#x6D88;&#x5931;&#x6216;&#x68AF;&#x5EA6;&#x7206;&#x70B8;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4F60;&#x8BAD;&#x7EC3;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5BFC;&#x6570;&#x6216;&#x5761;&#x5EA6;&#x6709;&#x65F6;&#x4F1A;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x5927;&#xFF0C;&#x6216;&#x8005;&#x975E;&#x5E38;&#x5C0F;&#xFF0C;&#x751A;&#x81F3;&#x4E8E;&#x4EE5;&#x6307;&#x6570;&#x65B9;&#x5F0F;&#x53D8;&#x5C0F;&#xFF0C;&#x8FD9;&#x52A0;&#x5927;&#x4E86;&#x8BAD;&#x7EC3;&#x7684;&#x96BE;&#x5EA6;&#x3002;</p>
<p>&#x8FD9;&#x8282;&#x8BFE;&#xFF0C;&#x4F60;&#x5C06;&#x4F1A;&#x4E86;&#x89E3;&#x68AF;&#x5EA6;&#x6D88;&#x5931;&#x6216;&#x68AF;&#x5EA6;&#x7206;&#x70B8;&#x7684;&#x771F;&#x6B63;&#x542B;&#x4E49;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x66F4;&#x660E;&#x667A;&#x5730;&#x9009;&#x62E9;&#x968F;&#x673A;&#x521D;&#x59CB;&#x5316;&#x6743;&#x91CD;&#xFF0C;&#x4ECE;&#x800C;&#x907F;&#x514D;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;
&#x5047;&#x8BBE;&#x4F60;&#x6B63;&#x5728;&#x8BAD;&#x7EC3;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x6781;&#x6DF1;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x4E3A;&#x4E86;&#x8282;&#x7EA6;&#x5E7B;&#x706F;&#x7247;&#x4E0A;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x6211;&#x753B;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6BCF;&#x5C42;&#x53EA;&#x6709;&#x4E24;&#x4E2A;&#x9690;&#x85CF;&#x5355;&#x5143;&#xFF0C;&#x4F46;&#x5B83;&#x53EF;&#x80FD;&#x542B;&#x6709;&#x66F4;&#x591A;&#xFF0C;&#x4F46;&#x8FD9;&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4F1A;&#x6709;&#x53C2;&#x6570;$W^{[1]}$&#xFF0C;$W^{[2]}$&#xFF0C;$W^{[3]}$&#x7B49;&#x7B49;&#xFF0C;&#x76F4;&#x5230;$W^{[l]}$&#xFF0C;&#x4E3A;&#x4E86;&#x7B80;&#x5355;&#x8D77;&#x89C1;&#xFF0C;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;$g(z)=z$&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x7EBF;&#x6027;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x5FFD;&#x7565;$b$&#xFF0C;&#x5047;&#x8BBE;$b^{[l]}$=0&#xFF0C;&#x5982;&#x679C;&#x90A3;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x8F93;&#x51FA;$ y=W^{[l]}W^{[L -1]}W^{[L - 2]}\ldots W^{[3]}W^{[2]}W^{[1]}x$&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8003;&#x9A8C;&#x6211;&#x7684;&#x6570;&#x5B66;&#x6C34;&#x5E73;&#xFF0C;$W^{[1]} x = z^{[1]}$&#xFF0C;&#x56E0;&#x4E3A;$b=0$&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x60F3;$z^{[1]} =W^{[1]} x$&#xFF0C;$a^{[1]} = g(z^{[1]})$&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x7EBF;&#x6027;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF0C;&#x5B83;&#x7B49;&#x4E8E;$z^{[1]}$&#xFF0C;&#x6240;&#x4EE5;&#x7B2C;&#x4E00;&#x9879;$W^{[1]} x = a^{[1]}$&#xFF0C;&#x901A;&#x8FC7;&#x63A8;&#x7406;&#xFF0C;&#x4F60;&#x4F1A;&#x5F97;&#x51FA;$W^{[2]}W^{[1]}x =a^{[2]}$&#xFF0C;&#x56E0;&#x4E3A;$a^{[2]} = g(z^{[2]})$&#xFF0C;&#x8FD8;&#x7B49;&#x4E8E;$g(W^{[2]}a^{[1]})$&#xFF0C;&#x53EF;&#x4EE5;&#x7528;$W^{[1]}x$&#x66FF;&#x6362;$a^{[1]}$&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E00;&#x9879;&#x5C31;&#x7B49;&#x4E8E;$a^{[2]}$&#xFF0C;&#x8FD9;&#x4E2A;&#x5C31;&#x662F;$a^{[3]}$($W^{[3]}W^{[2]}W^{[1]}x$)&#x3002;</p>
<p><img src="../images/fc03196f0b6d1c9f56fa39d0d462cfa4.png" alt=""></p>
<p>&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x77E9;&#x9635;&#x6570;&#x636E;&#x4F20;&#x9012;&#x7684;&#x534F;&#x8BAE;&#x5C06;&#x7ED9;&#x51FA;$\hat y$&#x800C;&#x4E0D;&#x662F;$y$&#x7684;&#x503C;&#x3002;</p>
<p>&#x5047;&#x8BBE;&#x6BCF;&#x4E2A;&#x6743;&#x91CD;&#x77E9;&#x9635;$W^{[l]} = \begin{bmatrix} 1.5 &amp; 0 \0 &amp; 1.5 \\end{bmatrix}$&#xFF0C;&#x4ECE;&#x6280;&#x672F;&#x4E0A;&#x6765;&#x8BB2;&#xFF0C;&#x6700;&#x540E;&#x4E00;&#x9879;&#x6709;&#x4E0D;&#x540C;&#x7EF4;&#x5EA6;&#xFF0C;&#x53EF;&#x80FD;&#x5B83;&#x5C31;&#x662F;&#x4F59;&#x4E0B;&#x7684;&#x6743;&#x91CD;&#x77E9;&#x9635;&#xFF0C;$y= W^{[1]}\begin{bmatrix} 1.5 &amp; 0 \ 0 &amp; 1.5 \\end{bmatrix}^{(L -1)}x$&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x6240;&#x6709;&#x77E9;&#x9635;&#x90FD;&#x7B49;&#x4E8E;&#x5B83;&#xFF0C;&#x5B83;&#x662F;1.5&#x500D;&#x7684;&#x5355;&#x4F4D;&#x77E9;&#x9635;&#xFF0C;&#x6700;&#x540E;&#x7684;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x5C31;&#x662F;$\hat{y}$&#xFF0C;$\hat{y}$&#x4E5F;&#x5C31;&#x662F;&#x7B49;&#x4E8E;${1.5}^{(L-1)}x$&#x3002;&#x5982;&#x679C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6765;&#x8BF4;$L$&#x503C;&#x8F83;&#x5927;&#xFF0C;&#x90A3;&#x4E48;$\hat{y}$&#x7684;&#x503C;&#x4E5F;&#x4F1A;&#x975E;&#x5E38;&#x5927;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x5B83;&#x5448;&#x6307;&#x6570;&#x7EA7;&#x589E;&#x957F;&#x7684;&#xFF0C;&#x5B83;&#x589E;&#x957F;&#x7684;&#x6BD4;&#x7387;&#x662F;${1.5}^{L}$&#xFF0C;&#x56E0;&#x6B64;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;$y$&#x7684;&#x503C;&#x5C06;&#x7206;&#x70B8;&#x5F0F;&#x589E;&#x957F;&#x3002;</p>
<p>&#x76F8;&#x53CD;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x6743;&#x91CD;&#x662F;0.5&#xFF0C;$W^{[l]} = \begin{bmatrix} 0.5&amp; 0 \ 0 &amp; 0.5 \ \end{bmatrix}$&#xFF0C;&#x5B83;&#x6BD4;1&#x5C0F;&#xFF0C;&#x8FD9;&#x9879;&#x4E5F;&#x5C31;&#x53D8;&#x6210;&#x4E86;${0.5}^{L}$&#xFF0C;&#x77E9;&#x9635;$y= W^{[1]}\begin{bmatrix} 0.5 &amp; 0 \ 0 &amp; 0.5 \\end{bmatrix}^{(L - 1)}x$&#xFF0C;&#x518D;&#x6B21;&#x5FFD;&#x7565;$W^{[L]}$&#xFF0C;&#x56E0;&#x6B64;&#x6BCF;&#x4E2A;&#x77E9;&#x9635;&#x90FD;&#x5C0F;&#x4E8E;1&#xFF0C;&#x5047;&#x8BBE;$x<em>{1}$&#x548C;$x</em>{2}$&#x90FD;&#x662F;1&#xFF0C;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x5C06;&#x53D8;&#x6210;$\frac{1}{2}$&#xFF0C;$\frac{1}{2}$&#xFF0C;$\frac{1}{4}$&#xFF0C;$\frac{1}{4}$&#xFF0C;$\frac{1}{8}$&#xFF0C;$\frac{1}{8}$&#x7B49;&#xFF0C;&#x76F4;&#x5230;&#x6700;&#x540E;&#x4E00;&#x9879;&#x53D8;&#x6210;$\frac{1}{2^{L}}$&#xFF0C;&#x6240;&#x4EE5;&#x4F5C;&#x4E3A;&#x81EA;&#x5B9A;&#x4E49;&#x51FD;&#x6570;&#xFF0C;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x7684;&#x503C;&#x5C06;&#x4EE5;&#x6307;&#x6570;&#x7EA7;&#x4E0B;&#x964D;&#xFF0C;&#x5B83;&#x662F;&#x4E0E;&#x7F51;&#x7EDC;&#x5C42;&#x6570;&#x6570;&#x91CF;$L$&#x76F8;&#x5173;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x5728;&#x6DF1;&#x5EA6;&#x7F51;&#x7EDC;&#x4E2D;&#xFF0C;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x4EE5;&#x6307;&#x6570;&#x7EA7;&#x9012;&#x51CF;&#x3002;</p>
<p>&#x6211;&#x5E0C;&#x671B;&#x4F60;&#x5F97;&#x5230;&#x7684;&#x76F4;&#x89C2;&#x7406;&#x89E3;&#x662F;&#xFF0C;&#x6743;&#x91CD;$W&#x200B;$&#x53EA;&#x6BD4;1&#x7565;&#x5927;&#x4E00;&#x70B9;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x53EA;&#x662F;&#x6BD4;&#x5355;&#x4F4D;&#x77E9;&#x9635;&#x5927;&#x4E00;&#x70B9;&#xFF0C;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x5C06;&#x7206;&#x70B8;&#x5F0F;&#x589E;&#x957F;&#xFF0C;&#x5982;&#x679C;$W&#x200B;$&#x6BD4;1&#x7565;&#x5C0F;&#x4E00;&#x70B9;&#xFF0C;&#x53EF;&#x80FD;&#x662F;$\begin{bmatrix}0.9 &amp; 0 \ 0 &amp; 0.9 \ \end{bmatrix}&#x200B;$&#x3002;</p>
<p><img src="../images/ff87a8ea1377053128cdbf5129f0203f.png" alt=""></p>
<p>&#x5728;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#xFF0C;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x5C06;&#x4EE5;&#x6307;&#x6570;&#x7EA7;&#x9012;&#x51CF;&#xFF0C;&#x867D;&#x7136;&#x6211;&#x53EA;&#x662F;&#x8BA8;&#x8BBA;&#x4E86;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x4EE5;&#x4E0E;$L$&#x76F8;&#x5173;&#x7684;&#x6307;&#x6570;&#x7EA7;&#x6570;&#x589E;&#x957F;&#x6216;&#x4E0B;&#x964D;&#xFF0C;&#x5B83;&#x4E5F;&#x9002;&#x7528;&#x4E8E;&#x4E0E;&#x5C42;&#x6570;$L$&#x76F8;&#x5173;&#x7684;&#x5BFC;&#x6570;&#x6216;&#x68AF;&#x5EA6;&#x51FD;&#x6570;&#xFF0C;&#x4E5F;&#x662F;&#x5448;&#x6307;&#x6570;&#x7EA7;&#x589E;&#x957F;&#x6216;&#x5448;&#x6307;&#x6570;&#x9012;&#x51CF;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x5F53;&#x524D;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x5047;&#x8BBE;$L=150$&#xFF0C;&#x6700;&#x8FD1;<strong>Microsoft</strong>&#x5BF9;152&#x5C42;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x7814;&#x7A76;&#x53D6;&#x5F97;&#x4E86;&#x5F88;&#x5927;&#x8FDB;&#x5C55;&#xFF0C;&#x5728;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x6216;&#x68AF;&#x5EA6;&#x51FD;&#x6570;&#x4EE5;&#x4E0E;$L$&#x76F8;&#x5173;&#x7684;&#x6307;&#x6570;&#x589E;&#x957F;&#x6216;&#x9012;&#x51CF;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x503C;&#x5C06;&#x4F1A;&#x53D8;&#x5F97;&#x6781;&#x5927;&#x6216;&#x6781;&#x5C0F;&#xFF0C;&#x4ECE;&#x800C;&#x5BFC;&#x81F4;&#x8BAD;&#x7EC3;&#x96BE;&#x5EA6;&#x4E0A;&#x5347;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x68AF;&#x5EA6;&#x6307;&#x6570;&#x5C0F;&#x4E8E;$L$&#x65F6;&#xFF0C;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7B97;&#x6CD5;&#x7684;&#x6B65;&#x957F;&#x4F1A;&#x975E;&#x5E38;&#x975E;&#x5E38;&#x5C0F;&#xFF0C;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7B97;&#x6CD5;&#x5C06;&#x82B1;&#x8D39;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#x6765;&#x5B66;&#x4E60;&#x3002;</p>
<p>&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x8BB2;&#x4E86;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x662F;&#x5982;&#x4F55;&#x4EA7;&#x751F;&#x68AF;&#x5EA6;&#x6D88;&#x5931;&#x6216;&#x7206;&#x70B8;&#x95EE;&#x9898;&#x7684;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5728;&#x5F88;&#x957F;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#xFF0C;&#x5B83;&#x66FE;&#x662F;&#x8BAD;&#x7EC3;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x963B;&#x529B;&#xFF0C;&#x867D;&#x7136;&#x6709;&#x4E00;&#x4E2A;&#x4E0D;&#x80FD;&#x5F7B;&#x5E95;&#x89E3;&#x51B3;&#x6B64;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x4F46;&#x662F;&#x5DF2;&#x5728;&#x5982;&#x4F55;&#x9009;&#x62E9;&#x521D;&#x59CB;&#x5316;&#x6743;&#x91CD;&#x95EE;&#x9898;&#x4E0A;&#x63D0;&#x4F9B;&#x4E86;&#x5F88;&#x591A;&#x5E2E;&#x52A9;&#x3002;</p>
<h3 id="111-&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x6743;&#x91CD;&#x521D;&#x59CB;&#x5316;&#xFF08;weight-initialization-for-deep-networksvanishing--exploding-gradients&#xFF09;">1.11 &#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x6743;&#x91CD;&#x521D;&#x59CB;&#x5316;&#xFF08;Weight Initialization for Deep NetworksVanishing / Exploding gradients&#xFF09;</h3>
<p>&#x4E0A;&#x8282;&#x8BFE;&#xFF0C;&#x6211;&#x4EEC;&#x5B66;&#x4E60;&#x4E86;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5982;&#x4F55;&#x4EA7;&#x751F;&#x68AF;&#x5EA6;&#x6D88;&#x5931;&#x548C;&#x68AF;&#x5EA6;&#x7206;&#x70B8;&#x95EE;&#x9898;&#xFF0C;&#x6700;&#x7EC8;&#x9488;&#x5BF9;&#x8BE5;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x60F3;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x4E0D;&#x5B8C;&#x6574;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x867D;&#x7136;&#x4E0D;&#x80FD;&#x5F7B;&#x5E95;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x5374;&#x5F88;&#x6709;&#x7528;&#xFF0C;&#x6709;&#x52A9;&#x4E8E;&#x6211;&#x4EEC;&#x4E3A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x66F4;&#x8C28;&#x614E;&#x5730;&#x9009;&#x62E9;&#x968F;&#x673A;&#x521D;&#x59CB;&#x5316;&#x53C2;&#x6570;&#xFF0C;&#x4E3A;&#x4E86;&#x66F4;&#x597D;&#x5730;&#x7406;&#x89E3;&#x5B83;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x4E3E;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x5355;&#x5143;&#x521D;&#x59CB;&#x5316;&#x5730;&#x4F8B;&#x5B50;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x6F14;&#x53D8;&#x5230;&#x6574;&#x4E2A;&#x6DF1;&#x5EA6;&#x7F51;&#x7EDC;&#x3002;</p>
<p><img src="../images/db9472c81a2cf6bb704dc398ea1cf017.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x7136;&#x540E;&#x624D;&#x662F;&#x6DF1;&#x5EA6;&#x7F51;&#x7EDC;&#x3002;</p>
<p>&#x5355;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x53EF;&#x80FD;&#x6709;4&#x4E2A;&#x8F93;&#x5165;&#x7279;&#x5F81;&#xFF0C;&#x4ECE;$x<em>{1}$&#x5230;$x</em>{4}$&#xFF0C;&#x7ECF;&#x8FC7;$a=g(z)$&#x5904;&#x7406;&#xFF0C;&#x6700;&#x7EC8;&#x5F97;&#x5230;$\hat{y}$&#xFF0C;&#x7A0D;&#x540E;&#x8BB2;&#x6DF1;&#x5EA6;&#x7F51;&#x7EDC;&#x65F6;&#xFF0C;&#x8FD9;&#x4E9B;&#x8F93;&#x5165;&#x8868;&#x793A;&#x4E3A;$a^{[l]}$&#xFF0C;&#x6682;&#x65F6;&#x6211;&#x4EEC;&#x7528;$x$&#x8868;&#x793A;&#x3002;</p>
<p>$z = w<em>{1}x</em>{1} + w<em>{2}x</em>{2} + \ldots +w<em>{n}x</em>{n}$&#xFF0C;$b=0$&#xFF0C;&#x6682;&#x65F6;&#x5FFD;&#x7565;$b$&#xFF0C;&#x4E3A;&#x4E86;&#x9884;&#x9632;$z$&#x503C;&#x8FC7;&#x5927;&#x6216;&#x8FC7;&#x5C0F;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x770B;&#x5230;$n$&#x8D8A;&#x5927;&#xFF0C;&#x4F60;&#x5E0C;&#x671B;$w<em>{i}$&#x8D8A;&#x5C0F;&#xFF0C;&#x56E0;&#x4E3A;$z$&#x662F;$w</em>{i}x<em>{i}$&#x7684;&#x548C;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x628A;&#x5F88;&#x591A;&#x6B64;&#x7C7B;&#x9879;&#x76F8;&#x52A0;&#xFF0C;&#x5E0C;&#x671B;&#x6BCF;&#x9879;&#x503C;&#x66F4;&#x5C0F;&#xFF0C;&#x6700;&#x5408;&#x7406;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x8BBE;&#x7F6E;$w</em>{i}=\frac{1}{n}$&#xFF0C;$n$&#x8868;&#x793A;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x8F93;&#x5165;&#x7279;&#x5F81;&#x6570;&#x91CF;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x4F60;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x8BBE;&#x7F6E;&#x67D0;&#x5C42;&#x6743;&#x91CD;&#x77E9;&#x9635;$w^{[l]} = np.random.randn( \text{shape})*\text{np.}\text{sqrt}(\frac{1}{n^{[l-1]}})$&#xFF0C;$n^{[l - 1]}$&#x5C31;&#x662F;&#x6211;&#x5582;&#x7ED9;&#x7B2C;$l$&#x5C42;&#x795E;&#x7ECF;&#x5355;&#x5143;&#x7684;&#x6570;&#x91CF;&#xFF08;&#x5373;&#x7B2C;$l-1$&#x5C42;&#x795E;&#x7ECF;&#x5143;&#x6570;&#x91CF;&#xFF09;&#x3002;</p>
<p><img src="../images/e4114d7dc1c6242bd96cdadb457b8959.png" alt=""></p>
<p>&#x7ED3;&#x679C;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x662F;&#x7528;&#x7684;&#x662F;<strong>Relu</strong>&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF0C;&#x800C;&#x4E0D;&#x662F;$\frac{1}{n}$&#xFF0C;&#x65B9;&#x5DEE;&#x8BBE;&#x7F6E;&#x4E3A;$\frac{2}{n}$&#xFF0C;&#x6548;&#x679C;&#x4F1A;&#x66F4;&#x597D;&#x3002;&#x4F60;&#x5E38;&#x5E38;&#x53D1;&#x73B0;&#xFF0C;&#x521D;&#x59CB;&#x5316;&#x65F6;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x4F7F;&#x7528;<strong>Relu</strong>&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x65F6;&#xFF0C;$g^{[l]}(z) =Relu(z)$,&#x5B83;&#x53D6;&#x51B3;&#x4E8E;&#x4F60;&#x5BF9;&#x968F;&#x673A;&#x53D8;&#x91CF;&#x7684;&#x719F;&#x6089;&#x7A0B;&#x5EA6;&#xFF0C;&#x8FD9;&#x662F;&#x9AD8;&#x65AF;&#x968F;&#x673A;&#x53D8;&#x91CF;&#xFF0C;&#x7136;&#x540E;&#x4E58;&#x4EE5;&#x5B83;&#x7684;&#x5E73;&#x65B9;&#x6839;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5F15;&#x7528;&#x8FD9;&#x4E2A;&#x65B9;&#x5DEE;$\frac{2}{n}$&#x3002;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x7528;&#x7684;&#x662F;$n^{[l - 1]}$&#xFF0C;&#x56E0;&#x4E3A;&#x672C;&#x4F8B;&#x4E2D;&#xFF0C;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x7684;&#x7279;&#x5F81;&#x662F;&#x4E0D;&#x53D8;&#x7684;&#x3002;&#x4F46;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;$l$&#x5C42;&#x4E0A;&#x7684;&#x6BCF;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x90FD;&#x6709;$n^{[l - 1]}$&#x4E2A;&#x8F93;&#x5165;&#x3002;&#x5982;&#x679C;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x7684;&#x8F93;&#x5165;&#x7279;&#x5F81;&#x88AB;&#x96F6;&#x5747;&#x503C;&#x548C;&#x6807;&#x51C6;&#x65B9;&#x5DEE;&#x5316;&#xFF0C;&#x65B9;&#x5DEE;&#x662F;1&#xFF0C;$z$&#x4E5F;&#x4F1A;&#x8C03;&#x6574;&#x5230;&#x76F8;&#x4F3C;&#x8303;&#x56F4;&#xFF0C;&#x8FD9;&#x5C31;&#x6CA1;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF08;&#x68AF;&#x5EA6;&#x6D88;&#x5931;&#x548C;&#x7206;&#x70B8;&#x95EE;&#x9898;&#xFF09;&#x3002;&#x4F46;&#x5B83;&#x786E;&#x5B9E;&#x964D;&#x4F4E;&#x4E86;&#x68AF;&#x5EA6;&#x6D88;&#x5931;&#x548C;&#x7206;&#x70B8;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x7ED9;&#x6743;&#x91CD;&#x77E9;&#x9635;$w$&#x8BBE;&#x7F6E;&#x4E86;&#x5408;&#x7406;&#x503C;&#xFF0C;&#x4F60;&#x4E5F;&#x77E5;&#x9053;&#xFF0C;&#x5B83;&#x4E0D;&#x80FD;&#x6BD4;1&#x5927;&#x5F88;&#x591A;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x6BD4;1&#x5C0F;&#x5F88;&#x591A;&#xFF0C;&#x6240;&#x4EE5;&#x68AF;&#x5EA6;&#x6CA1;&#x6709;&#x7206;&#x70B8;&#x6216;&#x6D88;&#x5931;&#x8FC7;&#x5FEB;&#x3002;</p>
<p><img src="../images/3decc82bf6f48903ee1fedbdb7e2c0f6.png" alt=""></p>
<p>&#x6211;&#x63D0;&#x5230;&#x4E86;&#x5176;&#x5B83;&#x53D8;&#x4F53;&#x51FD;&#x6570;&#xFF0C;&#x521A;&#x521A;&#x63D0;&#x5230;&#x7684;&#x51FD;&#x6570;&#x662F;<strong>Relu</strong>&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF0C;&#x4E00;&#x7BC7;&#x7531;<strong>Herd</strong>&#x7B49;&#x4EBA;&#x64B0;&#x5199;&#x7684;&#x8BBA;&#x6587;&#x66FE;&#x4ECB;&#x7ECD;&#x8FC7;&#x3002;&#x5BF9;&#x4E8E;&#x51E0;&#x4E2A;&#x5176;&#x5B83;&#x53D8;&#x4F53;&#x51FD;&#x6570;&#xFF0C;&#x5982;<strong>tanh</strong>&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF0C;&#x6709;&#x7BC7;&#x8BBA;&#x6587;&#x63D0;&#x5230;&#xFF0C;&#x5E38;&#x91CF;1&#x6BD4;&#x5E38;&#x91CF;2&#x7684;&#x6548;&#x7387;&#x66F4;&#x9AD8;&#xFF0C;&#x5BF9;&#x4E8E;<strong>tanh</strong>&#x51FD;&#x6570;&#x6765;&#x8BF4;&#xFF0C;&#x5B83;&#x662F;$\sqrt{\frac{1}{n^{[l-1]}}}$&#xFF0C;&#x8FD9;&#x91CC;&#x5E73;&#x65B9;&#x6839;&#x7684;&#x4F5C;&#x7528;&#x4E0E;&#x8FD9;&#x4E2A;&#x516C;&#x5F0F;&#x4F5C;&#x7528;&#x76F8;&#x540C;($\text{np.}\text{sqrt}(\frac{1}{n^{[l-1]}})$)&#xFF0C;&#x5B83;&#x9002;&#x7528;&#x4E8E;<strong>tanh</strong>&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF0C;&#x88AB;&#x79F0;&#x4E3A;<strong>Xavier</strong>&#x521D;&#x59CB;&#x5316;&#x3002;<strong>Yoshua Bengio</strong>&#x548C;&#x4ED6;&#x7684;&#x540C;&#x4E8B;&#x8FD8;&#x63D0;&#x51FA;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x5728;&#x4E00;&#x4E9B;&#x8BBA;&#x6587;&#x4E2D;&#x770B;&#x5230;&#x8FC7;&#xFF0C;&#x5B83;&#x4EEC;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x516C;&#x5F0F;$\sqrt{\frac{2}{n^{[l-1]} + n^{\left[l\right]}}}$&#x3002;&#x5176;&#x5B83;&#x7406;&#x8BBA;&#x5DF2;&#x5BF9;&#x6B64;&#x8BC1;&#x660E;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x7528;<strong>Relu</strong>&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6700;&#x5E38;&#x7528;&#x7684;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF0C;&#x6211;&#x4F1A;&#x7528;&#x8FD9;&#x4E2A;&#x516C;&#x5F0F;$\text{np.}\text{sqrt}(\frac{2}{n^{[l-1]}})$&#xFF0C;&#x5982;&#x679C;&#x4F7F;&#x7528;<strong>tanh</strong>&#x51FD;&#x6570;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x516C;&#x5F0F;$\sqrt{\frac{1}{n^{[l-1]}}}$&#xFF0C;&#x6709;&#x4E9B;&#x4F5C;&#x8005;&#x4E5F;&#x4F1A;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x3002;</p>
<p>&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x516C;&#x5F0F;&#x53EA;&#x662F;&#x7ED9;&#x4F60;&#x4E00;&#x4E2A;&#x8D77;&#x70B9;&#xFF0C;&#x5B83;&#x4EEC;&#x7ED9;&#x51FA;&#x521D;&#x59CB;&#x5316;&#x6743;&#x91CD;&#x77E9;&#x9635;&#x7684;&#x65B9;&#x5DEE;&#x7684;&#x9ED8;&#x8BA4;&#x503C;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x6DFB;&#x52A0;&#x65B9;&#x5DEE;&#xFF0C;&#x65B9;&#x5DEE;&#x53C2;&#x6570;&#x5219;&#x662F;&#x53E6;&#x4E00;&#x4E2A;&#x4F60;&#x9700;&#x8981;&#x8C03;&#x6574;&#x7684;&#x8D85;&#x7EA7;&#x53C2;&#x6570;&#xFF0C;&#x53EF;&#x4EE5;&#x7ED9;&#x516C;&#x5F0F;$\text{np.}\text{sqrt}(\frac{2}{n^{[l-1]}})$&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x4E58;&#x6570;&#x53C2;&#x6570;&#xFF0C;&#x8C03;&#x4F18;&#x4F5C;&#x4E3A;&#x8D85;&#x7EA7;&#x53C2;&#x6570;&#x6FC0;&#x589E;&#x4E00;&#x4EFD;&#x5B50;&#x7684;&#x4E58;&#x5B50;&#x53C2;&#x6570;&#x3002;&#x6709;&#x65F6;&#x8C03;&#x4F18;&#x8BE5;&#x8D85;&#x7EA7;&#x53C2;&#x6570;&#x6548;&#x679C;&#x4E00;&#x822C;&#xFF0C;&#x8FD9;&#x5E76;&#x4E0D;&#x662F;&#x6211;&#x60F3;&#x8C03;&#x4F18;&#x7684;&#x9996;&#x8981;&#x8D85;&#x7EA7;&#x53C2;&#x6570;&#xFF0C;&#x4F46;&#x6211;&#x53D1;&#x73B0;&#x8C03;&#x4F18;&#x8FC7;&#x7A0B;&#x4E2D;&#x4EA7;&#x751F;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x867D;&#x7136;&#x8C03;&#x4F18;&#x8BE5;&#x53C2;&#x6570;&#x80FD;&#x8D77;&#x5230;&#x4E00;&#x5B9A;&#x4F5C;&#x7528;&#xFF0C;&#x4F46;&#x8003;&#x8651;&#x5230;&#x76F8;&#x6BD4;&#x8C03;&#x4F18;&#xFF0C;&#x5176;&#x5B83;&#x8D85;&#x7EA7;&#x53C2;&#x6570;&#x7684;&#x91CD;&#x8981;&#x6027;&#xFF0C;&#x6211;&#x901A;&#x5E38;&#x628A;&#x5B83;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x653E;&#x5F97;&#x6BD4;&#x8F83;&#x4F4E;&#x3002;</p>
<p>&#x5E0C;&#x671B;&#x4F60;&#x73B0;&#x5728;&#x5BF9;&#x68AF;&#x5EA6;&#x6D88;&#x5931;&#x6216;&#x7206;&#x70B8;&#x95EE;&#x9898;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x4E3A;&#x6743;&#x91CD;&#x521D;&#x59CB;&#x5316;&#x5408;&#x7406;&#x503C;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x76F4;&#x89C2;&#x8BA4;&#x8BC6;&#xFF0C;&#x5E0C;&#x671B;&#x4F60;&#x8BBE;&#x7F6E;&#x7684;&#x6743;&#x91CD;&#x77E9;&#x9635;&#x65E2;&#x4E0D;&#x4F1A;&#x589E;&#x957F;&#x8FC7;&#x5FEB;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x592A;&#x5FEB;&#x4E0B;&#x964D;&#x5230;0&#xFF0C;&#x4ECE;&#x800C;&#x8BAD;&#x7EC3;&#x51FA;&#x4E00;&#x4E2A;&#x6743;&#x91CD;&#x6216;&#x68AF;&#x5EA6;&#x4E0D;&#x4F1A;&#x589E;&#x957F;&#x6216;&#x6D88;&#x5931;&#x8FC7;&#x5FEB;&#x7684;&#x6DF1;&#x5EA6;&#x7F51;&#x7EDC;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x8BAD;&#x7EC3;&#x6DF1;&#x5EA6;&#x7F51;&#x7EDC;&#x65F6;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x52A0;&#x5FEB;&#x8BAD;&#x7EC3;&#x901F;&#x5EA6;&#x7684;&#x6280;&#x5DE7;&#x3002;</p>
<h3 id="112-&#x68AF;&#x5EA6;&#x7684;&#x6570;&#x503C;&#x903C;&#x8FD1;&#xFF08;numerical-approximation-of-gradients&#xFF09;">1.12 &#x68AF;&#x5EA6;&#x7684;&#x6570;&#x503C;&#x903C;&#x8FD1;&#xFF08;Numerical approximation of gradients&#xFF09;</h3>
<p>&#x5728;&#x5B9E;&#x65BD;<strong>backprop</strong>&#x65F6;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x6D4B;&#x8BD5;&#x53EB;&#x505A;&#x68AF;&#x5EA6;&#x68C0;&#x9A8C;&#xFF0C;&#x5B83;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x786E;&#x4FDD;<strong>backprop</strong>&#x6B63;&#x786E;&#x5B9E;&#x65BD;&#x3002;&#x56E0;&#x4E3A;&#x6709;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x867D;&#x7136;&#x5199;&#x4E0B;&#x4E86;&#x8FD9;&#x4E9B;&#x65B9;&#x7A0B;&#x5F0F;&#xFF0C;&#x5374;&#x4E0D;&#x80FD;100%&#x786E;&#x5B9A;&#xFF0C;&#x6267;&#x884C;<strong>backprop</strong>&#x7684;&#x6240;&#x6709;&#x7EC6;&#x8282;&#x90FD;&#x662F;&#x6B63;&#x786E;&#x7684;&#x3002;&#x4E3A;&#x4E86;&#x9010;&#x6E10;&#x5B9E;&#x73B0;&#x68AF;&#x5EA6;&#x68C0;&#x9A8C;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x8BF4;&#x8BF4;&#x5982;&#x4F55;&#x8BA1;&#x7B97;&#x68AF;&#x5EA6;&#x7684;&#x6570;&#x503C;&#x903C;&#x8FD1;&#xFF0C;&#x4E0B;&#x8282;&#x8BFE;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8BA8;&#x8BBA;&#x5982;&#x4F55;&#x5728;<strong>backprop</strong>&#x4E2D;&#x6267;&#x884C;&#x68AF;&#x5EA6;&#x68C0;&#x9A8C;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;<strong>backprop</strong>&#x6B63;&#x786E;&#x5B9E;&#x65BD;&#x3002;</p>
<p><img src="../images/91cde35a0fc9c11a98f16ad2797f20a7.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x5148;&#x753B;&#x51FA;&#x51FD;&#x6570;$f$&#xFF0C;&#x6807;&#x8BB0;&#x4E3A;$f\left( \theta \right)$&#xFF0C;$f\left( \theta \right)=\theta^{3}$&#xFF0C;&#x5148;&#x770B;&#x4E00;&#x4E0B;$\theta$&#x7684;&#x503C;&#xFF0C;&#x5047;&#x8BBE;$\theta=1$&#xFF0C;&#x4E0D;&#x589E;&#x5927;$\theta$&#x7684;&#x503C;&#xFF0C;&#x800C;&#x662F;&#x5728;$\theta$ &#x53F3;&#x4FA7;&#xFF0C;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;$\theta +\varepsilon$&#xFF0C;&#x5728;$\theta$&#x5DE6;&#x4FA7;&#xFF0C;&#x8BBE;&#x7F6E;$\theta -\varepsilon$&#x3002;&#x56E0;&#x6B64;$\theta=1$&#xFF0C;$\theta +\varepsilon =1.01,\theta -\varepsilon =0.99$,&#xFF0C;&#x8DDF;&#x4EE5;&#x524D;&#x4E00;&#x6837;&#xFF0C;$\varepsilon$&#x7684;&#x503C;&#x4E3A;0.01&#xFF0C;&#x770B;&#x4E0B;&#x8FD9;&#x4E2A;&#x5C0F;&#x4E09;&#x89D2;&#x5F62;&#xFF0C;&#x8BA1;&#x7B97;&#x9AD8;&#x548C;&#x5BBD;&#x7684;&#x6BD4;&#x503C;&#xFF0C;&#x5C31;&#x662F;&#x66F4;&#x51C6;&#x786E;&#x7684;&#x68AF;&#x5EA6;&#x9884;&#x4F30;&#xFF0C;&#x9009;&#x62E9;$f$&#x51FD;&#x6570;&#x5728;$\theta -\varepsilon$&#x4E0A;&#x7684;&#x8FD9;&#x4E2A;&#x70B9;&#xFF0C;&#x7528;&#x8FD9;&#x4E2A;&#x8F83;&#x5927;&#x4E09;&#x89D2;&#x5F62;&#x7684;&#x9AD8;&#x6BD4;&#x4E0A;&#x5BBD;&#xFF0C;&#x6280;&#x672F;&#x4E0A;&#x7684;&#x539F;&#x56E0;&#x6211;&#x5C31;&#x4E0D;&#x8BE6;&#x7EC6;&#x89E3;&#x91CA;&#x4E86;&#xFF0C;&#x8F83;&#x5927;&#x4E09;&#x89D2;&#x5F62;&#x7684;&#x9AD8;&#x5BBD;&#x6BD4;&#x503C;&#x66F4;&#x63A5;&#x8FD1;&#x4E8E;$\theta$&#x7684;&#x5BFC;&#x6570;&#xFF0C;&#x628A;&#x53F3;&#x4E0A;&#x89D2;&#x7684;&#x4E09;&#x89D2;&#x5F62;&#x4E0B;&#x79FB;&#xFF0C;&#x597D;&#x50CF;&#x6709;&#x4E86;&#x4E24;&#x4E2A;&#x4E09;&#x89D2;&#x5F62;&#xFF0C;&#x53F3;&#x4E0A;&#x89D2;&#x6709;&#x4E00;&#x4E2A;&#xFF0C;&#x5DE6;&#x4E0B;&#x89D2;&#x6709;&#x4E00;&#x4E2A;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x7EFF;&#x8272;&#x5927;&#x4E09;&#x89D2;&#x5F62;&#x540C;&#x65F6;&#x8003;&#x8651;&#x4E86;&#x8FD9;&#x4E24;&#x4E2A;&#x5C0F;&#x4E09;&#x89D2;&#x5F62;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5F97;&#x5230;&#x7684;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5355;&#x8FB9;&#x516C;&#x5DEE;&#x800C;&#x662F;&#x4E00;&#x4E2A;&#x53CC;&#x8FB9;&#x516C;&#x5DEE;&#x3002;</p>
<p><img src="../images/b24ad9ce9fdc4a32be4d98915d8f6ffb.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x5199;&#x4E00;&#x4E0B;&#x6570;&#x636E;&#x7B97;&#x5F0F;&#xFF0C;&#x56FE;&#x4E2D;&#x7EFF;&#x8272;&#x4E09;&#x89D2;&#x5F62;&#x4E0A;&#x8FB9;&#x7684;&#x70B9;&#x7684;&#x503C;&#x662F;$f( \theta +\varepsilon )$&#xFF0C;&#x4E0B;&#x8FB9;&#x7684;&#x70B9;&#x662F;$f( \theta-\varepsilon)$&#xFF0C;&#x8FD9;&#x4E2A;&#x4E09;&#x89D2;&#x5F62;&#x7684;&#x9AD8;&#x5EA6;&#x662F;$f( \theta +\varepsilon)-f(\theta -\varepsilon)$&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x5BBD;&#x5EA6;&#x90FD;&#x662F;&#x3B5;&#xFF0C;&#x6240;&#x4EE5;&#x4E09;&#x89D2;&#x5F62;&#x7684;&#x5BBD;&#x5EA6;&#x662F;$2\varepsilon$&#xFF0C;&#x9AD8;&#x5BBD;&#x6BD4;&#x503C;&#x4E3A;$\frac{f(\theta + \varepsilon ) - (\theta -\varepsilon)}{2\varepsilon}$&#xFF0C;&#x5B83;&#x7684;&#x671F;&#x671B;&#x503C;&#x63A5;&#x8FD1;$g( \theta)$&#xFF0C;$f( \theta)=\theta^{3}$&#x4F20;&#x5165;&#x53C2;&#x6570;&#x503C;&#xFF0C;$\frac {f\left( \theta + \varepsilon \right) - f(\theta -\varepsilon)}{2\varepsilon} = \frac&#xFF5B;&#xFF5B;(1.01)}^{3} - {(0.99)}^{3}}{2 \times0.01}$&#xFF0C;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x6682;&#x505C;&#x89C6;&#x9891;&#xFF0C;&#x7528;&#x8BA1;&#x7B97;&#x5668;&#x7B97;&#x7B97;&#x7ED3;&#x679C;&#xFF0C;&#x7ED3;&#x679C;&#x5E94;&#x8BE5;&#x662F;3.0001&#xFF0C;&#x800C;&#x524D;&#x9762;&#x4E00;&#x5F20;&#x5E7B;&#x706F;&#x7247;&#x4E0A;&#x9762;&#x662F;&#xFF0C;&#x5F53;$\theta =1$&#x65F6;&#xFF0C;$g( \theta)=3\theta^{2} =3$&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E24;&#x4E2A;$g(\theta)$&#x503C;&#x975E;&#x5E38;&#x63A5;&#x8FD1;&#xFF0C;&#x903C;&#x8FD1;&#x8BEF;&#x5DEE;&#x4E3A;0.0001&#xFF0C;&#x524D;&#x4E00;&#x5F20;&#x5E7B;&#x706F;&#x7247;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x8003;&#x8651;&#x4E86;&#x5355;&#x8FB9;&#x516C;&#x5DEE;&#xFF0C;&#x5373;&#x4ECE;$\theta $&#x5230;$\theta +\varepsilon$&#x4E4B;&#x95F4;&#x7684;&#x8BEF;&#x5DEE;&#xFF0C;$g( \theta)$&#x7684;&#x503C;&#x4E3A;3.0301&#xFF0C;&#x903C;&#x8FD1;&#x8BEF;&#x5DEE;&#x662F;0.03&#xFF0C;&#x4E0D;&#x662F;0.0001&#xFF0C;&#x6240;&#x4EE5;&#x4F7F;&#x7528;&#x53CC;&#x8FB9;&#x8BEF;&#x5DEE;&#x7684;&#x65B9;&#x6CD5;&#x66F4;&#x903C;&#x8FD1;&#x5BFC;&#x6570;&#xFF0C;&#x5176;&#x7ED3;&#x679C;&#x63A5;&#x8FD1;&#x4E8E;3&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x66F4;&#x52A0;&#x786E;&#x4FE1;&#xFF0C;$g( \theta)$&#x53EF;&#x80FD;&#x662F;$f$&#x5BFC;&#x6570;&#x7684;&#x6B63;&#x786E;&#x5B9E;&#x73B0;&#xFF0C;&#x5728;&#x68AF;&#x5EA6;&#x68C0;&#x9A8C;&#x548C;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x4E2D;&#x4F7F;&#x7528;&#x8BE5;&#x65B9;&#x6CD5;&#x65F6;&#xFF0C;&#x6700;&#x7EC8;&#xFF0C;&#x5B83;&#x4E0E;&#x8FD0;&#x884C;&#x4E24;&#x6B21;&#x5355;&#x8FB9;&#x516C;&#x5DEE;&#x7684;&#x901F;&#x5EA6;&#x4E00;&#x6837;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x8FD8;&#x662F;&#x975E;&#x5E38;&#x503C;&#x5F97;&#x4F7F;&#x7528;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x7684;&#x7ED3;&#x679C;&#x66F4;&#x51C6;&#x786E;&#x3002;</p>
<p><img src="../images/35a2e86581eab4665634593870fe5180.png" alt=""></p>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E9B;&#x4F60;&#x53EF;&#x80FD;&#x6BD4;&#x8F83;&#x719F;&#x6089;&#x7684;&#x5FAE;&#x79EF;&#x5206;&#x7684;&#x7406;&#x8BBA;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x592A;&#x660E;&#x767D;&#x6211;&#x8BB2;&#x7684;&#x8FD9;&#x4E9B;&#x7406;&#x8BBA;&#x4E5F;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x5BFC;&#x6570;&#x7684;&#x5B98;&#x65B9;&#x5B9A;&#x4E49;&#x662F;&#x9488;&#x5BF9;&#x503C;&#x5F88;&#x5C0F;&#x7684;$\varepsilon$&#xFF0C;&#x5BFC;&#x6570;&#x7684;&#x5B98;&#x65B9;&#x5B9A;&#x4E49;&#x662F;$f^{&apos;}\theta) = \operatorname{}\frac{f( \theta + \varepsilon) -f(\theta -\varepsilon)}{2\varepsilon}$&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E0A;&#x8FC7;&#x5FAE;&#x79EF;&#x5206;&#x8BFE;&#xFF0C;&#x5E94;&#x8BE5;&#x5B66;&#x8FC7;&#x65E0;&#x7A77;&#x5C3D;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x6211;&#x5C31;&#x4E0D;&#x5728;&#x8FD9;&#x91CC;&#x8BB2;&#x4E86;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x975E;&#x96F6;&#x7684;$\varepsilon$&#xFF0C;&#x5B83;&#x7684;&#x903C;&#x8FD1;&#x8BEF;&#x5DEE;&#x53EF;&#x4EE5;&#x5199;&#x6210;$O(\varepsilon^{2})$&#xFF0C;&#x3B5;&#x503C;&#x975E;&#x5E38;&#x5C0F;&#xFF0C;&#x5982;&#x679C;$\varepsilon=0.01$&#xFF0C;$\varepsilon^{2}=0.0001$&#xFF0C;&#x5927;&#x5199;&#x7B26;&#x53F7;$O$&#x7684;&#x542B;&#x4E49;&#x662F;&#x6307;&#x903C;&#x8FD1;&#x8BEF;&#x5DEE;&#x5176;&#x5B9E;&#x662F;&#x4E00;&#x4E9B;&#x5E38;&#x91CF;&#x4E58;&#x4EE5;$\varepsilon^{2}$&#xFF0C;&#x4F46;&#x5B83;&#x7684;&#x786E;&#x662F;&#x5F88;&#x51C6;&#x786E;&#x7684;&#x903C;&#x8FD1;&#x8BEF;&#x5DEE;&#xFF0C;&#x6240;&#x4EE5;&#x5927;&#x5199;$O$&#x7684;&#x5E38;&#x91CF;&#x6709;&#x65F6;&#x662F;1&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x7528;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x516C;&#x5F0F;&#x903C;&#x8FD1;&#x8BEF;&#x5DEE;&#x5C31;&#x662F;$O(\varepsilon)$&#xFF0C;&#x5F53;$\varepsilon$&#x5C0F;&#x4E8E;1&#x65F6;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;$\varepsilon$&#x6BD4;$\varepsilon^{2}$&#x5927;&#x5F88;&#x591A;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x516C;&#x5F0F;&#x8FD1;&#x4F3C;&#x503C;&#x8FDC;&#x6CA1;&#x6709;&#x5DE6;&#x8FB9;&#x516C;&#x5F0F;&#x7684;&#x51C6;&#x786E;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x6267;&#x884C;&#x68AF;&#x5EA6;&#x68C0;&#x9A8C;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x53CC;&#x8FB9;&#x8BEF;&#x5DEE;&#xFF0C;&#x5373;$\frac{f\left(\theta + \varepsilon \right) - f(\theta -\varepsilon)}{2\varepsilon}$&#xFF0C;&#x800C;&#x4E0D;&#x4F7F;&#x7528;&#x5355;&#x8FB9;&#x516C;&#x5DEE;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4E0D;&#x591F;&#x51C6;&#x786E;&#x3002;</p>
<p><img src="../images/1b2617461ed10089bc61ad273c84594f.png" alt=""></p>
<p>&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x7406;&#x89E3;&#x4E0A;&#x9762;&#x4E24;&#x6761;&#x7ED3;&#x8BBA;&#xFF0C;&#x6240;&#x6709;&#x516C;&#x5F0F;&#x90FD;&#x5728;&#x8FD9;&#x513F;&#xFF0C;&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x5FAE;&#x79EF;&#x5206;&#x548C;&#x6570;&#x503C;&#x903C;&#x8FD1;&#x6709;&#x6240;&#x4E86;&#x89E3;&#xFF0C;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x5DF2;&#x7ECF;&#x8DB3;&#x591F;&#x591A;&#x4E86;&#xFF0C;&#x91CD;&#x70B9;&#x662F;&#x8981;&#x8BB0;&#x4F4F;&#xFF0C;&#x53CC;&#x8FB9;&#x8BEF;&#x5DEE;&#x516C;&#x5F0F;&#x7684;&#x7ED3;&#x679C;&#x66F4;&#x51C6;&#x786E;&#xFF0C;&#x4E0B;&#x8282;&#x8BFE;&#x6211;&#x4EEC;&#x505A;&#x68AF;&#x5EA6;&#x68C0;&#x9A8C;&#x65F6;&#x5C31;&#x4F1A;&#x7528;&#x5230;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x4ECA;&#x5929;&#x6211;&#x4EEC;&#x8BB2;&#x4E86;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x53CC;&#x8FB9;&#x8BEF;&#x5DEE;&#x6765;&#x5224;&#x65AD;&#x522B;&#x4EBA;&#x7ED9;&#x4F60;&#x7684;&#x51FD;&#x6570;$g( \theta)$&#xFF0C;&#x662F;&#x5426;&#x6B63;&#x786E;&#x5B9E;&#x73B0;&#x4E86;&#x51FD;&#x6570;$f$&#x7684;&#x504F;&#x5BFC;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x6765;&#x68C0;&#x9A8C;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x662F;&#x5426;&#x5F97;&#x4EE5;&#x6B63;&#x786E;&#x5B9E;&#x65BD;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x6B63;&#x786E;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x6709;bug&#x9700;&#x8981;&#x4F60;&#x6765;&#x89E3;&#x51B3;&#x3002;</p>
<h3 id="113-&#x68AF;&#x5EA6;&#x68C0;&#x9A8C;&#xFF08;gradient-checking&#xFF09;">1.13 &#x68AF;&#x5EA6;&#x68C0;&#x9A8C;&#xFF08;Gradient checking&#xFF09;</h3>
<p>&#x68AF;&#x5EA6;&#x68C0;&#x9A8C;&#x5E2E;&#x6211;&#x4EEC;&#x8282;&#x7701;&#x4E86;&#x5F88;&#x591A;&#x65F6;&#x95F4;&#xFF0C;&#x4E5F;&#x591A;&#x6B21;&#x5E2E;&#x6211;&#x53D1;&#x73B0;<strong>backprop</strong>&#x5B9E;&#x65BD;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;bug&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x5982;&#x4F55;&#x5229;&#x7528;&#x5B83;&#x6765;&#x8C03;&#x8BD5;&#x6216;&#x68C0;&#x9A8C;<strong>backprop</strong>&#x7684;&#x5B9E;&#x65BD;&#x662F;&#x5426;&#x6B63;&#x786E;&#x3002;</p>
<p>&#x5047;&#x8BBE;&#x4F60;&#x7684;&#x7F51;&#x7EDC;&#x4E2D;&#x542B;&#x6709;&#x4E0B;&#x5217;&#x53C2;&#x6570;&#xFF0C;$W^{[1]}$&#x548C;$b^{[1]}$&#x2026;&#x2026;$W^{[l]}$&#x548C;$b^{[l]}$&#xFF0C;&#x4E3A;&#x4E86;&#x6267;&#x884C;&#x68AF;&#x5EA6;&#x68C0;&#x9A8C;&#xFF0C;&#x9996;&#x5148;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#xFF0C;&#x628A;&#x6240;&#x6709;&#x53C2;&#x6570;&#x8F6C;&#x6362;&#x6210;&#x4E00;&#x4E2A;&#x5DE8;&#x5927;&#x7684;&#x5411;&#x91CF;&#x6570;&#x636E;&#xFF0C;&#x4F60;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x628A;&#x77E9;&#x9635;$W$&#x8F6C;&#x6362;&#x6210;&#x4E00;&#x4E2A;&#x5411;&#x91CF;&#xFF0C;&#x628A;&#x6240;&#x6709;$W$&#x77E9;&#x9635;&#x8F6C;&#x6362;&#x6210;&#x5411;&#x91CF;&#x4E4B;&#x540E;&#xFF0C;&#x505A;&#x8FDE;&#x63A5;&#x8FD0;&#x7B97;&#xFF0C;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x5DE8;&#x578B;&#x5411;&#x91CF;$\theta$&#xFF0C;&#x8BE5;&#x5411;&#x91CF;&#x8868;&#x793A;&#x4E3A;&#x53C2;&#x6570;$\theta$&#xFF0C;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;$J$&#x662F;&#x6240;&#x6709;$W$&#x548C;$b$&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x73B0;&#x5728;&#x4F60;&#x5F97;&#x5230;&#x4E86;&#x4E00;&#x4E2A;$\theta$&#x7684;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;$J$&#xFF08;&#x5373;$J(\theta)$&#xFF09;&#x3002;&#x63A5;&#x7740;&#xFF0C;&#x4F60;&#x5F97;&#x5230;&#x4E0E;$W$&#x548C;$b$&#x987A;&#x5E8F;&#x76F8;&#x540C;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4F60;&#x540C;&#x6837;&#x53EF;&#x4EE5;&#x628A;$dW^{[1]}$&#x548C;${db}^{[1]}$&#x2026;&#x2026;${dW}^{[l]}$&#x548C;${db}^{[l]}$&#x8F6C;&#x6362;&#x6210;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5411;&#x91CF;&#xFF0C;&#x7528;&#x5B83;&#x4EEC;&#x6765;&#x521D;&#x59CB;&#x5316;&#x5927;&#x5411;&#x91CF;$d\theta$&#xFF0C;&#x5B83;&#x4E0E;$\theta$&#x5177;&#x6709;&#x76F8;&#x540C;&#x7EF4;&#x5EA6;&#x3002;</p>
<p>&#x540C;&#x6837;&#x7684;&#xFF0C;&#x628A;$dW^{[1]}$&#x8F6C;&#x6362;&#x6210;&#x77E9;&#x9635;&#xFF0C;$db^{[1]}$&#x5DF2;&#x7ECF;&#x662F;&#x4E00;&#x4E2A;&#x5411;&#x91CF;&#x4E86;&#xFF0C;&#x76F4;&#x5230;&#x628A;${dW}^{[l]}$&#x8F6C;&#x6362;&#x6210;&#x77E9;&#x9635;&#xFF0C;&#x8FD9;&#x6837;&#x6240;&#x6709;&#x7684;$dW$&#x90FD;&#x5DF2;&#x7ECF;&#x662F;&#x77E9;&#x9635;&#xFF0C;&#x6CE8;&#x610F;$dW^{[1]}$&#x4E0E;$W^{[1]}$&#x5177;&#x6709;&#x76F8;&#x540C;&#x7EF4;&#x5EA6;&#xFF0C;$db^{[1]}$&#x4E0E;$b^{[1]}$&#x5177;&#x6709;&#x76F8;&#x540C;&#x7EF4;&#x5EA6;&#x3002;&#x7ECF;&#x8FC7;&#x76F8;&#x540C;&#x7684;&#x8F6C;&#x6362;&#x548C;&#x8FDE;&#x63A5;&#x8FD0;&#x7B97;&#x64CD;&#x4F5C;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x6240;&#x6709;&#x5BFC;&#x6570;&#x8F6C;&#x6362;&#x6210;&#x4E00;&#x4E2A;&#x5927;&#x5411;&#x91CF;$d\theta$&#xFF0C;&#x5B83;&#x4E0E;$\theta$&#x5177;&#x6709;&#x76F8;&#x540C;&#x7EF4;&#x5EA6;&#xFF0C;&#x73B0;&#x5728;&#x7684;&#x95EE;&#x9898;&#x662F;$d\theta$&#x548C;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;$J$&#x7684;&#x68AF;&#x5EA6;&#x6216;&#x5761;&#x5EA6;&#x6709;&#x4EC0;&#x4E48;&#x5173;&#x7CFB;&#xFF1F;</p>
<p><img src="../images/94fb79f5694c802a5261298e54157e14.png" alt=""></p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x5B9E;&#x65BD;&#x68AF;&#x5EA6;&#x68C0;&#x9A8C;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x82F1;&#x8BED;&#x91CC;&#x901A;&#x5E38;&#x7B80;&#x79F0;&#x4E3A;&#x201C;<strong>grad check</strong>&#x201D;&#xFF0C;&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x6E05;&#x695A;$J$&#x662F;&#x8D85;&#x53C2;&#x6570;$\theta$&#x7684;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x5C06;J&#x51FD;&#x6570;&#x5C55;&#x5F00;&#x4E3A;$J(\theta<em>{1},\theta</em>{2},\theta<em>{3},\ldots\ldots)$&#xFF0C;&#x4E0D;&#x8BBA;&#x8D85;&#x7EA7;&#x53C2;&#x6570;&#x5411;&#x91CF;$\theta$&#x7684;&#x7EF4;&#x5EA6;&#x662F;&#x591A;&#x5C11;&#xFF0C;&#x4E3A;&#x4E86;&#x5B9E;&#x65BD;&#x68AF;&#x5EA6;&#x68C0;&#x9A8C;&#xFF0C;&#x4F60;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x5FAA;&#x73AF;&#x6267;&#x884C;&#xFF0C;&#x4ECE;&#x800C;&#x5BF9;&#x6BCF;&#x4E2A;$i$&#x4E5F;&#x5C31;&#x662F;&#x5BF9;&#x6BCF;&#x4E2A;$\theta$&#x7EC4;&#x6210;&#x5143;&#x7D20;&#x8BA1;&#x7B97;$d\theta</em>{\text{approx}}[i]$&#x7684;&#x503C;&#xFF0C;&#x6211;&#x4F7F;&#x7528;&#x53CC;&#x8FB9;&#x8BEF;&#x5DEE;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;</p>
<p>$d\theta<em>{\text{approx}}\left[i \right] = \frac{J\left( \theta</em>{1},\theta<em>{2},\ldots\theta</em>{i} + \varepsilon,\ldots \right) - J\left( \theta<em>{1},\theta</em>{2},\ldots\theta_{i} - \varepsilon,\ldots \right)}{2\varepsilon}$</p>
<p>&#x53EA;&#x5BF9;$\theta_{i}&#x200B;$&#x589E;&#x52A0;$\varepsilon&#x200B;$&#xFF0C;&#x5176;&#x5B83;&#x9879;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x53CC;&#x8FB9;&#x8BEF;&#x5DEE;&#xFF0C;&#x5BF9;&#x53E6;&#x4E00;&#x8FB9;&#x505A;&#x540C;&#x6837;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x662F;&#x51CF;&#x53BB;$\varepsilon&#x200B;$&#xFF0C;$\theta&#x200B;$&#x5176;&#x5B83;&#x9879;&#x5168;&#x90FD;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#x3002;</p>
<p><img src="../images/f56f0cdc90730068109a6e20fcd41724.png" alt=""></p>
<p>&#x4ECE;&#x4E0A;&#x8282;&#x8BFE;&#x4E2D;&#x6211;&#x4EEC;&#x4E86;&#x89E3;&#x5230;&#x8FD9;&#x4E2A;&#x503C;&#xFF08;$d\theta<em>{\text{approx}}\left[i \right]$&#xFF09;&#x5E94;&#x8BE5;&#x903C;&#x8FD1;$d\theta\left[i \right]$=$\frac{\partial J}{\partial\theta</em>{i}}$&#xFF0C;$d\theta\left[i \right]$&#x662F;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x7684;&#x504F;&#x5BFC;&#x6570;&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x9700;&#x8981;&#x5BF9;i&#x7684;&#x6BCF;&#x4E2A;&#x503C;&#x90FD;&#x6267;&#x884C;&#x8FD9;&#x4E2A;&#x8FD0;&#x7B97;&#xFF0C;&#x6700;&#x540E;&#x5F97;&#x5230;&#x4E24;&#x4E2A;&#x5411;&#x91CF;&#xFF0C;&#x5F97;&#x5230;$d\theta$&#x7684;&#x903C;&#x8FD1;&#x503C;$d\theta_{\text{approx}}$&#xFF0C;&#x5B83;&#x4E0E;$d\theta$&#x5177;&#x6709;&#x76F8;&#x540C;&#x7EF4;&#x5EA6;&#xFF0C;&#x5B83;&#x4EEC;&#x4E24;&#x4E2A;&#x4E0E;$\theta$&#x5177;&#x6709;&#x76F8;&#x540C;&#x7EF4;&#x5EA6;&#xFF0C;&#x4F60;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x9A8C;&#x8BC1;&#x8FD9;&#x4E9B;&#x5411;&#x91CF;&#x662F;&#x5426;&#x5F7C;&#x6B64;&#x63A5;&#x8FD1;&#x3002;</p>
<p><img src="../images/bed27b1d469acaf24dc1a7c1a7cdc086.png" alt=""></p>
<p>&#x5177;&#x4F53;&#x6765;&#x8BF4;&#xFF0C;&#x5982;&#x4F55;&#x5B9A;&#x4E49;&#x4E24;&#x4E2A;&#x5411;&#x91CF;&#x662F;&#x5426;&#x771F;&#x7684;&#x63A5;&#x8FD1;&#x5F7C;&#x6B64;&#xFF1F;&#x6211;&#x4E00;&#x822C;&#x505A;&#x4E0B;&#x5217;&#x8FD0;&#x7B97;&#xFF0C;&#x8BA1;&#x7B97;&#x8FD9;&#x4E24;&#x4E2A;&#x5411;&#x91CF;&#x7684;&#x8DDD;&#x79BB;&#xFF0C;$d\theta<em>{\text{approx}}\left[i \right] - d\theta[i]$&#x7684;&#x6B27;&#x51E0;&#x91CC;&#x5F97;&#x8303;&#x6570;&#xFF0C;&#x6CE8;&#x610F;&#x8FD9;&#x91CC;&#xFF08;${||d\theta</em>{\text{approx}} -d\theta||}_{2}$&#xFF09;&#x6CA1;&#x6709;&#x5E73;&#x65B9;&#xFF0C;&#x5B83;&#x662F;&#x8BEF;&#x5DEE;&#x5E73;&#x65B9;&#x4E4B;&#x548C;&#xFF0C;&#x7136;&#x540E;&#x6C42;&#x5E73;&#x65B9;&#x6839;&#xFF0C;&#x5F97;&#x5230;&#x6B27;&#x5F0F;&#x8DDD;&#x79BB;&#xFF0C;&#x7136;&#x540E;&#x7528;&#x5411;&#x91CF;&#x957F;&#x5EA6;&#x5F52;&#x4E00;&#x5316;&#xFF0C;&#x4F7F;&#x7528;&#x5411;&#x91CF;&#x957F;&#x5EA6;&#x7684;&#x6B27;&#x51E0;&#x91CC;&#x5F97;&#x8303;&#x6570;&#x3002;&#x5206;&#x6BCD;&#x53EA;&#x662F;&#x7528;&#x4E8E;&#x9884;&#x9632;&#x8FD9;&#x4E9B;&#x5411;&#x91CF;&#x592A;&#x5C0F;&#x6216;&#x592A;&#x5927;&#xFF0C;&#x5206;&#x6BCD;&#x4F7F;&#x5F97;&#x8FD9;&#x4E2A;&#x65B9;&#x7A0B;&#x5F0F;&#x53D8;&#x6210;&#x6BD4;&#x7387;&#xFF0C;&#x6211;&#x4EEC;&#x5B9E;&#x9645;&#x6267;&#x884C;&#x8FD9;&#x4E2A;&#x65B9;&#x7A0B;&#x5F0F;&#xFF0C;$\varepsilon$&#x53EF;&#x80FD;&#x4E3A;$10^{-7}$&#xFF0C;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x5185;&#x7684;$\varepsilon$&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x53D1;&#x73B0;&#x8BA1;&#x7B97;&#x65B9;&#x7A0B;&#x5F0F;&#x5F97;&#x5230;&#x7684;&#x503C;&#x4E3A;$10^{-7}$&#x6216;&#x66F4;&#x5C0F;&#xFF0C;&#x8FD9;&#x5C31;&#x5F88;&#x597D;&#xFF0C;&#x8FD9;&#x5C31;&#x610F;&#x5473;&#x7740;&#x5BFC;&#x6570;&#x903C;&#x8FD1;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x5B83;&#x7684;&#x503C;&#x975E;&#x5E38;&#x5C0F;&#x3002;</p>
<p><img src="../images/f223102bc7d144b66ad9b2ffa4a85f00.png" alt=""></p>
<p>&#x5982;&#x679C;&#x5B83;&#x7684;&#x503C;&#x5728;$10^{-5}$&#x8303;&#x56F4;&#x5185;&#xFF0C;&#x6211;&#x5C31;&#x8981;&#x5C0F;&#x5FC3;&#x4E86;&#xFF0C;&#x4E5F;&#x8BB8;&#x8FD9;&#x4E2A;&#x503C;&#x6CA1;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x6211;&#x4F1A;&#x518D;&#x6B21;&#x68C0;&#x67E5;&#x8FD9;&#x4E2A;&#x5411;&#x91CF;&#x7684;&#x6240;&#x6709;&#x9879;&#xFF0C;&#x786E;&#x4FDD;&#x6CA1;&#x6709;&#x4E00;&#x9879;&#x8BEF;&#x5DEE;&#x8FC7;&#x5927;&#xFF0C;&#x53EF;&#x80FD;&#x8FD9;&#x91CC;&#x6709;<strong>bug</strong>&#x3002;</p>
<p>&#x5982;&#x679C;&#x5DE6;&#x8FB9;&#x8FD9;&#x4E2A;&#x65B9;&#x7A0B;&#x5F0F;&#x7ED3;&#x679C;&#x662F;$10^{-3}$&#xFF0C;&#x6211;&#x5C31;&#x4F1A;&#x62C5;&#x5FC3;&#x662F;&#x5426;&#x5B58;&#x5728;<strong>bug</strong>&#xFF0C;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x5E94;&#x8BE5;&#x6BD4;$10^{- 3}$&#x5C0F;&#x5F88;&#x591A;&#xFF0C;&#x5982;&#x679C;&#x6BD4;$10^{-3}$&#x5927;&#x5F88;&#x591A;&#xFF0C;&#x6211;&#x5C31;&#x4F1A;&#x5F88;&#x62C5;&#x5FC3;&#xFF0C;&#x62C5;&#x5FC3;&#x662F;&#x5426;&#x5B58;&#x5728;<strong>bug</strong>&#x3002;&#x8FD9;&#x65F6;&#x5E94;&#x8BE5;&#x4ED4;&#x7EC6;&#x68C0;&#x67E5;&#x6240;&#x6709;$\theta$&#x9879;&#xFF0C;&#x770B;&#x662F;&#x5426;&#x6709;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x7684;$i$&#x503C;&#xFF0C;&#x4F7F;&#x5F97;$d\theta_{\text{approx}}\left[i \right]$&#x4E0E;$ d\theta[i]$&#x5927;&#x4E0D;&#x76F8;&#x540C;&#xFF0C;&#x5E76;&#x7528;&#x5B83;&#x6765;&#x8FFD;&#x8E2A;&#x4E00;&#x4E9B;&#x6C42;&#x5BFC;&#x8BA1;&#x7B97;&#x662F;&#x5426;&#x6B63;&#x786E;&#xFF0C;&#x7ECF;&#x8FC7;&#x4E00;&#x4E9B;&#x8C03;&#x8BD5;&#xFF0C;&#x6700;&#x7EC8;&#x7ED3;&#x679C;&#x4F1A;&#x662F;&#x8FD9;&#x79CD;&#x975E;&#x5E38;&#x5C0F;&#x7684;&#x503C;&#xFF08;$10^{-7}$&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;&#x4F60;&#x7684;&#x5B9E;&#x65BD;&#x53EF;&#x80FD;&#x662F;&#x6B63;&#x786E;&#x7684;&#x3002;</p>
<p><img src="../images/07fd11e7b28ef0ab7d3b6d23b19a8fdc.png" alt=""></p>
<p>&#x5728;&#x5B9E;&#x65BD;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x65F6;&#xFF0C;&#x6211;&#x7ECF;&#x5E38;&#x9700;&#x8981;&#x6267;&#x884C;<strong>foreprop</strong>&#x548C;<strong>backprop</strong>&#xFF0C;&#x7136;&#x540E;&#x6211;&#x53EF;&#x80FD;&#x53D1;&#x73B0;&#x8FD9;&#x4E2A;&#x68AF;&#x5EA6;&#x68C0;&#x9A8C;&#x6709;&#x4E00;&#x4E2A;&#x76F8;&#x5BF9;&#x8F83;&#x5927;&#x7684;&#x503C;&#xFF0C;&#x6211;&#x4F1A;&#x6000;&#x7591;&#x5B58;&#x5728;<strong>bug</strong>&#xFF0C;&#x7136;&#x540E;&#x5F00;&#x59CB;&#x8C03;&#x8BD5;&#xFF0C;&#x8C03;&#x8BD5;&#xFF0C;&#x8C03;&#x8BD5;&#xFF0C;&#x8C03;&#x8BD5;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x540E;&#xFF0C;&#x6211;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x5F88;&#x5C0F;&#x7684;&#x68AF;&#x5EA6;&#x68C0;&#x9A8C;&#x503C;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x53EF;&#x4EE5;&#x5F88;&#x81EA;&#x4FE1;&#x7684;&#x8BF4;&#xFF0C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5B9E;&#x65BD;&#x662F;&#x6B63;&#x786E;&#x7684;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x4F60;&#x5DF2;&#x7ECF;&#x4E86;&#x89E3;&#x4E86;&#x68AF;&#x5EA6;&#x68C0;&#x9A8C;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#xFF0C;&#x5B83;&#x5E2E;&#x52A9;&#x6211;&#x5728;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5B9E;&#x65BD;&#x4E2D;&#x53D1;&#x73B0;&#x4E86;&#x5F88;&#x591A;<strong>bug</strong>&#xFF0C;&#x5E0C;&#x671B;&#x5B83;&#x5BF9;&#x4F60;&#x4E5F;&#x6709;&#x6240;&#x5E2E;&#x52A9;&#x3002;</p>
<h3 id="114-&#x68AF;&#x5EA6;&#x68C0;&#x9A8C;&#x5E94;&#x7528;&#x7684;&#x6CE8;&#x610F;&#x4E8B;&#x9879;&#xFF08;gradient-checking-implementation-notes&#xFF09;">1.14 &#x68AF;&#x5EA6;&#x68C0;&#x9A8C;&#x5E94;&#x7528;&#x7684;&#x6CE8;&#x610F;&#x4E8B;&#x9879;&#xFF08;Gradient Checking Implementation Notes&#xFF09;</h3>
<p>&#x8FD9;&#x8282;&#x8BFE;&#xFF0C;&#x5206;&#x4EAB;&#x4E00;&#x4E9B;&#x5173;&#x4E8E;&#x5982;&#x4F55;&#x5728;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5B9E;&#x65BD;&#x68AF;&#x5EA6;&#x68C0;&#x9A8C;&#x7684;&#x5B9E;&#x7528;&#x6280;&#x5DE7;&#x548C;&#x6CE8;&#x610F;&#x4E8B;&#x9879;&#x3002;</p>
<p><img src="../images/L2_week1_24.png" alt=""></p>
<p>&#x9996;&#x5148;&#xFF0C;&#x4E0D;&#x8981;&#x5728;&#x8BAD;&#x7EC3;&#x4E2D;&#x4F7F;&#x7528;&#x68AF;&#x5EA6;&#x68C0;&#x9A8C;&#xFF0C;&#x5B83;&#x53EA;&#x7528;&#x4E8E;&#x8C03;&#x8BD5;&#x3002;&#x6211;&#x7684;&#x610F;&#x601D;&#x662F;&#xFF0C;&#x8BA1;&#x7B97;&#x6240;&#x6709;$i$&#x503C;&#x7684;$d\theta_{\text{approx}}\left[i\right]$&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x6F2B;&#x957F;&#x7684;&#x8BA1;&#x7B97;&#x8FC7;&#x7A0B;&#xFF0C;&#x4E3A;&#x4E86;&#x5B9E;&#x65BD;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x4F7F;&#x7528;$W$&#x548C;$b$ <strong>backprop</strong>&#x6765;&#x8BA1;&#x7B97;$d\theta$&#xFF0C;&#x5E76;&#x4F7F;&#x7528;<strong>backprop</strong>&#x6765;&#x8BA1;&#x7B97;&#x5BFC;&#x6570;&#xFF0C;&#x53EA;&#x8981;&#x8C03;&#x8BD5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x624D;&#x4F1A;&#x8BA1;&#x7B97;&#x5B83;&#xFF0C;&#x6765;&#x786E;&#x8BA4;&#x6570;&#x503C;&#x662F;&#x5426;&#x63A5;&#x8FD1;$d\theta$&#x3002;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x4F60;&#x4F1A;&#x5173;&#x95ED;&#x68AF;&#x5EA6;&#x68C0;&#x9A8C;&#xFF0C;&#x68AF;&#x5EA6;&#x68C0;&#x9A8C;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x8FED;&#x4EE3;&#x8FC7;&#x7A0B;&#x90FD;&#x4E0D;&#x6267;&#x884C;&#x5B83;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x592A;&#x6162;&#x4E86;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x70B9;&#xFF0C;&#x5982;&#x679C;&#x7B97;&#x6CD5;&#x7684;&#x68AF;&#x5EA6;&#x68C0;&#x9A8C;&#x5931;&#x8D25;&#xFF0C;&#x8981;&#x68C0;&#x67E5;&#x6240;&#x6709;&#x9879;&#xFF0C;&#x68C0;&#x67E5;&#x6BCF;&#x4E00;&#x9879;&#xFF0C;&#x5E76;&#x8BD5;&#x7740;&#x627E;&#x51FA;<strong>bug</strong>&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5982;&#x679C;$d\theta<em>{\text{approx}}\left[i\right]$&#x4E0E;d&#x3B8;[i]&#x7684;&#x503C;&#x76F8;&#x5DEE;&#x5F88;&#x5927;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x67E5;&#x627E;&#x4E0D;&#x540C;&#x7684;i&#x503C;&#xFF0C;&#x770B;&#x770B;&#x662F;&#x54EA;&#x4E2A;&#x5BFC;&#x81F4;$d\theta</em>{\text{approx}}\left[i\right]$&#x4E0E;$d\theta\left[i\right]$&#x7684;&#x503C;&#x76F8;&#x5DEE;&#x8FD9;&#x4E48;&#x591A;&#x3002;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x53D1;&#x73B0;&#xFF0C;&#x76F8;&#x5BF9;&#x67D0;&#x4E9B;&#x5C42;&#x6216;&#x67D0;&#x5C42;&#x7684;$\theta$&#x6216;$d\theta$&#x7684;&#x503C;&#x76F8;&#x5DEE;&#x5F88;&#x5927;&#xFF0C;&#x4F46;&#x662F;$\text{dw}^{[l]}$&#x7684;&#x5404;&#x9879;&#x975E;&#x5E38;&#x63A5;&#x8FD1;&#xFF0C;&#x6CE8;&#x610F;$\theta$&#x7684;&#x5404;&#x9879;&#x4E0E;$b$&#x548C;$w$&#x7684;&#x5404;&#x9879;&#x90FD;&#x662F;&#x4E00;&#x4E00;&#x5BF9;&#x5E94;&#x7684;&#xFF0C;&#x8FD9;&#x65F6;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x5728;&#x8BA1;&#x7B97;&#x53C2;&#x6570;$b$&#x7684;&#x5BFC;&#x6570;$db$&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x5B58;&#x5728;<strong>bug</strong>&#x3002;&#x53CD;&#x8FC7;&#x6765;&#x4E5F;&#x662F;&#x4E00;&#x6837;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x53D1;&#x73B0;&#x5B83;&#x4EEC;&#x7684;&#x503C;&#x76F8;&#x5DEE;&#x5F88;&#x5927;&#xFF0C;$d\theta_{\text{approx}}\left[i\right]$&#x7684;&#x503C;&#x4E0E;$d\theta\left[i\right]$&#x7684;&#x503C;&#x76F8;&#x5DEE;&#x5F88;&#x5927;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x9879;&#x76EE;&#x90FD;&#x6765;&#x81EA;&#x4E8E;$dw$&#x6216;&#x67D0;&#x5C42;&#x7684;$dw$&#xFF0C;&#x53EF;&#x80FD;&#x5E2E;&#x4F60;&#x5B9A;&#x4F4D;bug&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x867D;&#x7136;&#x672A;&#x5FC5;&#x80FD;&#x591F;&#x5E2E;&#x4F60;&#x51C6;&#x786E;&#x5B9A;&#x4F4D;bug&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x4F46;&#x5B83;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x4F60;&#x4F30;&#x6D4B;&#x9700;&#x8981;&#x5728;&#x54EA;&#x4E9B;&#x5730;&#x65B9;&#x8FFD;&#x8E2A;<strong>bug</strong>&#x3002;</p>
<p>&#x7B2C;&#x4E09;&#x70B9;&#xFF0C;&#x5728;&#x5B9E;&#x65BD;&#x68AF;&#x5EA6;&#x68C0;&#x9A8C;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x6B63;&#x5219;&#x5316;&#xFF0C;&#x8BF7;&#x6CE8;&#x610F;&#x6B63;&#x5219;&#x9879;&#x3002;&#x5982;&#x679C;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;$J(\theta) = \frac{1}{m}\sum<em>{}^{}{L(\hat y^{(i)},y^{(i)})} + \frac{\lambda}{2m}\sum</em>{}^{}{||W^{[l]}||}^{2}$&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;$J$&#x7684;&#x5B9A;&#x4E49;&#xFF0C;$d\theta$&#x7B49;&#x4E8E;&#x4E0E;$\theta$&#x76F8;&#x5173;&#x7684;$J$&#x51FD;&#x6570;&#x7684;&#x68AF;&#x5EA6;&#xFF0C;&#x5305;&#x62EC;&#x8FD9;&#x4E2A;&#x6B63;&#x5219;&#x9879;&#xFF0C;&#x8BB0;&#x4F4F;&#x4E00;&#x5B9A;&#x8981;&#x5305;&#x62EC;&#x8FD9;&#x4E2A;&#x6B63;&#x5219;&#x9879;&#x3002;</p>
<p>&#x7B2C;&#x56DB;&#x70B9;&#xFF0C;&#x68AF;&#x5EA6;&#x68C0;&#x9A8C;&#x4E0D;&#x80FD;&#x4E0E;<strong>dropout</strong>&#x540C;&#x65F6;&#x4F7F;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x6B21;&#x8FED;&#x4EE3;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;<strong>dropout</strong>&#x4F1A;&#x968F;&#x673A;&#x6D88;&#x9664;&#x9690;&#x85CF;&#x5C42;&#x5355;&#x5143;&#x7684;&#x4E0D;&#x540C;&#x5B50;&#x96C6;&#xFF0C;&#x96BE;&#x4EE5;&#x8BA1;&#x7B97;<strong>dropout</strong>&#x5728;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x4E0A;&#x7684;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;$J&#x200B;$&#x3002;&#x56E0;&#x6B64;<strong>dropout</strong>&#x53EF;&#x4F5C;&#x4E3A;&#x4F18;&#x5316;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;$J&#x200B;$&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x662F;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;J&#x88AB;&#x5B9A;&#x4E49;&#x4E3A;&#x5BF9;&#x6240;&#x6709;&#x6307;&#x6570;&#x6781;&#x5927;&#x7684;&#x8282;&#x70B9;&#x5B50;&#x96C6;&#x6C42;&#x548C;&#x3002;&#x800C;&#x5728;&#x4EFB;&#x4F55;&#x8FED;&#x4EE3;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E9B;&#x8282;&#x70B9;&#x90FD;&#x6709;&#x53EF;&#x80FD;&#x88AB;&#x6D88;&#x9664;&#xFF0C;&#x6240;&#x4EE5;&#x5F88;&#x96BE;&#x8BA1;&#x7B97;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;$J&#x200B;$&#x3002;&#x4F60;&#x53EA;&#x662F;&#x5BF9;&#x6210;&#x672C;&#x51FD;&#x6570;&#x505A;&#x62BD;&#x6837;&#xFF0C;&#x7528;<strong>dropout</strong>&#xFF0C;&#x6BCF;&#x6B21;&#x968F;&#x673A;&#x6D88;&#x9664;&#x4E0D;&#x540C;&#x7684;&#x5B50;&#x96C6;&#xFF0C;&#x6240;&#x4EE5;&#x5F88;&#x96BE;&#x7528;&#x68AF;&#x5EA6;&#x68C0;&#x9A8C;&#x6765;&#x53CC;&#x91CD;&#x68C0;&#x9A8C;<strong>dropout</strong>&#x7684;&#x8BA1;&#x7B97;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4E00;&#x822C;&#x4E0D;&#x540C;&#x65F6;&#x4F7F;&#x7528;&#x68AF;&#x5EA6;&#x68C0;&#x9A8C;&#x548C;<strong>dropout</strong>&#x3002;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8FD9;&#x6837;&#x505A;&#xFF0C;&#x53EF;&#x4EE5;&#x628A;<strong>dropout</strong>&#x4E2D;&#x7684;<strong>keepprob</strong>&#x8BBE;&#x7F6E;&#x4E3A;1.0&#xFF0C;&#x7136;&#x540E;&#x6253;&#x5F00;<strong>dropout</strong>&#xFF0C;&#x5E76;&#x5BC4;&#x5E0C;&#x671B;&#x4E8E;<strong>dropout</strong>&#x7684;&#x5B9E;&#x65BD;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x4F60;&#x8FD8;&#x53EF;&#x4EE5;&#x505A;&#x70B9;&#x522B;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x4FEE;&#x6539;&#x8282;&#x70B9;&#x4E22;&#x5931;&#x6A21;&#x5F0F;&#x786E;&#x5B9A;&#x68AF;&#x5EA6;&#x68C0;&#x9A8C;&#x662F;&#x6B63;&#x786E;&#x7684;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x6211;&#x4E00;&#x822C;&#x4E0D;&#x8FD9;&#x4E48;&#x505A;&#xFF0C;&#x6211;&#x5EFA;&#x8BAE;&#x5173;&#x95ED;<strong>dropout</strong>&#xFF0C;&#x7528;&#x68AF;&#x5EA6;&#x68C0;&#x9A8C;&#x8FDB;&#x884C;&#x53CC;&#x91CD;&#x68C0;&#x67E5;&#xFF0C;&#x5728;&#x6CA1;&#x6709;<strong>dropout</strong>&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F60;&#x7684;&#x7B97;&#x6CD5;&#x81F3;&#x5C11;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x7136;&#x540E;&#x6253;&#x5F00;<strong>dropout</strong>&#x3002;</p>
<p>&#x6700;&#x540E;&#x4E00;&#x70B9;&#xFF0C;&#x4E5F;&#x662F;&#x6BD4;&#x8F83;&#x5FAE;&#x5999;&#x7684;&#x4E00;&#x70B9;&#xFF0C;&#x73B0;&#x5B9E;&#x4E2D;&#x51E0;&#x4E4E;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x3002;&#x5F53;$w$&#x548C;$b$&#x63A5;&#x8FD1;0&#x65F6;&#xFF0C;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7684;&#x5B9E;&#x65BD;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x5728;&#x968F;&#x673A;&#x521D;&#x59CB;&#x5316;&#x8FC7;&#x7A0B;&#x4E2D;&#x2026;&#x2026;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x8FD0;&#x884C;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x65F6;&#xFF0C;$w$&#x548C;$b$&#x53D8;&#x5F97;&#x66F4;&#x5927;&#x3002;&#x53EF;&#x80FD;&#x53EA;&#x6709;&#x5728;$w$&#x548C;$b$&#x63A5;&#x8FD1;0&#x65F6;&#xFF0C;<strong>backprop</strong>&#x7684;&#x5B9E;&#x65BD;&#x624D;&#x662F;&#x6B63;&#x786E;&#x7684;&#x3002;&#x4F46;&#x662F;&#x5F53;$W$&#x548C;$b$&#x53D8;&#x5927;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x4E0D;&#x51C6;&#x786E;&#x3002;&#x4F60;&#x9700;&#x8981;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;&#xFF0C;&#x6211;&#x4E0D;&#x7ECF;&#x5E38;&#x8FD9;&#x4E48;&#x505A;&#xFF0C;&#x5C31;&#x662F;&#x5728;&#x968F;&#x673A;&#x521D;&#x59CB;&#x5316;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x8FD0;&#x884C;&#x68AF;&#x5EA6;&#x68C0;&#x9A8C;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x8BAD;&#x7EC3;&#x7F51;&#x7EDC;&#xFF0C;$w$&#x548C;$b$&#x4F1A;&#x6709;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x8FDC;&#x79BB;0&#xFF0C;&#x5982;&#x679C;&#x968F;&#x673A;&#x521D;&#x59CB;&#x5316;&#x503C;&#x6BD4;&#x8F83;&#x5C0F;&#xFF0C;&#x53CD;&#x590D;&#x8BAD;&#x7EC3;&#x7F51;&#x7EDC;&#x4E4B;&#x540E;&#xFF0C;&#x518D;&#x91CD;&#x65B0;&#x8FD0;&#x884C;&#x68AF;&#x5EA6;&#x68C0;&#x9A8C;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x68AF;&#x5EA6;&#x68C0;&#x9A8C;&#xFF0C;&#x606D;&#x559C;&#x5927;&#x5BB6;&#xFF0C;&#x8FD9;&#x662F;&#x672C;&#x5468;&#x6700;&#x540E;&#x4E00;&#x8BFE;&#x4E86;&#x3002;&#x56DE;&#x987E;&#x8FD9;&#x4E00;&#x5468;&#xFF0C;&#x6211;&#x4EEC;&#x8BB2;&#x4E86;&#x5982;&#x4F55;&#x914D;&#x7F6E;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x9A8C;&#x8BC1;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#xFF0C;&#x5982;&#x4F55;&#x5206;&#x6790;&#x504F;&#x5DEE;&#x548C;&#x65B9;&#x5DEE;&#xFF0C;&#x5982;&#x4F55;&#x5904;&#x7406;&#x9AD8;&#x504F;&#x5DEE;&#x6216;&#x9AD8;&#x65B9;&#x5DEE;&#x4EE5;&#x53CA;&#x9AD8;&#x504F;&#x5DEE;&#x548C;&#x9AD8;&#x65B9;&#x5DEE;&#x5E76;&#x5B58;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x4F55;&#x5728;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x5E94;&#x7528;&#x4E0D;&#x540C;&#x5F62;&#x5F0F;&#x7684;&#x6B63;&#x5219;&#x5316;&#xFF0C;&#x5982;$L2&#x200B;$&#x6B63;&#x5219;&#x5316;&#x548C;<strong>dropout</strong>&#xFF0C;&#x8FD8;&#x6709;&#x52A0;&#x5FEB;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8BAD;&#x7EC3;&#x901F;&#x5EA6;&#x7684;&#x6280;&#x5DE7;&#xFF0C;&#x6700;&#x540E;&#x662F;&#x68AF;&#x5EA6;&#x68C0;&#x9A8C;&#x3002;&#x8FD9;&#x4E00;&#x5468;&#x6211;&#x4EEC;&#x5B66;&#x4E60;&#x4E86;&#x5F88;&#x591A;&#x5185;&#x5BB9;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x672C;&#x5468;&#x7F16;&#x7A0B;&#x4F5C;&#x4E1A;&#x4E2D;&#x591A;&#x591A;&#x7EC3;&#x4E60;&#x8FD9;&#x4E9B;&#x6982;&#x5FF5;&#x3002;&#x795D;&#x4F60;&#x597D;&#x8FD0;&#xFF0C;&#x671F;&#x5F85;&#x4E0B;&#x5468;&#x518D;&#x89C1;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="lesson1-week4.html" class="navigation navigation-prev " aria-label="Previous page: 第四周：深层神经网络">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="lesson2-week2.html" class="navigation navigation-next " aria-label="Next page: 第二周：优化算法">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第一周：深度学习的实践层面","level":"2.1","depth":1,"next":{"title":"第二周：优化算法","level":"2.2","depth":1,"path":"lesson2-week2.md","ref":"lesson2-week2.md","articles":[]},"previous":{"title":"第四周：深层神经网络","level":"1.5","depth":1,"path":"lesson1-week4.md","ref":"lesson1-week4.md","articles":[]},"dir":"ltr"},"config":{"plugins":["fontsettings","sharing","-lunr","-search","search-pro","highlight","livereload","back-to-top-button","cdn"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"cdn":{"url":"//cdn.jsdelivr.net/gh/zhepama/C-Sharp-Playground@gh-pages/","img_url":"//cdn.jsdelivr.net/gh/zhepama/C-Sharp-Playground@gh-pages/"},"fontsettings":{"family":"sans","size":2,"theme":"white"},"sharing":{"all":["facebook","google","twitter","weibo","instapaper"],"facebook":true,"google":false,"instapaper":false,"twitter":true,"vk":false,"weibo":false},"search-pro":{},"highlight":{},"livereload":{},"back-to-top-button":{},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"深度学习教程","language":"zh-hans","links":{"sidebar":{"编程网":"https://www.editcode.net"}},"gitbook":"*"},"file":{"path":"lesson2-week1.md","mtime":"2021-05-09T12:44:05.498Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-05-09T13:30:39.812Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook.js"></script>
    <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/theme.js"></script>
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="https://cdn.jsdelivr.net/gh/editcode2021/gitbook@master/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    

    </body>
</html>

