
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>零、前言 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="1.机器学习概览.html" />
    
    
    <link rel="prev" href="../" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Sklearn 与 TensorFlow 机器学习实用指南
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="0.前言.html">
            
                <a href="0.前言.html">
            
                    
                    零、前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="1.机器学习概览.html">
            
                <a href="1.机器学习概览.html">
            
                    
                    一、机器学习概览
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="2.一个完整的机器学习项目.html">
            
                <a href="2.一个完整的机器学习项目.html">
            
                    
                    二、一个完整的机器学习项目
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="3.分类.html">
            
                <a href="3.分类.html">
            
                    
                    三、分类
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="4.训练模型.html">
            
                <a href="4.训练模型.html">
            
                    
                    四、训练模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="5.支持向量机.html">
            
                <a href="5.支持向量机.html">
            
                    
                    五、支持向量机
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="6.决策树.html">
            
                <a href="6.决策树.html">
            
                    
                    六、决策树
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="7.集成学习和随机森林.html">
            
                <a href="7.集成学习和随机森林.html">
            
                    
                    七、集成学习和随机森林
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="8.降维.html">
            
                <a href="8.降维.html">
            
                    
                    八、降维
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="9.启动并运行_TensorFlow.html">
            
                <a href="9.启动并运行_TensorFlow.html">
            
                    
                    九、启动并运行 TensorFlow
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="10.人工神经网络介绍.html">
            
                <a href="10.人工神经网络介绍.html">
            
                    
                    十、人工神经网络介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="11.训练深层神经网络.html">
            
                <a href="11.训练深层神经网络.html">
            
                    
                    十一、训练深层神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="12.设备和服务器上的分布式_TensorFlow.html">
            
                <a href="12.设备和服务器上的分布式_TensorFlow.html">
            
                    
                    十二、设备和服务器上的分布式 TensorFlow
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="13.卷积神经网络.html">
            
                <a href="13.卷积神经网络.html">
            
                    
                    十三、卷积神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="14.循环神经网络.html">
            
                <a href="14.循环神经网络.html">
            
                    
                    十四、循环神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="15.自编码器.html">
            
                <a href="15.自编码器.html">
            
                    
                    十五、自编码器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="16.强化学习.html">
            
                <a href="16.强化学习.html">
            
                    
                    十六、强化学习
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="B.机器学习项目清单.html">
            
                <a href="B.机器学习项目清单.html">
            
                    
                    附录 B、机器学习项目清单
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="C.SVM_对偶问题.html">
            
                <a href="C.SVM_对偶问题.html">
            
                    
                    附录 C、SVM 对偶问题
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="D.自动微分.html">
            
                <a href="D.自动微分.html">
            
                    
                    附录 D、自动微分
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >零、前言</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x96F6;&#x3001;&#x524D;&#x8A00;">&#x96F6;&#x3001;&#x524D;&#x8A00;</h1>
<blockquote>
<p>&#x8BD1;&#x8005;&#xFF1A;<a href="https://github.com/chenyyx" target="_blank">@&#x5C0F;&#x7476;</a></p>
<p>&#x6821;&#x5BF9;&#x8005;&#xFF1A;<a href="https://github.com/chenyyx" target="_blank">@&#x5C0F;&#x7476;</a></p>
</blockquote>
<h2 id="1&#x3001;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6D77;&#x5578;">1&#x3001;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6D77;&#x5578;</h2>
<p>2006&#x5E74;&#xFF0C;Geoffrey Hinton&#x7B49;&#x4EBA;&#x53D1;&#x8868;&#x4E86;&#x4E00;&#x7BC7;&#x8BBA;&#x6587;&#xFF0C;&#x5C55;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x8BAD;&#x7EC3;&#x80FD;&#x591F;&#x8BC6;&#x522B;&#x5177;&#x6709;&#x6700;&#x65B0;&#x7CBE;&#x5EA6;&#xFF08;&gt; 98%&#xFF09;&#x7684;&#x624B;&#x5199;&#x6570;&#x5B57;&#x7684;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;&#x4ED6;&#x4EEC;&#x79F0;&#x8FD9;&#x79CD;&#x6280;&#x672F;&#x4E3A;&#x201C;Deep Learning&#x201D;&#x3002;&#x5F53;&#x65F6;&#xFF0C;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x8BAD;&#x7EC3;&#x88AB;&#x5E7F;&#x6CDB;&#x8BA4;&#x4E3A;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x5927;&#x591A;&#x6570;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x81EA; 20 &#x4E16;&#x7EAA; 90 &#x5E74;&#x4EE3;&#x4EE5;&#x6765;&#x5C31;&#x653E;&#x5F03;&#x4E86;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x3002;&#x8FD9;&#x7BC7;&#x8BBA;&#x6587;&#x91CD;&#x65B0;&#x6FC0;&#x8D77;&#x4E86;&#x79D1;&#x5B66;&#x754C;&#x7684;&#x5174;&#x8DA3;&#xFF0C;&#x4E0D;&#x4E45;&#x4E4B;&#x540E;&#xFF0C;&#x8BB8;&#x591A;&#x65B0;&#x53D1;&#x8868;&#x7684;&#x8BBA;&#x6587;&#x8868;&#x660E;&#xFF0C;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x4E0D;&#x4EC5;&#x662F;&#x53EF;&#x80FD;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x80FD;&#x591F;&#x53D6;&#x5F97;&#x5176;&#x4ED6;&#x7684; Machine Learning &#x6280;&#x672F;&#x90FD;&#x96BE;&#x4EE5;&#x5339;&#x914D;&#x7684;&#x4EE4;&#x4EBA;&#x5174;&#x594B;&#x7684;&#x6210;&#x5C31;&#xFF08;&#x501F;&#x52A9;&#x5DE8;&#x5927;&#x7684;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#x548C;&#x5927;&#x91CF;&#x7684;&#x6570;&#x636E;&#xFF09;&#x3002;&#x8FD9;&#x79CD;&#x70ED;&#x60C5;&#x5F88;&#x5FEB;&#x6269;&#x5C55;&#x5230;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x8BB8;&#x591A;&#x7684;&#x5176;&#x4ED6;&#x9886;&#x57DF;&#x3002;</p>
<p>Deep Learning &#x5FEB;&#x901F;&#x53D1;&#x5C55;&#x7684; 10 &#x5E74;&#x95F4;&#x548C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5DF2;&#x7ECF;&#x5F81;&#x670D;&#x4E86;&#x8FD9;&#x4E2A;&#x884C;&#x4E1A;&#xFF1A;&#x5B83;&#x73B0;&#x5728;&#x6210;&#x4E3A;&#x4E86;&#x5F53;&#x4ECA;&#x9AD8;&#x79D1;&#x6280;&#x4EA7;&#x54C1;&#x4E2D;&#x7684;&#x8BB8;&#x591A;&#x9ED1;&#x79D1;&#x6280;&#x7684;&#x6838;&#x5FC3;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x4E3A;&#x60A8;&#x7684;&#x7F51;&#x7EDC;&#x641C;&#x7D22;&#x7ED3;&#x679C;&#x6392;&#x540D;&#xFF0C;&#x4E3A;&#x667A;&#x80FD;&#x624B;&#x673A;&#x7684;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#x63D0;&#x4F9B;&#x652F;&#x6301;&#xFF0C;&#x4E3A;&#x60A8;&#x63A8;&#x8350;&#x60A8;&#x559C;&#x6B22;&#x7684;&#x89C6;&#x9891;&#xFF0C;&#x5728;&#x56F4;&#x68CB;&#x6E38;&#x620F;&#x4E2D;&#x51FB;&#x8D25;&#x4E16;&#x754C;&#x51A0;&#x519B;&#x3002;&#x5728;&#x4F60;&#x77E5;&#x9053;&#x4E4B;&#x524D;&#xFF0C;&#x5B83;&#x90FD;&#x53EF;&#x80FD;&#x4F1A;&#x9A7E;&#x9A76;&#x60A8;&#x7684;&#x6C7D;&#x8F66;&#x3002;</p>
<h2 id="2&#x3001;&#x60A8;&#x9879;&#x76EE;&#x4E2D;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;">2&#x3001;&#x60A8;&#x9879;&#x76EE;&#x4E2D;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;</h2>
<p>&#x73B0;&#x5728;&#x4F60;&#x662F;&#x4E0D;&#x662F;&#x5BF9;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x611F;&#x5230;&#x5174;&#x594B;&#xFF0C;&#x5E76;&#x4E14;&#x5F88;&#x4E50;&#x610F;&#x52A0;&#x5165;&#x5230;&#x8FD9;&#x4E2A;&#x9635;&#x8425;&#x4E2D;&#xFF1F;
&#x4E5F;&#x8BB8;&#x4F60;&#x5E0C;&#x671B;&#x7ED9;&#x81EA;&#x5DF1;&#x5236;&#x9020;&#x7684;&#x673A;&#x5668;&#x4EBA;&#x8D4B;&#x4E88;&#x4E00;&#x4E2A;&#x81EA;&#x5DF1;&#x7684;&#x5927;&#x8111;&#xFF1F;&#x8BA9;&#x5B83;&#x53EF;&#x4EE5;&#x9762;&#x90E8;&#x8BC6;&#x522B;&#xFF1F;&#x8FD8;&#x662F;&#x5B66;&#x4F1A;&#x5230;&#x5904;&#x8D70;&#x8D70;&#xFF1F;</p>
<p>&#x4E5F;&#x8BB8;&#x4F60;&#x7684;&#x516C;&#x53F8;&#x6709;&#x5927;&#x91CF;&#x7684;&#x6570;&#x636E;&#xFF08;&#x7528;&#x6237;&#x65E5;&#x5FD7;&#xFF0C;&#x8D22;&#x52A1;&#x6570;&#x636E;&#xFF0C;&#x751F;&#x4EA7;&#x6570;&#x636E;&#xFF0C;&#x673A;&#x5668;&#x4F20;&#x611F;&#x5668;&#x6570;&#x636E;&#xFF0C;&#x70ED;&#x7EBF;&#x7EDF;&#x8BA1;&#x6570;&#x636E;&#xFF0C;&#x4EBA;&#x529B;&#x8D44;&#x6E90;&#x62A5;&#x544A;&#x7B49;&#xFF09;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x77E5;&#x9053;&#x5728;&#x54EA;&#x65B9;&#x9762;&#x89C2;&#x5BDF;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x73B0;&#x4E00;&#x4E9B;&#x9690;&#x85CF;&#x7740;&#x7684;&#x7470;&#x5B9D;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p>
<ul>
<li>&#x7EC6;&#x5206;&#x5BA2;&#x6237;&#xFF0C;&#x4E3A;&#x6BCF;&#x4E2A;&#x56E2;&#x961F;&#x627E;&#x5230;&#x6700;&#x4F73;&#x7684;&#x8425;&#x9500;&#x7B56;&#x7565;</li>
<li>&#x6839;&#x636E;&#x7C7B;&#x4F3C;&#x5BA2;&#x6237;&#x8D2D;&#x4E70;&#x7684;&#x4EA7;&#x54C1;&#x4E3A;&#x6BCF;&#x4E2A;&#x5BA2;&#x6237;&#x63A8;&#x8350;&#x4EA7;&#x54C1;</li>
<li>&#x68C0;&#x6D4B;&#x54EA;&#x4E9B;&#x4EA4;&#x6613;&#x53EF;&#x80FD;&#x662F;&#x6B3A;&#x8BC8;&#x884C;&#x4E3A;</li>
<li>&#x9884;&#x6D4B;&#x4E0B;&#x4E00;&#x5E74;&#x7684;&#x6536;&#x5165;</li>
<li>&#x66F4;&#x591A;&#x5E94;&#x7528;</li>
</ul>
<p>&#x65E0;&#x8BBA;&#x4EC0;&#x4E48;&#x539F;&#x56E0;&#xFF0C;&#x4F60;&#x51B3;&#x5B9A;&#x5F00;&#x59CB;&#x5B66;&#x4E60;&#x673A;&#x5668;&#x5B66;&#x4E60;&#xFF0C;&#x5E76;&#x5728;&#x4F60;&#x7684;&#x9879;&#x76EE;&#x4E2D;&#x5B9E;&#x65BD;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x4E3B;&#x610F;&#xFF01;</p>
<h2 id="3&#x3001;&#x76EE;&#x6807;&#x548C;&#x65B9;&#x6CD5;">3&#x3001;&#x76EE;&#x6807;&#x548C;&#x65B9;&#x6CD5;</h2>
<p>&#x672C;&#x4E66;&#x5047;&#x5B9A;&#x4F60;&#x5BF9;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x51E0;&#x4E4E;&#x4E00;&#x65E0;&#x6240;&#x77E5;&#x3002;&#x5B83;&#x7684;&#x76EE;&#x6807;&#x662F;&#x7ED9;&#x4F60;&#x5B9E;&#x9645;&#x5B9E;&#x73B0;&#x80FD;&#x591F;&#x4ECE;&#x6570;&#x636E;&#x4E2D;&#x5B66;&#x4E60;&#x7684;&#x7A0B;&#x5E8F;&#x6240;&#x9700;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x76F4;&#x89C9;&#x548C;&#x5DE5;&#x5177;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5C06;&#x4ECB;&#x7ECD;&#x5927;&#x91CF;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x4ECE;&#x6700;&#x7B80;&#x5355;&#x7684;&#x548C;&#x6700;&#x5E38;&#x7528;&#x7684;&#xFF08;&#x5982;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#xFF09;&#x5230;&#x4E00;&#x4E9B;&#x5B9A;&#x671F;&#x8D62;&#x5F97;&#x6BD4;&#x8D5B;&#x7684;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x6280;&#x672F;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5C06;&#x4F7F;&#x7528;&#x73B0;&#x6210;&#x7684; Python &#x6846;&#x67B6;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5B9E;&#x73B0;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x6BCF;&#x4E2A;&#x7B97;&#x6CD5;&#x7684;&#x73A9;&#x5177;&#x7248;&#x672C;&#xFF1A;</p>
<ul>
<li><p>Scikit-learn &#x975E;&#x5E38;&#x6613;&#x4E8E;&#x4F7F;&#x7528;&#xFF0C;&#x5E76;&#x4E14;&#x5B9E;&#x73B0;&#x4E86;&#x8BB8;&#x591A;&#x6709;&#x6548;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4E3A;&#x5B66;&#x4E60;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x5207;&#x5165;&#x70B9;&#x3002;</p>
</li>
<li><p>TensorFlow &#x662F;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x6D41;&#x56FE;&#x8FDB;&#x884C;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x503C;&#x8BA1;&#x7B97;&#x7684;&#x66F4;&#x590D;&#x6742;&#x7684;&#x5E93;&#x3002;&#x5B83;&#x901A;&#x8FC7;&#x5728;&#x6F5C;&#x5728;&#x7684;&#x6570;&#x5343;&#x4E2A;&#x591A; GPU &#x670D;&#x52A1;&#x5668;&#x4E0A;&#x5206;&#x5E03;&#x5F0F;&#x8BA1;&#x7B97;&#xFF0C;&#x53EF;&#x4EE5;&#x9AD8;&#x6548;&#x5730;&#x8BAD;&#x7EC3;&#x548C;&#x8FD0;&#x884C;&#x975E;&#x5E38;&#x5927;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;TensorFlow &#x662F;&#x88AB; Google &#x521B;&#x9020;&#x7684;&#xFF0C;&#x652F;&#x6301;&#x5176;&#x5927;&#x578B;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x4E8E; 2015&#x5E74;11&#x6708;&#x5F00;&#x6E90;&#x3002;</p>
</li>
</ul>
<p>&#x672C;&#x4E66;&#x503E;&#x5411;&#x4E8E;&#x5B9E;&#x9645;&#x64CD;&#x4F5C;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x901A;&#x8FC7;&#x5177;&#x4F53;&#x7684;&#x5B9E;&#x4F8B;&#x548C;&#x4E00;&#x70B9;&#x7406;&#x8BBA;&#x6765;&#x589E;&#x52A0;&#x5BF9;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x76F4;&#x89C2;&#x7406;&#x89E3;&#x3002;&#x867D;&#x7136;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x62FF;&#x7B14;&#x8BB0;&#x672C;&#x7535;&#x8111;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x9605;&#x8BFB;&#x6B64;&#x4E66;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x5F3A;&#x70C8;&#x5EFA;&#x8BAE;&#x4F60;&#x901A;&#x8FC7; <a href="https://github.com/ageron/handson-ml" target="_blank">https://github.com/ageron/handson-ml</a> &#x5728;&#x7EBF;&#x5B9E;&#x73B0; Jupyter notebooks &#x4E0A;&#x7684;&#x4EE3;&#x7801;&#x793A;&#x4F8B;&#x3002;</p>
<h2 id="4&#x3001;&#x51C6;&#x5907;&#x6761;&#x4EF6;">4&#x3001;&#x51C6;&#x5907;&#x6761;&#x4EF6;</h2>
<p>&#x672C;&#x4E66;&#x5047;&#x5B9A;&#x60A8;&#x6709;&#x4E00;&#x4E9B; Python &#x7F16;&#x7A0B;&#x7ECF;&#x9A8C;&#xFF0C;&#x5E76;&#x4E14;&#x6BD4;&#x8F83;&#x719F;&#x6089; Python &#x7684;&#x4E3B;&#x8981;&#x79D1;&#x5B66;&#x5E93;&#xFF0C;&#x7279;&#x522B;&#x662F; NumPy&#xFF0C;Pandas &#x548C; Matplotlib &#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5173;&#x5FC3;&#x7684;&#x662F;&#x5E95;&#x5C42;&#x5B9E;&#x73B0;/&#x539F;&#x7406;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x5BF9;&#x5927;&#x5B66;&#x6C34;&#x5E73;&#x7684;&#x6570;&#x5B66;&#xFF08;&#x5FAE;&#x79EF;&#x5206;&#xFF0C;&#x7EBF;&#x6027;&#x4EE3;&#x6570;&#xFF0C;&#x6982;&#x7387;&#x548C;&#x7EDF;&#x8BA1;&#x5B66;&#xFF09;&#x6709;&#x4E00;&#x4E9B;&#x4E86;&#x89E3;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x8FD8;&#x4E0D;&#x4E86;&#x89E3; Python&#xFF0C;<a href="http://learnpython.org/" target="_blank">http://learnpython.org/</a> &#x662F;&#x4F60;&#x5B66;&#x4E60;&#x4F7F;&#x7528; Python &#x7684;&#x597D;&#x5730;&#x65B9;&#x3002; python.org &#x5B98;&#x65B9;&#x6559;&#x7A0B;&#x4E5F;&#x662F;&#x76F8;&#x5F53;&#x4E0D;&#x9519;&#x7684;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x4ECE;&#x672A;&#x4F7F;&#x7528;&#x8FC7; Jupyter &#xFF0C;&#x7B2C; 2 &#x7AE0;&#x5C06;&#x6307;&#x5BFC;&#x4F60;&#x5B8C;&#x6210;&#x5B89;&#x88C5;&#x548C;&#x57FA;&#x672C;&#x64CD;&#x4F5C;&#xFF1A;&#x5B83;&#x662F;&#x4F60;&#x5DE5;&#x5177;&#x7BB1;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x5DE5;&#x5177;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x719F;&#x6089; Python &#x7684;&#x79D1;&#x5B66;&#x5E93;&#xFF0C;&#x63D0;&#x4F9B;&#x7684;&#x4E00;&#x4E9B; Jupyter notebook &#x5305;&#x62EC;&#x4E86;&#x4E00;&#x4E9B;&#x6559;&#x7A0B;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x7EBF;&#x6027;&#x4EE3;&#x6570;&#x7684;&#x5FEB;&#x901F;&#x6570;&#x5B66;&#x6559;&#x7A0B;&#x3002;</p>
<h2 id="5&#x3001;&#x8DEF;&#x7EBF;&#x56FE;">5&#x3001;&#x8DEF;&#x7EBF;&#x56FE;</h2>
<p>&#x8FD9;&#x672C;&#x4E66;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x90E8;&#x5206;&#x3002;</p>
<p>&#x7B2C;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#xFF0C;&#x6DB5;&#x76D6;&#x4EE5;&#x4E0B;&#x4E3B;&#x9898;&#xFF1A;</p>
<ul>
<li>&#x4EC0;&#x4E48;&#x662F;&#x673A;&#x5668;&#x5B66;&#x4E60;&#xFF1F;&#x5B83;&#x88AB;&#x8BD5;&#x56FE;&#x7528;&#x6765;&#x89E3;&#x51B3;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF1F;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7CFB;&#x7EDF;&#x7684;&#x4E3B;&#x8981;&#x7C7B;&#x522B;&#x548C;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</li>
<li>&#x5178;&#x578B;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x9879;&#x76EE;&#x4E2D;&#x7684;&#x4E3B;&#x8981;&#x6B65;&#x9AA4;&#x3002;</li>
<li>&#x901A;&#x8FC7;&#x62DF;&#x5408;&#x6570;&#x636E;&#x6765;&#x5B66;&#x4E60;&#x6A21;&#x578B;&#x3002;</li>
<li>&#x4F18;&#x5316;&#x6210;&#x672C;&#x51FD;&#x6570;&#xFF08;cost function&#xFF09;&#x3002;</li>
<li>&#x5904;&#x7406;&#xFF0C;&#x6E05;&#x6D17;&#x548C;&#x51C6;&#x5907;&#x6570;&#x636E;&#x3002;</li>
<li>&#x9009;&#x62E9;&#x548C;&#x8BBE;&#x8BA1;&#x7279;&#x5F81;&#x3002;</li>
<li>&#x4F7F;&#x7528;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x6A21;&#x578B;&#x5E76;&#x8C03;&#x6574;&#x8D85;&#x53C2;&#x6570;&#x3002;</li>
<li>&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x4E3B;&#x8981;&#x6311;&#x6218;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x6B20;&#x62DF;&#x5408;&#x548C;&#x8FC7;&#x62DF;&#x5408;&#xFF08;&#x504F;&#x5DEE;&#x548C;&#x65B9;&#x5DEE;&#x6743;&#x8861;&#xFF09;&#x3002;</li>
<li>&#x5BF9;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x964D;&#x7EF4;&#x4EE5;&#x5BF9;&#x6297; the curse of dimensionality&#xFF08;&#x7EF4;&#x5EA6;&#x8BC5;&#x5492;&#xFF09;</li>
<li>&#x6700;&#x5E38;&#x89C1;&#x7684;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#xFF1A;&#x7EBF;&#x6027;&#x548C;&#x591A;&#x9879;&#x5F0F;&#x56DE;&#x5F52;&#xFF0C; Logistic &#x56DE;&#x5F52;&#xFF0C;k-&#x6700;&#x8FD1;&#x90BB;&#xFF0C;&#x652F;&#x6301;&#x5411;&#x91CF;&#x673A;&#xFF0C;&#x51B3;&#x7B56;&#x6811;&#xFF0C;&#x968F;&#x673A;&#x68EE;&#x6797;&#x548C;&#x96C6;&#x6210;&#x65B9;&#x6CD5;&#x3002;</li>
</ul>
<p>&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#xFF0C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x548C;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#xFF0C;&#x5305;&#x62EC;&#x4EE5;&#x4E0B;&#x4E3B;&#x9898;&#xFF1A;</p>
<ul>
<li>&#x4EC0;&#x4E48;&#x662F;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF1F;&#x5B83;&#x4EEC;&#x6709;&#x5565;&#x4F18;&#x52BF;&#xFF1F;</li>
<li>&#x4F7F;&#x7528; TensorFlow &#x6784;&#x5EFA;&#x548C;&#x8BAD;&#x7EC3;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;</li>
<li>&#x6700;&#x91CD;&#x8981;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x67B6;&#x6784;&#xFF1A;&#x524D;&#x9988;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#xFF0C;&#x9012;&#x5F52;&#x7F51;&#x7EDC;&#xFF0C;&#x957F;&#x671F;&#x77ED;&#x671F;&#x8BB0;&#x5FC6;&#x7F51;&#x7EDC;&#xFF08;LSTM&#xFF09;&#x548C;&#x81EA;&#x52A8;&#x7F16;&#x7801;&#x5668;&#x3002;</li>
<li>&#x8BAD;&#x7EC3;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x6280;&#x5DE7;&#x3002;</li>
<li>&#x5BF9;&#x4E8E;&#x5927;&#x6570;&#x636E;&#x96C6;&#x7F29;&#x653E;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;</li>
<li>&#x5F3A;&#x5316;&#x5B66;&#x4E60;&#x3002;</li>
</ul>
<p>&#x7B2C;&#x4E00;&#x90E8;&#x5206;&#x4E3B;&#x8981;&#x57FA;&#x4E8E; scikit-learn &#xFF0C;&#x800C;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#x5219;&#x4F7F;&#x7528; TensorFlow &#x3002;</p>
<p>&#x6CE8;&#x610F;&#xFF1A;&#x4E0D;&#x8981;&#x592A;&#x6025;&#x4E8E;&#x6DF1;&#x5165;&#x5B66;&#x4E60;&#x5230;&#x6838;&#x5FC3;&#x77E5;&#x8BC6;&#xFF1A;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x65E0;&#x7591;&#x662F;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4E2D;&#x6700;&#x4EE4;&#x4EBA;&#x5174;&#x594B;&#x7684;&#x9886;&#x57DF;&#x4E4B;&#x4E00;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x5E94;&#x8BE5;&#x9996;&#x5148;&#x638C;&#x63E1;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x95EE;&#x9898;&#x53EF;&#x4EE5;&#x7528;&#x8F83;&#x7B80;&#x5355;&#x7684;&#x6280;&#x672F;&#x5F88;&#x597D;&#x5730;&#x89E3;&#x51B3;&#xFF08;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#xFF09;&#xFF0C;&#x6BD4;&#x5982;&#x968F;&#x673A;&#x68EE;&#x6797;&#x548C;&#x96C6;&#x6210;&#x65B9;&#x6CD5;&#xFF08;&#x6211;&#x4EEC;&#x4F1A;&#x5728;&#x7B2C;&#x4E00;&#x90E8;&#x5206;&#x8FDB;&#x884C;&#x8BA8;&#x8BBA;&#xFF09;&#x3002;&#x5982;&#x679C;&#x4F60;&#x62E5;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#x548C;&#x8010;&#x5FC3;&#xFF0C;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x662F;&#x6700;&#x9002;&#x5408;&#x590D;&#x6742;&#x7684;&#x95EE;&#x9898;&#x7684;&#xFF0C;&#x5982;&#x56FE;&#x50CF;&#x8BC6;&#x522B;&#xFF0C;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#x6216;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x5904;&#x7406;&#x3002;</p>
<h2 id="6&#x3001;&#x5176;&#x4ED6;&#x8D44;&#x6E90;">6&#x3001;&#x5176;&#x4ED6;&#x8D44;&#x6E90;</h2>
<p>&#x6709;&#x8BB8;&#x591A;&#x8D44;&#x6E90;&#x53EF;&#x7528;&#x4E8E;&#x4E86;&#x89E3;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x3002;Andrew Ng &#x5728; Coursera &#x4E0A;&#x7684; <a href="https://www.coursera.org/learn/machine-learning/" target="_blank">ML &#x8BFE;&#x7A0B;</a>&#x548C; Geoffrey Hinton &#x5173;&#x4E8E;<a href="https://www.coursera.org/learn/neural-networks" target="_blank">&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x548C;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;</a>&#x7684;&#x8BFE;&#x7A0B;&#x90FD;&#x662F;&#x975E;&#x5E38;&#x68D2;&#x7684;&#xFF0C;&#x5C3D;&#x7BA1;&#x8FD9;&#x4E9B;&#x8BFE;&#x7A0B;&#x9700;&#x8981;&#x5927;&#x91CF;&#x7684;&#x65F6;&#x95F4;&#x6295;&#x5165;&#xFF08;&#x5927;&#x6982;&#x662F;&#x51E0;&#x4E2A;&#x6708;&#xFF09;&#x3002; </p>
<p>&#x8FD8;&#x6709;&#x8BB8;&#x591A;&#x5173;&#x4E8E;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x6BD4;&#x8F83;&#x6709;&#x8DA3;&#x7684;&#x7F51;&#x7AD9;&#xFF0C;&#x5F53;&#x7136;&#x8FD8;&#x5305;&#x62EC; scikit-learn &#x51FA;&#x8272;&#x7684; <a href="http://sklearn.apachecn.org/cn/0.19.0/user_guide.html" target="_blank">&#x7528;&#x6237;&#x6307;&#x5357;</a>&#x3002;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x559C;&#x6B22;&#x4E0A; <a href="https://www.dataquest.io/" target="_blank">Dataquest</a> &#xFF0C;&#x5B83;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x597D;&#x7684;&#x4EA4;&#x4E92;&#x5F0F;&#x6559;&#x7A0B;&#xFF0C;&#x8FD8;&#x6709; ML &#x535A;&#x5BA2;&#xFF0C;&#x6BD4;&#x5982;&#x90A3;&#x4E9B;&#x5728; <a href="http://goo.gl/GwtU3A" target="_blank">Quora</a> &#x4E0A;&#x5217;&#x51FA;&#x6765;&#x7684;&#x535A;&#x5BA2;&#x3002;&#x6700;&#x540E;&#xFF0C;<a href="http://deeplearning.net/" target="_blank">Deep Learning &#x7F51;&#x7AD9;</a> &#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x8D44;&#x6E90;&#x5217;&#x8868;&#x6765;&#x5B66;&#x4E60;&#x66F4;&#x591A;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x5173;&#x4E8E;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x5176;&#x4ED6;&#x4ECB;&#x7ECD;&#x6027;&#x4E66;&#x7C4D;&#xFF0C;&#x7279;&#x522B;&#x662F;&#xFF1A;</p>
<ul>
<li><p>Joel Grus, Data Science from Scratch (O&#x2019;Reilly). &#x8FD9;&#x672C;&#x4E66;&#x4ECB;&#x7ECD;&#x4E86;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#xFF0C;&#x5E76;&#x5728;&#x7EAF; Python &#x4E2D;&#x5B9E;&#x73B0;&#x4E86;&#x4E00;&#x4E9B;&#x4E3B;&#x8981;&#x7B97;&#x6CD5;&#xFF08;&#x4ECE;&#x540D;&#x5B57;&#x4E0A;&#x770B;&#x5C31;&#x53EF;&#x4EE5;&#x77E5;&#x9053;&#xFF0C;&#x4ECE;&#x5934;&#x5F00;&#x59CB;&#xFF09;&#x3002;</p>
</li>
<li><p>Stephen Marsland, Machine Learning: An Algorithmic Perspective (Chapman andHall). &#x8FD9;&#x672C;&#x4E66;&#x5BF9;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x4ECB;&#x7ECD;&#xFF0C;&#x6DB5;&#x76D6;&#x4E86;&#x5E7F;&#x6CDB;&#x7684;&#x4E3B;&#x9898;&#xFF0C;Python &#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x793A;&#x4F8B;&#xFF08;&#x4E5F;&#x662F;&#x4ECE;&#x96F6;&#x5F00;&#x59CB;&#xFF0C;&#x4F46;&#x662F;&#x4F7F;&#x7528; NumPy&#xFF09;&#x3002;</p>
</li>
<li><p>Sebastian Raschka, Python Machine Learning (Packt Publishing). &#x672C;&#x4E66;&#x4E5F;&#x5BF9;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x4ECB;&#x7ECD;&#xFF0C;&#x4F46;&#x662F;&#x5229;&#x7528;&#x4E86; Python &#x7684;&#x5F00;&#x6E90;&#x5E93;&#xFF08;Pylearn 2 &#x548C; Theano&#xFF09;&#x3002;</p>
</li>
<li><p>Yaser S. Abu-Mostafa, Malik Magdon-Ismail, and Hsuan-Tien Lin, Learning fromData (AMLBook). &#x5BF9; ML &#x6709;&#x4E00;&#x4E2A;&#x76F8;&#x5BF9;&#x7406;&#x8BBA;&#x5316;&#x7684;&#x4ECB;&#x7ECD;&#xFF0C;&#x8FD9;&#x672C;&#x4E66;&#x63D0;&#x4F9B;&#x4E86;&#x6BD4;&#x8F83;&#x6DF1;&#x523B;&#x7684;&#x89C1;&#x89E3;&#xFF0C;&#x7279;&#x522B;&#x662F; bias/variance tradeoff &#xFF08;&#x504F;&#x5DEE;/&#x65B9;&#x5DEE; &#x6743;&#x8861;&#xFF09;&#xFF08;&#x89C1;&#x7B2C; 4 &#x7AE0;&#xFF09;&#x3002;</p>
</li>
<li><p>Stuart Russell and Peter Norvig, Artificial Intelligence: A Modern Approach, 3rd
Edition (Pearson).  &#x8FD9;&#x662F;&#x4E00;&#x672C;&#x5F88;&#x597D;&#x7684;&#xFF08;&#x5E76;&#x4E14;&#x5F88;&#x5927;&#xFF09;&#x7684;&#x4E66;&#xFF0C;&#x6DB5;&#x76D6;&#x4E86;&#x5305;&#x62EC;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5728;&#x5185;&#x7684;&#x5927;&#x91CF;&#x4E3B;&#x9898;&#x3002;&#x8FD9;&#x6709;&#x52A9;&#x4E8E;&#x66F4;&#x52A0;&#x6DF1;&#x523B;&#x5730;&#x7406;&#x89E3; ML &#x3002;</p>
</li>
</ul>
<p>&#x6700;&#x540E;&#xFF0C;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x52A0;&#x5165; ML &#x7ADE;&#x8D5B;&#x7F51;&#x7AD9;&#xFF0C;&#x4F8B;&#x5982; kaggle.com &#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x5728;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x7684;&#x95EE;&#x9898;&#x4E0A;&#x953B;&#x70BC;&#x81EA;&#x5DF1;&#x7684;&#x6280;&#x80FD;&#xFF0C;&#x5E76;&#x4ECE;&#x4E00;&#x4E9B;&#x6700;&#x597D;&#x7684; ML &#x4E13;&#x4E1A;&#x4EBA;&#x58EB;&#x90A3;&#x91CC;&#x83B7;&#x5F97;&#x5E2E;&#x52A9;&#x548C;&#x89C1;&#x89E3;&#x3002;</p>
<h2 id="7&#x3001;&#x672C;&#x4E66;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x7EA6;&#x5B9A;">7&#x3001;&#x672C;&#x4E66;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x7EA6;&#x5B9A;</h2>
<p>&#x672C;&#x4E66;&#x4F7F;&#x7528;&#x4EE5;&#x4E0B;&#x5370;&#x5237;&#x7EA6;&#x5B9A;&#xFF1A;</p>
<ul>
<li><p>&#x659C;&#x4F53; &#x2014;&#x2014; &#x6307;&#x793A;&#x65B0;&#x672F;&#x8BED;&#xFF0C;&#x7F51;&#x5740;&#xFF0C;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x5730;&#x5740;&#xFF0C;&#x6587;&#x4EF6;&#x540D;&#x548C;&#x6587;&#x4EF6;&#x6269;&#x5C55;&#x540D;&#x3002;</p>
</li>
<li><p>&#x7B49;&#x5BBD; &#x2014;&#x2014; &#x7528;&#x4E8E;&#x7A0B;&#x5E8F;&#x6E05;&#x5355;&#xFF0C;&#x4EE5;&#x53CA;&#x6BB5;&#x843D;&#x5185;&#x7528;&#x4E8E;&#x5F15;&#x7528;&#x7A0B;&#x5E8F;&#x5143;&#x7D20;&#xFF0C;&#x5982;&#x53D8;&#x91CF;&#x6216;&#x51FD;&#x6570;&#x540D;&#x79F0;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF0C;&#x73AF;&#x5883;&#x53D8;&#x91CF;&#xFF0C;&#x8BED;&#x53E5;&#x548C;&#x5173;&#x952E;&#x5B57;&#x3002;</p>
</li>
<li><p>&#x7B49;&#x5BBD;&#x7C97;&#x4F53; &#x2014;&#x2014; &#x663E;&#x793A;&#x5E94;&#x7531;&#x7528;&#x6237;&#x9010;&#x5B57;&#x8F93;&#x5165;&#x7684;&#x547D;&#x4EE4;&#x6216;&#x5176;&#x4ED6;&#x6587;&#x672C;&#x3002;</p>
</li>
<li><p>&#x7B49;&#x5BBD;&#x659C;&#x4F53; &#x2014;&#x2014; &#x663E;&#x793A;&#x5E94;&#x7531;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x7684;&#x503C;&#x6216;&#x7531;&#x4E0A;&#x4E0B;&#x6587;&#x786E;&#x5B9A;&#x7684;&#x503C;&#x66FF;&#x6362;&#x7684;&#x6587;&#x672C;&#x3002;</p>
</li>
<li><p>&#x5C0F;&#x677E;&#x9F20;&#x56FE;&#x6807; &#x2014;&#x2014; &#x6B64;&#x5143;&#x7D20;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x5C0F;&#x63D0;&#x793A;&#x6216;&#x5EFA;&#x8BAE;&#x3002;</p>
</li>
<li><p>&#x5C0F;&#x4E4C;&#x9E26;&#x56FE;&#x6807; &#x2014;&#x2014; &#x6B64;&#x5143;&#x7D20;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x7684;&#x8BF4;&#x660E;&#x3002;</p>
</li>
<li><p>&#x5C0F;&#x874E;&#x5B50;&#x56FE;&#x6807; &#x2014;&#x2014; &#x6B64;&#x5143;&#x7D20;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x8B66;&#x544A;&#x548C;&#x6CE8;&#x610F;&#x3002;</p>
</li>
</ul>
<h2 id="8&#x3001;&#x4F7F;&#x7528;&#x4EE3;&#x7801;&#x793A;&#x4F8B;">8&#x3001;&#x4F7F;&#x7528;&#x4EE3;&#x7801;&#x793A;&#x4F8B;</h2>
<p>&#x8865;&#x5145;&#x6750;&#x6599;&#xFF08;&#x4EE3;&#x7801;&#x793A;&#x4F8B;&#xFF0C;&#x7EC3;&#x4E60;&#x9898;&#x7B49;&#xFF09;&#x53EF;&#x4EE5;&#x4ECE; <a href="https://github.com/ageron/handson-ml" target="_blank">https://github.com/ageron/handson-ml</a> &#x4E0B;&#x8F7D;&#x3002;</p>
<p>&#x8FD9;&#x672C;&#x4E66;&#x662F;&#x4E3A;&#x4E86;&#x5E2E;&#x52A9;&#x4F60;&#x5B8C;&#x6210;&#x5DE5;&#x4F5C;&#x3002;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x672C;&#x4E66;&#x63D0;&#x4F9B;&#x4E86;&#x793A;&#x4F8B;&#x4EE3;&#x7801;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x5728;&#x7A0B;&#x5E8F;&#x548C;&#x6587;&#x6863;&#x4E2D;&#x4F7F;&#x7528;&#x5B83;&#x3002;&#x9664;&#x975E;&#x4F60;&#x590D;&#x5236;&#x4E86;&#x5927;&#x90E8;&#x5206;&#x4EE3;&#x7801;&#xFF0C;&#x5426;&#x5219;&#x4F60;&#x65E0;&#x9700;&#x8054;&#x7CFB;&#x6211;&#x4EEC;&#x83B7;&#x5F97;&#x8BB8;&#x53EF;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x7F16;&#x5199;&#x4F7F;&#x7528;&#x672C;&#x4E66;&#x4E2D;&#x51E0;&#x4E2A;&#x4EE3;&#x7801;&#x5757;&#x7684;&#x7A0B;&#x5E8F;&#x4E0D;&#x9700;&#x8981;&#x8BB8;&#x53EF;&#x3002;&#x9500;&#x552E;&#x6216;&#x8005;&#x5206;&#x53D1; O&#x2019;Reilly &#x4E66;&#x7C4D;&#x7684; CD-ROM &#x4F8B;&#x5B50;&#x9700;&#x8981;&#x83B7;&#x5F97;&#x8BB8;&#x53EF;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x5F15;&#x7528;&#x672C;&#x4E66;&#x548C;&#x4F7F;&#x7528;&#x793A;&#x4F8B;&#x4EE3;&#x7801;&#x6765;&#x56DE;&#x7B54;&#x95EE;&#x9898;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x83B7;&#x5F97;&#x8BB8;&#x53EF;&#x3002;&#x5C06;&#x5927;&#x91CF;&#x6765;&#x81EA;&#x672C;&#x4E66;&#x7684;&#x793A;&#x4F8B;&#x4EE3;&#x7801;&#x6574;&#x5408;&#x5230;&#x4EA7;&#x54C1;&#x6587;&#x6863;&#x4E2D;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x83B7;&#x5F97;&#x8BB8;&#x53EF;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x611F;&#x8C22;&#xFF0C;&#x4F46;&#x662F;&#x5E76;&#x4E0D;&#x8981;&#x6C42;&#xFF0C;&#x8D21;&#x732E;&#x3002;&#x8D21;&#x732E;&#x901A;&#x5E38;&#x5305;&#x62EC;&#x6807;&#x9898;&#xFF0C;&#x4F5C;&#x8005;&#xFF0C;&#x51FA;&#x7248;&#x5546;&#x548C; ISBN &#x3002;&#x4F8B;&#x5982;&#xFF1A;&#x201C;Hands-On Machine Learning withScikit-Learn and TensorFlow by Aur&#xE9;lien G&#xE9;ron (O&#x2019;Reilly). Copyright 2017 Aur&#xE9;lienG&#xE9;ron, 978-1-491-96229-9.&#x201D;</p>
<p>&#x5982;&#x679C;&#x60A8;&#x89C9;&#x5F97;&#x60A8;&#x5BF9;&#x4EE3;&#x7801;&#x793A;&#x4F8B;&#x7684;&#x4F7F;&#x7528;&#x8D85;&#x51FA;&#x4E86;&#x5408;&#x7406;&#x4F7F;&#x7528;&#x8303;&#x56F4;&#x6216;&#x4E0A;&#x8FF0;&#x6743;&#x9650;&#xFF0C;&#x8BF7;&#x968F;&#x65F6;&#x8054;&#x7CFB;&#x6211;&#x4EEC;&#xFF1A;permissions@oreilly.com &#x3002;</p>
<h2 id="9&#x3001;oreilly-safari">9&#x3001;O&#x2019;Reilly Safari</h2>
<p>Safari &#xFF08;&#x4EE5;&#x524D;&#x88AB;&#x79F0;&#x4E3A; Safari Books Online&#xFF09;&#x662F;&#x4E00;&#x4E2A;&#x9488;&#x5BF9;&#x4F01;&#x4E1A;&#xFF0C;&#x653F;&#x5E9C;&#xFF0C;&#x6559;&#x80B2;&#x5DE5;&#x4F5C;&#x8005;&#x548C;&#x4E2A;&#x4EBA;&#x7684;&#x57FA;&#x4E8E;&#x4F1A;&#x5458;&#x7684;&#x57F9;&#x8BAD;&#x548C;&#x53C2;&#x8003;&#x5E73;&#x53F0;&#x3002;</p>
<p>&#x4F1A;&#x5458;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE; 250 &#x591A;&#x5BB6;&#x53D1;&#x5E03;&#x5546;&#x7684;&#x6570;&#x5343;&#x672C;&#x56FE;&#x4E66;&#xFF0C;&#x57F9;&#x8BAD;&#x89C6;&#x9891;&#xFF0C;&#x5B66;&#x4E60;&#x8DEF;&#x5F84;&#xFF0C;&#x4E92;&#x52A8;&#x6559;&#x7A0B;&#x548C;&#x7B56;&#x5212;&#x64AD;&#x653E;&#x5217;&#x8868;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x62EC; O&#x2019;Reilly Media&#xFF0C;&#x54C8;&#x4F5B;&#x5546;&#x4E1A;&#x8BC4;&#x8BBA;&#xFF0C;Prentice Hall &#x4E13;&#x4E1A;&#x4EBA;&#x5458;&#xFF0C;Addison-Wesley &#x4E13;&#x4E1A;&#x4EBA;&#x5458;&#xFF0C;Microsoft Press&#xFF0C; Sams&#xFF0C; Que&#xFF0C; Peachpit Press&#xFF0C; Adobe&#xFF0C; Focal Press&#xFF0C; Cisco Press &#x7B49;&#x3002;&#x60F3;&#x8981;&#x4E86;&#x89E3;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x8BBF;&#x95EE; <a href="http://oreilly.com/safari" target="_blank">http://oreilly.com/safari</a> &#x3002;</p>
<h2 id="10&#x3001;&#x5982;&#x4F55;&#x8054;&#x7CFB;&#x6211;&#x4EEC;">10&#x3001;&#x5982;&#x4F55;&#x8054;&#x7CFB;&#x6211;&#x4EEC;</h2>
<p>&#x8BF7;&#x5411;&#x51FA;&#x7248;&#x5546;&#x53D1;&#x8868;&#x6709;&#x5173;&#x672C;&#x4E66;&#x7684;&#x8BC4;&#x8BBA;&#x548C;&#x95EE;&#x9898;&#xFF1A;</p>
<p>O&#x2019;Reilly Media, Inc.</p>
<p>1005 Gravenstein Highway North</p>
<p>Sebastopol, CA 95472</p>
<p>800-998-9938 &#xFF08;&#x5728;&#x7F8E;&#x56FD;&#x6216;&#x8005;&#x52A0;&#x62FF;&#x5927;&#xFF09;</p>
<p>707-829-0515 &#xFF08;&#x56FD;&#x9645;&#x6216;&#x5730;&#x533A;&#xFF09;</p>
<p>707-829-0104 &#xFF08;&#x4F20;&#x771F;&#xFF09;</p>
<p>&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x4E2A;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x7F51;&#x9875;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x5217;&#x51FA;&#x4E86;&#x52D8;&#x8BEF;&#x8868;&#xFF0C;&#x4F8B;&#x5B50;&#x548C;&#x4EFB;&#x4F55;&#x989D;&#x5916;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x8FD9;&#x4E2A;&#x7F51;&#x9875; <a href="http://bit.ly/hands-on-machine-learning-with-scikit-learn-and-tensorflow" target="_blank">http://bit.ly/hands-on-machine-learning-with-scikit-learn-and-tensorflow</a></p>
<p>&#x8981;&#x8BC4;&#x8BBA;&#x6216;&#x8005;&#x8BE2;&#x95EE;&#x6709;&#x5173;&#x672C;&#x4E66;&#x7684;&#x6280;&#x672F;&#x95EE;&#x9898;&#xFF0C;&#x8BF7;&#x53D1;&#x9001;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x5230; bookquestions@oreilly.com &#x3002;</p>
<p>&#x6709;&#x5173;&#x6211;&#x4EEC;&#x7684;&#x4E66;&#x7C4D;&#xFF0C;&#x8BFE;&#x7A0B;&#xFF0C;&#x4F1A;&#x8BAE;&#x548C;&#x65B0;&#x95FB;&#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x8BBF;&#x95EE;&#x6211;&#x4EEC;&#x7684;&#x7F51;&#x7AD9; <a href="http://www.oreilly.com" target="_blank">http://www.oreilly.com</a> &#x3002;</p>
<p>&#x5728; facebook &#x4E0A;&#x627E;&#x5230;&#x6211;&#x4EEC;&#xFF1A; <a href="http://facebook.com/oreilly" target="_blank">http://facebook.com/oreilly</a></p>
<p>&#x5728; Twitter &#x4E0A;&#x5173;&#x6CE8;&#x6211;&#x4EEC;&#xFF1A;<a href="http://twitter.com/oreillymedia" target="_blank">http://twitter.com/oreillymedia</a></p>
<p>&#x5728; Youtube &#x4E0A;&#x89C2;&#x770B;&#x6211;&#x4EEC;&#x7684;&#x89C6;&#x9891;&#xFF1A; <a href="http://www.youtube.com/oreillymedia" target="_blank">http://www.youtube.com/oreillymedia</a></p>
<h2 id="11&#x3001;&#x81F4;&#x8C22;">11&#x3001;&#x81F4;&#x8C22;</h2>
<p>&#x6211;&#x8981;&#x611F;&#x8C22;&#x6211;&#x7684; Google &#x540C;&#x4E8B;&#xFF0C;&#x7279;&#x522B;&#x662F; Youtube &#x89C6;&#x9891;&#x5206;&#x7C7B;&#x5C0F;&#x7EC4;&#xFF0C;&#x6559;&#x7ED9;&#x6211;&#x5F88;&#x591A;&#x5173;&#x4E8E;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x77E5;&#x8BC6;&#x3002;&#x6CA1;&#x6709;&#x4ED6;&#x4EEC;&#xFF0C;&#x6211;&#x6C38;&#x8FDC;&#x65E0;&#x6CD5;&#x5F00;&#x59CB;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x3002;&#x7279;&#x522B;&#x611F;&#x8C22;&#x6211;&#x7684;&#x4E2A;&#x4EBA; ML &#x4E13;&#x5BB6;&#xFF1A;Cl&#xE9;ment Courbet, Julien Dubois, Mathias Kende, Daniel Kitachewsky, James Pack, Alexander Pak, Anosh Raj, Vitor Sessak, Wiktor Tomczak, Ingrid von Glehn, Rich Washington, &#x4EE5;&#x53CA; Youtube Paris &#x7684;&#x6240;&#x6709;&#x4EBA;&#x3002;</p>
<p>&#x6211;&#x975E;&#x5E38;&#x611F;&#x8C22;&#x6240;&#x6709;&#x90A3;&#x4E9B;&#x4ECE;&#x7E41;&#x5FD9;&#x7684;&#x751F;&#x6D3B;&#x4E2D;&#x62BD;&#x51FA;&#x65F6;&#x95F4;&#x6765;&#x4ED4;&#x7EC6;&#x9605;&#x8BFB;&#x6211;&#x7684;&#x4E66;&#x7684;&#x4EBA;&#x3002;&#x611F;&#x8C22; Pete Warden &#x56DE;&#x7B54;&#x4E86;&#x6211;&#x6240;&#x6709;&#x7684; TensorFlow &#x7684;&#x95EE;&#x9898;&#xFF0C;&#x56DE;&#x987E;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x8BB8;&#x591A;&#x6709;&#x8DA3;&#x7684;&#x89C1;&#x89E3;&#xFF0C;&#x5F53;&#x7136;&#x4E5F;&#x6210;&#x4E3A;&#x4E86; TensorFlow &#x6838;&#x5FC3;&#x56E2;&#x961F;&#x7684;&#x4E00;&#x5458;&#x3002;&#x4F60;&#x4E00;&#x5B9A;&#x60F3;&#x8981;&#x770B;&#x770B;&#x4ED6;&#x7684; <a href="https://petewarden.com/" target="_blank">&#x535A;&#x5BA2;</a> &#xFF01;&#x975E;&#x5E38;&#x611F;&#x8C22; Lukas Biewald &#x5BF9;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#x7684;&#x975E;&#x5E38;&#x5168;&#x9762;&#x7684;&#x5BA1;&#x67E5;&#xFF1A;&#x4ED6;&#x6BEB;&#x4E0D;&#x7559;&#x60C5;&#x5730;&#x5C1D;&#x8BD5;&#x4E86;&#x6240;&#x6709;&#x7684;&#x4EE3;&#x7801;&#xFF08;&#x5E76;&#x4E14;&#x53D1;&#x73B0;&#x4E86;&#x4E00;&#x4E9B;&#x9519;&#x8BEF;&#xFF09;&#xFF0C;&#x505A;&#x51FA;&#x4E86;&#x8BB8;&#x591A;&#x4F1F;&#x5927;&#x7684;&#x5EFA;&#x8BAE;&#xFF0C;&#x800C;&#x4E14;&#x4ED6;&#x7684;&#x70ED;&#x60C5;&#x662F;&#x5177;&#x6709;&#x611F;&#x67D3;&#x529B;&#x7684;&#x3002;&#x4F60;&#x5E94;&#x8BE5;&#x770B;&#x770B;&#x4ED6;&#x7684;&#x535A;&#x5BA2;&#xFF0C;&#x548C;&#x4ED6;&#x7684;&#x8D85;&#x9177;&#x7684;&#x673A;&#x5668;&#x4EBA;&#xFF01;&#x611F;&#x8C22; Justin Francis &#xFF0C;&#x4ED6;&#x4E5F;&#x975E;&#x5E38;&#x5168;&#x9762;&#x5730;&#x5BA1;&#x67E5;&#x4E86;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5728;&#x7B2C; 16 &#x7AE0;&#x63D0;&#x5230;&#x4E86;&#x9519;&#x8BEF;&#x5E76;&#x63D0;&#x4F9B;&#x4E86;&#x5F88;&#x597D;&#x7684;&#x89C1;&#x89E3;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5728; TensorFlow &#x4E0A;&#x770B;&#x5230;&#x4ED6;&#x7684;&#x5E16;&#x5B50;&#xFF01;</p>
<p>&#x4E5F;&#x975E;&#x5E38;&#x611F;&#x8C22; David Andrzejewski&#xFF0C;&#x4ED6;&#x5BA1;&#x67E5;&#x4E86;&#x7B2C;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x975E;&#x5E38;&#x6709;&#x7528;&#x7684;&#x53CD;&#x9988;&#x610F;&#x89C1;&#xFF0C;&#x786E;&#x5B9A;&#x4E86;&#x4E0D;&#x660E;&#x786E;&#x7684;&#x90E8;&#x5206;&#x5E76;&#x63D0;&#x51FA;&#x4E86;&#x6539;&#x8FDB;&#x5EFA;&#x8BAE;&#x3002;&#x67E5;&#x770B;&#x4E00;&#x4E0B;&#x4ED6;&#x7684;&#x7F51;&#x9875;&#x5427;&#x3002;&#x611F;&#x8C22; Gr&#xE9;goire Mesnil&#xFF0C;&#x4ED6;&#x5BA1;&#x67E5;&#x4E86;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x4E86;&#x975E;&#x5E38;&#x6709;&#x8DA3;&#x7684;&#x5173;&#x4E8E;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x5B9E;&#x7528;&#x5EFA;&#x8BAE;&#x3002;&#x611F;&#x8C22; Eddy Hung, Salim S&#xE9;maoune, Karim Matrah, Ingrid von Glehn,Iain Smears, &#x548C; Vincent Guilbeau &#x5BF9;&#x7B2C;&#x4E00;&#x90E8;&#x5206;&#x7684;&#x5BA1;&#x67E5;&#x548C;&#x5EFA;&#x8BAE;&#x3002;&#x6211;&#x8FD8;&#x8981;&#x611F;&#x8C22;&#x6211;&#x7684;&#x5CB3;&#x7236;&#xFF0C;&#x524D;&#x6570;&#x5B66;&#x8001;&#x5E08; Michel Tessier &#xFF0C;&#x73B0;&#x5728;&#x662F; Anton Chekhov &#x7684;&#x4E00;&#x540D;&#x4F18;&#x79C0;&#x7FFB;&#x8BD1;&#xFF0C;&#x5E2E;&#x52A9;&#x6211;&#x5728;&#x672C;&#x4E66;&#x4E2D;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E9B;&#x975E;&#x5E38;&#x597D;&#x7684;&#x6570;&#x5B66;&#x548C;&#x7B26;&#x53F7;&#xFF0C;&#x5E76;&#x4E14;&#x5BA1;&#x67E5;&#x4E86;&#x7EBF;&#x6027;&#x4EE3;&#x6570; Jupyter notebook &#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x5BF9;&#x6211;&#x4EB2;&#x7231;&#x7684;&#x5F1F;&#x5F1F;&#x8BF4;&#x4E00;&#x4E2A;&#x5DE8;&#x5927;&#x7684; &#x201C;&#x8C22;&#x8C22;&#x201D; &#xFF0C;&#x4ED6;&#x6D4B;&#x8BD5;&#x4E86;&#x6BCF;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x51E0;&#x4E4E;&#x5728;&#x6BCF;&#x4E2A;&#x90E8;&#x5206;&#x90FD;&#x63D0;&#x4F9B;&#x4E86;&#x53CD;&#x9988;&#xFF0C;&#x5E76;&#x9F13;&#x52B1;&#x6211;&#x4ECE;&#x7B2C;&#x4E00;&#x884C;&#x5230;&#x6700;&#x540E;&#x4E00;&#x884C;&#x3002;&#x7231;&#x4F60;&#xFF0C;&#x6211;&#x7684;&#x5144;&#x5F1F;&#x3002;</p>
<p>&#x975E;&#x5E38;&#x611F;&#x8C22; O&#x2019;Reilly &#x51FA;&#x8272;&#x7684;&#x5458;&#x5DE5;&#xFF0C;&#x7279;&#x522B;&#x662F; Nicole Tache &#xFF0C;&#x4ED6;&#x7ED9;&#x51FA;&#x4E86;&#x6DF1;&#x523B;&#x7684;&#x53CD;&#x9988;&#xFF0C;&#x5E76;&#x4E14;&#x603B;&#x662F;&#x5F00;&#x6717;&#xFF0C;&#x9F13;&#x821E;&#x548C;&#x4E50;&#x4E8E;&#x52A9;&#x4EBA;&#x7684;&#x3002;&#x8FD8;&#x8981;&#x611F;&#x8C22; Marie Beaugureau, Ben Lorica, Mike Loukides, &#x548C; Laurel Ruma &#x76F8;&#x4FE1;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x5E76;&#x5E2E;&#x52A9;&#x6211;&#x786E;&#x5B9A;&#x5176;&#x8303;&#x56F4;&#x3002;&#x611F;&#x8C22; Matt Hacker &#x548C;&#x6240;&#x6709;&#x7684; Atlasteam &#x56DE;&#x7B54;&#x4E86;&#x5173;&#x4E8E;&#x683C;&#x5F0F;&#x5316;&#xFF0C;asciidoc &#x548C; LaTeX &#x7684;&#x6240;&#x6709;&#x6280;&#x672F;&#x56E2;&#x961F;&#x95EE;&#x9898;&#xFF0C;&#x4E5F;&#x611F;&#x8C22; Rachel Monaghan, Nick Adams, &#x548C;&#x6240;&#x6709;&#x7684;&#x5236;&#x4F5C;&#x56E2;&#x961F;&#x8FDB;&#x884C;&#x4E86;&#x6700;&#x7EC8;&#x7684;&#x5BA1;&#x67E5;&#x548C;&#x6570;&#x767E;&#x6B21;&#x7684;&#x4FEE;&#x6B63;&#x3002;</p>
<p>&#x6700;&#x540E;&#x4F46;&#x4E5F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x70B9;&#xFF0C;&#x6211;&#x975E;&#x5E38;&#x611F;&#x8C22;&#x6211;&#x7684;&#x7231;&#x59BB; Emmanuelle &#x548C;&#x4E09;&#x4E2A;&#x975E;&#x5E38;&#x68D2;&#x7684;&#x5B69;&#x5B50;&#xFF0C;Alexandre, R&#xE9;mi, &#x548C; Gabrielle &#xFF0C;&#x5728;&#x8FD9;&#x672C;&#x4E66;&#x4E2D;&#x5199;&#x4E86;&#x5F88;&#x591A;&#xFF0C;&#x95EE;&#x4E86;&#x5F88;&#x591A;&#x95EE;&#x9898;&#xFF08;&#x8C01;&#x8BF4;&#x4E0D;&#x80FD;&#x6559; 7 &#x5C81;&#x7684;&#x5B69;&#x5B50;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF1F;&#xFF09;&#xFF0C;&#x751A;&#x81F3;&#x5E2E;&#x6211;&#x9001;&#x997C;&#x5E72;&#x548C;&#x5496;&#x5561;&#x3002;&#x4F60;&#x8FD8;&#x68A6;&#x60F3;&#x5F97;&#x5230;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../" class="navigation navigation-prev " aria-label="Previous page: Sklearn 与 TensorFlow 机器学习实用指南">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="1.机器学习概览.html" class="navigation navigation-next " aria-label="Next page: 一、机器学习概览">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"零、前言","level":"1.2","depth":1,"next":{"title":"一、机器学习概览","level":"1.3","depth":1,"path":"docs/1.机器学习概览.md","ref":"docs/1.机器学习概览.md","articles":[]},"previous":{"title":"Sklearn 与 TensorFlow 机器学习实用指南","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"docs/0.前言.md","mtime":"2019-04-18T03:01:37.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-05-07T09:41:36.357Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

