
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>一、机器学习概览 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="2.一个完整的机器学习项目.html" />
    
    
    <link rel="prev" href="0.前言.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Sklearn 与 TensorFlow 机器学习实用指南
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="0.前言.html">
            
                <a href="0.前言.html">
            
                    
                    零、前言
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="1.机器学习概览.html">
            
                <a href="1.机器学习概览.html">
            
                    
                    一、机器学习概览
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="2.一个完整的机器学习项目.html">
            
                <a href="2.一个完整的机器学习项目.html">
            
                    
                    二、一个完整的机器学习项目
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="3.分类.html">
            
                <a href="3.分类.html">
            
                    
                    三、分类
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="4.训练模型.html">
            
                <a href="4.训练模型.html">
            
                    
                    四、训练模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="5.支持向量机.html">
            
                <a href="5.支持向量机.html">
            
                    
                    五、支持向量机
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="6.决策树.html">
            
                <a href="6.决策树.html">
            
                    
                    六、决策树
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="7.集成学习和随机森林.html">
            
                <a href="7.集成学习和随机森林.html">
            
                    
                    七、集成学习和随机森林
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="8.降维.html">
            
                <a href="8.降维.html">
            
                    
                    八、降维
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="9.启动并运行_TensorFlow.html">
            
                <a href="9.启动并运行_TensorFlow.html">
            
                    
                    九、启动并运行 TensorFlow
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="10.人工神经网络介绍.html">
            
                <a href="10.人工神经网络介绍.html">
            
                    
                    十、人工神经网络介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="11.训练深层神经网络.html">
            
                <a href="11.训练深层神经网络.html">
            
                    
                    十一、训练深层神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="12.设备和服务器上的分布式_TensorFlow.html">
            
                <a href="12.设备和服务器上的分布式_TensorFlow.html">
            
                    
                    十二、设备和服务器上的分布式 TensorFlow
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="13.卷积神经网络.html">
            
                <a href="13.卷积神经网络.html">
            
                    
                    十三、卷积神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="14.循环神经网络.html">
            
                <a href="14.循环神经网络.html">
            
                    
                    十四、循环神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="15.自编码器.html">
            
                <a href="15.自编码器.html">
            
                    
                    十五、自编码器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="16.强化学习.html">
            
                <a href="16.强化学习.html">
            
                    
                    十六、强化学习
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="B.机器学习项目清单.html">
            
                <a href="B.机器学习项目清单.html">
            
                    
                    附录 B、机器学习项目清单
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="C.SVM_对偶问题.html">
            
                <a href="C.SVM_对偶问题.html">
            
                    
                    附录 C、SVM 对偶问题
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="D.自动微分.html">
            
                <a href="D.自动微分.html">
            
                    
                    附录 D、自动微分
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >一、机器学习概览</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x4E00;&#x3001;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6982;&#x89C8;">&#x4E00;&#x3001;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6982;&#x89C8;</h1>
<blockquote>
<p>&#x8BD1;&#x8005;&#xFF1A;<a href="https://www.jianshu.com/u/130f76596b02" target="_blank">@SeanCheney</a></p>
<p>&#x6821;&#x5BF9;&#x8005;&#xFF1A;<a href="https://github.com/Lisanaaa" target="_blank">@Lisanaaa</a>&#x3001;<a href="https://github.com/wizardforcel" target="_blank">@&#x98DE;&#x9F99;</a>&#x3001;<a href="https://github.com/yanmengk" target="_blank">@yanmengk</a>&#x3001;<a href="https://github.com/codershangfeng" target="_blank">@Liu Shangfeng</a></p>
</blockquote>
<p>&#x5927;&#x591A;&#x6570;&#x4EBA;&#x542C;&#x5230;&#x201C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x201D;&#xFF0C;&#x5F80;&#x5F80;&#x4F1A;&#x5728;&#x8111;&#x6D77;&#x4E2D;&#x52FE;&#x52D2;&#x51FA;&#x4E00;&#x4E2A;&#x673A;&#x5668;&#x4EBA;&#xFF1A;&#x4E00;&#x4E2A;&#x53EF;&#x9760;&#x7684;&#x7BA1;&#x5BB6;&#xFF0C;&#x6216;&#x662F;&#x4E00;&#x4E2A;&#x53EF;&#x6015;&#x7684;&#x7EC8;&#x7ED3;&#x8005;&#xFF0C;&#x8FD9;&#x53D6;&#x51B3;&#x4E8E;&#x4F60;&#x95EE;&#x7684;&#x662F;&#x8C01;&#x3002;&#x4F46;&#x662F;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5E76;&#x4E0D;&#x662F;&#x672A;&#x6765;&#x7684;&#x5E7B;&#x60F3;&#xFF0C;&#x5B83;&#x5DF2;&#x7ECF;&#x6765;&#x5230;&#x6211;&#x4EEC;&#x8EAB;&#x8FB9;&#x4E86;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x4E00;&#x4E9B;&#x7279;&#x5B9A;&#x9886;&#x57DF;&#x5DF2;&#x7ECF;&#x5E94;&#x7528;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x51E0;&#x5341;&#x5E74;&#x4E86;&#xFF0C;&#x6BD4;&#x5982;&#x5149;&#x5B66;&#x5B57;&#x7B26;&#x8BC6;&#x522B; &#xFF08;Optical Character Recognition&#xFF0C;OCR&#xFF09;&#x3002;&#x4F46;&#x662F;&#x76F4;&#x5230; 1990 &#x5E74;&#x4EE3;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x5F71;&#x54CD;&#x4E86;&#x6570;&#x4EBF;&#x4EBA;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5E94;&#x7528;&#x624D;&#x771F;&#x6B63;&#x6210;&#x719F;&#xFF0C;&#x5B83;&#x5C31;&#x662F;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x8FC7;&#x6EE4;&#x5668;&#xFF08;spam filter&#xFF09;&#x3002;&#x867D;&#x7136;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x6709;&#x81EA;&#x6211;&#x610F;&#x8BC6;&#x7684;&#x5929;&#x7F51;&#x7CFB;&#x7EDF;&#xFF08;Skynet&#xFF09;&#xFF0C;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x8FC7;&#x6EE4;&#x5668;&#x4ECE;&#x6280;&#x672F;&#x4E0A;&#x662F;&#x7B26;&#x5408;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#xFF08;&#x5B83;&#x53EF;&#x4EE5;&#x5F88;&#x597D;&#x5730;&#x8FDB;&#x884C;&#x5B66;&#x4E60;&#xFF0C;&#x7528;&#x6237;&#x51E0;&#x4E4E;&#x4E0D;&#x7528;&#x518D;&#x6807;&#x8BB0;&#x67D0;&#x4E2A;&#x90AE;&#x4EF6;&#x4E3A;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#xFF09;&#x3002;&#x540E;&#x6765;&#x51FA;&#x73B0;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x6570;&#x4EE5;&#x767E;&#x8BA1;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4EA7;&#x54C1;&#xFF0C;&#x652F;&#x6491;&#x4E86;&#x66F4;&#x591A;&#x4F60;&#x7ECF;&#x5E38;&#x4F7F;&#x7528;&#x7684;&#x4EA7;&#x54C1;&#x548C;&#x529F;&#x80FD;&#xFF0C;&#x4ECE;&#x63A8;&#x8350;&#x7CFB;&#x7EDF;&#x5230;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#x3002;</p>
<p>&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x8D77;&#x70B9;&#x548C;&#x7EC8;&#x70B9;&#x5206;&#x522B;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x786E;&#x5207;&#x7684;&#x8BB2;&#xFF0C;&#x673A;&#x5668;&#x8FDB;&#x884C;&#x5B66;&#x4E60;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF1F;&#x5982;&#x679C;&#x6211;&#x4E0B;&#x8F7D;&#x4E86;&#x4E00;&#x4EFD;&#x7EF4;&#x57FA;&#x767E;&#x79D1;&#x7684;&#x62F7;&#x8D1D;&#xFF0C;&#x6211;&#x7684;&#x7535;&#x8111;&#x5C31;&#x771F;&#x7684;&#x5B66;&#x4F1A;&#x4E86;&#x4EC0;&#x4E48;&#x5417;&#xFF1F;&#x5B83;&#x9A6C;&#x4E0A;&#x5C31;&#x53D8;&#x806A;&#x660E;&#x4E86;&#x5417;&#xFF1F;&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x4F1A;&#x6F84;&#x6E05;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x4EE5;&#x53CA;&#x4E3A;&#x4EC0;&#x4E48;&#x4F60;&#x8981;&#x4F7F;&#x7528;&#x5B83;&#x3002;</p>
<p>&#x7136;&#x540E;&#xFF0C;&#x5728;&#x6211;&#x4EEC;&#x51FA;&#x53D1;&#x53BB;&#x63A2;&#x7D22;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x65B0;&#x5927;&#x9646;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x89C2;&#x5BDF;&#x4E0B;&#x5730;&#x56FE;&#xFF0C;&#x4EE5;&#x4FBF;&#x77E5;&#x9053;&#x8FD9;&#x7247;&#x5927;&#x9646;&#x4E0A;&#x7684;&#x4E3B;&#x8981;&#x5730;&#x533A;&#x548C;&#x6700;&#x660E;&#x663E;&#x7684;&#x5730;&#x6807;&#xFF1A;&#x76D1;&#x7763;&#x5B66;&#x4E60;vs&#x975E;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#xFF0C;&#x5728;&#x7EBF;&#x5B66;&#x4E60;vs&#x6279;&#x91CF;&#x5B66;&#x4E60;&#xFF0C;&#x57FA;&#x4E8E;&#x5B9E;&#x4F8B;vs&#x57FA;&#x4E8E;&#x6A21;&#x578B;&#x5B66;&#x4E60;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x5B66;&#x4E60;&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x9879;&#x76EE;&#x7684;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#xFF0C;&#x8BA8;&#x8BBA;&#x53EF;&#x80FD;&#x78B0;&#x5230;&#x7684;&#x96BE;&#x70B9;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x8BC4;&#x4F30;&#x548C;&#x5FAE;&#x8C03;&#x4E00;&#x4E2A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7CFB;&#x7EDF;&#x3002;</p>
<p>&#x8FD9;&#x4E00;&#x7AE0;&#x4ECB;&#x7ECD;&#x4E86;&#x5927;&#x91CF;&#x6BCF;&#x4E2A;&#x6570;&#x636E;&#x79D1;&#x5B66;&#x5BB6;&#x9700;&#x8981;&#x7262;&#x8BB0;&#x5728;&#x5FC3;&#x7684;&#x57FA;&#x7840;&#x6982;&#x5FF5;&#xFF08;&#x548C;&#x4E60;&#x8BED;&#xFF09;&#x3002;&#x7B2C;&#x4E00;&#x7AE0;&#x53EA;&#x662F;&#x6982;&#x89C8;&#xFF08;&#x552F;&#x4E00;&#x4E0D;&#x542B;&#x6709;&#x4EE3;&#x7801;&#x7684;&#x4E00;&#x7AE0;&#xFF09;&#xFF0C;&#x76F8;&#x5F53;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x4F60;&#x8981;&#x786E;&#x4FDD;&#x6BCF;&#x4E00;&#x70B9;&#x90FD;&#x641E;&#x660E;&#x767D;&#x4E86;&#xFF0C;&#x518D;&#x7EE7;&#x7EED;&#x8FDB;&#x884C;&#x5B66;&#x4E60;&#x672C;&#x4E66;&#x5176;&#x4F59;&#x7AE0;&#x8282;&#x3002;&#x7AEF;&#x8D77;&#x4E00;&#x676F;&#x5496;&#x5561;&#xFF0C;&#x5F00;&#x59CB;&#x5B66;&#x4E60;&#x5427;&#xFF01;</p>
<blockquote>
<p>&#x63D0;&#x793A;&#xFF1A;&#x5982;&#x679C;&#x4F60;&#x5DF2;&#x7ECF;&#x77E5;&#x9053;&#x4E86;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x6240;&#x6709;&#x57FA;&#x7840;&#x6982;&#x5FF5;&#xFF0C;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x7FFB;&#x5230;&#x7B2C;2&#x7AE0;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x786E;&#x8BA4;&#xFF0C;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x56DE;&#x7B54;&#x672C;&#x7AE0;&#x672B;&#x5C3E;&#x5217;&#x51FA;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x7EE7;&#x7EED;&#x3002;</p>
</blockquote>
<h1 id="&#x4EC0;&#x4E48;&#x662F;&#x673A;&#x5668;&#x5B66;&#x4E60;&#xFF1F;">&#x4EC0;&#x4E48;&#x662F;&#x673A;&#x5668;&#x5B66;&#x4E60;&#xFF1F;</h1>
<p>&#x673A;&#x5668;&#x5B66;&#x4E60;&#x662F;&#x901A;&#x8FC7;&#x7F16;&#x7A0B;&#x8BA9;&#x8BA1;&#x7B97;&#x673A;&#x4ECE;&#x6570;&#x636E;&#x4E2D;&#x8FDB;&#x884C;&#x5B66;&#x4E60;&#x7684;&#x79D1;&#x5B66;&#xFF08;&#x548C;&#x827A;&#x672F;&#xFF09;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x4E00;&#x4E2A;&#x66F4;&#x5E7F;&#x4E49;&#x7684;&#x6982;&#x5FF5;&#xFF1A;</p>
<p>&#x673A;&#x5668;&#x5B66;&#x4E60;&#x662F;&#x8BA9;&#x8BA1;&#x7B97;&#x673A;&#x5177;&#x6709;&#x5B66;&#x4E60;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x65E0;&#x9700;&#x8FDB;&#x884C;&#x660E;&#x786E;&#x7F16;&#x7A0B;&#x3002; &#x2014;&#x2014; &#x4E9A;&#x745F;&#xB7;&#x8428;&#x7F2A;&#x5C14;&#xFF0C;1959</p>
<p>&#x548C;&#x4E00;&#x4E2A;&#x5DE5;&#x7A0B;&#x6027;&#x7684;&#x6982;&#x5FF5;&#xFF1A;</p>
<p>&#x8BA1;&#x7B97;&#x673A;&#x7A0B;&#x5E8F;&#x5229;&#x7528;&#x7ECF;&#x9A8C; E &#x5B66;&#x4E60;&#x4EFB;&#x52A1; T&#xFF0C;&#x6027;&#x80FD;&#x662F; P&#xFF0C;&#x5982;&#x679C;&#x9488;&#x5BF9;&#x4EFB;&#x52A1; T &#x7684;&#x6027;&#x80FD; P &#x968F;&#x7740;&#x7ECF;&#x9A8C; E &#x4E0D;&#x65AD;&#x589E;&#x957F;&#xFF0C;&#x5219;&#x79F0;&#x4E3A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x3002; &#x2014;&#x2014; &#x6C64;&#x59C6;&#xB7;&#x7C73;&#x5207;&#x5C14;&#xFF0C;1997</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x4F60;&#x7684;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x8FC7;&#x6EE4;&#x5668;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7A0B;&#x5E8F;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#xFF08;&#x6BD4;&#x5982;&#xFF0C;&#x7528;&#x6237;&#x6807;&#x8BB0;&#x7684;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#xFF09;&#x548C;&#x666E;&#x901A;&#x90AE;&#x4EF6;&#xFF08;&#x975E;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#xFF0C;&#x4E5F;&#x79F0;&#x4F5C; ham&#xFF09;&#x5B66;&#x4E60;&#x6807;&#x8BB0;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x3002;&#x7528;&#x6765;&#x8FDB;&#x884C;&#x5B66;&#x4E60;&#x7684;&#x6837;&#x4F8B;&#x79F0;&#x4F5C;&#x8BAD;&#x7EC3;&#x96C6;&#x3002;&#x6BCF;&#x4E2A;&#x8BAD;&#x7EC3;&#x6837;&#x4F8B;&#x79F0;&#x4F5C;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#xFF08;&#x6216;&#x6837;&#x672C;&#xFF09;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x4EFB;&#x52A1; T &#x5C31;&#x662F;&#x6807;&#x8BB0;&#x65B0;&#x90AE;&#x4EF6;&#x662F;&#x5426;&#x662F;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#xFF0C;&#x7ECF;&#x9A8C;E&#x662F;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#xFF0C;&#x6027;&#x80FD;P&#x9700;&#x8981;&#x5B9A;&#x4E49;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6B63;&#x786E;&#x5206;&#x7C7B;&#x7684;&#x6BD4;&#x4F8B;&#x3002;&#x8FD9;&#x4E2A;&#x6027;&#x80FD;&#x6307;&#x6807;&#x79F0;&#x4E3A;&#x51C6;&#x786E;&#x7387;&#xFF0C;&#x901A;&#x5E38;&#x7528;&#x5728;&#x5206;&#x7C7B;&#x4EFB;&#x52A1;&#x4E2D;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x4E0B;&#x8F7D;&#x4E86;&#x4E00;&#x4EFD;&#x7EF4;&#x57FA;&#x767E;&#x79D1;&#x7684;&#x62F7;&#x8D1D;&#xFF0C;&#x4F60;&#x7684;&#x7535;&#x8111;&#x867D;&#x7136;&#x6709;&#x4E86;&#x5F88;&#x591A;&#x6570;&#x636E;&#xFF0C;&#x4F46;&#x4E0D;&#x4F1A;&#x9A6C;&#x4E0A;&#x53D8;&#x5F97;&#x806A;&#x660E;&#x8D77;&#x6765;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8FD9;&#x4E0D;&#x662F;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x3002;</p>
<h1 id="&#x4E3A;&#x4EC0;&#x4E48;&#x4F7F;&#x7528;&#x673A;&#x5668;&#x5B66;&#x4E60;&#xFF1F;">&#x4E3A;&#x4EC0;&#x4E48;&#x4F7F;&#x7528;&#x673A;&#x5668;&#x5B66;&#x4E60;&#xFF1F;</h1>
<p>&#x601D;&#x8003;&#x4E00;&#x4E0B;&#xFF0C;&#x4F60;&#x4F1A;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x4F20;&#x7EDF;&#x7684;&#x7F16;&#x7A0B;&#x6280;&#x672F;&#x5199;&#x4E00;&#x4E2A;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x8FC7;&#x6EE4;&#x5668;&#xFF08;&#x56FE; 1-1&#xFF09;&#xFF1A;</p>
<ol>
<li><p>&#x4F60;&#x5148;&#x89C2;&#x5BDF;&#x4E0B;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x4E00;&#x822C;&#x90FD;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#x3002;&#x4F60;&#x53EF;&#x80FD;&#x6CE8;&#x610F;&#x5230;&#x4E00;&#x4E9B;&#x8BCD;&#x6216;&#x77ED;&#x8BED;&#xFF08;&#x6BD4;&#x5982; 4U&#x3001;credit card&#x3001;free&#x3001;amazing&#xFF09;&#x5728;&#x90AE;&#x4EF6;&#x4E3B;&#x9898;&#x4E2D;&#x9891;&#x7E41;&#x51FA;&#x73B0;&#xFF0C;&#x4E5F;&#x8BB8;&#x8FD8;&#x6CE8;&#x610F;&#x5230;&#x53D1;&#x4EF6;&#x4EBA;&#x540D;&#x5B57;&#x3001;&#x90AE;&#x4EF6;&#x6B63;&#x6587;&#x7684;&#x683C;&#x5F0F;&#xFF0C;&#x7B49;&#x7B49;&#x3002;</p>
</li>
<li><p>&#x4F60;&#x4E3A;&#x89C2;&#x5BDF;&#x5230;&#x7684;&#x89C4;&#x5F8B;&#x5199;&#x4E86;&#x4E00;&#x4E2A;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;&#xFF0C;&#x5982;&#x679C;&#x68C0;&#x6D4B;&#x5230;&#x4E86;&#x8FD9;&#x4E9B;&#x89C4;&#x5F8B;&#xFF0C;&#x7A0B;&#x5E8F;&#x5C31;&#x4F1A;&#x6807;&#x8BB0;&#x90AE;&#x4EF6;&#x4E3A;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x3002;</p>
</li>
<li><p>&#x6D4B;&#x8BD5;&#x7A0B;&#x5E8F;&#xFF0C;&#x91CD;&#x590D;&#x7B2C;1&#x6B65;&#x548C;&#x7B2C;2&#x6B65;&#xFF0C;&#x76F4;&#x5230;&#x6EE1;&#x8DB3;&#x8981;&#x6C42;&#x3002;</p>
</li>
</ol>
<p><img src="../images/chapter_1/1-1.png" alt=""></p>
<p>&#x56FE; 1-1 &#x4F20;&#x7EDF;&#x65B9;&#x6CD5;</p>
<p>&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5E76;&#x4E0D;&#x7B80;&#x5355;&#xFF0C;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x53D8;&#x6210;&#x4E00;&#x957F;&#x4E32;&#x590D;&#x6742;&#x7684;&#x89C4;&#x5219;&#x2014;&#x2014; &#x8FD9;&#x6837;&#x5C31;&#x4F1A;&#x5F88;&#x96BE;&#x7EF4;&#x62A4;&#x3002;</p>
<p>&#x76F8;&#x53CD;&#x7684;&#xFF0C;&#x57FA;&#x4E8E;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6280;&#x672F;&#x7684;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x8FC7;&#x6EE4;&#x5668;&#x4F1A;&#x81EA;&#x52A8;&#x5B66;&#x4E60;&#x54EA;&#x4E2A;&#x8BCD;&#x548C;&#x77ED;&#x8BED;&#x662F;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x7684;&#x9884;&#x6D4B;&#x503C;&#xFF0C;&#x901A;&#x8FC7;&#x4E0E;&#x666E;&#x901A;&#x90AE;&#x4EF6;&#x6BD4;&#x8F83;&#xFF0C;&#x68C0;&#x6D4B;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x4E2D;&#x53CD;&#x5E38;&#x9891;&#x6B21;&#x7684;&#x8BCD;&#x8BED;&#x683C;&#x5F0F;&#xFF08;&#x56FE; 1-2&#xFF09;&#x3002;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x77ED;&#x5F97;&#x591A;&#xFF0C;&#x66F4;&#x6613;&#x7EF4;&#x62A4;&#xFF0C;&#x4E5F;&#x66F4;&#x7CBE;&#x786E;&#x3002;</p>
<p><img src="../images/chapter_1/1-2.png" alt=""></p>
<p>&#x56FE; 1-2 &#x673A;&#x5668;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;</p>
<p>&#x8FDB;&#x800C;&#xFF0C;&#x5982;&#x679C;&#x53D1;&#x9001;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x7684;&#x4EBA;&#x53D1;&#x73B0;&#x6240;&#x6709;&#x5305;&#x542B;&#x201C;4U&#x201D;&#x7684;&#x90AE;&#x4EF6;&#x90FD;&#x88AB;&#x5C4F;&#x853D;&#x4E86;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x8F6C;&#x800C;&#x4F7F;&#x7528;&#x201C;For U&#x201D;&#x3002;&#x4F7F;&#x7528;&#x4F20;&#x7EDF;&#x65B9;&#x6CD5;&#x7684;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x8FC7;&#x6EE4;&#x5668;&#x9700;&#x8981;&#x66F4;&#x65B0;&#x4EE5;&#x6807;&#x8BB0;&#x201C;For U&#x201D;&#x3002;&#x5982;&#x679C;&#x53D1;&#x9001;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x7684;&#x4EBA;&#x6301;&#x7EED;&#x66F4;&#x6539;&#xFF0C;&#x4F60;&#x5C31;&#x9700;&#x8981;&#x88AB;&#x52A8;&#x5730;&#x4E0D;&#x505C;&#x5730;&#x5199;&#x5165;&#x65B0;&#x89C4;&#x5219;&#x3002;</p>
<p>&#x76F8;&#x53CD;&#x7684;&#xFF0C;&#x57FA;&#x4E8E;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x8FC7;&#x6EE4;&#x5668;&#x4F1A;&#x81EA;&#x52A8;&#x6CE8;&#x610F;&#x5230;&#x201C;For U&#x201D;&#x5728;&#x7528;&#x6237;&#x624B;&#x52A8;&#x6807;&#x8BB0;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x4E2D;&#x7684;&#x53CD;&#x5E38;&#x9891;&#x7E41;&#x6027;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x80FD;&#x81EA;&#x52A8;&#x6807;&#x8BB0;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x800C;&#x65E0;&#x9700;&#x5E72;&#x9884;&#x4E86;&#xFF08;&#x56FE;1-3&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_1/1-3.png" alt=""></p>
<p>&#x56FE; 1-3 &#x81EA;&#x52A8;&#x9002;&#x5E94;&#x6539;&#x53D8;</p>
<p>&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x4F18;&#x70B9;&#x662F;&#x5584;&#x4E8E;&#x5904;&#x7406;&#x5BF9;&#x4E8E;&#x4F20;&#x7EDF;&#x65B9;&#x6CD5;&#x592A;&#x590D;&#x6742;&#x6216;&#x662F;&#x6CA1;&#x6709;&#x5DF2;&#x77E5;&#x7B97;&#x6CD5;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5BF9;&#x4E8E;&#x8BED;&#x8A00;&#x8BC6;&#x522B;&#xFF1A;&#x5047;&#x5982;&#x60F3;&#x5199;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x8BC6;&#x522B;&#x201C;one&#x201D;&#x548C;&#x201C;two&#x201D;&#x7684;&#x7B80;&#x5355;&#x7A0B;&#x5E8F;&#x3002;&#x4F60;&#x53EF;&#x80FD;&#x6CE8;&#x610F;&#x5230;&#x201C;two&#x201D;&#x8D77;&#x59CB;&#x662F;&#x4E00;&#x4E2A;&#x9AD8;&#x97F3;&#xFF08;&#x201C;T&#x201D;&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x5199;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x6D4B;&#x91CF;&#x9AD8;&#x97F3;&#x5F3A;&#x5EA6;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x7528;&#x5B83;&#x533A;&#x5206; one &#x548C; two&#x3002;&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x4E0D;&#x80FD;&#x63A8;&#x5E7F;&#x5230;&#x5608;&#x6742;&#x73AF;&#x5883;&#x4E0B;&#x7684;&#x6570;&#x767E;&#x4E07;&#x4EBA;&#x7684;&#x6570;&#x5343;&#x8BCD;&#x6C47;&#x3001;&#x6570;&#x5341;&#x79CD;&#x8BED;&#x8A00;&#x3002;&#xFF08;&#x73B0;&#x5728;&#xFF09;&#x6700;&#x4F73;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x6839;&#x636E;&#x5927;&#x91CF;&#x5355;&#x8BCD;&#x7684;&#x5F55;&#x97F3;&#xFF0C;&#x5199;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x81EA;&#x6211;&#x5B66;&#x4E60;&#x7684;&#x7B97;&#x6CD5;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x4EBA;&#x7C7B;&#x8FDB;&#x884C;&#x5B66;&#x4E60;&#xFF08;&#x56FE; 1-4&#xFF09;&#xFF1A;&#x53EF;&#x4EE5;&#x68C0;&#x67E5;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x5DF2;&#x7ECF;&#x638C;&#x63E1;&#x4E86;&#x4EC0;&#x4E48;&#xFF08;&#x5C3D;&#x7BA1;&#x5BF9;&#x4E8E;&#x67D0;&#x4E9B;&#x7B97;&#x6CD5;&#xFF0C;&#x8FD9;&#x6837;&#x505A;&#x4F1A;&#x6709;&#x70B9;&#x9EBB;&#x70E6;&#xFF09;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5F53;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x8FC7;&#x6EE4;&#x5668;&#x88AB;&#x8BAD;&#x7EC3;&#x4E86;&#x8DB3;&#x591F;&#x591A;&#x7684;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x7528;&#x5B83;&#x5217;&#x51FA;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x9884;&#x6D4B;&#x503C;&#x7684;&#x5355;&#x8BCD;&#x548C;&#x5355;&#x8BCD;&#x7EC4;&#x5408;&#x5217;&#x8868;&#x3002;&#x6709;&#x65F6;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x73B0;&#x4E0D;&#x5F15;&#x4EBA;&#x5173;&#x6CE8;&#x7684;&#x5173;&#x8054;&#x6216;&#x65B0;&#x8D8B;&#x52BF;&#xFF0C;&#x6709;&#x52A9;&#x4E8E;&#x5BF9;&#x95EE;&#x9898;&#x66F4;&#x597D;&#x7684;&#x7406;&#x89E3;&#x3002;</p>
<p><img src="../images/chapter_1/1-4.png" alt=""></p>
<p>&#x56FE; 1-4 &#x673A;&#x5668;&#x5B66;&#x4E60;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x4EBA;&#x7C7B;&#x5B66;&#x4E60;</p>
<p>&#x4F7F;&#x7528;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x6316;&#x6398;&#x5927;&#x91CF;&#x6570;&#x636E;&#xFF0C;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#x5E76;&#x4E0D;&#x663E;&#x8457;&#x7684;&#x89C4;&#x5F8B;&#x3002;&#x8FD9;&#x79F0;&#x4F5C;&#x6570;&#x636E;&#x6316;&#x6398;&#x3002;</p>
<p>&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#xFF0C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5584;&#x4E8E;&#xFF1A;</p>
<ul>
<li><p>&#x9700;&#x8981;&#x8FDB;&#x884C;&#x5927;&#x91CF;&#x624B;&#x5DE5;&#x8C03;&#x6574;&#x6216;&#x9700;&#x8981;&#x62E5;&#x6709;&#x957F;&#x4E32;&#x89C4;&#x5219;&#x624D;&#x80FD;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#xFF1A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x901A;&#x5E38;&#x53EF;&#x4EE5;&#x7B80;&#x5316;&#x4EE3;&#x7801;&#x3001;&#x63D0;&#x9AD8;&#x6027;&#x80FD;&#x3002;</p>
</li>
<li><p>&#x95EE;&#x9898;&#x590D;&#x6742;&#xFF0C;&#x4F20;&#x7EDF;&#x65B9;&#x6CD5;&#x96BE;&#x4EE5;&#x89E3;&#x51B3;&#xFF1A;&#x6700;&#x597D;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p>
</li>
<li><p>&#x73AF;&#x5883;&#x6709;&#x6CE2;&#x52A8;&#xFF1A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x53EF;&#x4EE5;&#x9002;&#x5E94;&#x65B0;&#x6570;&#x636E;&#x3002;</p>
</li>
<li><p>&#x6D1E;&#x5BDF;&#x590D;&#x6742;&#x95EE;&#x9898;&#x548C;&#x5927;&#x91CF;&#x6570;&#x636E;&#x3002;</p>
</li>
</ul>
<h1 id="&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7CFB;&#x7EDF;&#x7684;&#x7C7B;&#x578B;">&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7CFB;&#x7EDF;&#x7684;&#x7C7B;&#x578B;</h1>
<p>&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6709;&#x591A;&#x79CD;&#x7C7B;&#x578B;&#xFF0C;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x5982;&#x4E0B;&#x89C4;&#x5219;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#xFF1A;</p>
<ul>
<li>&#x662F;&#x5426;&#x5728;&#x4EBA;&#x7C7B;&#x76D1;&#x7763;&#x4E0B;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#xFF08;&#x76D1;&#x7763;&#xFF0C;&#x975E;&#x76D1;&#x7763;&#xFF0C;&#x534A;&#x76D1;&#x7763;&#x548C;&#x5F3A;&#x5316;&#x5B66;&#x4E60;&#xFF09;</li>
<li>&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x52A8;&#x6001;&#x6E10;&#x8FDB;&#x5B66;&#x4E60;&#xFF08;&#x5728;&#x7EBF;&#x5B66;&#x4E60; vs &#x6279;&#x91CF;&#x5B66;&#x4E60;&#xFF09;</li>
<li>&#x5B83;&#x4EEC;&#x662F;&#x5426;&#x53EA;&#x662F;&#x901A;&#x8FC7;&#x7B80;&#x5355;&#x5730;&#x6BD4;&#x8F83;&#x65B0;&#x7684;&#x6570;&#x636E;&#x70B9;&#x548C;&#x5DF2;&#x77E5;&#x7684;&#x6570;&#x636E;&#x70B9;&#xFF0C;&#x8FD8;&#x662F;&#x5728;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x4E2D;&#x8FDB;&#x884C;&#x6A21;&#x5F0F;&#x8BC6;&#x522B;&#xFF0C;&#x4EE5;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x9884;&#x6D4B;&#x6A21;&#x578B;&#xFF0C;&#x5C31;&#x50CF;&#x79D1;&#x5B66;&#x5BB6;&#x6240;&#x505A;&#x7684;&#x90A3;&#x6837;&#xFF08;&#x57FA;&#x4E8E;&#x5B9E;&#x4F8B;&#x5B66;&#x4E60; vs &#x57FA;&#x4E8E;&#x6A21;&#x578B;&#x5B66;&#x4E60;&#xFF09;</li>
</ul>
<p>&#x89C4;&#x5219;&#x5E76;&#x4E0D;&#x4EC5;&#x9650;&#x4E8E;&#x4EE5;&#x4E0A;&#x7684;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x4ED6;&#x4EEC;&#x8FDB;&#x884C;&#x7EC4;&#x5408;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;&#x5148;&#x8FDB;&#x7684;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x8FC7;&#x6EE4;&#x5668;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6A21;&#x578B;&#x52A8;&#x6001;&#x8FDB;&#x884C;&#x5B66;&#x4E60;&#xFF0C;&#x7528;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x548C;&#x666E;&#x901A;&#x90AE;&#x4EF6;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#x3002;&#x8FD9;&#x5C31;&#x8BA9;&#x5B83;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x5728;&#x7EBF;&#x3001;&#x57FA;&#x4E8E;&#x6A21;&#x578B;&#x3001;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x7CFB;&#x7EDF;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x66F4;&#x4ED4;&#x7EC6;&#x5730;&#x5B66;&#x4E60;&#x8FD9;&#x4E9B;&#x89C4;&#x5219;&#x3002;</p>
<h2 id="&#x76D1;&#x7763;&#x975E;&#x76D1;&#x7763;&#x5B66;&#x4E60;">&#x76D1;&#x7763;/&#x975E;&#x76D1;&#x7763;&#x5B66;&#x4E60;</h2>
<p>&#x673A;&#x5668;&#x5B66;&#x4E60;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x8BAD;&#x7EC3;&#x65F6;&#x76D1;&#x7763;&#x7684;&#x91CF;&#x548C;&#x7C7B;&#x578B;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#x3002;&#x4E3B;&#x8981;&#x6709;&#x56DB;&#x7C7B;&#xFF1A;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x3001;&#x975E;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x3001;&#x534A;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x548C;&#x5F3A;&#x5316;&#x5B66;&#x4E60;&#x3002;</p>
<h3 id="&#x76D1;&#x7763;&#x5B66;&#x4E60;">&#x76D1;&#x7763;&#x5B66;&#x4E60;</h3>
<p>&#x5728;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x4E2D;&#xFF0C;&#x7528;&#x6765;&#x8BAD;&#x7EC3;&#x7B97;&#x6CD5;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x5305;&#x542B;&#x4E86;&#x7B54;&#x6848;&#xFF0C;&#x79F0;&#x4E3A;&#x6807;&#x7B7E;&#xFF08;&#x56FE; 1-5&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_1/1-5.png" alt=""></p>
<p>&#x56FE; 1-5 &#x7528;&#x4E8E;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#xFF08;&#x6BD4;&#x5982;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x5206;&#x7C7B;&#xFF09;&#x7684;&#x52A0;&#x4E86;&#x6807;&#x7B7E;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;</p>
<p>&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x7684;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x4EFB;&#x52A1;&#x662F;&#x5206;&#x7C7B;&#x3002;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x8FC7;&#x6EE4;&#x5668;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;&#x7528;&#x8BB8;&#x591A;&#x5E26;&#x6709;&#x5F52;&#x7C7B;&#xFF08;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x6216;&#x666E;&#x901A;&#x90AE;&#x4EF6;&#xFF09;&#x7684;&#x90AE;&#x4EF6;&#x6837;&#x672C;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#xFF0C;&#x8FC7;&#x6EE4;&#x5668;&#x5FC5;&#x987B;&#x8FD8;&#x80FD;&#x5BF9;&#x65B0;&#x90AE;&#x4EF6;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x4EFB;&#x52A1;&#x662F;&#x9884;&#x6D4B;&#x76EE;&#x6807;&#x6570;&#x503C;&#xFF0C;&#x4F8B;&#x5982;&#x7ED9;&#x51FA;&#x4E00;&#x4E9B;&#x7279;&#x5F81;&#xFF08;&#x91CC;&#x7A0B;&#x6570;&#x3001;&#x8F66;&#x9F84;&#x3001;&#x54C1;&#x724C;&#x7B49;&#x7B49;&#xFF09;&#x79F0;&#x4F5C;&#x9884;&#x6D4B;&#x503C;&#xFF0C;&#x6765;&#x9884;&#x6D4B;&#x4E00;&#x8F86;&#x6C7D;&#x8F66;&#x7684;&#x4EF7;&#x683C;&#x3002;&#x8FD9;&#x7C7B;&#x4EFB;&#x52A1;&#x79F0;&#x4F5C;&#x56DE;&#x5F52;&#xFF08;&#x56FE; 1-6&#xFF09;&#x3002;&#x8981;&#x8BAD;&#x7EC3;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x7ED9;&#x51FA;&#x5927;&#x91CF;&#x6C7D;&#x8F66;&#x6837;&#x672C;&#xFF0C;&#x5305;&#x62EC;&#x5B83;&#x4EEC;&#x7684;&#x9884;&#x6D4B;&#x503C;&#x548C;&#x6807;&#x7B7E;&#xFF08;&#x5373;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x4EF7;&#x683C;&#xFF09;&#x3002;</p>
<blockquote>
<p>&#x6CE8;&#x89E3;&#xFF1A;&#x5728;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x5C5E;&#x6027;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x201C;&#x91CC;&#x7A0B;&#x6570;&#x201D;&#xFF09;&#xFF0C;&#x53D6;&#x51B3;&#x4E8E;&#x5177;&#x4F53;&#x95EE;&#x9898;&#x4E00;&#x4E2A;&#x7279;&#x5F81;&#x4F1A;&#x6709;&#x591A;&#x4E2A;&#x542B;&#x4E49;&#xFF0C;&#x4F46;&#x901A;&#x5E38;&#x662F;&#x5C5E;&#x6027;&#x52A0;&#x4E0A;&#x5B83;&#x7684;&#x503C;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x201C;&#x91CC;&#x7A0B;&#x6570;<code>=15000</code>&#x201D;&#xFF09;&#x3002;&#x8BB8;&#x591A;&#x4EBA;&#x662F;&#x4E0D;&#x533A;&#x5206;&#x5730;&#x4F7F;&#x7528;&#x5C5E;&#x6027;&#x548C;&#x7279;&#x5F81;&#x3002;</p>
</blockquote>
<p><img src="../images/chapter_1/1-6.png" alt=""></p>
<p>&#x56FE; 1-6 &#x56DE;&#x5F52;</p>
<p>&#x6CE8;&#x610F;&#xFF0C;&#x4E00;&#x4E9B;&#x56DE;&#x5F52;&#x7B97;&#x6CD5;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#xFF0C;&#x53CD;&#x4E4B;&#x4EA6;&#x7136;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x901A;&#x5E38;&#x7528;&#x6765;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x5F52;&#x5C5E;&#x67D0;&#x4E00;&#x7C7B;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x7684;&#x503C;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;20% &#x51E0;&#x7387;&#x4E3A;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#xFF09;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x4E00;&#x4E9B;&#x91CD;&#x8981;&#x7684;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#xFF08;&#x672C;&#x4E66;&#x90FD;&#x6709;&#x4ECB;&#x7ECD;&#xFF09;&#xFF1A;</p>
<ul>
<li>K&#x8FD1;&#x90BB;&#x7B97;&#x6CD5;</li>
<li>&#x7EBF;&#x6027;&#x56DE;&#x5F52;</li>
<li>&#x903B;&#x8F91;&#x56DE;&#x5F52;</li>
<li>&#x652F;&#x6301;&#x5411;&#x91CF;&#x673A;&#xFF08;SVM&#xFF09;</li>
<li>&#x51B3;&#x7B56;&#x6811;&#x548C;&#x968F;&#x673A;&#x68EE;&#x6797;  </li>
<li>&#x795E;&#x7ECF;&#x7F51;&#x7EDC;</li>
</ul>
<h2 id="&#x975E;&#x76D1;&#x7763;&#x5B66;&#x4E60;">&#x975E;&#x76D1;&#x7763;&#x5B66;&#x4E60;</h2>
<p>&#x5728;&#x975E;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x4E2D;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x731C;&#x5230;&#x4E86;&#xFF0C;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x662F;&#x6CA1;&#x6709;&#x52A0;&#x6807;&#x7B7E;&#x7684;&#xFF08;&#x56FE; 1-7&#xFF09;&#x3002;&#x7CFB;&#x7EDF;&#x5728;&#x6CA1;&#x6709;&#x8001;&#x5E08;&#x7684;&#x6761;&#x4EF6;&#x4E0B;&#x8FDB;&#x884C;&#x5B66;&#x4E60;&#x3002;</p>
<p><img src="../images/chapter_1/1-7.png" alt=""></p>
<p>&#x56FE; 1-7 &#x975E;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x7684;&#x4E00;&#x4E2A;&#x4E0D;&#x52A0;&#x6807;&#x7B7E;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x4E00;&#x4E9B;&#x6700;&#x91CD;&#x8981;&#x7684;&#x975E;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#xFF08;&#x6211;&#x4EEC;&#x4F1A;&#x5728;&#x7B2C; 8 &#x7AE0;&#x4ECB;&#x7ECD;&#x964D;&#x7EF4;&#xFF09;&#xFF1A;</p>
<ul>
<li><strong>&#x805A;&#x7C7B;</strong><br>K &#x5747;&#x503C;<br>&#x5C42;&#x6B21;&#x805A;&#x7C7B;&#x5206;&#x6790;&#xFF08;Hierarchical Cluster Analysis&#xFF0C;HCA&#xFF09;<br>&#x671F;&#x671B;&#x6700;&#x5927;&#x503C;</li>
<li><strong>&#x53EF;&#x89C6;&#x5316;&#x548C;&#x964D;&#x7EF4;</strong><br>&#x4E3B;&#x6210;&#x5206;&#x5206;&#x6790;&#xFF08;Principal Component Analysis&#xFF0C;PCA&#xFF09;<br>&#x6838;&#x4E3B;&#x6210;&#x5206;&#x5206;&#x6790;<br>&#x5C40;&#x90E8;&#x7EBF;&#x6027;&#x5D4C;&#x5165;&#xFF08;Locally-Linear Embedding&#xFF0C;LLE&#xFF09;<br>t-&#x5206;&#x5E03;&#x90BB;&#x57DF;&#x5D4C;&#x5165;&#x7B97;&#x6CD5;&#xFF08;t-distributed Stochastic Neighbor Embedding&#xFF0C;t-SNE&#xFF09;</li>
<li><strong>&#x5173;&#x8054;&#x6027;&#x89C4;&#x5219;&#x5B66;&#x4E60;</strong><br>Apriori &#x7B97;&#x6CD5;<br>Eclat &#x7B97;&#x6CD5;</li>
</ul>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x5047;&#x8BBE;&#x4F60;&#x6709;&#x4E00;&#x4EFD;&#x5173;&#x4E8E;&#x4F60;&#x7684;&#x535A;&#x5BA2;&#x8BBF;&#x5BA2;&#x7684;&#x5927;&#x91CF;&#x6570;&#x636E;&#x3002;&#x4F60;&#x60F3;&#x8FD0;&#x884C;&#x4E00;&#x4E2A;&#x805A;&#x7C7B;&#x7B97;&#x6CD5;&#xFF0C;&#x68C0;&#x6D4B;&#x76F8;&#x4F3C;&#x8BBF;&#x5BA2;&#x7684;&#x5206;&#x7EC4;&#xFF08;&#x56FE; 1-8&#xFF09;&#x3002;&#x4F60;&#x4E0D;&#x4F1A;&#x544A;&#x8BC9;&#x7B97;&#x6CD5;&#x67D0;&#x4E2A;&#x8BBF;&#x5BA2;&#x5C5E;&#x4E8E;&#x54EA;&#x4E00;&#x7C7B;&#xFF1A;&#x5B83;&#x4F1A;&#x81EA;&#x5DF1;&#x627E;&#x51FA;&#x5173;&#x7CFB;&#xFF0C;&#x65E0;&#x9700;&#x5E2E;&#x52A9;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x7B97;&#x6CD5;&#x53EF;&#x80FD;&#x6CE8;&#x610F;&#x5230; 40% &#x7684;&#x8BBF;&#x5BA2;&#x662F;&#x559C;&#x6B22;&#x6F2B;&#x753B;&#x4E66;&#x7684;&#x7537;&#x6027;&#xFF0C;&#x901A;&#x5E38;&#x662F;&#x665A;&#x4E0A;&#x8BBF;&#x95EE;&#xFF0C;20% &#x662F;&#x79D1;&#x5E7B;&#x7231;&#x597D;&#x8005;&#xFF0C;&#x4ED6;&#x4EEC;&#x662F;&#x5728;&#x5468;&#x672B;&#x8BBF;&#x95EE;&#x7B49;&#x7B49;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;&#x5C42;&#x6B21;&#x805A;&#x7C7B;&#x5206;&#x6790;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x8FD8;&#x4F1A;&#x7EC6;&#x5206;&#x6BCF;&#x4E2A;&#x5206;&#x7EC4;&#x4E3A;&#x66F4;&#x5C0F;&#x7684;&#x7EC4;&#x3002;&#x8FD9;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x4F60;&#x4E3A;&#x6BCF;&#x4E2A;&#x5206;&#x7EC4;&#x5B9A;&#x4F4D;&#x535A;&#x6587;&#x3002;</p>
<p><img src="../images/chapter_1/1-8.png" alt=""></p>
<p>&#x56FE; 1-8 &#x805A;&#x7C7B;</p>
<p>&#x53EF;&#x89C6;&#x5316;&#x7B97;&#x6CD5;&#x4E5F;&#x662F;&#x6781;&#x4F73;&#x7684;&#x975E;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x6848;&#x4F8B;&#xFF1A;&#x7ED9;&#x7B97;&#x6CD5;&#x5927;&#x91CF;&#x590D;&#x6742;&#x7684;&#x4E14;&#x4E0D;&#x52A0;&#x6807;&#x7B7E;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x7B97;&#x6CD5;&#x8F93;&#x51FA;&#x6570;&#x636E;&#x7684;2D&#x6216;3D&#x56FE;&#x50CF;&#xFF08;&#x56FE; 1-9&#xFF09;&#x3002;&#x7B97;&#x6CD5;&#x4F1A;&#x8BD5;&#x56FE;&#x4FDD;&#x7559;&#x6570;&#x636E;&#x7684;&#x7ED3;&#x6784;&#xFF08;&#x5373;&#x5C1D;&#x8BD5;&#x4FDD;&#x7559;&#x8F93;&#x5165;&#x7684;&#x72EC;&#x7ACB;&#x805A;&#x7C7B;&#xFF0C;&#x907F;&#x514D;&#x5728;&#x56FE;&#x50CF;&#x4E2D;&#x91CD;&#x53E0;&#xFF09;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x660E;&#x767D;&#x6570;&#x636E;&#x662F;&#x5982;&#x4F55;&#x7EC4;&#x7EC7;&#x8D77;&#x6765;&#x7684;&#xFF0C;&#x4E5F;&#x8BB8;&#x8FD8;&#x80FD;&#x53D1;&#x73B0;&#x9690;&#x85CF;&#x7684;&#x89C4;&#x5F8B;&#x3002;</p>
<p><img src="../images/chapter_1/1-9.png" alt=""></p>
<p>&#x56FE; 1-9 t-SNE &#x53EF;&#x89C6;&#x5316;&#x6848;&#x4F8B;&#xFF0C;&#x7A81;&#x51FA;&#x4E86;&#x805A;&#x7C7B;&#xFF08;&#x6CE8;&#xFF1A;&#x6CE8;&#x610F;&#x52A8;&#x7269;&#x662F;&#x4E0E;&#x6C7D;&#x8F66;&#x5206;&#x5F00;&#x7684;&#xFF0C;&#x9A6C;&#x548C;&#x9E7F;&#x5F88;&#x8FD1;&#x3001;&#x4E0E;&#x9E1F;&#x8DDD;&#x79BB;&#x8FDC;&#xFF0C;&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#xFF09;</p>
<p>&#x4E0E;&#x6B64;&#x6709;&#x5173;&#x8054;&#x7684;&#x4EFB;&#x52A1;&#x662F;&#x964D;&#x7EF4;&#xFF0C;&#x964D;&#x7EF4;&#x7684;&#x76EE;&#x7684;&#x662F;&#x7B80;&#x5316;&#x6570;&#x636E;&#x3001;&#x4F46;&#x662F;&#x4E0D;&#x80FD;&#x5931;&#x53BB;&#x5927;&#x90E8;&#x5206;&#x4FE1;&#x606F;&#x3002;&#x505A;&#x6CD5;&#x4E4B;&#x4E00;&#x662F;&#x5408;&#x5E76;&#x82E5;&#x5E72;&#x76F8;&#x5173;&#x7684;&#x7279;&#x5F81;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6C7D;&#x8F66;&#x7684;&#x91CC;&#x7A0B;&#x6570;&#x4E0E;&#x8F66;&#x9F84;&#x9AD8;&#x5EA6;&#x76F8;&#x5173;&#xFF0C;&#x964D;&#x7EF4;&#x7B97;&#x6CD5;&#x5C31;&#x4F1A;&#x5C06;&#x5B83;&#x4EEC;&#x5408;&#x5E76;&#x6210;&#x4E00;&#x4E2A;&#xFF0C;&#x8868;&#x793A;&#x6C7D;&#x8F66;&#x7684;&#x78E8;&#x635F;&#x3002;&#x8FD9;&#x53EB;&#x505A;&#x7279;&#x5F81;&#x63D0;&#x53D6;&#x3002;</p>
<blockquote>
<p>&#x63D0;&#x793A;&#xFF1A;&#x5728;&#x7528;&#x8BAD;&#x7EC3;&#x96C6;&#x8BAD;&#x7EC3;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#xFF08;&#x6BD4;&#x5982;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#xFF09;&#x65F6;&#xFF0C;&#x6700;&#x597D;&#x5BF9;&#x8BAD;&#x7EC3;&#x96C6;&#x8FDB;&#x884C;&#x964D;&#x7EF4;&#x3002;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x7684;&#x66F4;&#x5FEB;&#xFF0C;&#x5360;&#x7528;&#x7684;&#x786C;&#x76D8;&#x548C;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x66F4;&#x5C11;&#xFF0C;&#x6709;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x6027;&#x80FD;&#x4E5F;&#x66F4;&#x597D;&#x3002;</p>
</blockquote>
<p>&#x53E6;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x975E;&#x76D1;&#x7763;&#x4EFB;&#x52A1;&#x662F;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#xFF08;anomaly detection&#xFF09; &#x2014;&#x2014; &#x4F8B;&#x5982;&#xFF0C;&#x68C0;&#x6D4B;&#x5F02;&#x5E38;&#x7684;&#x4FE1;&#x7528;&#x5361;&#x8F6C;&#x8D26;&#x4EE5;&#x9632;&#x6B3A;&#x8BC8;&#xFF0C;&#x68C0;&#x6D4B;&#x5236;&#x9020;&#x7F3A;&#x9677;&#xFF0C;&#x6216;&#x8005;&#x5728;&#x8BAD;&#x7EC3;&#x4E4B;&#x524D;&#x81EA;&#x52A8;&#x4ECE;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x96C6;&#x53BB;&#x9664;&#x5F02;&#x5E38;&#x503C;&#x3002;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x7684;&#x7CFB;&#x7EDF;&#x4F7F;&#x7528;&#x6B63;&#x5E38;&#x503C;&#x8BAD;&#x7EC3;&#x7684;&#xFF0C;&#x5F53;&#x5B83;&#x78B0;&#x5230;&#x4E00;&#x4E2A;&#x65B0;&#x5B9E;&#x4F8B;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5224;&#x65AD;&#x8FD9;&#x4E2A;&#x65B0;&#x5B9E;&#x4F8B;&#x662F;&#x50CF;&#x6B63;&#x5E38;&#x503C;&#x8FD8;&#x662F;&#x5F02;&#x5E38;&#x503C;&#xFF08;&#x56FE; 1-10&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_1/1-10.png" alt=""></p>
<p>&#x56FE; 1-10 &#x5F02;&#x5E38;&#x68C0;&#x6D4B;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x5E38;&#x89C1;&#x7684;&#x975E;&#x76D1;&#x7763;&#x4EFB;&#x52A1;&#x662F;&#x5173;&#x8054;&#x89C4;&#x5219;&#x5B66;&#x4E60;&#xFF0C;&#x5B83;&#x7684;&#x76EE;&#x6807;&#x662F;&#x6316;&#x6398;&#x5927;&#x91CF;&#x6570;&#x636E;&#x4EE5;&#x53D1;&#x73B0;&#x5C5E;&#x6027;&#x95F4;&#x6709;&#x8DA3;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5047;&#x8BBE;&#x4F60;&#x62E5;&#x6709;&#x4E00;&#x4E2A;&#x8D85;&#x5E02;&#x3002;&#x5728;&#x9500;&#x552E;&#x65E5;&#x5FD7;&#x4E0A;&#x8FD0;&#x884C;&#x5173;&#x8054;&#x89C4;&#x5219;&#xFF0C;&#x53EF;&#x80FD;&#x53D1;&#x73B0;&#x4E70;&#x4E86;&#x70E7;&#x70E4;&#x9171;&#x548C;&#x85AF;&#x7247;&#x7684;&#x4EBA;&#x4E5F;&#x4F1A;&#x4E70;&#x725B;&#x6392;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x8FD9;&#x4E9B;&#x5546;&#x54C1;&#x653E;&#x5728;&#x4E00;&#x8D77;&#x3002;</p>
<h2 id="&#x534A;&#x76D1;&#x7763;&#x5B66;&#x4E60;">&#x534A;&#x76D1;&#x7763;&#x5B66;&#x4E60;</h2>
<p>&#x4E00;&#x4E9B;&#x7B97;&#x6CD5;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x90E8;&#x5206;&#x5E26;&#x6807;&#x7B7E;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#xFF0C;&#x901A;&#x5E38;&#x662F;&#x5927;&#x91CF;&#x4E0D;&#x5E26;&#x6807;&#x7B7E;&#x6570;&#x636E;&#x52A0;&#x4E0A;&#x5C0F;&#x90E8;&#x5206;&#x5E26;&#x6807;&#x7B7E;&#x6570;&#x636E;&#x3002;&#x8FD9;&#x79F0;&#x4F5C;&#x534A;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#xFF08;&#x56FE; 1-11&#xFF09;&#x3002;</p>
<p>&#x4E00;&#x4E9B;&#x56FE;&#x7247;&#x5B58;&#x50A8;&#x670D;&#x52A1;&#xFF0C;&#x6BD4;&#x5982; Google Photos&#xFF0C;&#x662F;&#x534A;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x7684;&#x597D;&#x4F8B;&#x5B50;&#x3002;&#x4E00;&#x65E6;&#x4F60;&#x4E0A;&#x4F20;&#x4E86;&#x6240;&#x6709;&#x5BB6;&#x5EAD;&#x76F8;&#x7247;&#xFF0C;&#x5B83;&#x5C31;&#x80FD;&#x81EA;&#x52A8;&#x8BC6;&#x522B;&#x5230;&#x4EBA;&#x7269; A &#x51FA;&#x73B0;&#x5728;&#x4E86;&#x76F8;&#x7247; 1&#x3001;5&#x3001;11 &#x4E2D;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x4EBA; B &#x51FA;&#x73B0;&#x5728;&#x4E86;&#x76F8;&#x7247; 2&#x3001;5&#x3001;7 &#x4E2D;&#x3002;&#x8FD9;&#x662F;&#x7B97;&#x6CD5;&#x7684;&#x975E;&#x76D1;&#x7763;&#x90E8;&#x5206;&#xFF08;&#x805A;&#x7C7B;&#xFF09;&#x3002;&#x73B0;&#x5728;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x7684;&#x5C31;&#x662F;&#x4F60;&#x544A;&#x8BC9;&#x5B83;&#x8FD9;&#x4E24;&#x4E2A;&#x4EBA;&#x662F;&#x8C01;&#x3002;&#x53EA;&#x8981;&#x7ED9;&#x6BCF;&#x4E2A;&#x4EBA;&#x4E00;&#x4E2A;&#x6807;&#x7B7E;&#xFF0C;&#x7B97;&#x6CD5;&#x5C31;&#x53EF;&#x4EE5;&#x547D;&#x540D;&#x6BCF;&#x5F20;&#x7167;&#x7247;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x4EBA;&#xFF0C;&#x7279;&#x522B;&#x9002;&#x5408;&#x641C;&#x7D22;&#x7167;&#x7247;&#x3002;</p>
<p><img src="../images/chapter_1/1-11.png" alt=""></p>
<p>&#x56FE; 1-11 &#x534A;&#x76D1;&#x7763;&#x5B66;&#x4E60;</p>
<p>&#x591A;&#x6570;&#x534A;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x662F;&#x975E;&#x76D1;&#x7763;&#x548C;&#x76D1;&#x7763;&#x7B97;&#x6CD5;&#x7684;&#x7ED3;&#x5408;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6DF1;&#x5EA6;&#x4FE1;&#x5FF5;&#x7F51;&#x7EDC;&#xFF08;deep belief networks&#xFF09;&#x662F;&#x57FA;&#x4E8E;&#x88AB;&#x79F0;&#x4E3A;&#x4E92;&#x76F8;&#x53E0;&#x52A0;&#x7684;&#x53D7;&#x9650;&#x73BB;&#x5C14;&#x5179;&#x66FC;&#x673A;&#xFF08;restricted Boltzmann machines&#xFF0C;RBM&#xFF09;&#x7684;&#x975E;&#x76D1;&#x7763;&#x7EC4;&#x4EF6;&#x3002;RBM &#x662F;&#x5148;&#x7528;&#x975E;&#x76D1;&#x7763;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#xFF0C;&#x518D;&#x7528;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x5BF9;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x5FAE;&#x8C03;&#x3002;</p>
<h2 id="&#x5F3A;&#x5316;&#x5B66;&#x4E60;">&#x5F3A;&#x5316;&#x5B66;&#x4E60;</h2>
<p>&#x5F3A;&#x5316;&#x5B66;&#x4E60;&#x975E;&#x5E38;&#x4E0D;&#x540C;&#x3002;&#x5B66;&#x4E60;&#x7CFB;&#x7EDF;&#x5728;&#x8FD9;&#x91CC;&#x88AB;&#x79F0;&#x4E3A;&#x667A;&#x80FD;&#x4F53;&#xFF08;agent&#xFF09;&#xFF0C;&#x53EF;&#x4EE5;&#x5BF9;&#x73AF;&#x5883;&#x8FDB;&#x884C;&#x89C2;&#x5BDF;&#x3001;&#x9009;&#x62E9;&#x548C;&#x6267;&#x884C;&#x52A8;&#x4F5C;&#xFF0C;&#x5E76;&#x83B7;&#x5F97;&#x5956;&#x52B1;&#x4F5C;&#x4E3A;&#x56DE;&#x62A5;&#xFF08;&#x8D1F;&#x5956;&#x52B1;&#x662F;&#x60E9;&#x7F5A;&#xFF0C;&#x89C1;&#x56FE; 1-12&#xFF09;&#x3002;&#x7136;&#x540E;&#x5B83;&#x5FC5;&#x987B;&#x81EA;&#x5DF1;&#x5B66;&#x4E60;&#x54EA;&#x4E2A;&#x662F;&#x6700;&#x4F73;&#x65B9;&#x6CD5;&#xFF08;&#x79F0;&#x4E3A;&#x7B56;&#x7565;&#xFF0C;policy&#xFF09;&#xFF0C;&#x4EE5;&#x5F97;&#x5230;&#x957F;&#x4E45;&#x7684;&#x6700;&#x5927;&#x5956;&#x52B1;&#x3002;&#x7B56;&#x7565;&#x51B3;&#x5B9A;&#x4E86;&#x667A;&#x80FD;&#x4F53;&#x5728;&#x7ED9;&#x5B9A;&#x60C5;&#x51B5;&#x4E0B;&#x5E94;&#x8BE5;&#x91C7;&#x53D6;&#x7684;&#x884C;&#x52A8;&#x3002;</p>
<p><img src="../images/chapter_1/1-12.png" alt=""></p>
<p>&#x56FE; 1-12 &#x5F3A;&#x5316;&#x5B66;&#x4E60;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x8BB8;&#x591A;&#x673A;&#x5668;&#x4EBA;&#x8FD0;&#x884C;&#x5F3A;&#x5316;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x4EE5;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x884C;&#x8D70;&#x3002;DeepMind &#x7684; AlphaGo &#x4E5F;&#x662F;&#x5F3A;&#x5316;&#x5B66;&#x4E60;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;&#x5B83;&#x5728; 2016 &#x5E74;&#x4E09;&#x6708;&#x51FB;&#x8D25;&#x4E86;&#x4E16;&#x754C;&#x56F4;&#x68CB;&#x51A0;&#x519B;&#x674E;&#x4E16;&#x77F3;&#xFF08;&#x8BD1;&#x8005;&#x6CE8;&#xFF1A;2017 &#x5E74;&#x4E94;&#x6708;&#xFF0C;AlphaGo &#x53C8;&#x51FB;&#x8D25;&#x4E86;&#x4E16;&#x754C;&#x6392;&#x540D;&#x7B2C;&#x4E00;&#x7684;&#x67EF;&#x6D01;&#xFF09;&#x3002;&#x5B83;&#x662F;&#x901A;&#x8FC7;&#x5206;&#x6790;&#x6570;&#x767E;&#x4E07;&#x76D8;&#x68CB;&#x5C40;&#x5B66;&#x4E60;&#x5236;&#x80DC;&#x7B56;&#x7565;&#xFF0C;&#x7136;&#x540E;&#x81EA;&#x5DF1;&#x548C;&#x81EA;&#x5DF1;&#x4E0B;&#x68CB;&#x3002;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x5728;&#x6BD4;&#x8D5B;&#x4E2D;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x662F;&#x5173;&#x95ED;&#x7684;&#xFF1B;AlphaGo &#x53EA;&#x662F;&#x4F7F;&#x7528;&#x5B83;&#x5B66;&#x4F1A;&#x7684;&#x7B56;&#x7565;&#x3002;</p>
<h1 id="&#x6279;&#x91CF;&#x548C;&#x5728;&#x7EBF;&#x5B66;&#x4E60;">&#x6279;&#x91CF;&#x548C;&#x5728;&#x7EBF;&#x5B66;&#x4E60;</h1>
<p>&#x53E6;&#x4E00;&#x4E2A;&#x7528;&#x6765;&#x5206;&#x7C7B;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x51C6;&#x5219;&#x662F;&#xFF0C;&#x5B83;&#x662F;&#x5426;&#x80FD;&#x4ECE;&#x5BFC;&#x5165;&#x7684;&#x6570;&#x636E;&#x6D41;&#x8FDB;&#x884C;&#x6301;&#x7EED;&#x5B66;&#x4E60;&#x3002;</p>
<h2 id="&#x6279;&#x91CF;&#x5B66;&#x4E60;">&#x6279;&#x91CF;&#x5B66;&#x4E60;</h2>
<p>&#x5728;&#x6279;&#x91CF;&#x5B66;&#x4E60;&#x4E2D;&#xFF0C;&#x7CFB;&#x7EDF;&#x4E0D;&#x80FD;&#x8FDB;&#x884C;&#x6301;&#x7EED;&#x5B66;&#x4E60;&#xFF1A;&#x5FC5;&#x987B;&#x7528;&#x6240;&#x6709;&#x53EF;&#x7528;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#x3002;&#x8FD9;&#x901A;&#x5E38;&#x4F1A;&#x5360;&#x7528;&#x5927;&#x91CF;&#x65F6;&#x95F4;&#x548C;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#xFF0C;&#x6240;&#x4EE5;&#x4E00;&#x822C;&#x662F;&#x7EBF;&#x4E0B;&#x505A;&#x7684;&#x3002;&#x9996;&#x5148;&#x662F;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#xFF0C;&#x7136;&#x540E;&#x90E8;&#x7F72;&#x5728;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E14;&#x505C;&#x6B62;&#x5B66;&#x4E60;&#xFF0C;&#x5B83;&#x53EA;&#x662F;&#x4F7F;&#x7528;&#x5DF2;&#x7ECF;&#x5B66;&#x5230;&#x7684;&#x7B56;&#x7565;&#x3002;&#x8FD9;&#x79F0;&#x4E3A;&#x79BB;&#x7EBF;&#x5B66;&#x4E60;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8BA9;&#x4E00;&#x4E2A;&#x6279;&#x91CF;&#x5B66;&#x4E60;&#x7CFB;&#x7EDF;&#x660E;&#x767D;&#x65B0;&#x6570;&#x636E;&#xFF08;&#x4F8B;&#x5982;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x7684;&#x65B0;&#x7C7B;&#x578B;&#xFF09;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x4ECE;&#x5934;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x65B0;&#x7248;&#x672C;&#xFF0C;&#x4F7F;&#x7528;&#x5168;&#x90E8;&#x6570;&#x636E;&#x96C6;&#xFF08;&#x4E0D;&#x4EC5;&#x6709;&#x65B0;&#x6570;&#x636E;&#x4E5F;&#x6709;&#x8001;&#x6570;&#x636E;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x505C;&#x6389;&#x8001;&#x7CFB;&#x7EDF;&#xFF0C;&#x6362;&#x4E0A;&#x65B0;&#x7CFB;&#x7EDF;&#x3002;</p>
<p>&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x8BAD;&#x7EC3;&#x3001;&#x8BC4;&#x4F30;&#x3001;&#x90E8;&#x7F72;&#x4E00;&#x5957;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x7CFB;&#x7EDF;&#x7684;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x53EF;&#x4EE5;&#x81EA;&#x52A8;&#x8FDB;&#x884C;&#xFF08;&#x89C1;&#x56FE; 1-3&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#x5373;&#x4FBF;&#x662F;&#x6279;&#x91CF;&#x5B66;&#x4E60;&#x4E5F;&#x53EF;&#x4EE5;&#x9002;&#x5E94;&#x6539;&#x53D8;&#x3002;&#x53EA;&#x8981;&#x6709;&#x9700;&#x8981;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x65B9;&#x4FBF;&#x5730;&#x66F4;&#x65B0;&#x6570;&#x636E;&#x3001;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x65B0;&#x7248;&#x672C;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x901A;&#x5E38;&#x53EF;&#x4EE5;&#x6EE1;&#x8DB3;&#x9700;&#x6C42;&#xFF0C;&#x4F46;&#x662F;&#x7528;&#x5168;&#x90E8;&#x6570;&#x636E;&#x96C6;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#x4F1A;&#x82B1;&#x8D39;&#x5927;&#x91CF;&#x65F6;&#x95F4;&#xFF0C;&#x6240;&#x4EE5;&#x4E00;&#x822C;&#x662F;&#x6BCF; 24 &#x5C0F;&#x65F6;&#x6216;&#x6BCF;&#x5468;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x65B0;&#x7CFB;&#x7EDF;&#x3002;&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x5FEB;&#x901F;&#x9002;&#x5E94;&#x53D8;&#x5316;&#x7684;&#x6570;&#x636E;&#xFF08;&#x6BD4;&#x5982;&#xFF0C;&#x9884;&#x6D4B;&#x80A1;&#x4EF7;&#x53D8;&#x5316;&#xFF09;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x54CD;&#x5E94;&#x66F4;&#x53CA;&#x65F6;&#x7684;&#x65B9;&#x6848;&#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x7528;&#x5168;&#x90E8;&#x6570;&#x636E;&#x8BAD;&#x7EC3;&#x9700;&#x8981;&#x5927;&#x91CF;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#xFF08;CPU&#x3001;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x3001;&#x78C1;&#x76D8;&#x7A7A;&#x95F4;&#x3001;&#x78C1;&#x76D8; I/O&#x3001;&#x7F51;&#x7EDC; I/O &#x7B49;&#x7B49;&#xFF09;&#x3002;&#x5982;&#x679C;&#x4F60;&#x6709;&#x5927;&#x91CF;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x8BA9;&#x7CFB;&#x7EDF;&#x6BCF;&#x5929;&#x81EA;&#x52A8;&#x4ECE;&#x5934;&#x5F00;&#x59CB;&#x8BAD;&#x7EC3;&#xFF0C;&#x5C31;&#x4F1A;&#x5F00;&#x9500;&#x5F88;&#x5927;&#x3002;&#x5982;&#x679C;&#x6570;&#x636E;&#x91CF;&#x5DE8;&#x5927;&#xFF0C;&#x751A;&#x81F3;&#x65E0;&#x6CD5;&#x4F7F;&#x7528;&#x6279;&#x91CF;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7684;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x81EA;&#x52A8;&#x5B66;&#x4E60;&#xFF0C;&#x4F46;&#x662F;&#x8D44;&#x6E90;&#x6709;&#x9650;&#xFF08;&#x6BD4;&#x5982;&#xFF0C;&#x4E00;&#x53F0;&#x667A;&#x80FD;&#x624B;&#x673A;&#x6216;&#x706B;&#x661F;&#x8F66;&#xFF09;&#xFF0C;&#x643A;&#x5E26;&#x5927;&#x91CF;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x3001;&#x6BCF;&#x5929;&#x82B1;&#x8D39;&#x6570;&#x5C0F;&#x65F6;&#x7684;&#x5927;&#x91CF;&#x8D44;&#x6E90;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#x662F;&#x4E0D;&#x5B9E;&#x9645;&#x7684;&#x3002;</p>
<p>&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E0A;&#x9762;&#x8FD9;&#x4E9B;&#x60C5;&#x51B5;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x66F4;&#x4F73;&#x7684;&#x65B9;&#x6848;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x6301;&#x7EED;&#x5B66;&#x4E60;&#x3002;</p>
<h2 id="&#x5728;&#x7EBF;&#x5B66;&#x4E60;">&#x5728;&#x7EBF;&#x5B66;&#x4E60;</h2>
<p>&#x5728;&#x5728;&#x7EBF;&#x5B66;&#x4E60;&#x4E2D;&#xFF0C;&#x662F;&#x7528;&#x6570;&#x636E;&#x5B9E;&#x4F8B;&#x6301;&#x7EED;&#x5730;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#xFF0C;&#x53EF;&#x4EE5;&#x4E00;&#x6B21;&#x4E00;&#x4E2A;&#x6216;&#x4E00;&#x6B21;&#x51E0;&#x4E2A;&#x5B9E;&#x4F8B;&#xFF08;&#x79F0;&#x4E3A;&#x5C0F;&#x6279;&#x91CF;&#xFF09;&#x3002;&#x6BCF;&#x4E2A;&#x5B66;&#x4E60;&#x6B65;&#x9AA4;&#x90FD;&#x5F88;&#x5FEB;&#x4E14;&#x5EC9;&#x4EF7;&#xFF0C;&#x6240;&#x4EE5;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x52A8;&#x6001;&#x5730;&#x5B66;&#x4E60;&#x6536;&#x5230;&#x7684;&#x6700;&#x65B0;&#x6570;&#x636E;&#xFF08;&#x89C1;&#x56FE; 1-13&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_1/1-13.png" alt=""></p>
<p>&#x56FE; 1-13 &#x5728;&#x7EBF;&#x5B66;&#x4E60;</p>
<p>&#x5728;&#x7EBF;&#x5B66;&#x4E60;&#x5F88;&#x9002;&#x5408;&#x7CFB;&#x7EDF;&#x63A5;&#x6536;&#x8FDE;&#x7EED;&#x6D41;&#x7684;&#x6570;&#x636E;&#xFF08;&#x6BD4;&#x5982;&#xFF0C;&#x80A1;&#x7968;&#x4EF7;&#x683C;&#xFF09;&#xFF0C;&#x4E14;&#x9700;&#x8981;&#x81EA;&#x52A8;&#x5BF9;&#x6539;&#x53D8;&#x4F5C;&#x51FA;&#x8C03;&#x6574;&#x3002;&#x5982;&#x679C;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#x6709;&#x9650;&#xFF0C;&#x5728;&#x7EBF;&#x5B66;&#x4E60;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x65B9;&#x6848;&#xFF1A;&#x4E00;&#x65E6;&#x5728;&#x7EBF;&#x5B66;&#x4E60;&#x7CFB;&#x7EDF;&#x5B66;&#x4E60;&#x4E86;&#x65B0;&#x7684;&#x6570;&#x636E;&#x5B9E;&#x4F8B;&#xFF0C;&#x5B83;&#x5C31;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x6254;&#x6389;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#xFF08;&#x9664;&#x975E;&#x4F60;&#x60F3;&#x6EDA;&#x56DE;&#x5230;&#x4E4B;&#x524D;&#x7684;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#xFF0C;&#x518D;&#x6B21;&#x4F7F;&#x7528;&#x6570;&#x636E;&#xFF09;&#x3002;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x8282;&#x7701;&#x5927;&#x91CF;&#x7684;&#x7A7A;&#x95F4;&#x3002;</p>
<p>&#x5728;&#x7EBF;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x4E5F;&#x9002;&#x7528;&#x4E8E;&#x5728;&#x8D85;&#x5927;&#x6570;&#x636E;&#x96C6;&#xFF08;&#x4E00;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x4E0D;&#x8DB3;&#x4EE5;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x5B83;&#xFF09;&#x4E0A;&#x8BAD;&#x7EC3;&#x7CFB;&#x7EDF;&#xFF08;&#x8FD9;&#x79F0;&#x4F5C;&#x6838;&#x5916;&#x5B66;&#x4E60;&#xFF0C;<em>out-of-core</em> learning&#xFF09;&#x3002;&#x7B97;&#x6CD5;&#x6BCF;&#x6B21;&#x53EA;&#x52A0;&#x8F7D;&#x90E8;&#x5206;&#x6570;&#x636E;&#xFF0C;&#x7528;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#xFF0C;&#x7136;&#x540E;&#x91CD;&#x590D;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x76F4;&#x5230;&#x4F7F;&#x7528;&#x5B8C;&#x6240;&#x6709;&#x6570;&#x636E;&#xFF08;&#x89C1;&#x56FE; 1-14&#xFF09;&#x3002;</p>
<blockquote>
<p>&#x8B66;&#x544A;&#xFF1A;&#x8FD9;&#x4E2A;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x901A;&#x5E38;&#x662F;&#x79BB;&#x7EBF;&#x5B8C;&#x6210;&#x7684;&#xFF08;&#x5373;&#xFF0C;&#x4E0D;&#x5728;&#x90E8;&#x7F72;&#x7684;&#x7CFB;&#x7EDF;&#x4E0A;&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x7EBF;&#x5B66;&#x4E60;&#x8FD9;&#x4E2A;&#x540D;&#x5B57;&#x4F1A;&#x8BA9;&#x4EBA;&#x7591;&#x60D1;&#x3002;&#x53EF;&#x4EE5;&#x628A;&#x5B83;&#x60F3;&#x6210;&#x6301;&#x7EED;&#x5B66;&#x4E60;&#x3002;</p>
</blockquote>
<p><img src="../images/chapter_1/1-14.png" alt=""></p>
<p>&#x56FE; 1-14 &#x4F7F;&#x7528;&#x5728;&#x7EBF;&#x5B66;&#x4E60;&#x5904;&#x7406;&#x5927;&#x91CF;&#x6570;&#x636E;&#x96C6;</p>
<p>&#x5728;&#x7EBF;&#x5B66;&#x4E60;&#x7CFB;&#x7EDF;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x53C2;&#x6570;&#x662F;&#xFF0C;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x591A;&#x5FEB;&#x5730;&#x9002;&#x5E94;&#x6570;&#x636E;&#x7684;&#x6539;&#x53D8;&#xFF1A;&#x8FD9;&#x88AB;&#x79F0;&#x4E3A;&#x5B66;&#x4E60;&#x901F;&#x7387;&#x3002;&#x5982;&#x679C;&#x4F60;&#x8BBE;&#x5B9A;&#x4E00;&#x4E2A;&#x9AD8;&#x5B66;&#x4E60;&#x901F;&#x7387;&#xFF0C;&#x7CFB;&#x7EDF;&#x5C31;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x9002;&#x5E94;&#x65B0;&#x6570;&#x636E;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x4F1A;&#x5FEB;&#x901F;&#x5FD8;&#x8BB0;&#x8001;&#x6570;&#x636E;&#xFF08;&#x4F60;&#x53EF;&#x4E0D;&#x60F3;&#x8BA9;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x8FC7;&#x6EE4;&#x5668;&#x53EA;&#x6807;&#x8BB0;&#x6700;&#x65B0;&#x7684;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x79CD;&#x7C7B;&#xFF09;&#x3002;&#x76F8;&#x53CD;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8BBE;&#x5B9A;&#x7684;&#x5B66;&#x4E60;&#x901F;&#x7387;&#x4F4E;&#xFF0C;&#x7CFB;&#x7EDF;&#x7684;&#x60F0;&#x6027;&#x5C31;&#x4F1A;&#x5F3A;&#xFF1A;&#x5373;&#xFF0C;&#x5B83;&#x5B66;&#x7684;&#x66F4;&#x6162;&#xFF0C;&#x4F46;&#x5BF9;&#x65B0;&#x6570;&#x636E;&#x4E2D;&#x7684;&#x566A;&#x58F0;&#x6216;&#x6CA1;&#x6709;&#x4EE3;&#x8868;&#x6027;&#x7684;&#x6570;&#x636E;&#x70B9;&#x7ED3;&#x679C;&#x4E0D;&#x90A3;&#x4E48;&#x654F;&#x611F;&#x3002;</p>
<p>&#x5728;&#x7EBF;&#x5B66;&#x4E60;&#x7684;&#x6311;&#x6218;&#x4E4B;&#x4E00;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x574F;&#x6570;&#x636E;&#x88AB;&#x7528;&#x6765;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#xFF0C;&#x7CFB;&#x7EDF;&#x7684;&#x6027;&#x80FD;&#x5C31;&#x4F1A;&#x9010;&#x6E10;&#x4E0B;&#x6ED1;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x90E8;&#x7F72;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x7528;&#x6237;&#x5C31;&#x4F1A;&#x6CE8;&#x610F;&#x5230;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x574F;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x6765;&#x81EA;&#x5931;&#x7075;&#x7684;&#x4F20;&#x611F;&#x5668;&#x6216;&#x673A;&#x5668;&#x4EBA;&#xFF0C;&#x6216;&#x67D0;&#x4EBA;&#x5411;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x4F20;&#x5165;&#x5783;&#x573E;&#x4FE1;&#x606F;&#x4EE5;&#x63D0;&#x9AD8;&#x641C;&#x7D22;&#x6392;&#x540D;&#x3002;&#x8981;&#x51CF;&#x5C0F;&#x8FD9;&#x79CD;&#x98CE;&#x9669;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x5BC6;&#x96C6;&#x76D1;&#x6D4B;&#xFF0C;&#x5982;&#x679C;&#x68C0;&#x6D4B;&#x5230;&#x6027;&#x80FD;&#x4E0B;&#x964D;&#xFF0C;&#x8981;&#x5FEB;&#x901F;&#x5173;&#x95ED;&#xFF08;&#x6216;&#x662F;&#x6EDA;&#x56DE;&#x5230;&#x4E00;&#x4E2A;&#x4E4B;&#x524D;&#x7684;&#x72B6;&#x6001;&#xFF09;&#x3002;&#x4F60;&#x53EF;&#x80FD;&#x8FD8;&#x8981;&#x76D1;&#x6D4B;&#x8F93;&#x5165;&#x6570;&#x636E;&#xFF0C;&#x5BF9;&#x53CD;&#x5E38;&#x6570;&#x636E;&#x505A;&#x51FA;&#x53CD;&#x5E94;&#xFF08;&#x6BD4;&#x5982;&#xFF0C;&#x4F7F;&#x7528;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;&#xFF09;&#x3002;</p>
<h1 id="&#x57FA;&#x4E8E;&#x5B9E;&#x4F8B;-vs-&#x57FA;&#x4E8E;&#x6A21;&#x578B;&#x5B66;&#x4E60;">&#x57FA;&#x4E8E;&#x5B9E;&#x4F8B; vs &#x57FA;&#x4E8E;&#x6A21;&#x578B;&#x5B66;&#x4E60;</h1>
<p>&#x53E6;&#x4E00;&#x79CD;&#x5206;&#x7C7B;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x5224;&#x65AD;&#x5B83;&#x4EEC;&#x662F;&#x5982;&#x4F55;&#x8FDB;&#x884C;&#x5F52;&#x7EB3;&#x63A8;&#x5E7F;&#x7684;&#x3002;&#x5927;&#x591A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4EFB;&#x52A1;&#x662F;&#x5173;&#x4E8E;&#x9884;&#x6D4B;&#x7684;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x7ED9;&#x5B9A;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#xFF0C;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x80FD;&#x63A8;&#x5E7F;&#x5230;&#x4E4B;&#x524D;&#x6CA1;&#x89C1;&#x5230;&#x8FC7;&#x7684;&#x6837;&#x672C;&#x3002;&#x5BF9;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x96C6;&#x6709;&#x5F88;&#x597D;&#x7684;&#x6027;&#x80FD;&#x8FD8;&#x4E0D;&#x591F;&#xFF0C;&#x771F;&#x6B63;&#x7684;&#x76EE;&#x6807;&#x662F;&#x5BF9;&#x65B0;&#x5B9E;&#x4F8B;&#x9884;&#x6D4B;&#x7684;&#x6027;&#x80FD;&#x3002;</p>
<p>&#x6709;&#x4E24;&#x79CD;&#x4E3B;&#x8981;&#x7684;&#x5F52;&#x7EB3;&#x65B9;&#x6CD5;&#xFF1A;&#x57FA;&#x4E8E;&#x5B9E;&#x4F8B;&#x5B66;&#x4E60;&#x548C;&#x57FA;&#x4E8E;&#x6A21;&#x578B;&#x5B66;&#x4E60;&#x3002;</p>
<h2 id="&#x57FA;&#x4E8E;&#x5B9E;&#x4F8B;&#x5B66;&#x4E60;">&#x57FA;&#x4E8E;&#x5B9E;&#x4F8B;&#x5B66;&#x4E60;</h2>
<p>&#x4E5F;&#x8BB8;&#x6700;&#x7B80;&#x5355;&#x7684;&#x5B66;&#x4E60;&#x5F62;&#x5F0F;&#x5C31;&#x662F;&#x7528;&#x8BB0;&#x5FC6;&#x5B66;&#x4E60;&#x3002;&#x5982;&#x679C;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x505A;&#x4E00;&#x4E2A;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x68C0;&#x6D4B;&#x5668;&#xFF0C;&#x53EA;&#x9700;&#x6807;&#x8BB0;&#x6240;&#x6709;&#x548C;&#x7528;&#x6237;&#x6807;&#x8BB0;&#x7684;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x76F8;&#x540C;&#x7684;&#x90AE;&#x4EF6; &#x2014;&#x2014; &#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x4E0D;&#x5DEE;&#xFF0C;&#x4F46;&#x80AF;&#x5B9A;&#x4E0D;&#x662F;&#x6700;&#x597D;&#x7684;&#x3002;</p>
<p>&#x4E0D;&#x4EC5;&#x80FD;&#x6807;&#x8BB0;&#x548C;&#x5DF2;&#x77E5;&#x7684;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x76F8;&#x540C;&#x7684;&#x90AE;&#x4EF6;&#xFF0C;&#x4F60;&#x7684;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x8FC7;&#x6EE4;&#x5668;&#x4E5F;&#x8981;&#x80FD;&#x6807;&#x8BB0;&#x7C7B;&#x4F3C;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x7684;&#x90AE;&#x4EF6;&#x3002;&#x8FD9;&#x5C31;&#x9700;&#x8981;&#x6D4B;&#x91CF;&#x4E24;&#x5C01;&#x90AE;&#x4EF6;&#x7684;&#x76F8;&#x4F3C;&#x6027;&#x3002;&#x4E00;&#x4E2A;&#xFF08;&#x7B80;&#x5355;&#x7684;&#xFF09;&#x76F8;&#x4F3C;&#x5EA6;&#x6D4B;&#x91CF;&#x65B9;&#x6CD5;&#x662F;&#x7EDF;&#x8BA1;&#x4E24;&#x5C01;&#x90AE;&#x4EF6;&#x5305;&#x542B;&#x7684;&#x76F8;&#x540C;&#x5355;&#x8BCD;&#x7684;&#x6570;&#x91CF;&#x3002;&#x5982;&#x679C;&#x4E00;&#x5C01;&#x90AE;&#x4EF6;&#x542B;&#x6709;&#x8BB8;&#x591A;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x4E2D;&#x7684;&#x8BCD;&#xFF0C;&#x5C31;&#x4F1A;&#x88AB;&#x6807;&#x8BB0;&#x4E3A;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x3002;</p>
<p>&#x8FD9;&#x88AB;&#x79F0;&#x4F5C;&#x57FA;&#x4E8E;&#x5B9E;&#x4F8B;&#x5B66;&#x4E60;&#xFF1A;&#x7CFB;&#x7EDF;&#x5148;&#x7528;&#x8BB0;&#x5FC6;&#x5B66;&#x4E60;&#x6848;&#x4F8B;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x76F8;&#x4F3C;&#x5EA6;&#x6D4B;&#x91CF;&#x63A8;&#x5E7F;&#x5230;&#x65B0;&#x7684;&#x4F8B;&#x5B50;&#xFF08;&#x56FE; 1-15&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_1/1-15.png" alt=""></p>
<p>&#x56FE; 1-15 &#x57FA;&#x4E8E;&#x5B9E;&#x4F8B;&#x5B66;&#x4E60;</p>
<h2 id="&#x57FA;&#x4E8E;&#x6A21;&#x578B;&#x5B66;&#x4E60;">&#x57FA;&#x4E8E;&#x6A21;&#x578B;&#x5B66;&#x4E60;</h2>
<p>&#x53E6;&#x4E00;&#x79CD;&#x4ECE;&#x6837;&#x672C;&#x96C6;&#x8FDB;&#x884C;&#x5F52;&#x7EB3;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x5EFA;&#x7ACB;&#x8FD9;&#x4E9B;&#x6837;&#x672C;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#x8FDB;&#x884C;&#x9884;&#x6D4B;&#x3002;&#x8FD9;&#x79F0;&#x4F5C;&#x57FA;&#x4E8E;&#x6A21;&#x578B;&#x5B66;&#x4E60;&#xFF08;&#x56FE; 1-16&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_1/1-16.png" alt=""></p>
<p>&#x56FE; 1-16 &#x57FA;&#x4E8E;&#x6A21;&#x578B;&#x5B66;&#x4E60;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x4F60;&#x60F3;&#x77E5;&#x9053;&#x94B1;&#x662F;&#x5426;&#x80FD;&#x8BA9;&#x4EBA;&#x5FEB;&#x4E50;&#xFF0C;&#x4F60;&#x4ECE; <a href="http://stats.oecd.org/index.aspx?DataSetCode=BLI" target="_blank">OECD &#x7F51;&#x7AD9;</a>&#x4E0B;&#x8F7D;&#x4E86; Better Life Index &#x6307;&#x6570;&#x6570;&#x636E;&#xFF0C;&#x8FD8;&#x4ECE; <a href="http://www.imf.org/external/pubs/ft/weo/2016/01/weodata/weorept.aspx?pr.x=32&amp;pr.y=8&amp;sy=2015&amp;ey=2015&amp;scsm=1&amp;ssd=1&amp;sort=country&amp;ds=.&amp;br=1&amp;c=512%2C668%2C914%2C672%2C612%2C946%2C614%2C137%2C311%2C962%2C213%2C674%2C911%2C676%2C193%2C548%2C122%2C556%2C912%2C678%2C313%2C181%2C419%2C867%2C513%2C682%2C316%2C684%2C913%2C273%2C124%2C868%2C339%2C921%2C638%2C948%2C514%2C943%2C218%2C686%2C963%2C688%2C616%2C518%2C223%2C728%2C516%2C558%2C918%2C138%2C748%2C196%2C618%2C278%2C624%2C692%2C522%2C694%2C622%2C142%2C156%2C449%2C626%2C564%2C628%2C565%2C228%2C283%2C924%2C853%2C233%2C288%2C632%2C293%2C636%2C566%2C634%2C964%2C238%2C182%2C662%2C453%2C960%2C968%2C423%2C922%2C935%2C714%2C128%2C862%2C611%2C135%2C321%2C716%2C243%2C456%2C248%2C722%2C469%2C942%2C253%2C718%2C642%2C724%2C643%2C576%2C939%2C936%2C644%2C961%2C819%2C813%2C172%2C199%2C132%2C733%2C646%2C184%2C648%2C524%2C915%2C361%2C134%2C362%2C652%2C364%2C174%2C732%2C328%2C366%2C258%2C734%2C656%2C144%2C654%2C146%2C336%2C463%2C263%2C528%2C268%2C923%2C532%2C738%2C944%2C578%2C176%2C537%2C534%2C742%2C536%2C866%2C429%2C369%2C433%2C744%2C178%2C186%2C436%2C925%2C136%2C869%2C343%2C746%2C158%2C926%2C439%2C466%2C916%2C112%2C664%2C111%2C826%2C298%2C542%2C927%2C967%2C846%2C443%2C299%2C917%2C582%2C544%2C474%2C941%2C754%2C446%2C698%2C666&amp;s=NGDPDPC&amp;grp=0&amp;a=" target="_blank">IMF</a> &#x4E0B;&#x8F7D;&#x4E86;&#x4EBA;&#x5747; GDP &#x6570;&#x636E;&#x3002;&#x8868; 1-1 &#x5C55;&#x793A;&#x4E86;&#x6458;&#x8981;&#x3002;</p>
<p><img src="../images/chapter_1/t-1-1.png" alt=""></p>
<p>&#x8868; 1-1 &#x94B1;&#x4F1A;&#x4F7F;&#x4EBA;&#x5E78;&#x798F;&#x5417;&#xFF1F;</p>
<p>&#x7528;&#x4E00;&#x4E9B;&#x56FD;&#x5BB6;&#x7684;&#x6570;&#x636E;&#x753B;&#x56FE;&#xFF08;&#x56FE; 1-17&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_1/1-17.png" alt=""></p>
<p>&#x56FE; 1-17 &#x4F60;&#x770B;&#x5230;&#x8D8B;&#x52BF;&#x4E86;&#x5417;&#xFF1F;</p>
<p>&#x786E;&#x5B9E;&#x80FD;&#x770B;&#x5230;&#x8D8B;&#x52BF;&#xFF01;&#x5C3D;&#x7BA1;&#x6570;&#x636E;&#x6709;&#x566A;&#x58F0;&#xFF08;&#x5373;&#xFF0C;&#x90E8;&#x5206;&#x968F;&#x673A;&#xFF09;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x751F;&#x6D3B;&#x6EE1;&#x610F;&#x5EA6;&#x662F;&#x968F;&#x7740;&#x4EBA;&#x5747; GDP &#x7684;&#x589E;&#x957F;&#x7EBF;&#x6027;&#x63D0;&#x9AD8;&#x7684;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x4F60;&#x51B3;&#x5B9A;&#x751F;&#x6D3B;&#x6EE1;&#x610F;&#x5EA6;&#x5EFA;&#x6A21;&#x4E3A;&#x4EBA;&#x5747; GDP &#x7684;&#x7EBF;&#x6027;&#x51FD;&#x6570;&#x3002;&#x8FD9;&#x4E00;&#x6B65;&#x79F0;&#x4F5C;&#x6A21;&#x578B;&#x9009;&#x62E9;&#xFF1A;&#x4F60;&#x9009;&#x4E00;&#x4E2A;&#x751F;&#x6D3B;&#x6EE1;&#x610F;&#x5EA6;&#x7684;&#x7EBF;&#x6027;&#x6A21;&#x578B;&#xFF0C;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5C5E;&#x6027;&#xFF0C;&#x4EBA;&#x5747; GDP&#xFF08;&#x516C;&#x5F0F; 1-1&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_1/o-1-1.png" alt=""></p>
<p>&#x516C;&#x5F0F; 1-1 &#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x7EBF;&#x6027;&#x6A21;&#x578B;</p>
<p>&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#x6709;&#x4E24;&#x4E2A;&#x53C2;&#x6570;<code>&#x3B8;0</code>&#x548C;<code>&#x3B8;1</code>&#x3002;&#x901A;&#x8FC7;&#x8C03;&#x6574;&#x8FD9;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x4F60;&#x7684;&#x6A21;&#x578B;&#x8868;&#x793A;&#x4EFB;&#x4F55;&#x7EBF;&#x6027;&#x51FD;&#x6570;&#xFF0C;&#x89C1;&#x56FE; 1-18&#x3002;</p>
<p><img src="../images/chapter_1/1-18.png" alt=""></p>
<p>&#x56FE; 1-18 &#x51E0;&#x4E2A;&#x53EF;&#x80FD;&#x7684;&#x7EBF;&#x6027;&#x6A21;&#x578B;</p>
<p>&#x5728;&#x4F7F;&#x7528;&#x6A21;&#x578B;&#x4E4B;&#x524D;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x786E;&#x5B9A;<code>&#x3B8;0</code>&#x548C;<code>&#x3B8;1</code>&#x3002;&#x5982;&#x4F55;&#x80FD;&#x77E5;&#x9053;&#x54EA;&#x4E2A;&#x503C;&#x53EF;&#x4EE5;&#x4F7F;&#x6A21;&#x578B;&#x7684;&#x6027;&#x80FD;&#x6700;&#x4F73;&#x5462;&#xFF1F;&#x8981;&#x56DE;&#x7B54;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x6307;&#x5B9A;&#x6027;&#x80FD;&#x7684;&#x91CF;&#x5EA6;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x5B9E;&#x7528;&#x51FD;&#x6570;&#xFF08;&#x6216;&#x62DF;&#x5408;&#x51FD;&#x6570;&#xFF09;&#x7528;&#x6765;&#x6D4B;&#x91CF;&#x6A21;&#x578B;&#x662F;&#x5426;&#x591F;&#x597D;&#xFF0C;&#x6216;&#x8005;&#x4F60;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x6765;&#x6D4B;&#x91CF;&#x6A21;&#x578B;&#x6709;&#x591A;&#x5DEE;&#x3002;&#x5BF9;&#x4E8E;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x95EE;&#x9898;&#xFF0C;&#x4EBA;&#x4EEC;&#x4E00;&#x822C;&#x662F;&#x7528;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x6D4B;&#x91CF;&#x7EBF;&#x6027;&#x6A21;&#x578B;&#x7684;&#x9884;&#x6D4B;&#x503C;&#x548C;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#x4E4B;&#x95F4;&#x7684;&#x8DDD;&#x79BB;&#x5DEE;&#xFF0C;&#x76EE;&#x6807;&#x662F;&#x4F7F;&#x8DDD;&#x79BB;&#x5DEE;&#x6700;&#x5C0F;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x5C31;&#x662F;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x7B97;&#x6CD5;&#xFF0C;&#x4F60;&#x7528;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#x8BAD;&#x7EC3;&#x7B97;&#x6CD5;&#xFF0C;&#x7B97;&#x6CD5;&#x627E;&#x5230;&#x4F7F;&#x7EBF;&#x6027;&#x6A21;&#x578B;&#x6700;&#x62DF;&#x5408;&#x6570;&#x636E;&#x7684;&#x53C2;&#x6570;&#x3002;&#x8FD9;&#x79F0;&#x4F5C;&#x6A21;&#x578B;&#x8BAD;&#x7EC3;&#x3002;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x7B97;&#x6CD5;&#x5F97;&#x5230;&#x7684;&#x53C2;&#x6570;&#x503C;&#x662F;<code>&#x3B8;0=4.85</code>&#x548C;<code>&#x3B8;1=4.91&#xD7;10&#x2013;5</code>&#x3002;</p>
<p>&#x73B0;&#x5728;&#x6A21;&#x578B;&#x5DF2;&#x7ECF;&#x6700;&#x7D27;&#x5BC6;&#x5730;&#x62DF;&#x5408;&#x5230;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x4E86;&#xFF0C;&#x89C1;&#x56FE; 1-19&#x3002;</p>
<p><img src="../images/chapter_1/1-19.png" alt=""></p>
<p>&#x56FE; 1-19 &#x6700;&#x4F73;&#x62DF;&#x5408;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x7684;&#x7EBF;&#x6027;&#x6A21;&#x578B;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x51C6;&#x5907;&#x8FD0;&#x884C;&#x6A21;&#x578B;&#x8FDB;&#x884C;&#x9884;&#x6D4B;&#x4E86;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5047;&#x5982;&#x4F60;&#x60F3;&#x77E5;&#x9053;&#x585E;&#x6D66;&#x8DEF;&#x65AF;&#x4EBA;&#x6709;&#x591A;&#x5E78;&#x798F;&#xFF0C;&#x4F46; OECD &#x6CA1;&#x6709;&#x5B83;&#x7684;&#x6570;&#x636E;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x6A21;&#x578B;&#x8FDB;&#x884C;&#x9884;&#x6D4B;&#xFF1A;&#x67E5;&#x8BE2;&#x585E;&#x6D66;&#x8DEF;&#x65AF;&#x7684;&#x4EBA;&#x5747; GDP&#xFF0C;&#x4E3A; 22587 &#x7F8E;&#x5143;&#xFF0C;&#x7136;&#x540E;&#x5E94;&#x7528;&#x6A21;&#x578B;&#x5F97;&#x5230;&#x751F;&#x6D3B;&#x6EE1;&#x610F;&#x5EA6;&#xFF0C;&#x540E;&#x8005;&#x7684;&#x503C;&#x5728;<code>4.85 + 22,587 &#xD7; 4.91 &#xD7; 10-5 = 5.96</code>&#x5DE6;&#x53F3;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x6FC0;&#x8D77;&#x4F60;&#x7684;&#x5174;&#x8DA3;&#xFF0C;&#x6848;&#x4F8B; 1-1 &#x5C55;&#x793A;&#x4E86;&#x52A0;&#x8F7D;&#x6570;&#x636E;&#x3001;&#x51C6;&#x5907;&#x3001;&#x521B;&#x5EFA;&#x6563;&#x70B9;&#x56FE;&#x7684; Python &#x4EE3;&#x7801;&#xFF0C;&#x7136;&#x540E;&#x8BAD;&#x7EC3;&#x7EBF;&#x6027;&#x6A21;&#x578B;&#x5E76;&#x8FDB;&#x884C;&#x9884;&#x6D4B;&#x3002;</p>
<p>&#x6848;&#x4F8B; 1-1&#xFF0C;&#x4F7F;&#x7528; Scikit-Learn &#x8BAD;&#x7EC3;&#x5E76;&#x8FD0;&#x884C;&#x7EBF;&#x6027;&#x6A21;&#x578B;&#x3002;</p>
<pre><code class="lang-python"><span class="hljs-keyword">import</span> matplotlib
<span class="hljs-keyword">import</span> matplotlib.pyplot <span class="hljs-keyword">as</span> plt
<span class="hljs-keyword">import</span> numpy <span class="hljs-keyword">as</span> np
<span class="hljs-keyword">import</span> pandas <span class="hljs-keyword">as</span> pd
<span class="hljs-keyword">import</span> sklearn

<span class="hljs-comment"># &#x52A0;&#x8F7D;&#x6570;&#x636E;</span>
oecd_bli = pd.read_csv(<span class="hljs-string">&quot;oecd_bli_2015.csv&quot;</span>, thousands=<span class="hljs-string">&apos;,&apos;</span>)
gdp_per_capita = pd.read_csv(<span class="hljs-string">&quot;gdp_per_capita.csv&quot;</span>,thousands=<span class="hljs-string">&apos;,&apos;</span>,delimiter=<span class="hljs-string">&apos;\t&apos;</span>,
                             encoding=<span class="hljs-string">&apos;latin1&apos;</span>, na_values=<span class="hljs-string">&quot;n/a&quot;</span>)

<span class="hljs-comment"># &#x51C6;&#x5907;&#x6570;&#x636E;</span>
country_stats = prepare_country_stats(oecd_bli, gdp_per_capita)
X = np.c_[country_stats[<span class="hljs-string">&quot;GDP per capita&quot;</span>]]
y = np.c_[country_stats[<span class="hljs-string">&quot;Life satisfaction&quot;</span>]]

<span class="hljs-comment"># &#x53EF;&#x89C6;&#x5316;&#x6570;&#x636E;</span>
country_stats.plot(kind=<span class="hljs-string">&apos;scatter&apos;</span>, x=<span class="hljs-string">&quot;GDP per capita&quot;</span>, y=<span class="hljs-string">&apos;Life satisfaction&apos;</span>)
plt.show()

<span class="hljs-comment"># &#x9009;&#x62E9;&#x7EBF;&#x6027;&#x6A21;&#x578B;</span>
lin_reg_model = sklearn.linear_model.LinearRegression()

<span class="hljs-comment"># &#x8BAD;&#x7EC3;&#x6A21;&#x578B;</span>
lin_reg_model.fit(X, y)

<span class="hljs-comment"># &#x5BF9;&#x585E;&#x6D66;&#x8DEF;&#x65AF;&#x8FDB;&#x884C;&#x9884;&#x6D4B;</span>
X_new = [[<span class="hljs-number">22587</span>]]  <span class="hljs-comment"># &#x585E;&#x6D66;&#x8DEF;&#x65AF;&#x7684;&#x4EBA;&#x5747;GDP</span>
print(lin_reg_model.predict(X_new)) <span class="hljs-comment"># outputs [[ 5.96242338]]</span>
</code></pre>
<blockquote>
<p>&#x6CE8;&#x89E3;&#xFF1A;&#x5982;&#x679C;&#x4F60;&#x4E4B;&#x524D;&#x63A5;&#x89E6;&#x8FC7;&#x57FA;&#x4E8E;&#x5B9E;&#x4F8B;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x65AF;&#x6D1B;&#x6587;&#x5C3C;&#x4E9A;&#x7684;&#x4EBA;&#x5747; GDP&#xFF08;20732 &#x7F8E;&#x5143;&#xFF09;&#x548C;&#x585E;&#x6D66;&#x8DEF;&#x65AF;&#x5DEE;&#x8DDD;&#x5F88;&#x5C0F;&#xFF0C;OECD &#x6570;&#x636E;&#x4E0A;&#x65AF;&#x6D1B;&#x6587;&#x5C3C;&#x4E9A;&#x7684;&#x751F;&#x6D3B;&#x6EE1;&#x610F;&#x5EA6;&#x662F; 5.7&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x9884;&#x6D4B;&#x585E;&#x6D66;&#x8DEF;&#x65AF;&#x7684;&#x751F;&#x6D3B;&#x6EE1;&#x610F;&#x5EA6;&#x4E5F;&#x662F; 5.7&#x3002;&#x5982;&#x679C;&#x653E;&#x5927;&#x4E00;&#x4E0B;&#x8303;&#x56F4;&#xFF0C;&#x770B;&#x4E00;&#x4E0B;&#x63A5;&#x4E0B;&#x6765;&#x4E24;&#x4E2A;&#x4E34;&#x8FD1;&#x7684;&#x56FD;&#x5BB6;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x8461;&#x8404;&#x7259;&#x548C;&#x897F;&#x73ED;&#x7259;&#x7684;&#x751F;&#x6D3B;&#x6EE1;&#x610F;&#x5EA6;&#x5206;&#x522B;&#x662F; 5.1 &#x548C; 6.5&#x3002;&#x5BF9;&#x8FD9;&#x4E09;&#x4E2A;&#x503C;&#x8FDB;&#x884C;&#x5E73;&#x5747;&#x5F97;&#x5230; 5.77&#xFF0C;&#x5C31;&#x548C;&#x57FA;&#x4E8E;&#x6A21;&#x578B;&#x7684;&#x9884;&#x6D4B;&#x503C;&#x5F88;&#x63A5;&#x8FD1;&#x3002;&#x8FD9;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x7B97;&#x6CD5;&#x53EB;&#x505A;k&#x8FD1;&#x90BB;&#x56DE;&#x5F52;&#xFF08;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;<code>k=3</code>&#xFF09;&#x3002;</p>
<p>&#x5728;&#x524D;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#x66FF;&#x6362;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x6A21;&#x578B;&#x4E3A; K &#x8FD1;&#x90BB;&#x6A21;&#x578B;&#xFF0C;&#x53EA;&#x9700;&#x66F4;&#x6362;&#x4E0B;&#x9762;&#x4E00;&#x884C;&#xFF1A;</p>
<pre><code class="lang-py">clf = sklearn.linear_model.LinearRegression()
</code></pre>
<p>&#x4E3A;&#xFF1A;</p>
<pre><code class="lang-py">clf = sklearn.neighbors.KNeighborsRegressor(n_neighbors=<span class="hljs-number">3</span>)
</code></pre>
</blockquote>
<p>&#x5982;&#x679C;&#x4E00;&#x5207;&#x987A;&#x5229;&#xFF0C;&#x4F60;&#x7684;&#x6A21;&#x578B;&#x5C31;&#x53EF;&#x4EE5;&#x4F5C;&#x51FA;&#x597D;&#x7684;&#x9884;&#x6D4B;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x80FD;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x66F4;&#x591A;&#x7684;&#x5C5E;&#x6027;&#xFF08;&#x5C31;&#x4E1A;&#x7387;&#x3001;&#x5065;&#x5EB7;&#x3001;&#x7A7A;&#x6C14;&#x6C61;&#x67D3;&#x7B49;&#x7B49;&#xFF09;&#xFF0C;&#x83B7;&#x53D6;&#x66F4;&#x591A;&#x66F4;&#x597D;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#xFF0C;&#x6216;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x66F4;&#x597D;&#x7684;&#x6A21;&#x578B;&#xFF08;&#x6BD4;&#x5982;&#xFF0C;&#x591A;&#x9879;&#x5F0F;&#x56DE;&#x5F52;&#x6A21;&#x578B;&#xFF09;&#x3002;</p>
<p>&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#xFF1A;</p>
<ul>
<li>&#x7814;&#x7A76;&#x6570;&#x636E;</li>
<li>&#x9009;&#x62E9;&#x6A21;&#x578B;</li>
<li>&#x7528;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#xFF08;&#x5373;&#xFF0C;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x641C;&#x5BFB;&#x6A21;&#x578B;&#x53C2;&#x6570;&#x503C;&#xFF0C;&#x4F7F;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x6700;&#x5C0F;&#xFF09;</li>
<li>&#x6700;&#x540E;&#xFF0C;&#x4F7F;&#x7528;&#x6A21;&#x578B;&#x5BF9;&#x65B0;&#x6848;&#x4F8B;&#x8FDB;&#x884C;&#x9884;&#x6D4B;&#xFF08;&#x8FD9;&#x79F0;&#x4F5C;&#x63A8;&#x65AD;&#xFF09;&#xFF0C;&#x4F46;&#x613F;&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#x63A8;&#x5E7F;&#x6548;&#x679C;&#x4E0D;&#x5DEE;</li>
</ul>
<p>&#x8FD9;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x9879;&#x76EE;&#x3002;&#x5728;&#x7B2C; 2 &#x7AE0;&#x4E2D;&#xFF0C;&#x4F60;&#x4F1A;&#x7B2C;&#x4E00;&#x624B;&#x5730;&#x63A5;&#x89E6;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x9879;&#x76EE;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5B66;&#x4E60;&#x4E86;&#x8BB8;&#x591A;&#x5173;&#x4E8E;&#x57FA;&#x7840;&#x7684;&#x5185;&#x5BB9;&#xFF1A;&#x4F60;&#x73B0;&#x5728;&#x77E5;&#x9053;&#x4E86;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x662F;&#x5173;&#x4E8E;&#x4EC0;&#x4E48;&#x7684;&#x3001;&#x4E3A;&#x4EC0;&#x4E48;&#x5B83;&#x8FD9;&#x4E48;&#x6709;&#x7528;&#x3001;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x5206;&#x7C7B;&#x3001;&#x5178;&#x578B;&#x7684;&#x9879;&#x76EE;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x4E00;&#x770B;&#x5B66;&#x4E60;&#x4E2D;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#x9519;&#x8BEF;&#xFF0C;&#x5BFC;&#x81F4;&#x4E0D;&#x80FD;&#x505A;&#x51FA;&#x51C6;&#x786E;&#x7684;&#x9884;&#x6D4B;&#x3002;</p>
<h1 id="&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x4E3B;&#x8981;&#x6311;&#x6218;">&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x4E3B;&#x8981;&#x6311;&#x6218;</h1>
<p>&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x7684;&#x4E3B;&#x8981;&#x4EFB;&#x52A1;&#x662F;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x5E76;&#x7528;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#xFF0C;&#x4F1A;&#x5BFC;&#x81F4;&#x9519;&#x8BEF;&#x7684;&#x4E24;&#x4EF6;&#x4E8B;&#x5C31;&#x662F;&#x201C;&#x9519;&#x8BEF;&#x7684;&#x7B97;&#x6CD5;&#x201D;&#x548C;&#x201C;&#x9519;&#x8BEF;&#x7684;&#x6570;&#x636E;&#x201D;&#x3002;&#x6211;&#x4EEC;&#x4ECE;&#x9519;&#x8BEF;&#x7684;&#x6570;&#x636E;&#x5F00;&#x59CB;&#x3002;</p>
<h2 id="&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x91CF;&#x4E0D;&#x8DB3;">&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x91CF;&#x4E0D;&#x8DB3;</h2>
<p>&#x8981;&#x8BA9;&#x4E00;&#x4E2A;&#x8E52;&#x8DDA;&#x5B66;&#x6B65;&#x7684;&#x5B69;&#x5B50;&#x77E5;&#x9053;&#x4EC0;&#x4E48;&#x662F;&#x82F9;&#x679C;&#xFF0C;&#x9700;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x6307;&#x7740;&#x4E00;&#x4E2A;&#x82F9;&#x679C;&#x8BF4;&#x201C;&#x82F9;&#x679C;&#x201D;&#xFF08;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x91CD;&#x590D;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x51E0;&#x6B21;&#xFF09;&#x3002;&#x73B0;&#x5728;&#x8FD9;&#x4E2A;&#x5B69;&#x5B50;&#x5C31;&#x80FD;&#x8BA4;&#x8BC6;&#x6240;&#x6709;&#x5F62;&#x72B6;&#x548C;&#x989C;&#x8272;&#x7684;&#x82F9;&#x679C;&#x3002;&#x771F;&#x662F;&#x4E2A;&#x5929;&#x624D;&#xFF01;</p>
<p>&#x673A;&#x5668;&#x5B66;&#x4E60;&#x8FD8;&#x8FBE;&#x4E0D;&#x5230;&#x8FD9;&#x4E2A;&#x7A0B;&#x5EA6;&#xFF1B;&#x9700;&#x8981;&#x5927;&#x91CF;&#x6570;&#x636E;&#xFF0C;&#x624D;&#x80FD;&#x8BA9;&#x591A;&#x6570;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x3002;&#x5373;&#x4FBF;&#x5BF9;&#x4E8E;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E00;&#x822C;&#x4E5F;&#x9700;&#x8981;&#x6570;&#x5343;&#x7684;&#x6837;&#x672C;&#xFF0C;&#x5BF9;&#x4E8E;&#x590D;&#x6742;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#x56FE;&#x50CF;&#x6216;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x6570;&#x767E;&#x4E07;&#x7684;&#x6837;&#x672C;&#xFF08;&#x9664;&#x975E;&#x4F60;&#x80FD;&#x91CD;&#x590D;&#x4F7F;&#x7528;&#x90E8;&#x5206;&#x5B58;&#x5728;&#x7684;&#x6A21;&#x578B;&#xFF09;&#x3002;</p>
<blockquote>
<p>&#x6570;&#x636E;&#x7684;&#x4E0D;&#x53EF;&#x601D;&#x8BAE;&#x7684;&#x6709;&#x6548;&#x6027;</p>
<p>&#x5728;&#x4E00;&#x7BC7; 2001 &#x5E74;&#x53D1;&#x8868;&#x7684;<a href="http://ucrel.lancs.ac.uk/acl/P/P01/P01-1005.pdf" target="_blank">&#x8457;&#x540D;&#x8BBA;&#x6587;</a>&#x4E2D;&#xFF0C;&#x5FAE;&#x8F6F;&#x7814;&#x7A76;&#x5458; Michele Banko &#x548C; Eric Brill &#x5C55;&#x793A;&#x4E86;&#x4E0D;&#x540C;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#xFF0C;&#x5305;&#x62EC;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x4E00;&#x65E6;&#x6709;&#x4E86;&#x5927;&#x91CF;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#xFF0C;&#x5728;&#x8FDB;&#x884C;&#x53BB;&#x9664;&#x8BED;&#x8A00;&#x6B67;&#x4E49;&#x7684;&#x6D4B;&#x8BD5;&#x4E2D;&#x51E0;&#x4E4E;&#x6709;&#x76F8;&#x540C;&#x7684;&#x6027;&#x80FD;&#xFF08;&#x89C1;&#x56FE; 1-20&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_1/1-20.png" alt=""></p>
<p>&#x56FE; 1-20 &#x6570;&#x636E;&#x548C;&#x7B97;&#x6CD5;&#x7684;&#x91CD;&#x8981;&#x6027;&#x5BF9;&#x6BD4;</p>
<p>&#x8BBA;&#x6587;&#x4F5C;&#x8005;&#x8BF4;&#xFF1A;&#x201C;&#x7ED3;&#x679C;&#x8BF4;&#x660E;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x8003;&#x8651;&#x5728;&#x7B97;&#x6CD5;&#x5F00;&#x53D1; vs &#x8BED;&#x6599;&#x5E93;&#x53D1;&#x5C55;&#x4E0A;&#x82B1;&#x8D39;&#x65F6;&#x95F4;&#x548C;&#x91D1;&#x94B1;&#x7684;&#x53D6;&#x820D;&#x3002;&#x201D;</p>
<p>&#x5BF9;&#x4E8E;&#x590D;&#x6742;&#x95EE;&#x9898;&#xFF0C;&#x6570;&#x636E;&#x6BD4;&#x7B97;&#x6CD5;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x4E3B;&#x5F20;&#x5728; 2009 &#x5E74;&#x7531; Norvig &#x53D1;&#x8868;&#x7684;&#x8BBA;&#x6587;<a href="https://link.jianshu.com?t=http%3A%2F%2Fstatic.googleusercontent.com%2Fmedia%2Fresearch.google.com%2Ffr%2F%2Fpubs%2Farchive%2F35179.pdf" target="_blank">&#x300A;The Unreasonable Effectiveness of Data&#x300B;</a>&#x5F97;&#x5230;&#x4E86;&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x63A8;&#x5E7F;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5E94;&#x8BE5;&#x6CE8;&#x610F;&#x5230;&#xFF0C;&#x5C0F;&#x578B;&#x548C;&#x4E2D;&#x578B;&#x7684;&#x6570;&#x636E;&#x96C6;&#x4ECD;&#x7136;&#x662F;&#x975E;&#x5E38;&#x5E38;&#x89C1;&#x7684;&#xFF0C;&#x83B7;&#x5F97;&#x989D;&#x5916;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x8F7B;&#x6613;&#x548C;&#x5EC9;&#x4EF7;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x8981;&#x629B;&#x5F03;&#x7B97;&#x6CD5;&#x3002;</p>
</blockquote>
<h2 id="&#x6CA1;&#x6709;&#x4EE3;&#x8868;&#x6027;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;">&#x6CA1;&#x6709;&#x4EE3;&#x8868;&#x6027;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;</h2>
<p>&#x4E3A;&#x4E86;&#x66F4;&#x597D;&#x5730;&#x8FDB;&#x884C;&#x5F52;&#x7EB3;&#x63A8;&#x5E7F;&#xFF0C;&#x8BA9;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x5BF9;&#x65B0;&#x6570;&#x636E;&#x5177;&#x6709;&#x4EE3;&#x8868;&#x6027;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x3002;&#x65E0;&#x8BBA;&#x4F60;&#x7528;&#x7684;&#x662F;&#x57FA;&#x4E8E;&#x5B9E;&#x4F8B;&#x5B66;&#x4E60;&#x6216;&#x57FA;&#x4E8E;&#x6A21;&#x578B;&#x5B66;&#x4E60;&#xFF0C;&#x8FD9;&#x70B9;&#x90FD;&#x5F88;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x7528;&#x6765;&#x8BAD;&#x7EC3;&#x7EBF;&#x6027;&#x6A21;&#x578B;&#x7684;&#x56FD;&#x5BB6;&#x96C6;&#x5408;&#x4E0D;&#x591F;&#x5177;&#x6709;&#x4EE3;&#x8868;&#x6027;&#xFF1A;&#x7F3A;&#x5C11;&#x4E86;&#x4E00;&#x4E9B;&#x56FD;&#x5BB6;&#x3002;&#x56FE; 1-21 &#x5C55;&#x793A;&#x4E86;&#x6DFB;&#x52A0;&#x8FD9;&#x4E9B;&#x7F3A;&#x5931;&#x56FD;&#x5BB6;&#x4E4B;&#x540E;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<p><img src="../images/chapter_1/1-21.png" alt=""></p>
<p>&#x56FE; 1-21 &#x4E00;&#x4E2A;&#x66F4;&#x5177;&#x4EE3;&#x8868;&#x6027;&#x7684;&#x8BAD;&#x7EC3;&#x6837;&#x672C;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x7528;&#x8FD9;&#x4EFD;&#x6570;&#x636E;&#x8BAD;&#x7EC3;&#x7EBF;&#x6027;&#x6A21;&#x578B;&#xFF0C;&#x5F97;&#x5230;&#x7684;&#x662F;&#x5B9E;&#x7EBF;&#xFF0C;&#x65E7;&#x6A21;&#x578B;&#x7528;&#x865A;&#x7EBF;&#x8868;&#x793A;&#x3002;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x6DFB;&#x52A0;&#x51E0;&#x4E2A;&#x56FD;&#x5BB6;&#x4E0D;&#x4EC5;&#x53EF;&#x4EE5;&#x663E;&#x8457;&#x5730;&#x6539;&#x53D8;&#x6A21;&#x578B;&#xFF0C;&#x5B83;&#x8FD8;&#x8BF4;&#x660E;&#x5982;&#x6B64;&#x7B80;&#x5355;&#x7684;&#x7EBF;&#x6027;&#x6A21;&#x578B;&#x53EF;&#x80FD;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x8FBE;&#x5230;&#x5F88;&#x597D;&#x7684;&#x6027;&#x80FD;&#x3002;&#x8C8C;&#x4F3C;&#x975E;&#x5E38;&#x5BCC;&#x88D5;&#x7684;&#x56FD;&#x5BB6;&#x6CA1;&#x6709;&#x4E2D;&#x7B49;&#x5BCC;&#x88D5;&#x7684;&#x56FD;&#x5BB6;&#x5FEB;&#x4E50;&#xFF08;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x975E;&#x5E38;&#x5BCC;&#x88D5;&#x7684;&#x56FD;&#x5BB6;&#x770B;&#x8D77;&#x6765;&#x66F4;&#x4E0D;&#x5FEB;&#x4E50;&#xFF09;&#xFF0C;&#x76F8;&#x53CD;&#x7684;&#xFF0C;&#x4E00;&#x4E9B;&#x8D2B;&#x7A77;&#x7684;&#x56FD;&#x5BB6;&#x770B;&#x4E0A;&#x53BB;&#x6BD4;&#x5BCC;&#x88D5;&#x7684;&#x56FD;&#x5BB6;&#x8FD8;&#x5E78;&#x798F;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x4E86;&#x6CA1;&#x6709;&#x4EE3;&#x8868;&#x6027;&#x7684;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x6211;&#x4EEC;&#x8BAD;&#x7EC3;&#x4E86;&#x4E00;&#x4E2A;&#x4E0D;&#x53EF;&#x80FD;&#x5F97;&#x5230;&#x51C6;&#x786E;&#x9884;&#x6D4B;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5BF9;&#x4E8E;&#x975E;&#x5E38;&#x8D2B;&#x7A77;&#x548C;&#x975E;&#x5E38;&#x5BCC;&#x88D5;&#x7684;&#x56FD;&#x5BB6;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x5177;&#x6709;&#x4EE3;&#x8868;&#x6027;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#x5BF9;&#x4E8E;&#x63A8;&#x5E7F;&#x5230;&#x65B0;&#x6848;&#x4F8B;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x3002;&#x4F46;&#x662F;&#x505A;&#x8D77;&#x6765;&#x6BD4;&#x8BF4;&#x8D77;&#x6765;&#x8981;&#x96BE;&#xFF1A;&#x5982;&#x679C;&#x6837;&#x672C;&#x592A;&#x5C0F;&#xFF0C;&#x5C31;&#x4F1A;&#x6709;&#x6837;&#x672C;&#x566A;&#x58F0;&#xFF08;&#x5373;&#xFF0C;&#x4F1A;&#x6709;&#x4E00;&#x5B9A;&#x6982;&#x7387;&#x5305;&#x542B;&#x6CA1;&#x6709;&#x4EE3;&#x8868;&#x6027;&#x7684;&#x6570;&#x636E;&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x5373;&#x4F7F;&#x662F;&#x975E;&#x5E38;&#x5927;&#x7684;&#x6837;&#x672C;&#x4E5F;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x4EE3;&#x8868;&#x6027;&#xFF0C;&#x5982;&#x679C;&#x53D6;&#x6837;&#x65B9;&#x6CD5;&#x9519;&#x8BEF;&#x7684;&#x8BDD;&#x3002;&#x8FD9;&#x53EB;&#x505A;&#x6837;&#x672C;&#x504F;&#x5DEE;&#x3002;</p>
<blockquote>
<p>&#x4E00;&#x4E2A;&#x6837;&#x672C;&#x504F;&#x5DEE;&#x7684;&#x8457;&#x540D;&#x6848;&#x4F8B;</p>
<p>&#x4E5F;&#x8BB8;&#x5173;&#x4E8E;&#x6837;&#x672C;&#x504F;&#x5DEE;&#x6700;&#x6709;&#x540D;&#x7684;&#x6848;&#x4F8B;&#x53D1;&#x751F;&#x5728; 1936 &#x5E74;&#x5170;&#x767B;&#x548C;&#x7F57;&#x65AF;&#x798F;&#x7684;&#x7F8E;&#x56FD;&#x5927;&#x9009;&#xFF1A;&#x300A;&#x6587;&#x5B66;&#x6587;&#x6458;&#x300B;&#x505A;&#x4E86;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x5927;&#x7684;&#x6C11;&#x8C03;&#xFF0C;&#x7ED9; 1000 &#x4E07;&#x4EBA;&#x90AE;&#x5BC4;&#x4E86;&#x8C03;&#x67E5;&#x4FE1;&#x3002;&#x5F97;&#x5230;&#x4E86; 240 &#x4E07;&#x56DE;&#x4FE1;&#xFF0C;&#x975E;&#x5E38;&#x6709;&#x4FE1;&#x5FC3;&#x5730;&#x9884;&#x6D4B;&#x5170;&#x767B;&#x4F1A;&#x4EE5; 57% &#x8D62;&#x5F97;&#x5927;&#x9009;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x7F57;&#x65AF;&#x798F;&#x8D62;&#x5F97;&#x4E86; 62% &#x7684;&#x9009;&#x7968;&#x3002;&#x9519;&#x8BEF;&#x53D1;&#x751F;&#x5728;&#x300A;&#x6587;&#x5B66;&#x6587;&#x6458;&#x300B;&#x7684;&#x53D6;&#x6837;&#x65B9;&#x6CD5;&#xFF1A;</p>
<ul>
<li>&#x9996;&#x5148;&#xFF0C;&#x4E3A;&#x4E86;&#x83B7;&#x53D6;&#x53D1;&#x4FE1;&#x5730;&#x5740;&#xFF0C;&#x300A;&#x6587;&#x5B66;&#x6587;&#x6458;&#x300B;&#x4F7F;&#x7528;&#x4E86;&#x7535;&#x8BDD;&#x9EC4;&#x9875;&#x3001;&#x6742;&#x5FD7;&#x8BA2;&#x9605;&#x7528;&#x6237;&#x3001;&#x4FF1;&#x4E50;&#x90E8;&#x4F1A;&#x5458;&#x7B49;&#x76F8;&#x4F3C;&#x7684;&#x5217;&#x8868;&#x3002;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x5217;&#x8868;&#x90FD;&#x504F;&#x5411;&#x4E8E;&#x5BCC;&#x88D5;&#x4EBA;&#x7FA4;&#xFF0C;&#x4ED6;&#x4EEC;&#x90FD;&#x503E;&#x5411;&#x4E8E;&#x6295;&#x7968;&#x7ED9;&#x5171;&#x548C;&#x515A;&#xFF08;&#x5373;&#x5170;&#x767B;&#xFF09;&#x3002;</li>
<li>&#x7B2C;&#x4E8C;&#xFF0C;&#x53EA;&#x6709; 25% &#x7684;&#x56DE;&#x7B54;&#x4E86;&#x8C03;&#x7814;&#x3002;&#x8FD9;&#x5C31;&#x53C8;&#x4E00;&#x6B21;&#x5F15;&#x5165;&#x4E86;&#x6837;&#x672C;&#x504F;&#x5DEE;&#xFF0C;&#x5B83;&#x6392;&#x9664;&#x4E86;&#x4E0D;&#x5173;&#x5FC3;&#x653F;&#x6CBB;&#x7684;&#x4EBA;&#x3001;&#x4E0D;&#x559C;&#x6B22;&#x300A;&#x6587;&#x5B66;&#x6587;&#x6458;&#x300B;&#x7684;&#x4EBA;&#xFF0C;&#x548C;&#x5176;&#x5B83;&#x5173;&#x952E;&#x4EBA;&#x7FA4;&#x3002;&#x8FD9;&#x79CD;&#x7279;&#x6B8A;&#x7684;&#x6837;&#x672C;&#x504F;&#x5DEE;&#x79F0;&#x4F5C;&#x65E0;&#x5E94;&#x7B54;&#x504F;&#x5DEE;&#x3002;</li>
</ul>
<p>&#x4E0B;&#x9762;&#x662F;&#x53E6;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;&#x5047;&#x5982;&#x4F60;&#x60F3;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x80FD;&#x8BC6;&#x522B;&#x653E;&#x514B;&#x97F3;&#x4E50;&#xFF08;Funk Music, &#x522B;&#x540D;&#x9A9A;&#x4E50;&#xFF09;&#x89C6;&#x9891;&#x7684;&#x7CFB;&#x7EDF;&#x3002;&#x5EFA;&#x7ACB;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x65B9;&#x6CD5;&#x4E4B;&#x4E00;&#x662F;&#x5728; YouTube &#x4E0A;&#x641C;&#x7D22;&#x201C;&#x653E;&#x514B;&#x97F3;&#x4E50;&#x201D;&#xFF0C;&#x4F7F;&#x7528;&#x641C;&#x7D22;&#x5230;&#x7684;&#x89C6;&#x9891;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x6837;&#x5C31;&#x5047;&#x5B9A;&#x4E86; YouTube &#x7684;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x8FD4;&#x56DE;&#x7684;&#x89C6;&#x9891;&#x96C6;&#xFF0C;&#x662F;&#x5BF9; YouTube &#x4E0A;&#x7684;&#x6240;&#x6709;&#x653E;&#x514B;&#x97F3;&#x4E50;&#x6709;&#x4EE3;&#x8868;&#x6027;&#x7684;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x641C;&#x7D22;&#x7ED3;&#x679C;&#x53EF;&#x80FD;&#x66F4;&#x504F;&#x5411;&#x4E8E;&#x6D41;&#x884C;&#x6B4C;&#x624B;&#xFF08;&#x5982;&#x679C;&#x4F60;&#x5C45;&#x4F4F;&#x5728;&#x5DF4;&#x897F;&#xFF0C;&#x4F60;&#x4F1A;&#x5F97;&#x5230;&#x8BB8;&#x591A;&#x201C;funk carioca&#x201D;&#x89C6;&#x9891;&#xFF0C;&#x5B83;&#x4EEC;&#x548C; James Brown &#x7684;&#x622A;&#x7136;&#x4E0D;&#x540C;&#xFF09;&#x3002;&#x4ECE;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x6765;&#x8BB2;&#xFF0C;&#x4F60;&#x8FD8;&#x80FD;&#x600E;&#x4E48;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x5927;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#x5462;&#xFF1F;</p>
</blockquote>
<h2 id="&#x4F4E;&#x8D28;&#x91CF;&#x6570;&#x636E;">&#x4F4E;&#x8D28;&#x91CF;&#x6570;&#x636E;</h2>
<p>&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x5982;&#x679C;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#x7684;&#x9519;&#x8BEF;&#x3001;&#x5F02;&#x5E38;&#x503C;&#x548C;&#x566A;&#x58F0;&#xFF08;&#x9519;&#x8BEF;&#x6D4B;&#x91CF;&#x5F15;&#x5165;&#x7684;&#xFF09;&#x592A;&#x591A;&#xFF0C;&#x7CFB;&#x7EDF;&#x68C0;&#x6D4B;&#x51FA;&#x6F5C;&#x5728;&#x89C4;&#x5F8B;&#x7684;&#x96BE;&#x5EA6;&#x5C31;&#x4F1A;&#x53D8;&#x5927;&#xFF0C;&#x6027;&#x80FD;&#x5C31;&#x4F1A;&#x964D;&#x4F4E;&#x3002;&#x82B1;&#x8D39;&#x65F6;&#x95F4;&#x5BF9;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x6E05;&#x7406;&#x662F;&#x5341;&#x5206;&#x91CD;&#x8981;&#x7684;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x636E;&#x79D1;&#x5B66;&#x5BB6;&#x7684;&#x4E00;&#x5927;&#x90E8;&#x5206;&#x65F6;&#x95F4;&#x662F;&#x505A;&#x6E05;&#x6D17;&#x5DE5;&#x4F5C;&#x7684;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p>
<ul>
<li>&#x5982;&#x679C;&#x4E00;&#x4E9B;&#x5B9E;&#x4F8B;&#x662F;&#x660E;&#x663E;&#x7684;&#x5F02;&#x5E38;&#x503C;&#xFF0C;&#x6700;&#x597D;&#x5220;&#x6389;&#x5B83;&#x4EEC;&#x6216;&#x5C1D;&#x8BD5;&#x624B;&#x5DE5;&#x4FEE;&#x6539;&#x9519;&#x8BEF;&#xFF1B;</li>
<li>&#x5982;&#x679C;&#x4E00;&#x4E9B;&#x5B9E;&#x4F8B;&#x7F3A;&#x5C11;&#x7279;&#x5F81;&#xFF08;&#x6BD4;&#x5982;&#xFF0C;&#x4F60;&#x7684; 5% &#x7684;&#x987E;&#x5BA2;&#x6CA1;&#x6709;&#x8BF4;&#x660E;&#x5E74;&#x9F84;&#xFF09;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x51B3;&#x5B9A;&#x662F;&#x5426;&#x5FFD;&#x7565;&#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#x3001;&#x5FFD;&#x7565;&#x8FD9;&#x4E9B;&#x5B9E;&#x4F8B;&#x3001;&#x586B;&#x5165;&#x7F3A;&#x5931;&#x503C;&#xFF08;&#x6BD4;&#x5982;&#xFF0C;&#x5E74;&#x9F84;&#x4E2D;&#x4F4D;&#x6570;&#xFF09;&#xFF0C;&#x6216;&#x8005;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x542B;&#x6709;&#x8FD9;&#x4E2A;&#x7279;&#x5F81;&#x7684;&#x6A21;&#x578B;&#x548C;&#x4E00;&#x4E2A;&#x4E0D;&#x542B;&#x6709;&#x8FD9;&#x4E2A;&#x7279;&#x5F81;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x7B49;&#x7B49;&#x3002;</li>
</ul>
<h2 id="&#x4E0D;&#x76F8;&#x5173;&#x7684;&#x7279;&#x5F81;">&#x4E0D;&#x76F8;&#x5173;&#x7684;&#x7279;&#x5F81;</h2>
<p>&#x4FD7;&#x8BED;&#x8BF4;&#xFF1A;&#x5982;&#x679C;&#x8FDB;&#x6765;&#x7684;&#x662F;&#x5783;&#x573E;&#xFF0C;&#x90A3;&#x4E48;&#x51FA;&#x53BB;&#x7684;&#x4E5F;&#x662F;&#x5783;&#x573E;&#x3002;&#x4F60;&#x7684;&#x7CFB;&#x7EDF;&#x53EA;&#x6709;&#x5728;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x5305;&#x542B;&#x8DB3;&#x591F;&#x76F8;&#x5173;&#x7279;&#x5F81;&#x3001;&#x975E;&#x76F8;&#x5173;&#x7279;&#x5F81;&#x4E0D;&#x591A;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x624D;&#x80FD;&#x8FDB;&#x884C;&#x5B66;&#x4E60;&#x3002;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x9879;&#x76EE;&#x6210;&#x529F;&#x7684;&#x5173;&#x952E;&#x4E4B;&#x4E00;&#x662F;&#x7528;&#x597D;&#x7684;&#x7279;&#x5F81;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#x3002;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x79F0;&#x4F5C;&#x7279;&#x5F81;&#x5DE5;&#x7A0B;&#xFF0C;&#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li>&#x7279;&#x5F81;&#x9009;&#x62E9;&#xFF1A;&#x5728;&#x6240;&#x6709;&#x5B58;&#x5728;&#x7684;&#x7279;&#x5F81;&#x4E2D;&#x9009;&#x53D6;&#x6700;&#x6709;&#x7528;&#x7684;&#x7279;&#x5F81;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#x3002;</li>
<li>&#x7279;&#x5F81;&#x63D0;&#x53D6;&#xFF1A;&#x7EC4;&#x5408;&#x5B58;&#x5728;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x66F4;&#x6709;&#x7528;&#x7684;&#x7279;&#x5F81;&#xFF08;&#x5982;&#x524D;&#x9762;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x964D;&#x7EF4;&#x7B97;&#x6CD5;&#xFF09;&#x3002;</li>
<li>&#x6536;&#x96C6;&#x65B0;&#x6570;&#x636E;&#x521B;&#x5EFA;&#x65B0;&#x7279;&#x5F81;&#x3002;</li>
</ul>
<p>&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x770B;&#x8FC7;&#x4E86;&#x8BB8;&#x591A;&#x574F;&#x6570;&#x636E;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x770B;&#x51E0;&#x4E2A;&#x574F;&#x7B97;&#x6CD5;&#x7684;&#x4F8B;&#x5B50;&#x3002;</p>
<h2 id="&#x8FC7;&#x62DF;&#x5408;&#x8BAD;&#x7EC3;&#x6570;&#x636E;">&#x8FC7;&#x62DF;&#x5408;&#x8BAD;&#x7EC3;&#x6570;&#x636E;</h2>
<p>&#x5982;&#x679C;&#x4F60;&#x5728;&#x5916;&#x56FD;&#x6E38;&#x73A9;&#xFF0C;&#x5F53;&#x5730;&#x7684;&#x51FA;&#x79DF;&#x8F66;&#x53F8;&#x673A;&#x591A;&#x6536;&#x4E86;&#x4F60;&#x7684;&#x94B1;&#x3002;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x8BF4;&#x8FD9;&#x4E2A;&#x56FD;&#x5BB6;&#x6240;&#x6709;&#x7684;&#x51FA;&#x79DF;&#x8F66;&#x53F8;&#x673A;&#x90FD;&#x662F;&#x5C0F;&#x5077;&#x3002;&#x8FC7;&#x5EA6;&#x5F52;&#x7EB3;&#x662F;&#x6211;&#x4EEC;&#x4EBA;&#x7C7B;&#x7ECF;&#x5E38;&#x505A;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4E0D;&#x5C0F;&#x5FC3;&#xFF0C;&#x673A;&#x5668;&#x4E5F;&#x4F1A;&#x72AF;&#x540C;&#x6837;&#x7684;&#x9519;&#x8BEF;&#x3002;&#x5728;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4E2D;&#xFF0C;&#x8FD9;&#x79F0;&#x4F5C;&#x8FC7;&#x62DF;&#x5408;&#xFF1A;&#x610F;&#x601D;&#x662F;&#x8BF4;&#xFF0C;&#x6A21;&#x578B;&#x5728;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x4E0A;&#x8868;&#x73B0;&#x5F88;&#x597D;&#xFF0C;&#x4F46;&#x662F;&#x63A8;&#x5E7F;&#x6548;&#x679C;&#x4E0D;&#x597D;&#x3002;</p>
<p>&#x56FE; 1-22 &#x5C55;&#x793A;&#x4E86;&#x4E00;&#x4E2A;&#x9AD8;&#x9636;&#x591A;&#x9879;&#x5F0F;&#x751F;&#x6D3B;&#x6EE1;&#x610F;&#x5EA6;&#x6A21;&#x578B;&#xFF0C;&#x5B83;&#x5927;&#x5927;&#x8FC7;&#x62DF;&#x5408;&#x4E86;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x3002;&#x5373;&#x4F7F;&#x5B83;&#x6BD4;&#x7B80;&#x5355;&#x7EBF;&#x6027;&#x6A21;&#x578B;&#x5728;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x4E0A;&#x8868;&#x73B0;&#x66F4;&#x597D;&#xFF0C;&#x4F60;&#x4F1A;&#x76F8;&#x4FE1;&#x5B83;&#x7684;&#x9884;&#x6D4B;&#x5417;&#xFF1F;</p>
<p><img src="../images/chapter_1/1-22.png" alt=""></p>
<p>&#x56FE; 1-22 &#x8FC7;&#x62DF;&#x5408;&#x8BAD;&#x7EC3;&#x6570;&#x636E;</p>
<p>&#x590D;&#x6742;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x6BD4;&#x5982;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x53EF;&#x4EE5;&#x68C0;&#x6D4B;&#x6570;&#x636E;&#x4E2D;&#x7684;&#x7EC6;&#x5FAE;&#x89C4;&#x5F8B;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x8BAD;&#x7EC3;&#x96C6;&#x6709;&#x566A;&#x58F0;&#xFF0C;&#x6216;&#x8005;&#x8BAD;&#x7EC3;&#x96C6;&#x592A;&#x5C0F;&#xFF08;&#x592A;&#x5C0F;&#x4F1A;&#x5F15;&#x5165;&#x6837;&#x672C;&#x566A;&#x58F0;&#xFF09;&#xFF0C;&#x6A21;&#x578B;&#x5C31;&#x4F1A;&#x53BB;&#x68C0;&#x6D4B;&#x566A;&#x58F0;&#x672C;&#x8EAB;&#x7684;&#x89C4;&#x5F8B;&#x3002;&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x8FD9;&#x4E9B;&#x89C4;&#x5F8B;&#x4E0D;&#x80FD;&#x63A8;&#x5E7F;&#x5230;&#x65B0;&#x5B9E;&#x4F8B;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5047;&#x5982;&#x4F60;&#x7528;&#x66F4;&#x591A;&#x7684;&#x5C5E;&#x6027;&#x8BAD;&#x7EC3;&#x751F;&#x6D3B;&#x6EE1;&#x610F;&#x5EA6;&#x6A21;&#x578B;&#xFF0C;&#x5305;&#x62EC;&#x4E0D;&#x5305;&#x542B;&#x4FE1;&#x606F;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x6BD4;&#x5982;&#x56FD;&#x5BB6;&#x7684;&#x540D;&#x5B57;&#x3002;&#x5982;&#x6B64;&#x4E00;&#x6765;&#xFF0C;&#x590D;&#x6742;&#x7684;&#x6A21;&#x578B;&#x53EF;&#x80FD;&#x4F1A;&#x68C0;&#x6D4B;&#x51FA;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#x540D;&#x5B57;&#x6709; w &#x5B57;&#x6BCD;&#x7684;&#x56FD;&#x5BB6;&#x7684;&#x751F;&#x6D3B;&#x6EE1;&#x610F;&#x5EA6;&#x5927;&#x4E8E; 7&#xFF1A;&#x65B0;&#x897F;&#x5170;&#xFF08;7.3&#xFF09;&#xFF0C;&#x632A;&#x5A01;&#xFF08;7.4&#xFF09;&#xFF0C;&#x745E;&#x5178;&#xFF08;7.2&#xFF09;&#x548C;&#x745E;&#x58EB;&#xFF08;7.5&#xFF09;&#x3002;&#x4F60;&#x80FD;&#x76F8;&#x4FE1;&#x8FD9;&#x4E2A; W-&#x6EE1;&#x610F;&#x5EA6;&#x6CD5;&#x5219;&#x63A8;&#x5E7F;&#x5230;&#x5362;&#x65FA;&#x8FBE;&#x548C;&#x6D25;&#x5DF4;&#x5E03;&#x97E6;&#x5417;&#xFF1F;&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x8FD9;&#x4E2A;&#x89C4;&#x5F8B;&#x53EA;&#x662F;&#x8BAD;&#x7EC3;&#x96C6;&#x6570;&#x636E;&#x4E2D;&#x5076;&#x7136;&#x51FA;&#x73B0;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x6A21;&#x578B;&#x4E0D;&#x80FD;&#x5224;&#x65AD;&#x8FD9;&#x4E2A;&#x89C4;&#x5F8B;&#x662F;&#x771F;&#x5B9E;&#x7684;&#x3001;&#x8FD8;&#x662F;&#x566A;&#x58F0;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<blockquote>
<p>&#x8B66;&#x544A;&#xFF1A;&#x8FC7;&#x62DF;&#x5408;&#x53D1;&#x751F;&#x5728;&#x76F8;&#x5BF9;&#x4E8E;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x7684;&#x91CF;&#x548C;&#x566A;&#x58F0;&#xFF0C;&#x6A21;&#x578B;&#x8FC7;&#x4E8E;&#x590D;&#x6742;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x53EF;&#x80FD;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x6709;&#xFF1A;</p>
<ul>
<li>&#x7B80;&#x5316;&#x6A21;&#x578B;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x66F4;&#x5C11;&#x7684;&#x6A21;&#x578B;&#xFF08;&#x6BD4;&#x5982;&#x4F7F;&#x7528;&#x7EBF;&#x6027;&#x6A21;&#x578B;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x9AD8;&#x9636;&#x591A;&#x9879;&#x5F0F;&#x6A21;&#x578B;&#xFF09;&#x3001;&#x51CF;&#x5C11;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x7684;&#x5C5E;&#x6027;&#x6570;&#x3001;&#x6216;&#x9650;&#x5236;&#x4E00;&#x4E0B;&#x6A21;&#x578B;</li>
<li>&#x6536;&#x96C6;&#x66F4;&#x591A;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;</li>
<li>&#x51CF;&#x5C0F;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x7684;&#x566A;&#x58F0;&#xFF08;&#x6BD4;&#x5982;&#xFF0C;&#x4FEE;&#x6539;&#x6570;&#x636E;&#x9519;&#x8BEF;&#x548C;&#x53BB;&#x9664;&#x5F02;&#x5E38;&#x503C;&#xFF09;</li>
</ul>
</blockquote>
<p>&#x9650;&#x5B9A;&#x4E00;&#x4E2A;&#x6A21;&#x578B;&#x4EE5;&#x8BA9;&#x5B83;&#x66F4;&#x7B80;&#x5355;&#x5E76;&#x4E14;&#x964D;&#x4F4E;&#x8FC7;&#x62DF;&#x5408;&#x7684;&#x98CE;&#x9669;&#x88AB;&#x79F0;&#x4F5C;&#x6B63;&#x5219;&#x5316;&#xFF08;regularization&#xFF09;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x5B9A;&#x4E49;&#x7684;&#x7EBF;&#x6027;&#x6A21;&#x578B;&#x6709;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;<code>&#x3B8;0</code>&#x548C;<code>&#x3B8;1</code>&#x3002;&#x5B83;&#x7ED9;&#x4E86;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x4E24;&#x4E2A;&#x81EA;&#x7531;&#x5EA6;&#x4EE5;&#x8BA9;&#x6A21;&#x578B;&#x9002;&#x5E94;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#xFF1A;&#x53EF;&#x4EE5;&#x8C03;&#x6574;&#x622A;&#x8DDD;<code>&#x3B8;0</code>&#x548C;&#x659C;&#x7387;<code>&#x3B8;1</code>&#x3002;&#x5982;&#x679C;&#x5F3A;&#x5236;<code>&#x3B8;1=0</code>&#xFF0C;&#x7B97;&#x6CD5;&#x5C31;&#x53EA;&#x5269;&#x4E00;&#x4E2A;&#x81EA;&#x7531;&#x5EA6;&#xFF0C;&#x62DF;&#x5408;&#x6570;&#x636E;&#x5C31;&#x4F1A;&#x66F4;&#x4E3A;&#x56F0;&#x96BE;&#xFF1A;&#x5B83;&#x6240;&#x80FD;&#x505A;&#x7684;&#x53EA;&#x662F;&#x5C06;&#x62DF;&#x5408;&#x66F2;&#x7EBF;&#x4E0A;&#x4E0B;&#x79FB;&#x52A8;&#x53BB;&#x5C3D;&#x53EF;&#x80FD;&#x5730;&#x9760;&#x8FD1;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#xFF0C;&#x7ED3;&#x679C;&#x4F1A;&#x5728;&#x5E73;&#x5747;&#x503C;&#x9644;&#x8FD1;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x6A21;&#x578B;&#xFF01;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5141;&#x8BB8;&#x7B97;&#x6CD5;&#x53EF;&#x4EE5;&#x4FEE;&#x6539;<code>&#x3B8;1</code>&#xFF0C;&#x4F46;&#x662F;&#x53EA;&#x80FD;&#x5728;&#x4E00;&#x4E2A;&#x5F88;&#x5C0F;&#x7684;&#x8303;&#x56F4;&#x5185;&#x4FEE;&#x6539;&#xFF0C;&#x7B97;&#x6CD5;&#x7684;&#x81EA;&#x7531;&#x5EA6;&#x5C31;&#x4F1A;&#x4ECB;&#x4E8E; 1 &#x548C; 2 &#x4E4B;&#x95F4;&#x3002;&#x5B83;&#x8981;&#x6BD4;&#x4E24;&#x4E2A;&#x81EA;&#x7531;&#x5EA6;&#x7684;&#x6A21;&#x578B;&#x7B80;&#x5355;&#xFF0C;&#x6BD4; 1 &#x4E2A;&#x81EA;&#x7531;&#x5EA6;&#x7684;&#x6A21;&#x578B;&#x8981;&#x590D;&#x6742;&#x3002;&#x4F60;&#x7684;&#x76EE;&#x6807;&#x662F;&#x5728;&#x5B8C;&#x7F8E;&#x62DF;&#x5408;&#x6570;&#x636E;&#x548C;&#x4FDD;&#x6301;&#x6A21;&#x578B;&#x7B80;&#x5355;&#x6027;&#x4E0A;&#x627E;&#x5230;&#x5E73;&#x8861;&#xFF0C;&#x786E;&#x4FDD;&#x7B97;&#x6CD5;&#x7684;&#x63A8;&#x5E7F;&#x6548;&#x679C;&#x3002;</p>
<p>&#x56FE; 1-23 &#x5C55;&#x793A;&#x4E86;&#x4E09;&#x4E2A;&#x6A21;&#x578B;&#xFF1A;&#x865A;&#x7EBF;&#x8868;&#x793A;&#x7528;&#x4E00;&#x4E9B;&#x7F3A;&#x5931;&#x56FD;&#x5BB6;&#x7684;&#x6570;&#x636E;&#x8BAD;&#x7EC3;&#x7684;&#x539F;&#x59CB;&#x6A21;&#x578B;&#xFF0C;&#x77ED;&#x5212;&#x7EBF;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x7528;&#x6240;&#x6709;&#x56FD;&#x5BB6;&#x8BAD;&#x7EC3;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x5B9E;&#x7EBF;&#x6A21;&#x578B;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x548C;&#x7B2C;&#x4E00;&#x4E2A;&#x76F8;&#x540C;&#xFF0C;&#x4F46;&#x8FDB;&#x884C;&#x4E86;&#x6B63;&#x5219;&#x5316;&#x9650;&#x5236;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x6B63;&#x5219;&#x5316;&#x5F3A;&#x5236;&#x6A21;&#x578B;&#x6709;&#x4E00;&#x4E2A;&#x5C0F;&#x7684;&#x659C;&#x7387;&#xFF0C;&#x5B83;&#x5BF9;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x7684;&#x62DF;&#x5408;&#x4E0D;&#x662F;&#x90A3;&#x4E48;&#x597D;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x65B0;&#x6837;&#x672C;&#x7684;&#x63A8;&#x5E7F;&#x6548;&#x679C;&#x597D;&#x3002;</p>
<p><img src="../images/chapter_1/1-23.png" alt=""></p>
<p>&#x56FE; 1-23 &#x6B63;&#x5219;&#x5316;&#x964D;&#x4F4E;&#x4E86;&#x8FC7;&#x5EA6;&#x62DF;&#x5408;&#x7684;&#x98CE;&#x9669;</p>
<p>&#x6B63;&#x5219;&#x5316;&#x7684;&#x5EA6;&#x53EF;&#x4EE5;&#x7528;&#x4E00;&#x4E2A;&#x8D85;&#x53C2;&#x6570;&#xFF08;hyperparameter&#xFF09;&#x63A7;&#x5236;&#x3002;&#x8D85;&#x53C2;&#x6570;&#x662F;&#x4E00;&#x4E2A;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x7684;&#x53C2;&#x6570;&#xFF08;&#x800C;&#x4E0D;&#x662F;&#x6A21;&#x578B;&#x7684;&#xFF09;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x5B83;&#x662F;&#x4E0D;&#x4F1A;&#x88AB;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x672C;&#x8EAB;&#x5F71;&#x54CD;&#x7684;&#xFF0C;&#x5B83;&#x4F18;&#x4E8E;&#x8BAD;&#x7EC3;&#xFF0C;&#x5728;&#x8BAD;&#x7EC3;&#x4E2D;&#x662F;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#x7684;&#x3002;&#x5982;&#x679C;&#x4F60;&#x8BBE;&#x5B9A;&#x7684;&#x8D85;&#x53C2;&#x6570;&#x975E;&#x5E38;&#x5927;&#xFF0C;&#x5C31;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x51E0;&#x4E4E;&#x662F;&#x5E73;&#x7684;&#x6A21;&#x578B;&#xFF08;&#x659C;&#x7387;&#x63A5;&#x8FD1;&#x4E8E; 0&#xFF09;&#xFF1B;&#x8FD9;&#x79CD;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x51E0;&#x4E4E;&#x80AF;&#x5B9A;&#x4E0D;&#x4F1A;&#x8FC7;&#x62DF;&#x5408;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x5F88;&#x96BE;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x89E3;&#x3002;&#x8C03;&#x8282;&#x8D85;&#x53C2;&#x6570;&#x662F;&#x521B;&#x5EFA;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF08;&#x4E0B;&#x4E00;&#x7AE0;&#x4F60;&#x4F1A;&#x770B;&#x5230;&#x4E00;&#x4E2A;&#x8BE6;&#x7EC6;&#x7684;&#x4F8B;&#x5B50;&#xFF09;&#x3002;</p>
<h2 id="&#x6B20;&#x62DF;&#x5408;&#x8BAD;&#x7EC3;&#x6570;&#x636E;">&#x6B20;&#x62DF;&#x5408;&#x8BAD;&#x7EC3;&#x6570;&#x636E;</h2>
<p>&#x4F60;&#x53EF;&#x80FD;&#x731C;&#x5230;&#x4E86;&#xFF0C;&#x6B20;&#x62DF;&#x5408;&#x662F;&#x548C;&#x8FC7;&#x62DF;&#x5408;&#x76F8;&#x5BF9;&#x7684;&#xFF1A;&#x5F53;&#x4F60;&#x7684;&#x6A21;&#x578B;&#x8FC7;&#x4E8E;&#x7B80;&#x5355;&#x65F6;&#x5C31;&#x4F1A;&#x53D1;&#x751F;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x751F;&#x6D3B;&#x6EE1;&#x610F;&#x5EA6;&#x7684;&#x7EBF;&#x6027;&#x6A21;&#x578B;&#x503E;&#x5411;&#x4E8E;&#x6B20;&#x62DF;&#x5408;&#xFF1B;&#x73B0;&#x5B9E;&#x8981;&#x6BD4;&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#x590D;&#x6742;&#x7684;&#x591A;&#xFF0C;&#x6240;&#x4EE5;&#x9884;&#x6D4B;&#x5F88;&#x96BE;&#x51C6;&#x786E;&#xFF0C;&#x5373;&#x4F7F;&#x5728;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#x4E0A;&#x4E5F;&#x5F88;&#x96BE;&#x51C6;&#x786E;&#x3002;</p>
<p>&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x9009;&#x9879;&#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li>&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x66F4;&#x5F3A;&#x5927;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x5E26;&#x6709;&#x66F4;&#x591A;&#x53C2;&#x6570;</li>
<li>&#x7528;&#x66F4;&#x597D;&#x7684;&#x7279;&#x5F81;&#x8BAD;&#x7EC3;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#xFF08;&#x7279;&#x5F81;&#x5DE5;&#x7A0B;&#xFF09;</li>
<li>&#x51CF;&#x5C0F;&#x5BF9;&#x6A21;&#x578B;&#x7684;&#x9650;&#x5236;&#xFF08;&#x6BD4;&#x5982;&#xFF0C;&#x51CF;&#x5C0F;&#x6B63;&#x5219;&#x5316;&#x8D85;&#x53C2;&#x6570;&#xFF09;</li>
</ul>
<h2 id="&#x56DE;&#x987E;">&#x56DE;&#x987E;</h2>
<p>&#x73B0;&#x5728;&#xFF0C;&#x4F60;&#x5DF2;&#x7ECF;&#x77E5;&#x9053;&#x4E86;&#x5F88;&#x591A;&#x5173;&#x4E8E;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x77E5;&#x8BC6;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5B66;&#x8FC7;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#x6982;&#x5FF5;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x611F;&#x5230;&#x6709;&#x4E9B;&#x8FF7;&#x5931;&#xFF0C;&#x6240;&#x4EE5;&#x8BA9;&#x6211;&#x4EEC;&#x9000;&#x56DE;&#x53BB;&#xFF0C;&#x56DE;&#x987E;&#x4E00;&#x4E0B;&#x91CD;&#x8981;&#x7684;&#xFF1A;</p>
<ul>
<li>&#x673A;&#x5668;&#x5B66;&#x4E60;&#x662F;&#x8BA9;&#x673A;&#x5668;&#x901A;&#x8FC7;&#x5B66;&#x4E60;&#x6570;&#x636E;&#x5BF9;&#x67D0;&#x4E9B;&#x4EFB;&#x52A1;&#x505A;&#x5F97;&#x66F4;&#x597D;&#xFF0C;&#x800C;&#x4E0D;&#x4F7F;&#x7528;&#x786E;&#x5B9A;&#x7684;&#x4EE3;&#x7801;&#x89C4;&#x5219;&#x3002;</li>
<li>&#x6709;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7CFB;&#x7EDF;&#xFF1A;&#x76D1;&#x7763;&#x6216;&#x975E;&#x76D1;&#x7763;&#xFF0C;&#x6279;&#x91CF;&#x6216;&#x5728;&#x7EBF;&#xFF0C;&#x57FA;&#x4E8E;&#x5B9E;&#x4F8B;&#x6216;&#x57FA;&#x4E8E;&#x6A21;&#x578B;&#xFF0C;&#x7B49;&#x7B49;&#x3002;</li>
<li>&#x5728;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x9879;&#x76EE;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4ECE;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#x6536;&#x96C6;&#x6570;&#x636E;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#x3002;&#x5982;&#x679C;&#x7B97;&#x6CD5;&#x662F;&#x57FA;&#x4E8E;&#x6A21;&#x578B;&#x7684;&#xFF0C;&#x5C31;&#x8C03;&#x8282;&#x4E00;&#x4E9B;&#x53C2;&#x6570;&#xFF0C;&#x8BA9;&#x6A21;&#x578B;&#x62DF;&#x5408;&#x5230;&#x8BAD;&#x7EC3;&#x96C6;&#xFF08;&#x5373;&#xFF0C;&#x5BF9;&#x8BAD;&#x7EC3;&#x96C6;&#x672C;&#x8EAB;&#x4F5C;&#x51FA;&#x597D;&#x7684;&#x9884;&#x6D4B;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x5E0C;&#x671B;&#x5B83;&#x5BF9;&#x65B0;&#x6837;&#x672C;&#x4E5F;&#x80FD;&#x6709;&#x597D;&#x9884;&#x6D4B;&#x3002;&#x5982;&#x679C;&#x7B97;&#x6CD5;&#x662F;&#x57FA;&#x4E8E;&#x5B9E;&#x4F8B;&#x7684;&#xFF0C;&#x5C31;&#x662F;&#x7528;&#x8BB0;&#x5FC6;&#x5B66;&#x4E60;&#x6837;&#x672C;&#xFF0C;&#x7136;&#x540E;&#x7528;&#x76F8;&#x4F3C;&#x5EA6;&#x63A8;&#x5E7F;&#x5230;&#x65B0;&#x5B9E;&#x4F8B;&#x3002;</li>
<li>&#x5982;&#x679C;&#x8BAD;&#x7EC3;&#x96C6;&#x592A;&#x5C0F;&#x3001;&#x6570;&#x636E;&#x6CA1;&#x6709;&#x4EE3;&#x8868;&#x6027;&#x3001;&#x542B;&#x6709;&#x566A;&#x58F0;&#x3001;&#x6216;&#x63BA;&#x6709;&#x4E0D;&#x76F8;&#x5173;&#x7684;&#x7279;&#x5F81;&#xFF08;&#x5783;&#x573E;&#x8FDB;&#xFF0C;&#x5783;&#x573E;&#x51FA;&#xFF09;&#xFF0C;&#x7CFB;&#x7EDF;&#x7684;&#x6027;&#x80FD;&#x4E0D;&#x4F1A;&#x597D;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x6A21;&#x578B;&#x4E0D;&#x80FD;&#x592A;&#x7B80;&#x5355;&#xFF08;&#x4F1A;&#x53D1;&#x751F;&#x6B20;&#x62DF;&#x5408;&#xFF09;&#x6216;&#x592A;&#x590D;&#x6742;&#xFF08;&#x4F1A;&#x53D1;&#x751F;&#x8FC7;&#x62DF;&#x5408;&#xFF09;&#x3002;</li>
</ul>
<p>&#x8FD8;&#x5DEE;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x4E3B;&#x9898;&#x8981;&#x5B66;&#x4E60;&#xFF1A;&#x8BAD;&#x7EC3;&#x5B8C;&#x4E86;&#x4E00;&#x4E2A;&#x6A21;&#x578B;&#xFF0C;&#x4F60;&#x4E0D;&#x53EA;&#x5E0C;&#x671B;&#x5C06;&#x5B83;&#x63A8;&#x5E7F;&#x5230;&#x65B0;&#x6837;&#x672C;&#x3002;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8BC4;&#x4F30;&#x5B83;&#xFF0C;&#x90A3;&#x4E48;&#x8FD8;&#x9700;&#x8981;&#x4F5C;&#x51FA;&#x5FC5;&#x8981;&#x7684;&#x5FAE;&#x8C03;&#x3002;&#x4E00;&#x8D77;&#x6765;&#x770B;&#x4E00;&#x770B;&#x3002;</p>
<h1 id="&#x6D4B;&#x8BD5;&#x548C;&#x786E;&#x8BA4;">&#x6D4B;&#x8BD5;&#x548C;&#x786E;&#x8BA4;</h1>
<p>&#x8981;&#x77E5;&#x9053;&#x4E00;&#x4E2A;&#x6A21;&#x578B;&#x63A8;&#x5E7F;&#x5230;&#x65B0;&#x6837;&#x672C;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x552F;&#x4E00;&#x7684;&#x529E;&#x6CD5;&#x5C31;&#x662F;&#x771F;&#x6B63;&#x7684;&#x8FDB;&#x884C;&#x8BD5;&#x9A8C;&#x3002;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x5C06;&#x6A21;&#x578B;&#x90E8;&#x7F72;&#x5230;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#xFF0C;&#x89C2;&#x5BDF;&#x5B83;&#x7684;&#x6027;&#x80FD;&#x3002;&#x8FD9;&#x4E48;&#x505A;&#x53EF;&#x4EE5;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x6A21;&#x578B;&#x7684;&#x6027;&#x80FD;&#x5F88;&#x5DEE;&#xFF0C;&#x5C31;&#x4F1A;&#x5F15;&#x8D77;&#x7528;&#x6237;&#x62B1;&#x6028; &#x2014;&#x2014; &#x8FD9;&#x4E0D;&#x662F;&#x6700;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x66F4;&#x597D;&#x7684;&#x9009;&#x9879;&#x662F;&#x5C06;&#x4F60;&#x7684;&#x6570;&#x636E;&#x5206;&#x6210;&#x4E24;&#x4E2A;&#x96C6;&#x5408;&#xFF1A;&#x8BAD;&#x7EC3;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x3002;&#x6B63;&#x5982;&#x5B83;&#x4EEC;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x7528;&#x8BAD;&#x7EC3;&#x96C6;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#xFF0C;&#x7528;&#x6D4B;&#x8BD5;&#x96C6;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#x3002;&#x5BF9;&#x65B0;&#x6837;&#x672C;&#x7684;&#x9519;&#x8BEF;&#x7387;&#x79F0;&#x4F5C;&#x63A8;&#x5E7F;&#x9519;&#x8BEF;&#xFF08;&#x6216;&#x6837;&#x672C;&#x5916;&#x9519;&#x8BEF;&#xFF09;&#xFF0C;&#x901A;&#x8FC7;&#x6A21;&#x578B;&#x5BF9;&#x6D4B;&#x8BD5;&#x96C6;&#x7684;&#x8BC4;&#x4F30;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x9884;&#x4F30;&#x8FD9;&#x4E2A;&#x9519;&#x8BEF;&#x3002;&#x8FD9;&#x4E2A;&#x503C;&#x53EF;&#x4EE5;&#x544A;&#x8BC9;&#x4F60;&#xFF0C;&#x4F60;&#x7684;&#x6A21;&#x578B;&#x5BF9;&#x65B0;&#x6837;&#x672C;&#x7684;&#x6027;&#x80FD;&#x3002;</p>
<p>&#x5982;&#x679C;&#x8BAD;&#x7EC3;&#x9519;&#x8BEF;&#x7387;&#x4F4E;&#xFF08;&#x5373;&#xFF0C;&#x4F60;&#x7684;&#x6A21;&#x578B;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x9519;&#x8BEF;&#x4E0D;&#x591A;&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x63A8;&#x5E7F;&#x9519;&#x8BEF;&#x7387;&#x9AD8;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x6A21;&#x578B;&#x5BF9;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x8FC7;&#x62DF;&#x5408;&#x3002;</p>
<blockquote>
<p>&#x63D0;&#x793A;&#xFF1A;&#x4E00;&#x822C;&#x4F7F;&#x7528; 80% &#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#xFF0C;&#x4FDD;&#x7559;20%&#x7528;&#x4E8E;&#x6D4B;&#x8BD5;&#x3002;</p>
</blockquote>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x8BC4;&#x4F30;&#x4E00;&#x4E2A;&#x6A21;&#x578B;&#x5F88;&#x7B80;&#x5355;&#xFF1A;&#x53EA;&#x8981;&#x4F7F;&#x7528;&#x6D4B;&#x8BD5;&#x96C6;&#x3002;&#x73B0;&#x5728;&#x5047;&#x8BBE;&#x4F60;&#x5728;&#x4E24;&#x4E2A;&#x6A21;&#x578B;&#x4E4B;&#x95F4;&#x72B9;&#x8C6B;&#x4E0D;&#x51B3;&#xFF08;&#x6BD4;&#x5982;&#x4E00;&#x4E2A;&#x7EBF;&#x6027;&#x6A21;&#x578B;&#x548C;&#x4E00;&#x4E2A;&#x591A;&#x9879;&#x5F0F;&#x6A21;&#x578B;&#xFF09;&#xFF1A;&#x5982;&#x4F55;&#x505A;&#x51B3;&#x5B9A;&#x5462;&#xFF1F;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x4E24;&#x4E2A;&#x90FD;&#x8BAD;&#x7EC3;&#xFF0C;&#xFF0C;&#x7136;&#x540E;&#x6BD4;&#x8F83;&#x5728;&#x6D4B;&#x8BD5;&#x96C6;&#x4E0A;&#x7684;&#x6548;&#x679C;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x5047;&#x8BBE;&#x7EBF;&#x6027;&#x6A21;&#x578B;&#x7684;&#x6548;&#x679C;&#x66F4;&#x597D;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x60F3;&#x505A;&#x4E00;&#x4E9B;&#x6B63;&#x5219;&#x5316;&#x4EE5;&#x907F;&#x514D;&#x8FC7;&#x62DF;&#x5408;&#x3002;&#x95EE;&#x9898;&#x662F;&#xFF1A;&#x5982;&#x4F55;&#x9009;&#x62E9;&#x6B63;&#x5219;&#x5316;&#x8D85;&#x53C2;&#x6570;&#x7684;&#x503C;&#xFF1F;&#x4E00;&#x79CD;&#x9009;&#x9879;&#x662F;&#x7528; 100 &#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x8D85;&#x53C2;&#x6570;&#x8BAD;&#x7EC3;100&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x6A21;&#x578B;&#x3002;&#x5047;&#x8BBE;&#x4F60;&#x53D1;&#x73B0;&#x6700;&#x4F73;&#x7684;&#x8D85;&#x53C2;&#x6570;&#x7684;&#x63A8;&#x5E7F;&#x9519;&#x8BEF;&#x7387;&#x6700;&#x4F4E;&#xFF0C;&#x6BD4;&#x5982;&#x53EA;&#x6709; 5%&#x3002;&#x7136;&#x540E;&#x5C31;&#x9009;&#x7528;&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#x4F5C;&#x4E3A;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#xFF0C;&#x4F46;&#x662F;&#x5B9E;&#x9645;&#x4E2D;&#x6027;&#x80FD;&#x4E0D;&#x4F73;&#xFF0C;&#x8BEF;&#x5DEE;&#x7387;&#x8FBE;&#x5230;&#x4E86; 15%&#x3002;&#x53D1;&#x751F;&#x4E86;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;</p>
<p>&#x7B54;&#x6848;&#x5728;&#x4E8E;&#xFF0C;&#x4F60;&#x5728;&#x6D4B;&#x8BD5;&#x96C6;&#x4E0A;&#x591A;&#x6B21;&#x6D4B;&#x91CF;&#x4E86;&#x63A8;&#x5E7F;&#x8BEF;&#x5DEE;&#x7387;&#xFF0C;&#x8C03;&#x6574;&#x4E86;&#x6A21;&#x578B;&#x548C;&#x8D85;&#x53C2;&#x6570;&#xFF0C;&#x4EE5;&#x4F7F;&#x6A21;&#x578B;&#x6700;&#x9002;&#x5408;&#x8FD9;&#x4E2A;&#x96C6;&#x5408;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6A21;&#x578B;&#x5BF9;&#x65B0;&#x6570;&#x636E;&#x7684;&#x6027;&#x80FD;&#x4E0D;&#x4F1A;&#x9AD8;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x901A;&#x5E38;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#xFF0C;&#x518D;&#x4FDD;&#x7559;&#x4E00;&#x4E2A;&#x96C6;&#x5408;&#xFF0C;&#x79F0;&#x4F5C;&#x9A8C;&#x8BC1;&#x96C6;&#x5408;&#x3002;&#x7528;&#x8BAD;&#x7EC3;&#x96C6;&#x548C;&#x591A;&#x4E2A;&#x8D85;&#x53C2;&#x6570;&#x8BAD;&#x7EC3;&#x591A;&#x4E2A;&#x6A21;&#x578B;&#xFF0C;&#x9009;&#x62E9;&#x5728;&#x9A8C;&#x8BC1;&#x96C6;&#x4E0A;&#x6709;&#x6700;&#x4F73;&#x6027;&#x80FD;&#x7684;&#x6A21;&#x578B;&#x548C;&#x8D85;&#x53C2;&#x6570;&#x3002;&#x5F53;&#x4F60;&#x5BF9;&#x6A21;&#x578B;&#x6EE1;&#x610F;&#x65F6;&#xFF0C;&#x7528;&#x6D4B;&#x8BD5;&#x96C6;&#x518D;&#x505A;&#x6700;&#x540E;&#x4E00;&#x6B21;&#x6D4B;&#x8BD5;&#xFF0C;&#x4EE5;&#x5F97;&#x5230;&#x63A8;&#x5E7F;&#x8BEF;&#x5DEE;&#x7387;&#x7684;&#x9884;&#x4F30;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x201C;&#x6D6A;&#x8D39;&#x201D;&#x8FC7;&#x591A;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x5728;&#x9A8C;&#x8BC1;&#x96C6;&#x4E0A;&#xFF0C;&#x901A;&#x5E38;&#x7684;&#x529E;&#x6CD5;&#x662F;&#x4F7F;&#x7528;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#xFF1A;&#x8BAD;&#x7EC3;&#x96C6;&#x5206;&#x6210;&#x4E92;&#x8865;&#x7684;&#x5B50;&#x96C6;&#xFF0C;&#x6BCF;&#x4E2A;&#x6A21;&#x578B;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x5B50;&#x96C6;&#x8BAD;&#x7EC3;&#xFF0C;&#x518D;&#x7528;&#x5269;&#x4E0B;&#x7684;&#x5B50;&#x96C6;&#x9A8C;&#x8BC1;&#x3002;&#x4E00;&#x65E6;&#x786E;&#x5B9A;&#x6A21;&#x578B;&#x7C7B;&#x578B;&#x548C;&#x8D85;&#x53C2;&#x6570;&#xFF0C;&#x6700;&#x7EC8;&#x7684;&#x6A21;&#x578B;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x8D85;&#x53C2;&#x6570;&#x548C;&#x5168;&#x90E8;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#xFF0C;&#x7528;&#x6D4B;&#x8BD5;&#x96C6;&#x5F97;&#x5230;&#x63A8;&#x5E7F;&#x8BEF;&#x5DEE;&#x7387;&#x3002;</p>
<blockquote>
<p>&#x6CA1;&#x6709;&#x514D;&#x8D39;&#x5348;&#x9910;&#x516C;&#x7406;</p>
<p>&#x6A21;&#x578B;&#x662F;&#x89C2;&#x5BDF;&#x7684;&#x7B80;&#x5316;&#x7248;&#x672C;&#x3002;&#x7B80;&#x5316;&#x610F;&#x5473;&#x7740;&#x820D;&#x5F03;&#x65E0;&#x6CD5;&#x8FDB;&#x884C;&#x63A8;&#x5E7F;&#x7684;&#x8868;&#x9762;&#x7EC6;&#x8282;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8981;&#x786E;&#x5B9A;&#x820D;&#x5F03;&#x4EC0;&#x4E48;&#x6570;&#x636E;&#x3001;&#x4FDD;&#x7559;&#x4EC0;&#x4E48;&#x6570;&#x636E;&#xFF0C;&#x5FC5;&#x987B;&#x8981;&#x505A;&#x5047;&#x8BBE;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x7EBF;&#x6027;&#x6A21;&#x578B;&#x7684;&#x5047;&#x8BBE;&#x662F;&#x6570;&#x636E;&#x57FA;&#x672C;&#x4E0A;&#x662F;&#x7EBF;&#x6027;&#x7684;&#xFF0C;&#x5B9E;&#x4F8B;&#x548C;&#x6A21;&#x578B;&#x76F4;&#x7EBF;&#x95F4;&#x7684;&#x8DDD;&#x79BB;&#x53EA;&#x662F;&#x566A;&#x97F3;&#xFF0C;&#x53EF;&#x4EE5;&#x653E;&#x5FC3;&#x5FFD;&#x7565;&#x3002;</p>
<p>&#x5728;&#x4E00;&#x7BC7; 1996 &#x5E74;&#x7684;<a href="https://www.zabaras.com/Courses/BayesianComputing/Papers/lack_of_a_priori_distinctions_wolpert.pdf" target="_blank">&#x8457;&#x540D;&#x8BBA;&#x6587;</a>&#x4E2D;&#xFF0C;David Wolpert &#x8BC1;&#x660E;&#xFF0C;&#x5982;&#x679C;&#x5B8C;&#x5168;&#x4E0D;&#x5BF9;&#x6570;&#x636E;&#x505A;&#x5047;&#x8BBE;&#xFF0C;&#x5C31;&#x6CA1;&#x6709;&#x7406;&#x7531;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x6A21;&#x578B;&#x800C;&#x4E0D;&#x9009;&#x53E6;&#x4E00;&#x4E2A;&#x3002;&#x8FD9;&#x79F0;&#x4F5C;&#x6CA1;&#x6709;&#x514D;&#x8D39;&#x5348;&#x9910;&#xFF08;NFL&#xFF09;&#x516C;&#x7406;&#x3002;&#x5BF9;&#x4E8E;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x6700;&#x4F73;&#x6A21;&#x578B;&#x662F;&#x7EBF;&#x6027;&#x6A21;&#x578B;&#xFF0C;&#x800C;&#x5BF9;&#x5176;&#x5B83;&#x6570;&#x636E;&#x96C6;&#x662F;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x6A21;&#x578B;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x6548;&#x679C;&#x66F4;&#x597D;&#xFF08;&#x5982;&#x8FD9;&#x4E2A;&#x516C;&#x7406;&#x7684;&#x540D;&#x5B57;&#x6240;&#x793A;&#xFF09;&#x3002;&#x786E;&#x4FE1;&#x7684;&#x552F;&#x4E00;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x6D4B;&#x8BD5;&#x6240;&#x6709;&#x7684;&#x6A21;&#x578B;&#x3002;&#x56E0;&#x4E3A;&#x8FD9;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#xFF0C;&#x5B9E;&#x9645;&#x4E2D;&#x5C31;&#x5FC5;&#x987B;&#x8981;&#x505A;&#x4E00;&#x4E9B;&#x5BF9;&#x6570;&#x636E;&#x5408;&#x7406;&#x7684;&#x5047;&#x8BBE;&#xFF0C;&#x53EA;&#x8BC4;&#x4F30;&#x51E0;&#x4E2A;&#x5408;&#x7406;&#x7684;&#x6A21;&#x578B;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5BF9;&#x4E8E;&#x7B80;&#x5355;&#x4EFB;&#x52A1;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x662F;&#x7528;&#x4E0D;&#x540C;&#x7A0B;&#x5EA6;&#x7684;&#x6B63;&#x5219;&#x5316;&#x8BC4;&#x4F30;&#x7EBF;&#x6027;&#x6A21;&#x578B;&#xFF0C;&#x5BF9;&#x4E8E;&#x590D;&#x6742;&#x95EE;&#x9898;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x8981;&#x8BC4;&#x4F30;&#x51E0;&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6A21;&#x578B;&#x3002;</p>
</blockquote>
<h1 id="&#x7EC3;&#x4E60;">&#x7EC3;&#x4E60;</h1>
<p>&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5B66;&#x4E60;&#x4E86;&#x4E00;&#x4E9B;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4E2D;&#x6700;&#x4E3A;&#x91CD;&#x8981;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x4E0B;&#x4E00;&#x7AE0;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x66F4;&#x52A0;&#x6DF1;&#x5165;&#xFF0C;&#x5E76;&#x5199;&#x4E00;&#x4E9B;&#x4EE3;&#x7801;&#x3002;&#x5F00;&#x59CB;&#x4E0B;&#x7AE0;&#x4E4B;&#x524D;&#xFF0C;&#x786E;&#x4FDD;&#x4F60;&#x80FD;&#x56DE;&#x7B54;&#x4E0B;&#x9762;&#x7684;&#x95EE;&#x9898;&#xFF1A;</p>
<ol>
<li>&#x5982;&#x4F55;&#x5B9A;&#x4E49;&#x673A;&#x5668;&#x5B66;&#x4E60;&#xFF1F;</li>
<li>&#x673A;&#x5668;&#x5B66;&#x4E60;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x7684;&#x56DB;&#x7C7B;&#x95EE;&#x9898;&#xFF1F;</li>
<li>&#x4EC0;&#x4E48;&#x662F;&#x5E26;&#x6807;&#x7B7E;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#xFF1F;</li>
<li>&#x6700;&#x5E38;&#x89C1;&#x7684;&#x4E24;&#x4E2A;&#x76D1;&#x7763;&#x4EFB;&#x52A1;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</li>
<li>&#x6307;&#x51FA;&#x56DB;&#x4E2A;&#x5E38;&#x89C1;&#x7684;&#x975E;&#x76D1;&#x7763;&#x4EFB;&#x52A1;&#xFF1F;</li>
<li>&#x8981;&#x8BA9;&#x4E00;&#x4E2A;&#x673A;&#x5668;&#x4EBA;&#x80FD;&#x5728;&#x5404;&#x79CD;&#x672A;&#x77E5;&#x5730;&#x5F62;&#x884C;&#x8D70;&#xFF0C;&#x4F60;&#x4F1A;&#x91C7;&#x7528;&#x4EC0;&#x4E48;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#xFF1F;</li>
<li>&#x8981;&#x5BF9;&#x4F60;&#x7684;&#x987E;&#x5BA2;&#x8FDB;&#x884C;&#x5206;&#x7EC4;&#xFF0C;&#x4F60;&#x4F1A;&#x91C7;&#x7528;&#x54EA;&#x7C7B;&#x7B97;&#x6CD5;&#xFF1F;</li>
<li>&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x68C0;&#x6D4B;&#x662F;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x95EE;&#x9898;&#xFF0C;&#x8FD8;&#x662F;&#x975E;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x95EE;&#x9898;&#xFF1F;</li>
<li>&#x4EC0;&#x4E48;&#x662F;&#x5728;&#x7EBF;&#x5B66;&#x4E60;&#x7CFB;&#x7EDF;&#xFF1F;</li>
<li>&#x4EC0;&#x4E48;&#x662F;&#x6838;&#x5916;&#x5B66;&#x4E60;&#xFF1F;</li>
<li>&#x4EC0;&#x4E48;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x662F;&#x7528;&#x76F8;&#x4F3C;&#x5EA6;&#x505A;&#x9884;&#x6D4B;&#xFF1F;</li>
<li>&#x6A21;&#x578B;&#x53C2;&#x6570;&#x548C;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x7684;&#x8D85;&#x53C2;&#x6570;&#x7684;&#x533A;&#x522B;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</li>
<li>&#x57FA;&#x4E8E;&#x6A21;&#x578B;&#x5B66;&#x4E60;&#x7684;&#x7B97;&#x6CD5;&#x641C;&#x5BFB;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x6700;&#x6210;&#x529F;&#x7684;&#x7B56;&#x7565;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x57FA;&#x4E8E;&#x6A21;&#x578B;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x505A;&#x9884;&#x6D4B;&#xFF1F;</li>
<li>&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x56DB;&#x4E2A;&#x4E3B;&#x8981;&#x6311;&#x6218;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</li>
<li>&#x5982;&#x679C;&#x6A21;&#x578B;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x8868;&#x73B0;&#x597D;&#xFF0C;&#x4F46;&#x63A8;&#x5E7F;&#x5230;&#x65B0;&#x5B9E;&#x4F8B;&#x8868;&#x73B0;&#x5DEE;&#xFF0C;&#x95EE;&#x9898;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x7ED9;&#x51FA;&#x4E09;&#x4E2A;&#x53EF;&#x80FD;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</li>
<li>&#x4EC0;&#x4E48;&#x662F;&#x6D4B;&#x8BD5;&#x96C6;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x4F7F;&#x7528;&#x5B83;&#xFF1F;</li>
<li>&#x9A8C;&#x8BC1;&#x96C6;&#x7684;&#x76EE;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</li>
<li>&#x5982;&#x679C;&#x7528;&#x6D4B;&#x8BD5;&#x96C6;&#x8C03;&#x8282;&#x8D85;&#x53C2;&#x6570;&#xFF0C;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#xFF1F;</li>
<li>&#x4EC0;&#x4E48;&#x662F;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x5B83;&#x6BD4;&#x9A8C;&#x8BC1;&#x96C6;&#x597D;&#xFF1F;</li>
</ol>
<p>&#x7EC3;&#x4E60;&#x7B54;&#x6848;&#x89C1;&#x9644;&#x5F55; A&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="0.前言.html" class="navigation navigation-prev " aria-label="Previous page: 零、前言">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="2.一个完整的机器学习项目.html" class="navigation navigation-next " aria-label="Next page: 二、一个完整的机器学习项目">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"一、机器学习概览","level":"1.3","depth":1,"next":{"title":"二、一个完整的机器学习项目","level":"1.4","depth":1,"path":"docs/2.一个完整的机器学习项目.md","ref":"docs/2.一个完整的机器学习项目.md","articles":[]},"previous":{"title":"零、前言","level":"1.2","depth":1,"path":"docs/0.前言.md","ref":"docs/0.前言.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"docs/1.机器学习概览.md","mtime":"2019-04-18T03:01:37.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-05-07T09:41:36.357Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

