
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>十、人工神经网络介绍 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="11.训练深层神经网络.html" />
    
    
    <link rel="prev" href="9.启动并运行_TensorFlow.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Sklearn 与 TensorFlow 机器学习实用指南
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="0.前言.html">
            
                <a href="0.前言.html">
            
                    
                    零、前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="1.机器学习概览.html">
            
                <a href="1.机器学习概览.html">
            
                    
                    一、机器学习概览
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="2.一个完整的机器学习项目.html">
            
                <a href="2.一个完整的机器学习项目.html">
            
                    
                    二、一个完整的机器学习项目
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="3.分类.html">
            
                <a href="3.分类.html">
            
                    
                    三、分类
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="4.训练模型.html">
            
                <a href="4.训练模型.html">
            
                    
                    四、训练模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="5.支持向量机.html">
            
                <a href="5.支持向量机.html">
            
                    
                    五、支持向量机
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="6.决策树.html">
            
                <a href="6.决策树.html">
            
                    
                    六、决策树
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="7.集成学习和随机森林.html">
            
                <a href="7.集成学习和随机森林.html">
            
                    
                    七、集成学习和随机森林
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="8.降维.html">
            
                <a href="8.降维.html">
            
                    
                    八、降维
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="9.启动并运行_TensorFlow.html">
            
                <a href="9.启动并运行_TensorFlow.html">
            
                    
                    九、启动并运行 TensorFlow
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.12" data-path="10.人工神经网络介绍.html">
            
                <a href="10.人工神经网络介绍.html">
            
                    
                    十、人工神经网络介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="11.训练深层神经网络.html">
            
                <a href="11.训练深层神经网络.html">
            
                    
                    十一、训练深层神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="12.设备和服务器上的分布式_TensorFlow.html">
            
                <a href="12.设备和服务器上的分布式_TensorFlow.html">
            
                    
                    十二、设备和服务器上的分布式 TensorFlow
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="13.卷积神经网络.html">
            
                <a href="13.卷积神经网络.html">
            
                    
                    十三、卷积神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="14.循环神经网络.html">
            
                <a href="14.循环神经网络.html">
            
                    
                    十四、循环神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="15.自编码器.html">
            
                <a href="15.自编码器.html">
            
                    
                    十五、自编码器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="16.强化学习.html">
            
                <a href="16.强化学习.html">
            
                    
                    十六、强化学习
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="B.机器学习项目清单.html">
            
                <a href="B.机器学习项目清单.html">
            
                    
                    附录 B、机器学习项目清单
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="C.SVM_对偶问题.html">
            
                <a href="C.SVM_对偶问题.html">
            
                    
                    附录 C、SVM 对偶问题
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="D.自动微分.html">
            
                <a href="D.自动微分.html">
            
                    
                    附录 D、自动微分
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >十、人工神经网络介绍</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x5341;&#x3001;&#x4EBA;&#x5DE5;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4ECB;&#x7ECD;">&#x5341;&#x3001;&#x4EBA;&#x5DE5;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4ECB;&#x7ECD;</h1>
<blockquote>
<p>&#x8BD1;&#x8005;&#xFF1A;<a href="https://github.com/wangxupeng" target="_blank">@akonwang</a>&#x3001;<a href="https://github.com/friedhelm739" target="_blank">@friedhelm739</a></p>
<p>&#x6821;&#x5BF9;&#x8005;&#xFF1A;<a href="https://github.com/wizardforcel" target="_blank">@&#x98DE;&#x9F99;</a>&#x3001;<a href="https://github.com/bigeyex" target="_blank">@YuWang</a></p>
</blockquote>
<p>&#x9E1F;&#x7C7B;&#x542F;&#x53D1;&#x6211;&#x4EEC;&#x98DE;&#x7FD4;&#xFF0C;&#x725B;&#x84A1;&#x690D;&#x7269;&#x542F;&#x53D1;&#x4E86;&#x5C3C;&#x9F99;&#x7EF3;&#xFF0C;&#x5927;&#x81EA;&#x7136;&#x4E5F;&#x6FC0;&#x53D1;&#x4E86;&#x8BB8;&#x591A;&#x5176;&#x4ED6;&#x53D1;&#x660E;&#x3002;&#x4ECE;&#x903B;&#x8F91;&#x4E0A;&#x770B;&#xFF0C;&#x5927;&#x8111;&#x662F;&#x5982;&#x4F55;&#x6784;&#x5EFA;&#x667A;&#x80FD;&#x673A;&#x5668;&#x7684;&#x7075;&#x611F;&#x3002;&#x8FD9;&#x662F;&#x542F;&#x53D1;&#x4EBA;&#x5DE5;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF08;ANN&#xFF09;&#x7684;&#x5173;&#x952E;&#x601D;&#x60F3;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5C3D;&#x7BA1;&#x98DE;&#x673A;&#x53D7;&#x5230;&#x9E1F;&#x7C7B;&#x7684;&#x542F;&#x53D1;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x4E0D;&#x5FC5;&#x62CD;&#x52A8;&#x7FC5;&#x8180;&#x3002;&#x540C;&#x6837;&#x7684;&#xFF0C;ANN &#x9010;&#x6E10;&#x53D8;&#x5F97;&#x4E0E;&#x4ED6;&#x4EEC;&#x7684;&#x751F;&#x7269;&#x8868;&#x5144;&#x5F1F;&#x6709;&#x5F88;&#x5927;&#x7684;&#x4E0D;&#x540C;&#x3002;&#x4E00;&#x4E9B;&#x7814;&#x7A76;&#x8005;&#x751A;&#x81F3;&#x4E89;&#x8FA9;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x5B8C;&#x5168;&#x653E;&#x5F03;&#x751F;&#x7269;&#x7C7B;&#x6BD4;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x901A;&#x8FC7;&#x8BF4;&#x201C;&#x5355;&#x4F4D;&#x201D;&#x800C;&#x4E0D;&#x662F;&#x201C;&#x795E;&#x7ECF;&#x5143;&#x201D;&#xFF09;&#xFF0C;&#x4EE5;&#x514D;&#x6211;&#x4EEC;&#x628A;&#x6211;&#x4EEC;&#x7684;&#x521B;&#x9020;&#x529B;&#x9650;&#x5236;&#x5728;&#x751F;&#x7269;&#x5B66;&#x7684;&#x7CFB;&#x7EDF;&#x4E0A;&#x3002;</p>
<p>&#x4EBA;&#x5DE5;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x662F;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x6838;&#x5FC3;&#x3002;&#x5B83;&#x4EEC;&#x5177;&#x6709;&#x901A;&#x7528;&#x6027;&#x3001;&#x5F3A;&#x5927;&#x6027;&#x548C;&#x53EF;&#x6269;&#x5C55;&#x6027;&#xFF0C;&#x4F7F;&#x5F97;&#x5B83;&#x4EEC;&#x80FD;&#x591F;&#x5F88;&#x597D;&#x5730;&#x89E3;&#x51B3;&#x5927;&#x578B;&#x548C;&#x9AD8;&#x5EA6;&#x590D;&#x6742;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4EFB;&#x52A1;&#xFF0C;&#x4F8B;&#x5982;&#x5206;&#x7C7B;&#x6570;&#x5341;&#x4EBF;&#x56FE;&#x50CF;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x8C37;&#x6B4C;&#x56FE;&#x50CF;&#xFF09;&#xFF0C;&#x5F3A;&#x5927;&#x7684;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#x670D;&#x52A1;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x82F9;&#x679C;&#x7684; Siri&#xFF09;&#xFF0C;&#x901A;&#x8FC7;&#x6BCF;&#x5929;&#x8FFD;&#x8E2A;&#x6570;&#x767E;&#x4E07;&#x7684;&#x7528;&#x6237;&#x7684;&#x884C;&#x4E3A;&#x63A8;&#x8350;&#x6700;&#x597D;&#x7684;&#x89C6;&#x9891;&#xFF08;&#x6BD4;&#x5982; YouTube&#xFF09;&#xFF0C;&#x6216;&#x8005;&#x901A;&#x8FC7;&#x5728;&#x6E38;&#x620F;&#x4E2D;&#x51FB;&#x8D25;&#x4E16;&#x754C;&#x51A0;&#x519B;&#xFF0C;&#x901A;&#x8FC7;&#x5B66;&#x4E60;&#x6570;&#x767E;&#x4E07;&#x7684;&#x6E38;&#x620F;&#xFF0C;&#x7136;&#x540E;&#x4E0E;&#x81EA;&#x5DF1;&#x5BF9;&#x6297;&#xFF08;DeepMind &#x7684; AlgFaGo&#xFF09;&#x3002;</p>
<p>&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4ECB;&#x7ECD;&#x4EBA;&#x5DE5;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x4ECE;&#x5FEB;&#x901F;&#x6E38;&#x89C8;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;ANN&#x67B6;&#x6784;&#x5F00;&#x59CB;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x63D0;&#x51FA;&#x591A;&#x5C42;&#x611F;&#x77E5;&#x5668;&#xFF08;MLP&#xFF09;&#xFF0C;&#x5E76;&#x57FA;&#x4E8E;TensorFlow&#x5B9E;&#x73B0;MNIST&#x6570;&#x5B57;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#xFF08;&#x5728;&#x7B2C;3&#x7AE0;&#x4E2D;&#x4ECB;&#x7ECD;&#xFF09;&#x3002;</p>
<h2 id="&#x4ECE;&#x751F;&#x7269;&#x5230;&#x4EBA;&#x5DE5;&#x795E;&#x7ECF;&#x5143;">&#x4ECE;&#x751F;&#x7269;&#x5230;&#x4EBA;&#x5DE5;&#x795E;&#x7ECF;&#x5143;</h2>
<p>&#x4EE4;&#x4EBA;&#x60CA;&#x8BB6;&#x7684;&#x662F;&#xFF0C;&#x4EBA;&#x5DE5;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x4E86;&#x76F8;&#x5F53;&#x957F;&#x7684;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF1A;&#x5B83;&#x4EEC;&#x6700;&#x521D;&#x662F;&#x7531;&#x795E;&#x7ECF;&#x751F;&#x7406;&#x5B66;&#x5BB6; Warren McCulloch &#x548C;&#x6570;&#x5B66;&#x5BB6; Walter Pitts &#x5728; 1943 &#x63D0;&#x51FA;&#x3002;McCulloch &#x548C; Pitts &#x5728;&#x5176;&#x91CC;&#x7A0B;&#x7891;&#x5F0F;&#x7684;&#x8BBA;&#x6587;&#x4E2D;&#x63D0;&#x51FA;&#x4E86;&#x201C;&#x795E;&#x7ECF;&#x6D3B;&#x52A8;&#x5185;&#x5728;&#x7684;&#x903B;&#x8F91;&#x6F14;&#x7B97;&#x201D;&#xFF0C;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x7B80;&#x5316;&#x7684;&#x8BA1;&#x7B97;&#x6A21;&#x578B;&#xFF0C;&#x5373;&#x751F;&#x7269;&#x795E;&#x7ECF;&#x5143;&#x5982;&#x4F55;&#x5728;&#x52A8;&#x7269;&#x5927;&#x8111;&#x4E2D;&#x534F;&#x540C;&#x5DE5;&#x4F5C;&#xFF0C;&#x7528;&#x903B;&#x8F91;&#x8FDB;&#x884C;&#x590D;&#x6742;&#x7684;&#x8BA1;&#x7B97;&#x3002;&#x8FD9;&#x662F;&#x7B2C;&#x4E00;&#x4E2A;&#x4EBA;&#x5DE5;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x3002;&#x4ECE;&#x90A3;&#x65F6;&#x8D77;&#xFF0C;&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x8BB8;&#x591A;&#x5176;&#x4ED6;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x7ED3;&#x6784;&#x5DF2;&#x7ECF;&#x88AB;&#x53D1;&#x660E;&#xFF0C;</p>
<p>&#x76F4;&#x5230; 20 &#x4E16;&#x7EAA; 60 &#x5E74;&#x4EE3;&#xFF0C;ANN &#x7684;&#x65E9;&#x671F;&#x6210;&#x529F;&#x624D;&#x4F7F;&#x4EBA;&#x4EEC;&#x666E;&#x904D;&#x76F8;&#x4FE1;&#x6211;&#x4EEC;&#x5F88;&#x5FEB;&#x5C31;&#x4F1A;&#x4E0E;&#x771F;&#x6B63;&#x7684;&#x667A;&#x80FD;&#x673A;&#x5668;&#x5BF9;&#x8BDD;&#x3002;&#x5F53;&#x663E;&#x7136;&#x7684;&#x8FD9;&#x4E2A;&#x627F;&#x8BFA;&#x5C06;&#x4E0D;&#x4F1A;&#x88AB;&#x5151;&#x73B0;&#xFF08;&#x81F3;&#x5C11;&#x76F8;&#x5F53;&#x957F;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF09;&#x65F6;&#xFF0C;&#x8D44;&#x91D1;&#x98DE;&#x5411;&#x522B;&#x5904;&#xFF0C;ANN &#x8FDB;&#x5165;&#x4E86;&#x4E00;&#x4E2A;&#x6F2B;&#x957F;&#x7684;&#x9ED1;&#x6697;&#x65F6;&#x4EE3;&#x3002;20 &#x4E16;&#x7EAA; 80 &#x5E74;&#x4EE3;&#x521D;&#xFF0C;&#x968F;&#x7740;&#x65B0;&#x7684;&#x7F51;&#x7EDC;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x7684;&#x53D1;&#x660E;&#x548C;&#x66F4;&#x597D;&#x7684;&#x8BAD;&#x7EC3;&#x6280;&#x672F;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x4EBA;&#x4EEC;&#x5BF9;&#x4EBA;&#x5DE5;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x5174;&#x8DA3;&#x4E5F;&#x5728;&#x91CD;&#x65B0;&#x71C3;&#x8D77;&#x3002;&#x4F46;&#x5230;&#x4E86; 20 &#x4E16;&#x7EAA; 90 &#x5E74;&#x4EE3;&#xFF0C;&#x5F3A;&#x5927;&#x7684;&#x53EF;&#x66FF;&#x4EE3;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6280;&#x672F;&#x7684;&#xFF0C;&#x5982;&#x652F;&#x6301;&#x5411;&#x91CF;&#x673A;&#xFF08;&#x89C1;&#x7B2C;5&#x7AE0;&#xFF09;&#x53D7;&#x5230;&#x5927;&#x591A;&#x6570;&#x7814;&#x7A76;&#x8005;&#x7684;&#x9752;&#x7750;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x4F3C;&#x4E4E;&#x63D0;&#x4F9B;&#x4E86;&#x66F4;&#x597D;&#x7684;&#x7ED3;&#x679C;&#x548C;&#x66F4;&#x5F3A;&#x7684;&#x7406;&#x8BBA;&#x57FA;&#x7840;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x76EE;&#x7779;&#x4E86;&#x53E6;&#x4E00;&#x80A1;&#x5BF9; ANN &#x611F;&#x5174;&#x8DA3;&#x7684;&#x6D6A;&#x6F6E;&#x3002;&#x8FD9;&#x6CE2;&#x4F1A;&#x50CF;&#x4EE5;&#x524D;&#x4E00;&#x6837;&#x6D88;&#x5931;&#x5417;&#xFF1F;&#x6709;&#x4E00;&#x4E9B;&#x5F88;&#x597D;&#x7684;&#x7406;&#x7531;&#x76F8;&#x4FE1;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x662F;&#x4E0D;&#x540C;&#x7684;&#xFF0C;&#x5C06;&#x4F1A;&#x5BF9;&#x6211;&#x4EEC;&#x7684;&#x751F;&#x6D3B;&#x4EA7;&#x751F;&#x66F4;&#x6DF1;&#x8FDC;&#x7684;&#x5F71;&#x54CD;&#xFF1A;</p>
<ul>
<li><p>&#x73B0;&#x5728;&#x6709;&#x5927;&#x91CF;&#x7684;&#x6570;&#x636E;&#x53EF;&#x7528;&#x4E8E;&#x8BAD;&#x7EC3;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;ANN &#x5728;&#x8BB8;&#x591A;&#x975E;&#x5E38;&#x590D;&#x6742;&#x7684;&#x95EE;&#x9898;&#x4E0A;&#x7ECF;&#x5E38;&#x4F18;&#x4E8E;&#x5176;&#x4ED6; ML &#x6280;&#x672F;&#x3002;</p>
</li>
<li><p>&#x81EA;&#x4ECE; 90 &#x5E74;&#x4EE3;&#x4EE5;&#x6765;&#xFF0C;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#x7684;&#x5DE8;&#x5927;&#x589E;&#x957F;&#x4F7F;&#x5F97;&#x5728;&#x5408;&#x7406;&#x7684;&#x65F6;&#x95F4;&#x5185;&#x8BAD;&#x7EC3;&#x5927;&#x578B;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6210;&#x4E3A;&#x53EF;&#x80FD;&#x3002;&#x8FD9;&#x90E8;&#x5206;&#x662F;&#x7531;&#x4E8E;&#x7A46;&#x5C14;&#x5B9A;&#x5F8B;&#xFF0C;&#x4F46;&#x4E5F;&#x5F97;&#x76CA;&#x4E8E;&#x6E38;&#x620F;&#x4EA7;&#x4E1A;&#xFF0C;&#x5B83;&#x5DF2;&#x7ECF;&#x4EA7;&#x751F;&#x4E86;&#x6570;&#x4EE5;&#x767E;&#x4E07;&#x8BA1;&#x7684;&#x5F3A;&#x5927;&#x7684; GPU &#x663E;&#x5361;&#x3002;</p>
</li>
<li><p>&#x6539;&#x8FDB;&#x4E86;&#x8BAD;&#x7EC3;&#x7B97;&#x6CD5;&#x3002;&#x516C;&#x5E73;&#x5730;&#x8BF4;&#xFF0C;&#x5B83;&#x4EEC;&#x4E0E;&#x4E0A;&#x4E16;&#x7EAA; 90 &#x5E74;&#x4EE3;&#x4F7F;&#x7528;&#x7684;&#x7565;&#x6709;&#x4E0D;&#x540C;&#xFF0C;&#x4F46;&#x8FD9;&#x4E9B;&#x76F8;&#x5BF9;&#x8F83;&#x5C0F;&#x7684;&#x8C03;&#x6574;&#x4EA7;&#x751F;&#x4E86;&#x5DE8;&#x5927;&#x7684;&#x6B63;&#x9762;&#x5F71;&#x54CD;&#x3002;</p>
</li>
<li><p>&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x4EBA;&#x5DE5;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x4E00;&#x4E9B;&#x7406;&#x8BBA;&#x5C40;&#x9650;&#x6027;&#x662F;&#x826F;&#x6027;&#x7684;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8BB8;&#x591A;&#x4EBA;&#x8BA4;&#x4E3A;&#x4EBA;&#x5DE5;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8BAD;&#x7EC3;&#x7B97;&#x6CD5;&#x662F;&#x6CE8;&#x5B9A;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x5F88;&#x53EF;&#x80FD;&#x9677;&#x5165;&#x5C40;&#x90E8;&#x6700;&#x4F18;&#xFF0C;&#x4F46;&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#xFF0C;&#x8FD9;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x662F;&#x76F8;&#x5F53;&#x7F55;&#x89C1;&#x7684;&#xFF08;&#x6216;&#x8005;&#x5982;&#x679C;&#x5B83;&#x53D1;&#x751F;&#xFF0C;&#x5B83;&#x4EEC;&#x4E5F;&#x901A;&#x5E38;&#x76F8;&#x5F53;&#x63A5;&#x8FD1;&#x5168;&#x5C40;&#x6700;&#x4F18;&#xFF09;&#x3002;</p>
</li>
<li><p>ANN &#x4F3C;&#x4E4E;&#x5DF2;&#x7ECF;&#x8FDB;&#x5165;&#x4E86;&#x8D44;&#x91D1;&#x548C;&#x8FDB;&#x6B65;&#x7684;&#x826F;&#x6027;&#x5FAA;&#x73AF;&#x3002;&#x57FA;&#x4E8E; ANN &#x7684;&#x60CA;&#x4EBA;&#x4EA7;&#x54C1;&#x5B9A;&#x671F;&#x6210;&#x4E3A;&#x5934;&#x6761;&#x65B0;&#x95FB;&#xFF0C;&#x5438;&#x5F15;&#x4E86;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x5173;&#x6CE8;&#x548C;&#x8D44;&#x91D1;&#xFF0C;&#x5BFC;&#x81F4;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x8FDB;&#x6B65;&#xFF0C;&#x751A;&#x81F3;&#x66F4;&#x60CA;&#x4EBA;&#x7684;&#x4EA7;&#x54C1;&#x3002;</p>
</li>
</ul>
<h2 id="&#x751F;&#x7269;&#x795E;&#x7ECF;&#x5143;">&#x751F;&#x7269;&#x795E;&#x7ECF;&#x5143;</h2>
<p>&#x5728;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4EBA;&#x5DE5;&#x795E;&#x7ECF;&#x5143;&#x4E4B;&#x524D;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x5FEB;&#x901F;&#x770B;&#x4E00;&#x4E2A;&#x751F;&#x7269;&#x795E;&#x7ECF;&#x5143;&#xFF08;&#x5982;&#x56FE; 10-1 &#x6240;&#x793A;&#xFF09;&#x3002;&#x5B83;&#x662F;&#x4E00;&#x79CD;&#x5F02;&#x5E38;&#x7EC6;&#x80DE;&#xFF0C;&#x4E3B;&#x8981;&#x89C1;&#x4E8E;&#x52A8;&#x7269;&#x5927;&#x8111;&#x76AE;&#x5C42;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x4F60;&#x7684;&#x5927;&#x8111;&#xFF09;&#xFF0C;&#x7531;&#x5305;&#x542B;&#x7EC6;&#x80DE;&#x6838;&#x548C;&#x5927;&#x591A;&#x6570;&#x7EC6;&#x80DE;&#x590D;&#x6742;&#x6210;&#x5206;&#x7684;&#x7EC6;&#x80DE;&#x4F53;&#x7EC4;&#x6210;&#xFF0C;&#x8BB8;&#x591A;&#x5206;&#x652F;&#x6269;&#x5C55;&#x79F0;&#x4E3A;&#x6811;&#x7A81;&#xFF0C;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x957F;&#x7684;&#x5EF6;&#x4F38;&#x79F0;&#x4E3A;&#x8F74;&#x7A81;&#x3002;&#x8F74;&#x7A81;&#x7684;&#x957F;&#x5EA6;&#x53EF;&#x80FD;&#x6BD4;&#x7EC6;&#x80DE;&#x4F53;&#x957F;&#x51E0;&#x500D;&#xFF0C;&#x6216;&#x957F;&#x8FBE;&#x51E0;&#x4E07;&#x500D;&#x3002;&#x5728;&#x5B83;&#x7684;&#x672B;&#x7AEF;&#x9644;&#x8FD1;&#xFF0C;&#x8F74;&#x7A81;&#x5206;&#x88C2;&#x6210;&#x8BB8;&#x591A;&#x79F0;&#x4E3A; telodendria &#x7684;&#x5206;&#x652F;&#xFF0C;&#x5728;&#x8FD9;&#x4E9B;&#x5206;&#x652F;&#x7684;&#x9876;&#x7AEF;&#x662F;&#x5FAE;&#x5C0F;&#x7684;&#x7ED3;&#x6784;&#xFF0C;&#x79F0;&#x4E3A;&#x7A81;&#x89E6;&#x672B;&#x7AEF;&#xFF08;&#x6216;&#x7B80;&#x5355;&#x7684;&#x7A81;&#x89E6;&#xFF09;&#xFF0C;&#x5B83;&#x4EEC;&#x8FDE;&#x63A5;&#x5230;&#x5176;&#x4ED6;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x6811;&#x7A81;&#xFF08;&#x6216;&#x76F4;&#x63A5;&#x5230;&#x7EC6;&#x80DE;&#x4F53;&#xFF09;&#x3002;&#x751F;&#x7269;&#x795E;&#x7ECF;&#x5143;&#x63A5;&#x6536;&#x77ED;&#x7684;&#x7535;&#x8109;&#x51B2;&#xFF0C;&#x79F0;&#x4E3A;&#x6765;&#x81EA;&#x5176;&#x4ED6;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x4FE1;&#x53F7;&#xFF0C;&#x901A;&#x8FC7;&#x8FD9;&#x4E9B;&#x7A81;&#x89E6;&#x3002;&#x5F53;&#x795E;&#x7ECF;&#x5143;&#x5728;&#x51E0;&#x6BEB;&#x79D2;&#x5185;&#x63A5;&#x6536;&#x5230;&#x6765;&#x81EA;&#x5176;&#x4ED6;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x8DB3;&#x591F;&#x6570;&#x91CF;&#x7684;&#x4FE1;&#x53F7;&#x65F6;&#xFF0C;&#x5B83;&#x5C31;&#x53D1;&#x5C04;&#x51FA;&#x81EA;&#x5DF1;&#x7684;&#x4FE1;&#x53F7;&#x3002;</p>
<p><img src="../images/chapter_10/10-1.png" alt="&#x56FE;10-1"></p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x4E2A;&#x4F53;&#x7684;&#x751F;&#x7269;&#x795E;&#x7ECF;&#x5143;&#x4F3C;&#x4E4E;&#x4EE5;&#x4E00;&#x79CD;&#x76F8;&#x5F53;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x5F0F;&#x8FD0;&#x884C;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x7EC4;&#x7EC7;&#x5728;&#x4E00;&#x4E2A;&#x5DE8;&#x5927;&#x7684;&#x6570;&#x5341;&#x4EBF;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x7F51;&#x7EDC;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x901A;&#x5E38;&#x8FDE;&#x63A5;&#x5230;&#x6570;&#x5343;&#x4E2A;&#x5176;&#x4ED6;&#x795E;&#x7ECF;&#x5143;&#x3002;&#x9AD8;&#x5EA6;&#x590D;&#x6742;&#x7684;&#x8BA1;&#x7B97;&#x53EF;&#x4EE5;&#x7531;&#x76F8;&#x5F53;&#x7B80;&#x5355;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x5DE8;&#x5927;&#x7F51;&#x7EDC;&#x6765;&#x5B8C;&#x6210;&#xFF0C;&#x5C31;&#x50CF;&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x7684;&#x8681;&#x7A74;&#x53EF;&#x4EE5;&#x7531;&#x6BCF;&#x4E2A;&#x8682;&#x8681;&#x7684;&#x52AA;&#x529B;&#x6784;&#x9020;&#x51FA;&#x6765;&#x3002;&#x751F;&#x7269;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF08;BNN&#xFF09;&#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x4ECD;&#x7136;&#x662F;&#x4E3B;&#x52A8;&#x7814;&#x7A76;&#x7684;&#x4E3B;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x5927;&#x8111;&#x7684;&#x67D0;&#x4E9B;&#x90E8;&#x5206;&#x5DF2;&#x7ECF;&#x88AB;&#x6620;&#x5C04;&#xFF0C;&#x5E76;&#x4E14;&#x4F3C;&#x4E4E;&#x795E;&#x7ECF;&#x5143;&#x7ECF;&#x5E38;&#x7EC4;&#x7EC7;&#x5728;&#x8FDE;&#x7EED;&#x7684;&#x5C42;&#x4E2D;&#xFF0C;&#x5982;&#x56FE; 10-2 &#x6240;&#x793A;&#x3002;</p>
<p><img src="../images/chapter_10/10-2.png" alt="&#x56FE;10-2"></p>
<h2 id="&#x795E;&#x7ECF;&#x5143;&#x7684;&#x903B;&#x8F91;&#x8BA1;&#x7B97;">&#x795E;&#x7ECF;&#x5143;&#x7684;&#x903B;&#x8F91;&#x8BA1;&#x7B97;</h2>
<p>Warren McCulloch &#x548C; Pitts &#x63D0;&#x51FA;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x751F;&#x7269;&#x795E;&#x7ECF;&#x5143;&#x6A21;&#x578B;&#xFF0C;&#x8FD9;&#x540E;&#x6765;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x4EBA;&#x5DE5;&#x795E;&#x7ECF;&#x5143;&#x6210;&#x4E3A;&#x4F17;&#x6240;&#x5468;&#x77E5;&#xFF1A;&#x5B83;&#x6709;&#x4E00;&#x4E2A;&#x6216;&#x66F4;&#x591A;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#xFF08;ON/OFF&#xFF09;&#x8F93;&#x5165;&#x548C;&#x4E00;&#x4E2A;&#x4E8C;&#x8FDB;&#x5236;&#x8F93;&#x51FA;&#x3002;&#x5F53;&#x8D85;&#x8FC7;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x8F93;&#x5165;&#x662F;&#x6FC0;&#x6D3B;&#x65F6;&#xFF0C;&#x4EBA;&#x5DE5;&#x795E;&#x7ECF;&#x5143;&#x4F1A;&#x6FC0;&#x6D3B;&#x5176;&#x8F93;&#x51FA;&#x3002;McCulloch &#x548C; Pitts &#x8868;&#x660E;&#xFF0C;&#x5373;&#x4F7F;&#x7528;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x7B80;&#x5316;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x4E5F;&#x6709;&#x53EF;&#x80FD;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x4EBA;&#x5DE5;&#x795E;&#x7ECF;&#x5143;&#x7F51;&#x7EDC;&#x6765;&#x8BA1;&#x7B97;&#x4EFB;&#x4F55;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x903B;&#x8F91;&#x547D;&#x9898;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x6784;&#x5EFA;&#x4E00;&#x4E9B;&#x6267;&#x884C;&#x5404;&#x79CD;&#x903B;&#x8F91;&#x8BA1;&#x7B97;&#x7684; ANN&#xFF08;&#x89C1;&#x56FE; 10-3&#xFF09;&#xFF0C;&#x5047;&#x8BBE;&#x5F53;&#x81F3;&#x5C11;&#x4E24;&#x4E2A;&#x8F93;&#x5165;&#x662F;&#x6FC0;&#x6D3B;&#x7684;&#x65F6;&#x5019;&#x795E;&#x7ECF;&#x5143;&#x88AB;&#x6FC0;&#x6D3B;&#x3002;</p>
<p><img src="../images/chapter_10/10-3.png" alt="&#x56FE;10-3"></p>
<ul>
<li><p>&#x5DE6;&#x8FB9;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x4EC5;&#x4EC5;&#x662F;&#x786E;&#x8BA4;&#x51FD;&#x6570;&#xFF1A;&#x5982;&#x679C;&#x795E;&#x7ECF;&#x5143; A &#x88AB;&#x6FC0;&#x6D3B;&#xFF0C;&#x90A3;&#x4E48;&#x795E;&#x7ECF;&#x5143; C &#x4E5F;&#x88AB;&#x6FC0;&#x6D3B;&#xFF08;&#x56E0;&#x4E3A;&#x5B83;&#x63A5;&#x6536;&#x6765;&#x81EA;&#x795E;&#x7ECF;&#x5143; A &#x7684;&#x4E24;&#x4E2A;&#x8F93;&#x5165;&#x4FE1;&#x53F7;&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x795E;&#x7ECF;&#x5143; A &#x5173;&#x95ED;&#xFF0C;&#x90A3;&#x4E48;&#x795E;&#x7ECF;&#x5143; C &#x4E5F;&#x5173;&#x95ED;&#x3002;</p>
</li>
<li><p>&#x7B2C;&#x4E8C;&#x7F51;&#x7EDC;&#x6267;&#x884C;&#x903B;&#x8F91; AND&#xFF1A;&#x795E;&#x7ECF;&#x5143; C &#x53EA;&#x6709;&#x5728;&#x6FC0;&#x6D3B;&#x795E;&#x7ECF;&#x5143; A &#x548C; B&#xFF08;&#x5355;&#x4E2A;&#x8F93;&#x5165;&#x4FE1;&#x53F7;&#x4E0D;&#x8DB3;&#x4EE5;&#x6FC0;&#x6D3B;&#x795E;&#x7ECF;&#x5143; C&#xFF09;&#x65F6;&#x624D;&#x88AB;&#x6FC0;&#x6D3B;&#x3002;</p>
</li>
<li><p>&#x7B2C;&#x4E09;&#x7F51;&#x7EDC;&#x6267;&#x884C;&#x903B;&#x8F91; OR&#xFF1A;&#x5982;&#x679C;&#x795E;&#x7ECF;&#x5143; A &#x6216;&#x795E;&#x7ECF;&#x5143; B &#x88AB;&#x6FC0;&#x6D3B;&#xFF08;&#x6216;&#x4E24;&#x8005;&#xFF09;&#xFF0C;&#x795E;&#x7ECF;&#x5143; C &#x88AB;&#x6FC0;&#x6D3B;&#x3002;</p>
</li>
<li><p>&#x6700;&#x540E;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x8F93;&#x5165;&#x8FDE;&#x63A5;&#x53EF;&#x4EE5;&#x6291;&#x5236;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x6D3B;&#x52A8;&#xFF08;&#x751F;&#x7269;&#x795E;&#x7ECF;&#x5143;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x60C5;&#x51B5;&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x7B2C;&#x56DB;&#x4E2A;&#x7F51;&#x7EDC;&#x8BA1;&#x7B97;&#x4E00;&#x4E2A;&#x7A0D;&#x5FAE;&#x590D;&#x6742;&#x7684;&#x903B;&#x8F91;&#x547D;&#x9898;&#xFF1A;&#x5982;&#x679C;&#x795E;&#x7ECF;&#x5143; B &#x5173;&#x95ED;&#xFF0C;&#x53EA;&#x6709;&#x5F53;&#x795E;&#x7ECF;&#x5143;A&#x662F;&#x6FC0;&#x6D3B;&#x7684;&#xFF0C;&#x795E;&#x7ECF;&#x5143; C &#x624D;&#x88AB;&#x6FC0;&#x6D3B;&#x3002;&#x5982;&#x679C;&#x795E;&#x7ECF;&#x5143; A &#x59CB;&#x7EC8;&#x662F;&#x6FC0;&#x6D3B;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x903B;&#x8F91; NOT&#xFF1A;&#x795E;&#x7ECF;&#x5143; C &#x5728;&#x795E;&#x7ECF;&#x5143; B &#x5173;&#x95ED;&#x65F6;&#x662F;&#x6FC0;&#x6D3B;&#x7684;&#xFF0C;&#x53CD;&#x4E4B;&#x4EA6;&#x7136;&#x3002;</p>
</li>
</ul>
<p>&#x60A8;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x60F3;&#x8C61;&#x5982;&#x4F55;&#x5C06;&#x8FD9;&#x4E9B;&#x7F51;&#x7EDC;&#x7EC4;&#x5408;&#x8D77;&#x6765;&#x8BA1;&#x7B97;&#x590D;&#x6742;&#x7684;&#x903B;&#x8F91;&#x8868;&#x8FBE;&#x5F0F;&#xFF08;&#x53C2;&#x89C1;&#x672C;&#x7AE0;&#x672B;&#x5C3E;&#x7684;&#x7EC3;&#x4E60;&#xFF09;&#x3002;</p>
<h2 id="&#x611F;&#x77E5;&#x5668;">&#x611F;&#x77E5;&#x5668;</h2>
<p>&#x611F;&#x77E5;&#x5668;&#x662F;&#x6700;&#x7B80;&#x5355;&#x7684;&#x4EBA;&#x5DE5;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7ED3;&#x6784;&#x4E4B;&#x4E00;&#xFF0C;&#x7531; Frank Rosenblatt &#x53D1;&#x660E;&#x4E8E; 1957&#x3002;&#x5B83;&#x662F;&#x57FA;&#x4E8E;&#x4E00;&#x79CD;&#x7A0D;&#x5FAE;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#x5DE5;&#x795E;&#x7ECF;&#x5143;&#xFF08;&#x89C1;&#x56FE; 10-4&#xFF09;&#xFF0C;&#x79F0;&#x4E3A;&#x7EBF;&#x6027;&#x9608;&#x503C;&#x5355;&#x5143;&#xFF08;LTU&#xFF09;&#xFF1A;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x73B0;&#x5728;&#x662F;&#x6570;&#x5B57;&#xFF08;&#x800C;&#x4E0D;&#x662F;&#x4E8C;&#x8FDB;&#x5236;&#x5F00;/&#x5173;&#x503C;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x6BCF;&#x4E2A;&#x8F93;&#x5165;&#x8FDE;&#x63A5;&#x90FD;&#x4E0E;&#x6743;&#x91CD;&#x76F8;&#x8FDE;&#x3002;LTU&#x8BA1;&#x7B97;&#x5176;&#x8F93;&#x5165;&#x7684;&#x52A0;&#x6743;&#x548C;&#xFF08;<code>z = W1&#xD7;1 + W2&#xD7;2 + ... + + WN&#xD7;n = Wt&#xB7;x</code>&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x9636;&#x8DC3;&#x51FD;&#x6570;&#x5E94;&#x7528;&#x4E8E;&#x8BE5;&#x548C;&#xFF0C;&#x5E76;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#xFF1A;<code>HW(x) = STEP(Z) = STEP(W^T&#xB7;x)</code>&#x3002;</p>
<p><img src="../images/chapter_10/10-4.png" alt="&#x56FE;10-4"></p>
<p>&#x6700;&#x5E38;&#x89C1;&#x7684;&#x5728;&#x611F;&#x77E5;&#x5668;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x9636;&#x8DC3;&#x51FD;&#x6570;&#x662F; Heaviside &#x9636;&#x8DC3;&#x51FD;&#x6570;&#xFF08;&#x89C1;&#x65B9;&#x7A0B; 10-1&#xFF09;&#x3002;&#x6709;&#x65F6;&#x4F7F;&#x7528;&#x7B26;&#x53F7;&#x51FD;&#x6570;&#x4EE3;&#x66FF;&#x3002;</p>
<p><img src="../images/chapter_10/E10-1.png" alt="&#x56FE;E10-1"></p>
<p>&#x5355;&#x4E00;&#x7684; LTU &#x53EF;&#x88AB;&#x7528;&#x4F5C;&#x7B80;&#x5355;&#x7EBF;&#x6027;&#x4E8C;&#x5143;&#x5206;&#x7C7B;&#x3002;&#x5B83;&#x8BA1;&#x7B97;&#x8F93;&#x5165;&#x7684;&#x7EBF;&#x6027;&#x7EC4;&#x5408;&#xFF0C;&#x5982;&#x679C;&#x7ED3;&#x679C;&#x8D85;&#x8FC7;&#x9608;&#x503C;&#xFF0C;&#x5B83;&#x8F93;&#x51FA;&#x6B63;&#x7C7B;&#x6216;&#x8005;&#x8F93;&#x51FA;&#x8D1F;&#x7C7B;&#xFF08;&#x5C31;&#x50CF;&#x4E00;&#x4E2A;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x5206;&#x7C7B;&#x6216;&#x7EBF;&#x6027; SVM&#xFF09;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5355;&#x4E00;&#x7684; LTU &#x57FA;&#x4E8E;&#x82B1;&#x74E3;&#x957F;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#x53BB;&#x5206;&#x7C7B;&#x9E22;&#x5C3E;&#x82B1;&#xFF08;&#x4E5F;&#x53EF;&#x6DFB;&#x52A0;&#x989D;&#x5916;&#x7684;&#x504F;&#x7F6E;&#x7279;&#x5F81;<code>x0=1</code>&#xFF0C;&#x5C31;&#x50CF;&#x6211;&#x4EEC;&#x5728;&#x524D;&#x4E00;&#x7AE0;&#x6240;&#x505A;&#x7684;&#xFF09;&#x3002;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A; LTU &#x610F;&#x5473;&#x7740;&#x53BB;&#x5BFB;&#x627E;&#x5408;&#x9002;&#x7684;<code>W0</code>&#x548C;<code>W1</code>&#x503C;&#xFF0C;&#xFF08;&#x8BAD;&#x7EC3;&#x7B97;&#x6CD5;&#x7A0D;&#x540E;&#x63D0;&#x5230;&#xFF09;&#x3002;</p>
<p>&#x611F;&#x77E5;&#x5668;&#x7B80;&#x5355;&#x5730;&#x7531;&#x4E00;&#x5C42; LTU &#x7EC4;&#x6210;&#xFF0C;&#x6BCF;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x8FDE;&#x63A5;&#x5230;&#x6240;&#x6709;&#x8F93;&#x5165;&#x3002;&#x8FD9;&#x4E9B;&#x8FDE;&#x63A5;&#x901A;&#x5E38;&#x7528;&#x7279;&#x6B8A;&#x7684;&#x88AB;&#x79F0;&#x4E3A;&#x8F93;&#x5165;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x4F20;&#x9012;&#x795E;&#x7ECF;&#x5143;&#x6765;&#x8868;&#x793A;&#xFF1A;&#x5B83;&#x4EEC;&#x53EA;&#x8F93;&#x51FA;&#x5B83;&#x4EEC;&#x6240;&#x8F93;&#x5165;&#x7684;&#x4EFB;&#x4F55;&#x8F93;&#x5165;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x901A;&#x5E38;&#x6DFB;&#x52A0;&#x989D;&#x5916;&#x504F;&#x7F6E;&#x7279;&#x5F81;&#xFF08;<code>X0=1</code>&#xFF09;&#x3002;&#x8FD9;&#x79CD;&#x504F;&#x7F6E;&#x7279;&#x6027;&#x901A;&#x5E38;&#x7528;&#x4E00;&#x79CD;&#x79F0;&#x4E3A;&#x504F;&#x7F6E;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x7279;&#x6B8A;&#x7C7B;&#x578B;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x6765;&#x8868;&#x793A;&#xFF0C;&#x5B83;&#x603B;&#x662F;&#x8F93;&#x51FA; 1&#x3002;</p>
<p>&#x56FE; 10-5 &#x8868;&#x793A;&#x5177;&#x6709;&#x4E24;&#x4E2A;&#x8F93;&#x5165;&#x548C;&#x4E09;&#x4E2A;&#x8F93;&#x51FA;&#x7684;&#x611F;&#x77E5;&#x5668;&#x3002;&#x8BE5;&#x611F;&#x77E5;&#x5668;&#x53EF;&#x4EE5;&#x5C06;&#x5B9E;&#x4F8B;&#x540C;&#x65F6;&#x5206;&#x7C7B;&#x4E3A;&#x4E09;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x7C7B;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x591A;&#x8F93;&#x51FA;&#x5206;&#x7C7B;&#x5668;&#x3002;</p>
<p><img src="../images/chapter_10/10-5.png" alt="&#x56FE;10-5"></p>
<p>&#x90A3;&#x4E48;&#x611F;&#x77E5;&#x5668;&#x662F;&#x5982;&#x4F55;&#x8BAD;&#x7EC3;&#x7684;&#x5462;&#xFF1F;Frank Rosenblatt &#x63D0;&#x51FA;&#x7684;&#x611F;&#x77E5;&#x5668;&#x8BAD;&#x7EC3;&#x7B97;&#x6CD5;&#x5728;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x53D7;&#x5230; Hebb &#x89C4;&#x5219;&#x7684;&#x542F;&#x53D1;&#x3002;&#x5728; 1949 &#x51FA;&#x7248;&#x7684;&#x300A;&#x884C;&#x4E3A;&#x7EC4;&#x7EC7;&#x300B;&#x4E00;&#x4E66;&#x4E2D;&#xFF0C;Donald Hebb &#x63D0;&#x51FA;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x751F;&#x7269;&#x795E;&#x7ECF;&#x5143;&#x7ECF;&#x5E38;&#x89E6;&#x53D1;&#x53E6;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x65F6;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x4E4B;&#x95F4;&#x7684;&#x8054;&#x7CFB;&#x5C31;&#x4F1A;&#x53D8;&#x5F97;&#x66F4;&#x5F3A;&#x3002;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x540E;&#x6765;&#x88AB; Siegrid L&#xF6;wel &#x603B;&#x7ED3;&#x4E3A;&#x4E00;&#x4E2A;&#x5438;&#x5F15;&#x4EBA;&#x7684;&#x77ED;&#x8BED;&#xFF1A;&#x201C;&#x4E00;&#x8D77;&#x71C3;&#x70E7;&#x7684;&#x7EC6;&#x80DE;&#xFF0C;&#x6C47;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x3002;&#x201D;&#x8FD9;&#x4E2A;&#x89C4;&#x5219;&#x540E;&#x6765;&#x88AB;&#x79F0;&#x4E3A; Hebb &#x89C4;&#x5219;&#xFF08;&#x6216; HebBIN &#x5B66;&#x4E60;&#xFF09;&#xFF1B;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5F53;&#x4E24;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7684;&#x8F93;&#x51FA;&#x65F6;&#xFF0C;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x8FDE;&#x63A5;&#x6743;&#x91CD;&#x5C31;&#x4F1A;&#x589E;&#x52A0;&#x3002;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x89C4;&#x5219;&#x7684;&#x53D8;&#x4F53;&#x6765;&#x8BAD;&#x7EC3;&#x611F;&#x77E5;&#x5668;&#xFF0C;&#x8BE5;&#x89C4;&#x5219;&#x8003;&#x8651;&#x4E86;&#x7F51;&#x7EDC;&#x6240;&#x72AF;&#x7684;&#x9519;&#x8BEF;&#xFF1B;&#x5B83;&#x4E0D;&#x52A0;&#x5F3A;&#x5BFC;&#x81F4;&#x9519;&#x8BEF;&#x8F93;&#x51FA;&#x7684;&#x8FDE;&#x63A5;&#x3002;&#x66F4;&#x5177;&#x4F53;&#x5730;&#xFF0C;&#x611F;&#x77E5;&#x5668;&#x4E00;&#x6B21;&#x88AB;&#x9988;&#x9001;&#x4E00;&#x4E2A;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#xFF0C;&#x5E76;&#x4E14;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x5B9E;&#x4F8B;&#xFF0C;&#x5B83;&#x8FDB;&#x884C;&#x9884;&#x6D4B;&#x3002;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E00;&#x4E2A;&#x4EA7;&#x751F;&#x9519;&#x8BEF;&#x9884;&#x6D4B;&#x7684;&#x8F93;&#x51FA;&#x795E;&#x7ECF;&#x5143;&#xFF0C;&#x5B83;&#x52A0;&#x5F3A;&#x4E86;&#x8F93;&#x5165;&#x7684;&#x8FDE;&#x63A5;&#x6743;&#x91CD;&#xFF0C;&#x8FD9;&#x5C06;&#x6709;&#x52A9;&#x4E8E;&#x6B63;&#x786E;&#x7684;&#x9884;&#x6D4B;&#x3002;&#x8BE5;&#x89C4;&#x5219;&#x5728;&#x516C;&#x5F0F; 10-2 &#x4E2D;&#x793A;&#x51FA;&#x3002;</p>
<p><img src="../images/chapter_10/E10-2.png" alt="&#x56FE;E10-2"></p>
<ul>
<li><p>&#x5176;&#x4E2D;<code>Wi,j</code>&#x662F;&#x7B2C;<code>i</code>&#x8F93;&#x5165;&#x795E;&#x7ECF;&#x5143;&#x4E0E;&#x7B2C;<code>J</code>&#x4E2A;&#x8F93;&#x51FA;&#x795E;&#x7ECF;&#x5143;&#x4E4B;&#x95F4;&#x7684;&#x8FDE;&#x63A5;&#x6743;&#x91CD;&#x3002;</p>
</li>
<li><p><code>xi</code>&#x662F;&#x5F53;&#x524D;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#x4E0E;&#x8F93;&#x5165;&#x503C;&#x3002;</p>
</li>
<li><p><code>Y</code>&#x5E3D;&#x662F;&#x5F53;&#x524D;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#x7684;&#x7B2C;<code>J</code>&#x4E2A;&#x8F93;&#x51FA;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x8F93;&#x51FA;&#x3002;</p>
</li>
<li><p><code>Yj</code>&#x662F;&#x5F53;&#x524D;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#x7684;&#x7B2C;<code>J</code>&#x4E2A;&#x8F93;&#x51FA;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x76EE;&#x6807;&#x8F93;&#x51FA;&#x3002;</p>
</li>
<li><p><code>&#x3B5;</code>&#x662F;&#x5B66;&#x4E60;&#x7387;&#x3002;</p>
</li>
</ul>
<p>&#x6BCF;&#x4E2A;&#x8F93;&#x51FA;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x51B3;&#x7B56;&#x8FB9;&#x754C;&#x662F;&#x7EBF;&#x6027;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x611F;&#x77E5;&#x673A;&#x4E0D;&#x80FD;&#x5B66;&#x4E60;&#x590D;&#x6742;&#x7684;&#x6A21;&#x5F0F;&#xFF08;&#x5C31;&#x50CF; Logistic &#x56DE;&#x5F52;&#x5206;&#x7C7B;&#x5668;&#xFF09;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5982;&#x679C;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#x662F;&#x7EBF;&#x6027;&#x53EF;&#x5206;&#x79BB;&#x7684;&#xFF0C;Rosenblatt &#x8BC1;&#x660E;&#x8BE5;&#x7B97;&#x6CD5;&#x5C06;&#x6536;&#x655B;&#x5230;&#x4E00;&#x4E2A;&#x89E3;&#x3002;&#x8FD9;&#x88AB;&#x79F0;&#x4E3A;&#x611F;&#x77E5;&#x5668;&#x6536;&#x655B;&#x5B9A;&#x7406;&#x3002;</p>
<p>sklearn &#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x611F;&#x77E5;&#x5668;&#x7C7B;&#xFF0C;&#x5B83;&#x5B9E;&#x73B0;&#x4E86;&#x4E00;&#x4E2A; LTU &#x7F51;&#x7EDC;&#x3002;&#x5B83;&#x53EF;&#x4EE5;&#x50CF;&#x4F60;&#x6240;&#x671F;&#x671B;&#x7684;&#x90A3;&#x6837;&#x4F7F;&#x7528;&#xFF0C;&#x4F8B;&#x5982;&#x5728; iris &#x6570;&#x636E;&#x96C6;&#xFF08;&#x7B2C; 4 &#x7AE0;&#x4E2D;&#x4ECB;&#x7ECD;&#xFF09;&#xFF1A;</p>
<pre><code class="lang-python"><span class="hljs-keyword">import</span> numpy <span class="hljs-keyword">as</span> np 
<span class="hljs-keyword">from</span> sklearn.datasets <span class="hljs-keyword">import</span> load_iris 
<span class="hljs-keyword">from</span> sklearn.linear_model <span class="hljs-keyword">import</span> Perceptron
iris = load_iris() 
X = iris.data[:, (<span class="hljs-number">2</span>, <span class="hljs-number">3</span>)]  <span class="hljs-comment"># &#x82B1;&#x74E3;&#x957F;&#x5EA6;&#xFF0C;&#x5BBD;&#x5EA6; </span>
y = (iris.target == <span class="hljs-number">0</span>).astype(np.int) 
per_clf = Perceptron(random_state=<span class="hljs-number">42</span>) 
per_clf.fit(X, y)
per_clf.predict([[<span class="hljs-number">2</span>, <span class="hljs-number">0.5</span>]])
</code></pre>
<p>&#x60A8;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x8BA4;&#x8BC6;&#x5230;&#xFF0C;&#x611F;&#x77E5;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x7C7B;&#x4F3C;&#x4E8E;&#x968F;&#x673A;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;sklearn &#x7684;&#x611F;&#x77E5;&#x5668;&#x7C7B;&#x76F8;&#x5F53;&#x4E8E;&#x4F7F;&#x7528;&#x5177;&#x6709;&#x4EE5;&#x4E0B;&#x8D85;&#x53C2;&#x6570;&#x7684; SGD &#x5206;&#x7C7B;&#x5668;&#xFF1A;<code>loss=&quot;perceptron&quot;</code>&#xFF0C;<code>learning_rate=&quot;constant&quot;</code>&#xFF08;&#x5B66;&#x4E60;&#x7387;&#xFF09;&#xFF0C;<code>eta0=1</code>&#xFF0C;<code>penalty=None</code>&#xFF08;&#x65E0;&#x6B63;&#x5219;&#x5316;&#xFF09;&#x3002;</p>
<p>&#x6CE8;&#x610F;&#xFF0C;&#x4E0E;&#x903B;&#x8F91;&#x65AF;&#x8482;&#x56DE;&#x5F52;&#x5206;&#x7C7B;&#x5668;&#x76F8;&#x53CD;&#xFF0C;&#x611F;&#x77E5;&#x673A;&#x4E0D;&#x8F93;&#x51FA;&#x7C7B;&#x6982;&#x7387;&#xFF0C;&#x800C;&#x662F;&#x57FA;&#x4E8E;&#x786C;&#x9608;&#x503C;&#x8FDB;&#x884C;&#x9884;&#x6D4B;&#x3002;&#x8FD9;&#x662F;&#x4F60;&#x559C;&#x6B22;&#x903B;&#x8F91;&#x65AF;&#x8482;&#x56DE;&#x5F52;&#x5F88;&#x597D;&#x7684;&#x4E00;&#x4E2A;&#x7406;&#x7531;&#x3002;</p>
<p>&#x5728;&#x4ED6;&#x4EEC;&#x7684; 1969 &#x4E2A;&#x9898;&#x4E3A;&#x201C;&#x611F;&#x77E5;&#x8005;&#x201D;&#x7684;&#x4E13;&#x8457;&#x4E2D;&#xFF0C;Marvin Minsky &#x548C; Seymour Papert &#x5F3A;&#x8C03;&#x4E86;&#x611F;&#x77E5;&#x673A;&#x7684;&#x8BB8;&#x591A;&#x4E25;&#x91CD;&#x7F3A;&#x9677;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5B83;&#x4EEC;&#x4E0D;&#x80FD;&#x89E3;&#x51B3;&#x4E00;&#x4E9B;&#x7410;&#x788E;&#x7684;&#x95EE;&#x9898;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5F02;&#x6216;&#xFF08;XOR&#xFF09;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#xFF09;&#xFF1B;&#x53C2;&#x89C1;&#x56FE; 10-6 &#x7684;&#x5DE6;&#x4FA7;&#xFF09;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x7EBF;&#x6027;&#x5206;&#x7C7B;&#x6A21;&#x578B;&#xFF08;&#x5982; Logistic &#x56DE;&#x5F52;&#x5206;&#x7C7B;&#x5668;&#xFF09;&#x4E5F;&#x90FD;&#x5B9E;&#x73B0;&#x4E0D;&#x4E86;&#xFF0C;&#x4F46;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x671F;&#x671B;&#x4ECE;&#x611F;&#x77E5;&#x5668;&#x4E2D;&#x5F97;&#x5230;&#x66F4;&#x591A;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x5931;&#x671B;&#x662F;&#x5F88;&#x5927;&#x7684;&#xFF1A;&#x56E0;&#x6B64;&#xFF0C;&#x8BB8;&#x591A;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x653E;&#x5F03;&#x4E86;&#x8054;&#x7ED3;&#x4E3B;&#x4E49;&#xFF08;&#x5373;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x7814;&#x7A76;&#xFF09;&#xFF0C;&#x8FD9;&#x6709;&#x5229;&#x4E8E;&#x66F4;&#x9AD8;&#x5C42;&#x6B21;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x903B;&#x8F91;&#x3001;&#x95EE;&#x9898;&#x89E3;&#x51B3;&#x548C;&#x641C;&#x7D22;&#x3002;</p>
<p>&#x7136;&#x800C;&#xFF0C;&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#xFF0C;&#x611F;&#x77E5;&#x5668;&#x7684;&#x4E00;&#x4E9B;&#x5C40;&#x9650;&#x6027;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5806;&#x53E0;&#x591A;&#x4E2A;&#x611F;&#x77E5;&#x5668;&#x6765;&#x6D88;&#x9664;&#x3002;&#x7531;&#x6B64;&#x4EA7;&#x751F;&#x7684;&#x4EBA;&#x5DE5;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x88AB;&#x79F0;&#x4E3A;&#x591A;&#x5C42;&#x611F;&#x77E5;&#x5668;&#xFF08;MLP&#xFF09;&#x3002;&#x7279;&#x522B;&#x5730;&#xFF0C;MLP &#x53EF;&#x4EE5;&#x89E3;&#x51B3; XOR &#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8BA1;&#x7B97;&#x56FE; 10-6 &#x53F3;&#x4FA7;&#x6240;&#x793A;&#x7684; MLP &#x7684;&#x8F93;&#x51FA;&#x6765;&#x9A8C;&#x8BC1;&#x8F93;&#x5165;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x7EC4;&#x5408;&#xFF1A;&#x8F93;&#x5165;<code>(0, 0)</code>&#x6216;<code>(1, 1)</code>&#x7F51;&#x7EDC;&#x8F93;&#x51FA; 0&#xFF0C;&#x5E76;&#x4E14;&#x8F93;&#x5165;<code>(0, 1)</code>&#x6216;<code>(1, 0)</code>&#x5B83;&#x8F93;&#x51FA; 1&#x3002;</p>
<p><img src="../images/chapter_10/10-6.png" alt="&#x56FE;10-6"></p>
<h2 id="&#x591A;&#x5C42;&#x611F;&#x77E5;&#x5668;&#x4E0E;&#x53CD;&#x5411;&#x4F20;&#x64AD;">&#x591A;&#x5C42;&#x611F;&#x77E5;&#x5668;&#x4E0E;&#x53CD;&#x5411;&#x4F20;&#x64AD;</h2>
<p>MLP &#x7531;&#x4E00;&#x4E2A;&#xFF08;&#x901A;&#x8FC7;&#xFF09;&#x8F93;&#x5165;&#x5C42;&#x3001;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x79F0;&#x4E3A;&#x9690;&#x85CF;&#x5C42;&#x7684; LTU &#x7EC4;&#x6210;&#xFF0C;&#x4E00;&#x4E2A;&#x6700;&#x7EC8;&#x5C42; LTU &#x79F0;&#x4E3A;&#x8F93;&#x51FA;&#x5C42;&#xFF08;&#x89C1;&#x56FE; 10-7&#xFF09;&#x3002;&#x9664;&#x4E86;&#x8F93;&#x51FA;&#x5C42;&#x4E4B;&#x5916;&#x7684;&#x6BCF;&#x4E00;&#x5C42;&#x5305;&#x62EC;&#x504F;&#x7F6E;&#x795E;&#x7ECF;&#x5143;&#xFF0C;&#x5E76;&#x4E14;&#x5168;&#x8FDE;&#x63A5;&#x5230;&#x4E0B;&#x4E00;&#x5C42;&#x3002;&#x5F53;&#x4EBA;&#x5DE5;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6709;&#x4E24;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x9690;&#x542B;&#x5C42;&#x65F6;&#xFF0C;&#x79F0;&#x4E3A;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF08;DNN&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_10/10-7.png" alt="&#x56FE;10-7"></p>
<p>&#x591A;&#x5E74;&#x6765;&#xFF0C;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x52AA;&#x529B;&#x5BFB;&#x627E;&#x4E00;&#x79CD;&#x8BAD;&#x7EC3; MLP &#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x6CA1;&#x6709;&#x6210;&#x529F;&#x3002;&#x4F46;&#x5728; 1986&#xFF0C;D. E. Rumelhart &#x7B49;&#x4EBA;&#x63D0;&#x51FA;&#x4E86;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x8BAD;&#x7EC3;&#x7B97;&#x6CD5;&#x3002;&#x7B2C; 9 &#x7AE0;&#x6211;&#x4EEC;&#x5C06;&#x5176;&#x63CF;&#x8FF0;&#x4E3A;&#x4F7F;&#x7528;&#x53CD;&#x5411;&#x81EA;&#x52A8;&#x5FAE;&#x5206;&#x7684;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#xFF08;&#x7B2C; 4 &#x7AE0;&#x8BA8;&#x8BBA;&#x4E86;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#xFF0C;&#x7B2C; 9 &#x7AE0;&#x8BA8;&#x8BBA;&#x4E86;&#x81EA;&#x52A8;&#x5FAE;&#x5206;&#xFF09;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#xFF0C;&#x7B97;&#x6CD5;&#x5C06;&#x5176;&#x9988;&#x9001;&#x5230;&#x7F51;&#x7EDC;&#x5E76;&#x8BA1;&#x7B97;&#x6BCF;&#x4E2A;&#x8FDE;&#x7EED;&#x5C42;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x8F93;&#x51FA;&#xFF08;&#x8FD9;&#x662F;&#x5411;&#x524D;&#x4F20;&#x9012;&#xFF0C;&#x5C31;&#x50CF;&#x5728;&#x8FDB;&#x884C;&#x9884;&#x6D4B;&#x65F6;&#x4E00;&#x6837;&#xFF09;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x5B83;&#x6D4B;&#x91CF;&#x7F51;&#x7EDC;&#x7684;&#x8F93;&#x51FA;&#x8BEF;&#x5DEE;&#xFF08;&#x5373;&#xFF0C;&#x671F;&#x671B;&#x8F93;&#x51FA;&#x548C;&#x7F51;&#x7EDC;&#x5B9E;&#x9645;&#x8F93;&#x51FA;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x503C;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x8BA1;&#x7B97;&#x6700;&#x540E;&#x9690;&#x85CF;&#x5C42;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x5BF9;&#x6BCF;&#x4E2A;&#x8F93;&#x51FA;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x8BEF;&#x5DEE;&#x8D21;&#x732E;&#x591A;&#x5C11;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x7EE7;&#x7EED;&#x6D4B;&#x91CF;&#x8FD9;&#x4E9B;&#x8BEF;&#x5DEE;&#x8D21;&#x732E;&#x6709;&#x591A;&#x5C11;&#x6765;&#x81EA;&#x5148;&#x524D;&#x9690;&#x85CF;&#x5C42;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x7B49;&#x7B49;&#xFF0C;&#x76F4;&#x5230;&#x7B97;&#x6CD5;&#x5230;&#x8FBE;&#x8F93;&#x5165;&#x5C42;&#x3002;&#x8BE5;&#x53CD;&#x5411;&#x901A;&#x8FC7;&#x6709;&#x6548;&#x5730;&#x6D4B;&#x91CF;&#x7F51;&#x7EDC;&#x4E2D;&#x6240;&#x6709;&#x8FDE;&#x63A5;&#x6743;&#x91CD;&#x7684;&#x8BEF;&#x5DEE;&#x68AF;&#x5EA6;&#xFF0C;&#x901A;&#x8FC7;&#x5728;&#x7F51;&#x7EDC;&#x4E2D;&#x5411;&#x540E;&#x4F20;&#x64AD;&#x8BEF;&#x5DEE;&#x68AF;&#x5EA6;&#xFF08;&#x4E5F;&#x662F;&#x8BE5;&#x7B97;&#x6CD5;&#x7684;&#x540D;&#x79F0;&#xFF09;&#x3002;&#x5982;&#x679C;&#x4F60;&#x67E5;&#x770B;&#x4E00;&#x4E0B;&#x9644;&#x5F55; D &#x4E2D;&#x7684;&#x53CD;&#x5411;&#x81EA;&#x52A8;&#x5FAE;&#x5206;&#x7B97;&#x6CD5;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x7684;&#x6B63;&#x5411;&#x548C;&#x53CD;&#x5411;&#x901A;&#x8FC7;&#x7B80;&#x5355;&#x5730;&#x6267;&#x884C;&#x53CD;&#x5411;&#x81EA;&#x52A8;&#x5FAE;&#x5206;&#x3002;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x7B97;&#x6CD5;&#x7684;&#x6700;&#x540E;&#x4E00;&#x6B65;&#x662F;&#x4F7F;&#x7528;&#x8F83;&#x65E9;&#x6D4B;&#x91CF;&#x7684;&#x8BEF;&#x5DEE;&#x68AF;&#x5EA6;&#x5BF9;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x8FDE;&#x63A5;&#x6743;&#x503C;&#x8FDB;&#x884C;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x6B65;&#x9AA4;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x66F4;&#x7B80;&#x77ED;&#x4E00;&#x4E9B;&#xFF1A;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#xFF0C;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x7B97;&#x6CD5;&#x9996;&#x5148;&#x8FDB;&#x884C;&#x9884;&#x6D4B;&#xFF08;&#x524D;&#x5411;&#xFF09;&#xFF0C;&#x6D4B;&#x91CF;&#x8BEF;&#x5DEE;&#xFF0C;&#x7136;&#x540E;&#x53CD;&#x5411;&#x904D;&#x5386;&#x6BCF;&#x4E2A;&#x5C42;&#x6765;&#x6D4B;&#x91CF;&#x6BCF;&#x4E2A;&#x8FDE;&#x63A5;&#xFF08;&#x53CD;&#x5411;&#x4F20;&#x9012;&#xFF09;&#x7684;&#x8BEF;&#x5DEE;&#x8D21;&#x732E;&#xFF0C;&#x6700;&#x540E;&#x7A0D;&#x5FAE;&#x8C03;&#x6574;&#x8FDE;&#x63A5;&#x5668;&#x6743;&#x503C;&#x4EE5;&#x51CF;&#x5C11;&#x8BEF;&#x5DEE;&#xFF08;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x6B65;&#x957F;&#xFF09;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7B97;&#x6CD5;&#x80FD;&#x591F;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#xFF0C;&#x4F5C;&#x8005;&#x5BF9; MLP &#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x8FDB;&#x884C;&#x4E86;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x6027;&#x7684;&#x6539;&#x53D8;&#xFF1A;&#x7528; Logistic &#x51FD;&#x6570;&#x4EE3;&#x66FF;&#x4E86;&#x9636;&#x8DC3;&#x51FD;&#x6570;&#xFF0C;<code>&#x3C3;(z) = 1 / (1 + exp(&#x2013;z))</code>&#x3002;&#x8FD9;&#x662F;&#x5FC5;&#x8981;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x9636;&#x8DC3;&#x51FD;&#x6570;&#x53EA;&#x5305;&#x542B;&#x5E73;&#x5766;&#x7684;&#x6BB5;&#xFF0C;&#x56E0;&#x6B64;&#x6CA1;&#x6709;&#x68AF;&#x5EA6;&#x6765;&#x5DE5;&#x4F5C;&#xFF08;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x4E0D;&#x80FD;&#x5728;&#x5E73;&#x9762;&#x4E0A;&#x79FB;&#x52A8;&#xFF09;&#xFF0C;&#x800C; Logistic &#x51FD;&#x6570;&#x5230;&#x5904;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x5B9A;&#x4E49;&#x826F;&#x597D;&#x7684;&#x975E;&#x96F6;&#x5BFC;&#x6570;&#xFF0C;&#x5141;&#x8BB8;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x5728;&#x6BCF;&#x4E2A;&#x6B65;&#x4E0A;&#x53D6;&#x5F97;&#x4E00;&#x4E9B;&#x8FDB;&#x5C55;&#x3002;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x7B97;&#x6CD5;&#x53EF;&#x4EE5;&#x4E0E;&#x5176;&#x4ED6;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#xFF0C;&#x800C;&#x4E0D;&#x662F; Logistic &#x51FD;&#x6570;&#x3002;&#x53E6;&#x5916;&#x4E24;&#x4E2A;&#x6D41;&#x884C;&#x7684;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x662F;&#xFF1A;</p>
<ul>
<li><p>&#x53CC;&#x66F2;&#x6B63;&#x5207;&#x51FD;&#x6570; <code>tanh (z) = 2&#x3C3;(2z) &#x2013; 1</code></p>
<ul>
<li>&#x5C31;&#x50CF; Logistic &#x51FD;&#x6570;&#xFF0C;&#x5B83;&#x662F; S &#x5F62;&#x7684;&#x3001;&#x8FDE;&#x7EED;&#x7684;&#x3001;&#x53EF;&#x5FAE;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x7684;&#x8F93;&#x51FA;&#x503C;&#x8303;&#x56F4;&#x4ECE;-1&#x5230;1&#xFF08;&#x4E0D;&#x662F;&#x5728; Logistic &#x51FD;&#x6570;&#x7684; 0 &#x5230; 1&#xFF09;&#xFF0C;&#x8FD9;&#x5F80;&#x5F80;&#x4F7F;&#x6BCF;&#x4E2A;&#x5C42;&#x7684;&#x8F93;&#x51FA;&#x5728;&#x8BAD;&#x7EC3;&#x5F00;&#x59CB;&#x65F6;&#x6216;&#x591A;&#x6216;&#x5C11;&#x90FD;&#x6B63;&#x5219;&#x5316;&#x4E86;&#xFF08;&#x5373;&#x4EE5; 0 &#x4E3A;&#x4E2D;&#x5FC3;&#xFF09;&#x3002;&#x8FD9;&#x5E38;&#x5E38;&#x6709;&#x52A9;&#x4E8E;&#x52A0;&#x5FEB;&#x6536;&#x655B;&#x901F;&#x5EA6;&#x3002;</li>
</ul>
</li>
<li><p>Relu &#x51FD;&#x6570;&#xFF08;&#x5728;&#x7B2C; 9 &#x7AE0;&#x4E2D;&#x4ECB;&#x7ECD;&#xFF09;</p>
<ul>
<li><code>ReLU (z) = max (0, z)</code>&#x3002;&#x5B83;&#x662F;&#x8FDE;&#x7EED;&#x7684;&#xFF0C;&#x4F46;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#x5728;<code>z=0</code>&#x65F6;&#x4E0D;&#x53EF;&#x5FAE;&#xFF08;&#x659C;&#x7387;&#x7A81;&#x7136;&#x6539;&#x53D8;&#xFF0C;&#x8FD9;&#x53EF;&#x4EE5;&#x4F7F;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x53CD;&#x5F39;&#xFF09;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x5B83;&#x5DE5;&#x4F5C;&#x5F97;&#x5F88;&#x597D;&#xFF0C;&#x5E76;&#x4E14;&#x5177;&#x6709;&#x5FEB;&#x901F;&#x8BA1;&#x7B97;&#x7684;&#x4F18;&#x70B9;&#x3002;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x5B83;&#x6CA1;&#x6709;&#x6700;&#x5927;&#x8F93;&#x51FA;&#x503C;&#x7684;&#x4E8B;&#x5B9E;&#x4E5F;&#x6709;&#x52A9;&#x4E8E;&#x51CF;&#x5C11;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x671F;&#x95F4;&#x7684;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#xFF08;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x7B2C; 11 &#x7AE0;&#x4E2D;&#x56DE;&#x987E;&#x8FD9;&#x4E00;&#x70B9;&#xFF09;&#x3002;</li>
</ul>
</li>
</ul>
<p>&#x8FD9;&#x4E9B;&#x6D41;&#x884C;&#x7684;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x53CA;&#x5176;&#x884D;&#x751F;&#x7269;&#x5982;&#x56FE; 10-8 &#x6240;&#x793A;&#x3002;</p>
<p><img src="../images/chapter_10/10-8.png" alt="&#x56FE;10-8"></p>
<p>MLP &#x901A;&#x5E38;&#x7528;&#x4E8E;&#x5206;&#x7C7B;&#xFF0C;&#x6BCF;&#x4E2A;&#x8F93;&#x51FA;&#x5BF9;&#x5E94;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x7C7B;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5783;&#x573E;&#x90AE;&#x4EF6;/&#x6B63;&#x5E38;&#x90AE;&#x4EF6;&#xFF0C;&#x7D27;&#x6025;/&#x975E;&#x7D27;&#x6025;&#xFF0C;&#x7B49;&#x7B49;&#xFF09;&#x3002;&#x5F53;&#x7C7B;&#x662F;&#x591A;&#x7C7B;&#x7684;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;0 &#x5230; 9 &#x7684;&#x6570;&#x5B57;&#x56FE;&#x50CF;&#x5206;&#x7C7B;&#xFF09;&#x65F6;&#xFF0C;&#x8F93;&#x51FA;&#x5C42;&#x901A;&#x5E38;&#x901A;&#x8FC7;&#x7528;&#x5171;&#x4EAB;&#x7684; softmax &#x51FD;&#x6570;&#x66FF;&#x6362;&#x5355;&#x72EC;&#x7684;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x6765;&#x4FEE;&#x6539;&#xFF08;&#x89C1;&#x56FE; 10-9&#xFF09;&#x3002;&#x7B2C; 4 &#x7AE0;&#x4ECB;&#x7ECD;&#x4E86; softmax &#x51FD;&#x6570;&#x3002;&#x6BCF;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x8F93;&#x51FA;&#x5BF9;&#x5E94;&#x4E8E;&#x76F8;&#x5E94;&#x7C7B;&#x7684;&#x4F30;&#x8BA1;&#x6982;&#x7387;&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x4FE1;&#x53F7;&#x53EA;&#x5728;&#x4E00;&#x4E2A;&#x65B9;&#x5411;&#x4E0A;&#x6D41;&#x52A8;&#xFF08;&#x4ECE;&#x8F93;&#x5165;&#x5230;&#x8F93;&#x51FA;&#xFF09;&#xFF0C;&#x56E0;&#x6B64;&#x8FD9;&#x79CD;&#x7ED3;&#x6784;&#x662F;&#x524D;&#x9988;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF08;FNN&#xFF09;&#x7684;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x3002;</p>
<p><img src="../images/chapter_10/10-9.png" alt="&#x56FE;10-9"></p>
<p>&#x751F;&#x7269;&#x795E;&#x7ECF;&#x5143;&#x4F3C;&#x4E4E;&#x662F;&#x7528; sigmoid&#xFF08;S &#x578B;&#xFF09;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x6D3B;&#x52A8;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x5728;&#x5F88;&#x957F;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#x575A;&#x6301; sigmoid &#x51FD;&#x6570;&#x3002;&#x4F46;&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#xFF0C;Relu &#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x901A;&#x5E38;&#x5728; ANN &#x5DE5;&#x4F5C;&#x5F97;&#x66F4;&#x597D;&#x3002;&#x8FD9;&#x662F;&#x751F;&#x7269;&#x7814;&#x7A76;&#x8BEF;&#x5BFC;&#x7684;&#x4F8B;&#x5B50;&#x4E4B;&#x4E00;&#x3002;</p>
<h2 id="&#x7528;-tensorflow-&#x9AD8;&#x7EA7;-api-&#x8BAD;&#x7EC3;-mlp">&#x7528; TensorFlow &#x9AD8;&#x7EA7; API &#x8BAD;&#x7EC3; MLP</h2>
<p>&#x4E0E; TensorFlow &#x4E00;&#x8D77;&#x8BAD;&#x7EC3; MLP &#x6700;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x4F7F;&#x7528;&#x9AD8;&#x7EA7; API TF.Learn&#xFF0C;&#x8FD9;&#x4E0E; sklearn &#x7684; API &#x975E;&#x5E38;&#x76F8;&#x4F3C;&#x3002;<code>DNNClassifier</code>&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x8BAD;&#x7EC3;&#x5177;&#x6709;&#x4EFB;&#x610F;&#x6570;&#x91CF;&#x9690;&#x5C42;&#x7684;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x800C; softmax &#x8F93;&#x51FA;&#x5C42;&#x8F93;&#x51FA;&#x4F30;&#x8BA1;&#x7684;&#x7C7B;&#x6982;&#x7387;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x8BAD;&#x7EC3;&#x4E24;&#x4E2A;&#x9690;&#x85CF;&#x5C42;&#x7684; DNN&#xFF08;&#x4E00;&#x4E2A;&#x5177;&#x6709; 300 &#x4E2A;&#x795E;&#x7ECF;&#x5143;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x5177;&#x6709; 100 &#x4E2A;&#x795E;&#x7ECF;&#x5143;&#xFF09;&#x548C;&#x4E00;&#x4E2A;&#x5177;&#x6709; 10 &#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x7684; SOFTMax &#x8F93;&#x51FA;&#x5C42;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#xFF1A;</p>
<pre><code class="lang-python"><span class="hljs-keyword">import</span> tensorflow <span class="hljs-keyword">as</span> tf
feature_columns = tf.contrib.learn.infer_real_valued_columns_from_input(X) 
dnn_clf = tf.contrib.learn.DNNClassifier(hidden_units=[<span class="hljs-number">300</span>, <span class="hljs-number">100</span>], n_classes=<span class="hljs-number">10</span>,
                                         feature_columns=feature_columns) 
dnn_clf.fit(x=X, y=y, batch_size=<span class="hljs-number">50</span>, steps=<span class="hljs-number">40000</span>)
</code></pre>
<p>&#x5982;&#x679C;&#x4F60;&#x5728; MNIST &#x6570;&#x636E;&#x96C6;&#x4E0A;&#x8FD0;&#x884C;&#x8FD9;&#x4E2A;&#x4EE3;&#x7801;&#xFF08;&#x5728;&#x7F29;&#x653E;&#x5B83;&#x4E4B;&#x540E;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x901A;&#x8FC7;&#x4F7F;&#x7528; skLearn &#x7684;<code>StandardScaler</code>&#xFF09;&#xFF0C;&#x4F60;&#x5B9E;&#x9645;&#x4E0A;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x5728;&#x6D4B;&#x8BD5;&#x96C6;&#x4E0A;&#x8FBE;&#x5230; 98.1% &#x4EE5;&#x4E0A;&#x7CBE;&#x5EA6;&#x7684;&#x6A21;&#x578B;&#xFF01;&#x8FD9;&#x6BD4;&#x6211;&#x4EEC;&#x5728;&#x7B2C; 3 &#x7AE0;&#x4E2D;&#x8BAD;&#x7EC3;&#x7684;&#x6700;&#x597D;&#x7684;&#x6A21;&#x578B;&#x90FD;&#x8981;&#x597D;&#xFF1A;</p>
<pre><code class="lang-python"><span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-keyword">from</span> sklearn.metrics <span class="hljs-keyword">import</span> accuracy_score 
<span class="hljs-meta">&gt;&gt;&gt; </span>y_pred = list(dnn_clf.predict(X_test)) 
<span class="hljs-meta">&gt;&gt;&gt; </span>accuracy_score(y_test, y_pred) 
<span class="hljs-number">0.98180000000000001</span>
</code></pre>
<p>TF.Learn &#x5B66;&#x4E60;&#x5E93;&#x4E5F;&#x4E3A;&#x8BC4;&#x4F30;&#x6A21;&#x578B;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E9B;&#x65B9;&#x4FBF;&#x7684;&#x529F;&#x80FD;&#xFF1A;</p>
<pre><code class="lang-python"><span class="hljs-meta">&gt;&gt;&gt; </span>dnn_clf.evaluate(X_test, y_test) 
{<span class="hljs-string">&apos;accuracy&apos;</span>: <span class="hljs-number">0.98180002</span>, <span class="hljs-string">&apos;global_step&apos;</span>: <span class="hljs-number">40000</span>, <span class="hljs-string">&apos;loss&apos;</span>: <span class="hljs-number">0.073678359</span>}
</code></pre>
<p><code>DNNClassifier</code>&#x57FA;&#x4E8E; Relu &#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x521B;&#x5EFA;&#x6240;&#x6709;&#x795E;&#x7ECF;&#x5143;&#x5C42;&#xFF08;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8BBE;&#x7F6E;&#x8D85;&#x53C2;&#x6570;<code>activation_fn</code>&#x6765;&#x6539;&#x53D8;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF09;&#x3002;&#x8F93;&#x51FA;&#x5C42;&#x57FA;&#x4E8E; SoftMax &#x51FD;&#x6570;&#xFF0C;&#x635F;&#x5931;&#x51FD;&#x6570;&#x662F;&#x4EA4;&#x53C9;&#x71B5;&#xFF08;&#x5728;&#x7B2C; 4 &#x7AE0;&#x4E2D;&#x4ECB;&#x7ECD;&#xFF09;&#x3002;</p>
<p>TF.EXCEL API &#x4ECD;&#x7136;&#x662F;&#x66F4;&#x65B0;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x8FD9;&#x4E9B;&#x4F8B;&#x5B50;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x4E00;&#x4E9B;&#x540D;&#x79F0;&#x548C;&#x51FD;&#x6570;&#x53EF;&#x80FD;&#x4F1A;&#x5728;&#x4F60;&#x8BFB;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x65F6;&#x5019;&#x53D1;&#x751F;&#x4E00;&#x4E9B;&#x53D8;&#x5316;&#x3002;&#x4F46;&#x603B;&#x7684;&#x601D;&#x60F3;&#x662F;&#x4E0D;&#x53D8;&#x3002;</p>
<h2 id="&#x4F7F;&#x7528;&#x666E;&#x901A;-tensorflow-&#x8BAD;&#x7EC3;-dnn">&#x4F7F;&#x7528;&#x666E;&#x901A; TensorFlow &#x8BAD;&#x7EC3; DNN</h2>
<p>&#x5982;&#x679C;&#x60A8;&#x60F3;&#x8981;&#x66F4;&#x597D;&#x5730;&#x63A7;&#x5236;&#x7F51;&#x7EDC;&#x67B6;&#x6784;&#xFF0C;&#x60A8;&#x53EF;&#x80FD;&#x66F4;&#x559C;&#x6B22;&#x4F7F;&#x7528; TensorFlow &#x7684;&#x8F83;&#x4F4E;&#x7EA7;&#x522B;&#x7684; Python API&#xFF08;&#x5728;&#x7B2C; 9 &#x7AE0;&#x4E2D;&#x4ECB;&#x7ECD;&#xFF09;&#x3002; &#x5728;&#x672C;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F7F;&#x7528;&#x4E0E;&#x4E4B;&#x524D;&#x7684; API &#x76F8;&#x540C;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5B9E;&#x65BD; Minibatch &#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x6765;&#x5728; MNIST &#x6570;&#x636E;&#x96C6;&#x4E0A;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#x3002; &#x7B2C;&#x4E00;&#x6B65;&#x662F;&#x5EFA;&#x8BBE;&#x9636;&#x6BB5;&#xFF0C;&#x6784;&#x5EFA; TensorFlow &#x56FE;&#x3002; &#x7B2C;&#x4E8C;&#x6B65;&#x662F;&#x6267;&#x884C;&#x9636;&#x6BB5;&#xFF0C;&#x60A8;&#x5B9E;&#x9645;&#x8FD0;&#x884C;&#x8BA1;&#x7B97;&#x56FE;&#x8C31;&#x6765;&#x8BAD;&#x7EC3;&#x6A21;&#x578B;&#x3002;</p>
<h2 id="&#x6784;&#x9020;&#x9636;&#x6BB5;">&#x6784;&#x9020;&#x9636;&#x6BB5;</h2>
<p>&#x5F00;&#x59CB;&#x5427;&#x3002; &#x9996;&#x5148;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5BFC;&#x5165;<code>tensorflow</code>&#x5E93;&#x3002; &#x7136;&#x540E;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x6307;&#x5B9A;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x5E76;&#x8BBE;&#x7F6E;&#x6BCF;&#x4E2A;&#x5C42;&#x4E2D;&#x9690;&#x85CF;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x6570;&#x91CF;&#xFF1A;</p>
<pre><code class="lang-python"><span class="hljs-keyword">import</span> tensorflow <span class="hljs-keyword">as</span> tf
n_inputs = <span class="hljs-number">28</span>*<span class="hljs-number">28</span> <span class="hljs-comment"># MNIST</span>
n_hidden1 = <span class="hljs-number">300</span>
n_hidden2 = <span class="hljs-number">100</span>
n_outputs = <span class="hljs-number">10</span>
</code></pre>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x4E0E;&#x7B2C; 9 &#x7AE0;&#x4E00;&#x6837;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5360;&#x4F4D;&#x7B26;&#x8282;&#x70B9;&#x6765;&#x8868;&#x793A;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x548C;&#x76EE;&#x6807;&#x3002;<code>X</code>&#x7684;&#x5F62;&#x72B6;&#x4EC5;&#x6709;&#x90E8;&#x5206;&#x88AB;&#x5B9A;&#x4E49;&#x3002; &#x6211;&#x4EEC;&#x77E5;&#x9053;&#x5B83;&#x5C06;&#x662F;&#x4E00;&#x4E2A; 2D &#x5F20;&#x91CF;&#xFF08;&#x5373;&#x4E00;&#x4E2A;&#x77E9;&#x9635;&#xFF09;&#xFF0C;&#x6CBF;&#x7740;&#x7B2C;&#x4E00;&#x4E2A;&#x7EF4;&#x5EA6;&#x7684;&#x5B9E;&#x4F8B;&#x548C;&#x7B2C;&#x4E8C;&#x4E2A;&#x7EF4;&#x5EA6;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x7279;&#x5F81;&#x7684;&#x6570;&#x91CF;&#x5C06;&#x662F;<code>28&#xD7;28</code>&#xFF08;&#x6BCF;&#x50CF;&#x7D20;&#x4E00;&#x4E2A;&#x7279;&#x5F81;&#xFF09; &#x4F46;&#x662F;&#x6211;&#x4EEC;&#x4E0D;&#x77E5;&#x9053;&#x6BCF;&#x4E2A;&#x8BAD;&#x7EC3;&#x6279;&#x6B21;&#x5C06;&#x5305;&#x542B;&#x591A;&#x5C11;&#x4E2A;&#x5B9E;&#x4F8B;&#x3002; &#x6240;&#x4EE5;<code>X</code>&#x7684;&#x5F62;&#x72B6;&#x662F;<code>(None, n_inputs)</code>&#x3002; &#x540C;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x77E5;&#x9053;<code>y</code>&#x5C06;&#x662F;&#x4E00;&#x4E2A; 1D &#x5F20;&#x91CF;&#xFF0C;&#x6BCF;&#x4E2A;&#x5B9E;&#x4F8B;&#x6709;&#x4E00;&#x4E2A;&#x5165;&#x53E3;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x518D;&#x6B21;&#x4E0D;&#x77E5;&#x9053;&#x5728;&#x8FD9;&#x4E00;&#x70B9;&#x4E0A;&#x8BAD;&#x7EC3;&#x6279;&#x6B21;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x6240;&#x4EE5;&#x5F62;&#x72B6;<code>(None)</code>&#x3002;</p>
<pre><code class="lang-python">X = tf.placeholder(tf.float32, shape=(<span class="hljs-keyword">None</span>, n_inputs), name=<span class="hljs-string">&quot;X&quot;</span>)
y = tf.placeholder(tf.int64, shape=(<span class="hljs-keyword">None</span>), name=<span class="hljs-string">&quot;y&quot;</span>)
</code></pre>
<p>&#x73B0;&#x5728;&#x8BA9;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5B9E;&#x9645;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002; &#x5360;&#x4F4D;&#x7B26;<code>X</code>&#x5C06;&#x4F5C;&#x4E3A;&#x8F93;&#x5165;&#x5C42;; &#x5728;&#x6267;&#x884C;&#x9636;&#x6BB5;&#xFF0C;&#x5B83;&#x5C06;&#x4E00;&#x6B21;&#x66F4;&#x6362;&#x4E00;&#x4E2A;&#x8BAD;&#x7EC3;&#x6279;&#x6B21;&#xFF08;&#x6CE8;&#x610F;&#x8BAD;&#x7EC3;&#x6279;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x5B9E;&#x4F8B;&#x5C06;&#x7531;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x540C;&#x65F6;&#x5904;&#x7406;&#xFF09;&#x3002; &#x73B0;&#x5728;&#x60A8;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x4E24;&#x4E2A;&#x9690;&#x85CF;&#x5C42;&#x548C;&#x8F93;&#x51FA;&#x5C42;&#x3002; &#x4E24;&#x4E2A;&#x9690;&#x85CF;&#x7684;&#x5C42;&#x51E0;&#x4E4E;&#x76F8;&#x540C;&#xFF1A;&#x5B83;&#x4EEC;&#x53EA;&#x662F;&#x5B83;&#x4EEC;&#x6240;&#x8FDE;&#x63A5;&#x7684;&#x8F93;&#x5165;&#x548C;&#x5B83;&#x4EEC;&#x5305;&#x542B;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x6570;&#x91CF;&#x4E0D;&#x540C;&#x3002; &#x8F93;&#x51FA;&#x5C42;&#x4E5F;&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#xFF0C;&#x4F46;&#x5B83;&#x4F7F;&#x7528; softmax &#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x800C;&#x4E0D;&#x662F; ReLU &#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x3002; &#x6240;&#x4EE5;&#x8BA9;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;<code>neuron_layer()</code>&#x51FD;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4E00;&#x6B21;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x56FE;&#x5C42;&#x3002; &#x5B83;&#x5C06;&#x9700;&#x8981;&#x53C2;&#x6570;&#x6765;&#x6307;&#x5B9A;&#x8F93;&#x5165;&#xFF0C;&#x795E;&#x7ECF;&#x5143;&#x6570;&#x91CF;&#xFF0C;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x548C;&#x56FE;&#x5C42;&#x7684;&#x540D;&#x79F0;&#xFF1A;</p>
<pre><code class="lang-python"><span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">neuron_layer</span><span class="hljs-params">(X, n_neurons, name, activation=None)</span>:</span>
    <span class="hljs-keyword">with</span> tf.name_scope(name):
        n_inputs = int(X.get_shape()[<span class="hljs-number">1</span>])
        stddev = <span class="hljs-number">2</span> / np.sqrt(n_inputs)
        init = tf.truncated_normal((n_inputs, n_neurons), stddev=stddev)
        W = tf.Variable(init, name=<span class="hljs-string">&quot;weights&quot;</span>)
        b = tf.Variable(tf.zeros([n_neurons]), name=<span class="hljs-string">&quot;biases&quot;</span>)
        z = tf.matmul(X, W) + b
        <span class="hljs-keyword">if</span> activation == <span class="hljs-string">&quot;relu&quot;</span>:
            <span class="hljs-keyword">return</span> tf.nn.relu(z)
        <span class="hljs-keyword">else</span>:
            <span class="hljs-keyword">return</span> z
</code></pre>
<p>&#x6211;&#x4EEC;&#x9010;&#x884C;&#x6D4F;&#x89C8;&#x8FD9;&#x4E2A;&#x4EE3;&#x7801;&#xFF1A;</p>
<ol>
<li><p>&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x540D;&#x79F0;&#x8303;&#x56F4;&#x6765;&#x521B;&#x5EFA;&#x6BCF;&#x5C42;&#x7684;&#x540D;&#x79F0;&#xFF1A;&#x5B83;&#x5C06;&#x5305;&#x542B;&#x8BE5;&#x795E;&#x7ECF;&#x5143;&#x5C42;&#x7684;&#x6240;&#x6709;&#x8BA1;&#x7B97;&#x8282;&#x70B9;&#x3002; &#x8FD9;&#x662F;&#x53EF;&#x9009;&#x7684;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x8282;&#x70B9;&#x7EC4;&#x7EC7;&#x826F;&#x597D;&#xFF0C;&#x5219; TensorBoard &#x56FE;&#x5F62;&#x5C06;&#x4F1A;&#x66F4;&#x52A0;&#x51FA;&#x8272;&#x3002;</p>
</li>
<li><p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x67E5;&#x627E;&#x8F93;&#x5165;&#x77E9;&#x9635;&#x7684;&#x5F62;&#x72B6;&#x5E76;&#x83B7;&#x5F97;&#x7B2C;&#x4E8C;&#x4E2A;&#x7EF4;&#x5EA6;&#x7684;&#x5927;&#x5C0F;&#x6765;&#x83B7;&#x5F97;&#x8F93;&#x5165;&#x6570;&#x91CF;&#xFF08;&#x7B2C;&#x4E00;&#x4E2A;&#x7EF4;&#x5EA6;&#x7528;&#x4E8E;&#x5B9E;&#x4F8B;&#xFF09;&#x3002;</p>
</li>
<li><p>&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x4E09;&#x884C;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x4FDD;&#x5B58;&#x6743;&#x91CD;&#x77E9;&#x9635;&#x7684;<code>W</code>&#x53D8;&#x91CF;&#x3002; &#x5B83;&#x5C06;&#x662F;&#x5305;&#x542B;&#x6BCF;&#x4E2A;&#x8F93;&#x5165;&#x548C;&#x6BCF;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x4E4B;&#x95F4;&#x7684;&#x6240;&#x6709;&#x8FDE;&#x63A5;&#x6743;&#x91CD;&#x7684;2D&#x5F20;&#x91CF;&#xFF1B;&#x56E0;&#x6B64;&#xFF0C;&#x5B83;&#x7684;&#x5F62;&#x72B6;&#x5C06;&#x662F;<code>(n_inputs, n_neurons)</code>&#x3002;&#x5B83;&#x5C06;&#x88AB;&#x968F;&#x673A;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x4F7F;&#x7528;&#x5177;&#x6709;&#x6807;&#x51C6;&#x5DEE;&#x4E3A;<code>2/&#x221A;n</code>&#x7684;&#x622A;&#x65AD;&#x7684;&#x6B63;&#x6001;&#xFF08;&#x9AD8;&#x65AF;&#xFF09;&#x5206;&#x5E03;(&#x4F7F;&#x7528;&#x622A;&#x65AD;&#x7684;&#x6B63;&#x6001;&#x5206;&#x5E03;&#x800C;&#x4E0D;&#x662F;&#x5E38;&#x89C4;&#x6B63;&#x6001;&#x5206;&#x5E03;&#x786E;&#x4FDD;&#x4E0D;&#x4F1A;&#x6709;&#x4EFB;&#x4F55;&#x5927;&#x7684;&#x6743;&#x91CD;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x4F1A;&#x51CF;&#x6162;&#x8BAD;&#x7EC3;&#x3002;).&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x6807;&#x51C6;&#x5DEE;&#x6709;&#x52A9;&#x4E8E;&#x7B97;&#x6CD5;&#x7684;&#x6536;&#x655B;&#x901F;&#x5EA6;&#x66F4;&#x5FEB;&#xFF08;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x7B2C;11&#x7AE0;&#x4E2D;&#x8FDB;&#x4E00;&#x6B65;&#x8BA8;&#x8BBA;&#x8FD9;&#x4E00;&#x70B9;&#xFF09;&#xFF0C;&#x8FD9;&#x662F;&#x5BF9;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x5FAE;&#x5C0F;&#x8C03;&#x6574;&#x4E4B;&#x4E00;&#xFF0C;&#x5BF9;&#x5B83;&#x4EEC;&#x7684;&#x6548;&#x7387;&#x4EA7;&#x751F;&#x4E86;&#x5DE8;&#x5927;&#x7684;&#x5F71;&#x54CD;&#xFF09;&#x3002; &#x91CD;&#x8981;&#x7684;&#x662F;&#x4E3A;&#x6240;&#x6709;&#x9690;&#x85CF;&#x5C42;&#x968F;&#x673A;&#x521D;&#x59CB;&#x5316;&#x8FDE;&#x63A5;&#x6743;&#x91CD;&#xFF0C;&#x4EE5;&#x907F;&#x514D;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7B97;&#x6CD5;&#x65E0;&#x6CD5;&#x4E2D;&#x65AD;&#x7684;&#x4EFB;&#x4F55;&#x5BF9;&#x79F0;&#x6027;&#x3002;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x5C06;&#x6240;&#x6709;&#x6743;&#x91CD;&#x8BBE;&#x7F6E;&#x4E3A; 0&#xFF0C;&#x5219;&#x6240;&#x6709;&#x795E;&#x7ECF;&#x5143;&#x5C06;&#x8F93;&#x51FA; 0&#xFF0C;&#x5E76;&#x4E14;&#x7ED9;&#x5B9A;&#x9690;&#x85CF;&#x5C42;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x8BEF;&#x5DEE;&#x68AF;&#x5EA6;&#x5C06;&#x76F8;&#x540C;&#x3002; &#x7136;&#x540E;&#xFF0C;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x6B65;&#x9AA4;&#x5C06;&#x5728;&#x6BCF;&#x4E2A;&#x5C42;&#x4E2D;&#x4EE5;&#x76F8;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x66F4;&#x65B0;&#x6240;&#x6709;&#x6743;&#x91CD;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4EEC;&#x5C06;&#x4FDD;&#x6301;&#x76F8;&#x7B49;&#x3002; &#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5C3D;&#x7BA1;&#x6BCF;&#x5C42;&#x6709;&#x6570;&#x767E;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#xFF0C;&#x4F60;&#x7684;&#x6A21;&#x578B;&#x5C31;&#x50CF;&#x6BCF;&#x5C42;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x4E00;&#x6837;&#x3002;&#xFF09;</p>
</li>
<li><p>&#x4E0B;&#x4E00;&#x884C;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x504F;&#x5DEE;&#x7684;<code>b</code>&#x53D8;&#x91CF;&#xFF0C;&#x521D;&#x59CB;&#x5316;&#x4E3A; 0&#xFF08;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x65E0;&#x5BF9;&#x79F0;&#x95EE;&#x9898;&#xFF09;&#xFF0C;&#x6BCF;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x6709;&#x4E00;&#x4E2A;&#x504F;&#x7F6E;&#x53C2;&#x6570;&#x3002;</p>
</li>
<li><p>&#x7136;&#x540E;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5B50;&#x56FE;&#x6765;&#x8BA1;&#x7B97;<code>z = X&#xB7;W + b</code>&#x3002; &#x8BE5;&#x5411;&#x91CF;&#x5316;&#x5B9E;&#x73B0;&#x5C06;&#x6709;&#x6548;&#x5730;&#x8BA1;&#x7B97;&#x8F93;&#x5165;&#x7684;&#x52A0;&#x6743;&#x548C;&#x52A0;&#x4E0A;&#x5C42;&#x4E2D;&#x6BCF;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x504F;&#x7F6E;&#xFF0C;&#x5BF9;&#x4E8E;&#x6279;&#x6B21;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x5B9E;&#x4F8B;&#xFF0C;&#x4EC5;&#x9700;&#x4E00;&#x6B21;.</p>
</li>
<li><p>&#x6700;&#x540E;&#xFF0C;&#x5982;&#x679C;&#x6FC0;&#x6D3B;&#x53C2;&#x6570;&#x8BBE;&#x7F6E;&#x4E3A;<code>relu</code>&#xFF0C;&#x5219;&#x4EE3;&#x7801;&#x8FD4;&#x56DE;<code>relu(z)</code>&#xFF08;&#x5373;<code>max(0,z)</code>&#xFF09;&#xFF0C;&#x5426;&#x5219;&#x5B83;&#x53EA;&#x8FD4;&#x56DE;<code>z</code>&#x3002;</p>
</li>
</ol>
<p>&#x597D;&#x4E86;&#xFF0C;&#x73B0;&#x5728;&#x4F60;&#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x51FD;&#x6570;&#x6765;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x5C42;&#x3002; &#x8BA9;&#x6211;&#x4EEC;&#x7528;&#x5B83;&#x6765;&#x521B;&#x5EFA;&#x6DF1;&#x5C42;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF01; &#x7B2C;&#x4E00;&#x4E2A;&#x9690;&#x85CF;&#x5C42;&#x4EE5;<code>X</code>&#x4E3A;&#x8F93;&#x5165;&#x3002; &#x7B2C;&#x4E8C;&#x4E2A;&#x5C06;&#x7B2C;&#x4E00;&#x4E2A;&#x9690;&#x85CF;&#x5C42;&#x7684;&#x8F93;&#x51FA;&#x4F5C;&#x4E3A;&#x5176;&#x8F93;&#x5165;&#x3002; &#x6700;&#x540E;&#xFF0C;&#x8F93;&#x51FA;&#x5C42;&#x5C06;&#x7B2C;&#x4E8C;&#x4E2A;&#x9690;&#x85CF;&#x5C42;&#x7684;&#x8F93;&#x51FA;&#x4F5C;&#x4E3A;&#x5176;&#x8F93;&#x5165;&#x3002;</p>
<pre><code class="lang-python">    <span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&quot;dnn&quot;</span>):
        hidden1 = neuron_layer(X, n_hidden1, <span class="hljs-string">&quot;hidden1&quot;</span>, activation=<span class="hljs-string">&quot;relu&quot;</span>)
    hidden2 = neuron_layer(hidden1, n_hidden2, <span class="hljs-string">&quot;hidden2&quot;</span>, activation=<span class="hljs-string">&quot;relu&quot;</span>)
    logits = neuron_layer(hidden2, n_outputs, <span class="hljs-string">&quot;outputs&quot;</span>)
</code></pre>
<p>&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x4E3A;&#x4E86;&#x6E05;&#x695A;&#x8D77;&#x89C1;&#xFF0C;&#x6211;&#x4EEC;&#x518D;&#x6B21;&#x4F7F;&#x7528;&#x540D;&#x79F0;&#x8303;&#x56F4;&#x3002; &#x8FD8;&#x8981;&#x6CE8;&#x610F;&#xFF0C;logit &#x662F;&#x5728;&#x901A;&#x8FC7; softmax &#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x4E4B;&#x524D;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x8F93;&#x51FA;&#xFF1A;&#x4E3A;&#x4E86;&#x4F18;&#x5316;&#xFF0C;&#x6211;&#x4EEC;&#x7A0D;&#x540E;&#x5C06;&#x5904;&#x7406; softmax &#x8BA1;&#x7B97;&#x3002;</p>
<p>&#x6B63;&#x5982;&#x4F60;&#x6240;&#x671F;&#x671B;&#x7684;&#xFF0C;TensorFlow &#x6709;&#x8BB8;&#x591A;&#x65B9;&#x4FBF;&#x7684;&#x529F;&#x80FD;&#x6765;&#x521B;&#x5EFA;&#x6807;&#x51C6;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5C42;&#xFF0C;&#x6240;&#x4EE5;&#x901A;&#x5E38;&#x4E0D;&#x9700;&#x8981;&#x50CF;&#x6211;&#x4EEC;&#x521A;&#x624D;&#x90A3;&#x6837;&#x5B9A;&#x4E49;&#x4F60;&#x81EA;&#x5DF1;&#x7684;<code>neuron_layer()</code>&#x51FD;&#x6570;&#x3002; &#x4F8B;&#x5982;&#xFF0C;TensorFlow &#x7684;<code>fully_connected()</code>&#x51FD;&#x6570;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5B8C;&#x5168;&#x8FDE;&#x63A5;&#x7684;&#x5C42;&#xFF0C;&#x5176;&#x4E2D;&#x6240;&#x6709;&#x8F93;&#x5165;&#x90FD;&#x8FDE;&#x63A5;&#x5230;&#x56FE;&#x5C42;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x795E;&#x7ECF;&#x5143;&#x3002; &#x5B83;&#x4F7F;&#x7528;&#x6B63;&#x786E;&#x7684;&#x521D;&#x59CB;&#x5316;&#x7B56;&#x7565;&#x6765;&#x8D1F;&#x8D23;&#x521B;&#x5EFA;&#x6743;&#x91CD;&#x548C;&#x504F;&#x7F6E;&#x53D8;&#x91CF;&#xFF0C;&#x5E76;&#x4E14;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#x4F7F;&#x7528; ReLU &#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF08;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>activate_fn</code>&#x53C2;&#x6570;&#x6765;&#x66F4;&#x6539;&#x5B83;&#xFF09;&#x3002; &#x6B63;&#x5982;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x7B2C; 11 &#x7AE0;&#x4E2D;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x5B83;&#x8FD8;&#x652F;&#x6301;&#x6B63;&#x5219;&#x5316;&#x548C;&#x5F52;&#x4E00;&#x5316;&#x53C2;&#x6570;&#x3002; &#x6211;&#x4EEC;&#x6765;&#x8C03;&#x6574;&#x4E0A;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x6765;&#x4F7F;&#x7528;<code>fully_connected()</code>&#x51FD;&#x6570;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6211;&#x4EEC;&#x7684;<code>neuron_layer()</code>&#x51FD;&#x6570;&#x3002; &#x53EA;&#x9700;&#x5BFC;&#x5165;&#x8BE5;&#x529F;&#x80FD;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x4EE5;&#x4E0B;&#x4EE3;&#x7801;&#x66FF;&#x6362; dnn &#x6784;&#x5EFA;&#x90E8;&#x5206;&#xFF1A;</p>
<pre><code class="lang-python">    <span class="hljs-keyword">from</span> tensorflow.contrib.layers <span class="hljs-keyword">import</span> fully_connected
    <span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&quot;dnn&quot;</span>):
        hidden1 = fully_connected(X, n_hidden1, scope=<span class="hljs-string">&quot;hidden1&quot;</span>)
        hidden2 = fully_connected(hidden1, n_hidden2, scope=<span class="hljs-string">&quot;hidden2&quot;</span>)
        logits = fully_connected(hidden2, n_outputs, scope=<span class="hljs-string">&quot;outputs&quot;</span>,
                                    activation_fn=<span class="hljs-keyword">None</span>)
</code></pre>
<p><code>tensorflow.contrib</code>&#x5305;&#x5305;&#x542B;&#x8BB8;&#x591A;&#x6709;&#x7528;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x4F46;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x5C1A;&#x672A;&#x5206;&#x7EA7;&#x6210;&#x4E3A;&#x4E3B;&#x8981; TensorFlow API &#x4E00;&#x90E8;&#x5206;&#x7684;&#x5B9E;&#x9A8C;&#x4EE3;&#x7801;&#x7684;&#x5730;&#x65B9;&#x3002; &#x56E0;&#x6B64;&#xFF0C;<code>full_connected()</code>&#x51FD;&#x6570;&#xFF08;&#x548C;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;<code>contrib</code>&#x4EE3;&#x7801;&#xFF09;&#x53EF;&#x80FD;&#x4F1A;&#x5728;&#x5C06;&#x6765;&#x66F4;&#x6539;&#x6216;&#x79FB;&#x52A8;&#x3002;</p>
<p>&#x4F7F;&#x7528;<code>dense()</code>&#x4EE3;&#x66FF;<code>neuron_layer()</code></p>
<p>&#x6CE8;&#x610F;&#xFF1A;&#x672C;&#x4E66;&#x4F7F;&#x7528;<code>tensorflow.contrib.layers.fully_connected()</code>&#x800C;&#x4E0D;&#x662F;<code>tf.layers.dense()</code>&#xFF08;&#x672C;&#x7AE0;&#x7F16;&#x5199;&#x65F6;&#x4E0D;&#x5B58;&#x5728;&#xFF09;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x6700;&#x597D;&#x4F7F;&#x7528;<code>tf.layers.dense()</code>&#xFF0C;&#x56E0;&#x4E3A;<code>contrib</code>&#x6A21;&#x5757;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x5185;&#x5BB9;&#x53EF;&#x80FD;&#x4F1A;&#x66F4;&#x6539;&#x6216;&#x5220;&#x9664;&#xFF0C;&#x6055;&#x4E0D;&#x53E6;&#x884C;&#x901A;&#x77E5;&#x3002;<code>dense()</code>&#x51FD;&#x6570;&#x4E0E;<code>fully_connected()</code>&#x51FD;&#x6570;&#x51E0;&#x4E4E;&#x76F8;&#x540C;&#xFF0C;&#x9664;&#x4E86;&#x4E00;&#x4E9B;&#x7EC6;&#x5FAE;&#x7684;&#x5DEE;&#x522B;&#xFF1A;</p>
<p>&#x51E0;&#x4E2A;&#x53C2;&#x6570;&#x88AB;&#x91CD;&#x547D;&#x540D;&#xFF1A;<code>scope</code>&#x53D8;&#x4E3A;&#x540D;&#x79F0;&#xFF0C;<code>activation_fn</code>&#x53D8;&#x4E3A;&#x6FC0;&#x6D3B;&#xFF08;&#x540C;&#x6837;<code>_fn</code>&#x540E;&#x7F00;&#x4ECE;&#x5176;&#x4ED6;&#x53C2;&#x6570;&#xFF08;&#x5982;<code>normalizer_fn</code>&#xFF09;&#x4E2D;&#x5220;&#x9664;&#xFF09;&#xFF0C;<code>weights_initializer</code>&#x6210;&#x4E3A;<code>kernel_initializer</code>&#x7B49;&#x3002;&#x9ED8;&#x8BA4;&#x6FC0;&#x6D3B;&#x73B0;&#x5728;&#x662F;&#x65E0;&#xFF0C;&#x800C;&#x4E0D;&#x662F;<code>tf.nn.relu</code>&#x3002; &#x7B2C; 11 &#x7AE0;&#x8FD8;&#x4ECB;&#x7ECD;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x5DEE;&#x5F02;&#x3002;</p>
<pre><code class="lang-python"><span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&quot;dnn&quot;</span>):
    hidden1 = tf.layers.dense(X, n_hidden1, name=<span class="hljs-string">&quot;hidden1&quot;</span>,
                              activation=tf.nn.relu)
    hidden2 = tf.layers.dense(hidden1, n_hidden2, name=<span class="hljs-string">&quot;hidden2&quot;</span>,
                              activation=tf.nn.relu)
    logits = tf.layers.dense(hidden2, n_outputs, name=<span class="hljs-string">&quot;outputs&quot;</span>)
</code></pre>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6A21;&#x578B;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5B9A;&#x4E49;&#x6211;&#x4EEC;&#x7528;&#x6765;&#x8BAD;&#x7EC3;&#x7684;&#x635F;&#x5931;&#x51FD;&#x6570;&#x3002; &#x6B63;&#x5982;&#x6211;&#x4EEC;&#x5728;&#x7B2C; 4 &#x7AE0;&#x4E2D;&#x5BF9; Softmax &#x56DE;&#x5F52;&#x6240;&#x505A;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F7F;&#x7528;&#x4EA4;&#x53C9;&#x71B5;&#x3002; &#x6B63;&#x5982;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x8BA8;&#x8BBA;&#x7684;&#xFF0C;&#x4EA4;&#x53C9;&#x71B5;&#x5C06;&#x60E9;&#x7F5A;&#x4F30;&#x8BA1;&#x76EE;&#x6807;&#x7C7B;&#x7684;&#x6982;&#x7387;&#x8F83;&#x4F4E;&#x7684;&#x6A21;&#x578B;&#x3002; TensorFlow &#x63D0;&#x4F9B;&#x4E86;&#x51E0;&#x79CD;&#x8BA1;&#x7B97;&#x4EA4;&#x53C9;&#x71B5;&#x7684;&#x529F;&#x80FD;&#x3002; &#x6211;&#x4EEC;&#x5C06;&#x4F7F;&#x7528;<code>sparse_softmax_cross_entropy_with_logits()</code>&#xFF1A;&#x5B83;&#x6839;&#x636E;&#x201C;logit&#x201D;&#x8BA1;&#x7B97;&#x4EA4;&#x53C9;&#x71B5;&#xFF08;&#x5373;&#xFF0C;&#x5728;&#x901A;&#x8FC7; softmax &#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x4E4B;&#x524D;&#x7684;&#x7F51;&#x7EDC;&#x8F93;&#x51FA;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x671F;&#x671B;&#x4EE5; 0 &#x5230; -1 &#x6570;&#x91CF;&#x7684;&#x6574;&#x6570;&#x5F62;&#x5F0F;&#x7684;&#x6807;&#x7B7E;&#xFF08;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x4ECE; 0 &#x5230; 9&#xFF09;&#x3002; &#x8FD9;&#x5C06;&#x7ED9;&#x6211;&#x4EEC;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x6BCF;&#x4E2A;&#x5B9E;&#x4F8B;&#x7684;&#x4EA4;&#x53C9;&#x71B5;&#x7684; 1D &#x5F20;&#x91CF;&#x3002; &#x7136;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; TensorFlow &#x7684;<code>reduce_mean()</code>&#x51FD;&#x6570;&#x6765;&#x8BA1;&#x7B97;&#x6240;&#x6709;&#x5B9E;&#x4F8B;&#x7684;&#x5E73;&#x5747;&#x4EA4;&#x53C9;&#x71B5;&#x3002;</p>
<pre><code class="lang-python"><span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&quot;loss&quot;</span>):
    xentropy = tf.nn.sparse_softmax_cross_entropy_with_logits(labels=y, logits=logits)
    loss = tf.reduce_mean(xentropy, name=<span class="hljs-string">&quot;loss&quot;</span>)
</code></pre>
<p>&#x8BE5;<code>sparse_softmax_cross_entropy_with_logits()</code>&#x51FD;&#x6570;&#x7B49;&#x540C;&#x4E8E;&#x5E94;&#x7528; SOFTMAX &#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF0C;&#x7136;&#x540E;&#x8BA1;&#x7B97;&#x4EA4;&#x53C9;&#x71B5;&#xFF0C;&#x4F46;&#x5B83;&#x66F4;&#x9AD8;&#x6548;&#xFF0C;&#x5B83;&#x59A5;&#x5584;&#x7167;&#x987E;&#x7684;&#x8FB9;&#x754C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6BD4;&#x5982; logits &#x7B49;&#x4E8E; 0&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x8F83;&#x65E9;&#x7684;&#x5E94;&#x7528; SOFTMAX &#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x3002; &#x8FD8;&#x6709;&#x79F0;&#x4E3A;<code>softmax_cross_entropy_with_logits()</code>&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x8BE5;&#x51FD;&#x6570;&#x5728;&#x6807;&#x7B7E;&#x5355;&#x70ED;&#x8F7D;&#x4F53;&#x7684;&#x5F62;&#x5F0F;&#xFF08;&#x800C;&#x4E0D;&#x662F;&#x6574;&#x6570; 0 &#x81F3;&#x7C7B;&#x7684;&#x6570;&#x76EE;&#x51CF; 1&#xFF09;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6709;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6A21;&#x578B;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x635F;&#x5931;&#x51FD;&#x6570;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;<code>GradientDescentOptimizer</code>&#x6765;&#x8C03;&#x6574;&#x6A21;&#x578B;&#x53C2;&#x6570;&#x4EE5;&#x6700;&#x5C0F;&#x5316;&#x635F;&#x5931;&#x51FD;&#x6570;&#x3002;&#x6CA1;&#x4EC0;&#x4E48;&#x65B0;&#x9C9C;&#x7684;; &#x5C31;&#x50CF;&#x6211;&#x4EEC;&#x5728;&#x7B2C; 9 &#x7AE0;&#x4E2D;&#x6240;&#x505A;&#x7684;&#x90A3;&#x6837;&#xFF1A;</p>
<pre><code class="lang-python">learning_rate = <span class="hljs-number">0.01</span>

<span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&quot;train&quot;</span>):
    optimizer = tf.train.GradientDescentOptimizer(learning_rate)
    training_op = optimizer.minimize(loss)
</code></pre>
<p>&#x5EFA;&#x6A21;&#x9636;&#x6BB5;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x6B65;&#x9AA4;&#x662F;&#x6307;&#x5B9A;&#x5982;&#x4F55;&#x8BC4;&#x4F30;&#x6A21;&#x578B;&#x3002; &#x6211;&#x4EEC;&#x5C06;&#x7B80;&#x5355;&#x5730;&#x5C06;&#x7CBE;&#x5EA6;&#x7528;&#x4F5C;&#x6211;&#x4EEC;&#x7684;&#x7EE9;&#x6548;&#x6307;&#x6807;&#x3002; &#x9996;&#x5148;&#xFF0C;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x5B9E;&#x4F8B;&#xFF0C;&#x901A;&#x8FC7;&#x68C0;&#x67E5;&#x6700;&#x9AD8; logit &#x662F;&#x5426;&#x5BF9;&#x5E94;&#x4E8E;&#x76EE;&#x6807;&#x7C7B;&#x522B;&#x6765;&#x786E;&#x5B9A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x9884;&#x6D4B;&#x662F;&#x5426;&#x6B63;&#x786E;&#x3002; &#x4E3A;&#x6B64;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>in_top_k()</code>&#x51FD;&#x6570;&#x3002; &#x8FD9;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x5145;&#x6EE1;&#x5E03;&#x5C14;&#x503C;&#x7684; 1D &#x5F20;&#x91CF;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5C06;&#x8FD9;&#x4E9B;&#x5E03;&#x5C14;&#x503C;&#x8F6C;&#x6362;&#x4E3A;&#x6D6E;&#x70B9;&#x6570;&#xFF0C;&#x7136;&#x540E;&#x8BA1;&#x7B97;&#x5E73;&#x5747;&#x503C;&#x3002; &#x8FD9;&#x5C06;&#x7ED9;&#x6211;&#x4EEC;&#x7F51;&#x7EDC;&#x7684;&#x6574;&#x4F53;&#x51C6;&#x786E;&#x6027;.</p>
<pre><code class="lang-python"><span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&quot;eval&quot;</span>):
    correct = tf.nn.in_top_k(logits, y, <span class="hljs-number">1</span>)
    accuracy = tf.reduce_mean(tf.cast(correct, tf.float32))
</code></pre>
<p>&#x800C;&#x4E14;&#xFF0C;&#x50CF;&#x5F80;&#x5E38;&#x4E00;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x521D;&#x59CB;&#x5316;&#x6240;&#x6709;&#x53D8;&#x91CF;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x5C06;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;<code>Saver</code>&#x6765;&#x5C06;&#x6211;&#x4EEC;&#x8BAD;&#x7EC3;&#x6709;&#x7D20;&#x7684;&#x6A21;&#x578B;&#x53C2;&#x6570;&#x4FDD;&#x5B58;&#x5230;&#x78C1;&#x76D8;&#x4E2D;&#xFF1A;</p>
<pre><code class="lang-python">init = tf.global_variables_initializer()
saver = tf.train.Saver()
</code></pre>
<p>&#x5EFA;&#x6A21;&#x9636;&#x6BB5;&#x7ED3;&#x675F;&#x3002; &#x8FD9;&#x662F;&#x4E0D;&#x5230; 40 &#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x4F46;&#x76F8;&#x5F53;&#x6FC0;&#x70C8;&#xFF1A;&#x6211;&#x4EEC;&#x4E3A;&#x8F93;&#x5165;&#x548C;&#x76EE;&#x6807;&#x521B;&#x5EFA;&#x5360;&#x4F4D;&#x7B26;&#xFF0C;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x6784;&#x5EFA;&#x795E;&#x7ECF;&#x5143;&#x5C42;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x7528;&#x5B83;&#x6765;&#x521B;&#x5EFA; DNN&#xFF0C;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x4E86;&#x635F;&#x5931;&#x51FD;&#x6570;&#xFF0C;&#x6211;&#x4EEC; &#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x4F18;&#x5316;&#x5668;&#xFF0C;&#x6700;&#x540E;&#x5B9A;&#x4E49;&#x4E86;&#x6027;&#x80FD;&#x6307;&#x6807;&#x3002; &#x73B0;&#x5728;&#x5230;&#x6267;&#x884C;&#x9636;&#x6BB5;&#x3002;</p>
<h2 id="&#x6267;&#x884C;&#x9636;&#x6BB5;">&#x6267;&#x884C;&#x9636;&#x6BB5;</h2>
<p>&#x8FD9;&#x90E8;&#x5206;&#x8981;&#x77ED;&#x5F97;&#x591A;&#xFF0C;&#x66F4;&#x7B80;&#x5355;&#x3002; &#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x52A0;&#x8F7D; MNIST&#x3002; &#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x50CF;&#x4E4B;&#x524D;&#x7684;&#x7AE0;&#x8282;&#x90A3;&#x6837;&#x4F7F;&#x7528; ScikitLearn&#xFF0C;&#x4F46;&#x662F; TensorFlow &#x63D0;&#x4F9B;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x52A9;&#x624B;&#x6765;&#x83B7;&#x53D6;&#x6570;&#x636E;&#xFF0C;&#x5C06;&#x5176;&#x7F29;&#x653E;&#xFF08;0 &#x5230; 1 &#x4E4B;&#x95F4;&#xFF09;&#xFF0C;&#x5C06;&#x5B83;&#x6D17;&#x724C;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x529F;&#x80FD;&#x6765;&#x4E00;&#x6B21;&#x52A0;&#x8F7D;&#x4E00;&#x4E2A;&#x5C0F;&#x6279;&#x91CF;&#xFF1A;</p>
<pre><code class="lang-python"><span class="hljs-keyword">from</span> tensorflow.examples.tutorials.mnist <span class="hljs-keyword">import</span> input_data

mnist = input_data.read_data_sets(<span class="hljs-string">&quot;/tmp/data/&quot;</span>)
</code></pre>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x6211;&#x4EEC;&#x8981;&#x8FD0;&#x884C;&#x7684;&#x8FED;&#x4EE3;&#x6570;&#xFF0C;&#x4EE5;&#x53CA;&#x5C0F;&#x6279;&#x91CF;&#x7684;&#x5927;&#x5C0F;&#xFF1A;</p>
<pre><code class="lang-python">n_epochs = <span class="hljs-number">10001</span>
batch_size = <span class="hljs-number">50</span>
</code></pre>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x53BB;&#x8BAD;&#x7EC3;&#x6A21;&#x578B;:</p>
<pre><code class="lang-python"><span class="hljs-keyword">with</span> tf.Session() <span class="hljs-keyword">as</span> sess:
    init.run()
    <span class="hljs-keyword">for</span> epoch <span class="hljs-keyword">in</span> range(n_epochs):
        <span class="hljs-keyword">for</span> iteration <span class="hljs-keyword">in</span> range(mnist.train.num_examples // batch_size):
            X_batch, y_batch = mnist.train.next_batch(batch_size)
            sess.run(training_op, feed_dict={X: X_batch, y: y_batch})
        acc_train = accuracy.eval(feed_dict={X: X_batch, y: y_batch})
        acc_test = accuracy.eval(feed_dict={X: mnist.test.images, y: mnist.test.labels})
        print(epoch, <span class="hljs-string">&quot;Train accuracy:&quot;</span>, acc_train, <span class="hljs-string">&quot;Test accuracy:&quot;</span>, acc_test)

    save_path = saver.save(sess, <span class="hljs-string">&quot;./my_model_final.ckpt&quot;</span>)
</code></pre>
<p>&#x8BE5;&#x4EE3;&#x7801;&#x6253;&#x5F00;&#x4E00;&#x4E2A; TensorFlow &#x4F1A;&#x8BDD;&#xFF0C;&#x5E76;&#x8FD0;&#x884C;&#x521D;&#x59CB;&#x5316;&#x6240;&#x6709;&#x53D8;&#x91CF;&#x7684;<code>init</code>&#x8282;&#x70B9;&#x3002; &#x7136;&#x540E;&#x5B83;&#x8FD0;&#x884C;&#x7684;&#x4E3B;&#x8981;&#x8BAD;&#x7EC3;&#x5FAA;&#x73AF;&#xFF1A;&#x5728;&#x6BCF;&#x4E2A;&#x65F6;&#x671F;&#xFF0C;&#x901A;&#x8FC7;&#x4E00;&#x4E9B;&#x5C0F;&#x6279;&#x6B21;&#x7684;&#x5BF9;&#x5E94;&#x4E8E;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x5927;&#x5C0F;&#x7684;&#x4EE3;&#x7801;&#x8FDB;&#x884C;&#x8FED;&#x4EE3;&#x3002; &#x6BCF;&#x4E2A;&#x5C0F;&#x6279;&#x91CF;&#x901A;&#x8FC7;<code>next_batch()</code>&#x65B9;&#x6CD5;&#x83B7;&#x53D6;&#xFF0C;&#x7136;&#x540E;&#x4EE3;&#x7801;&#x7B80;&#x5355;&#x5730;&#x8FD0;&#x884C;&#x8BAD;&#x7EC3;&#x64CD;&#x4F5C;&#xFF0C;&#x4E3A;&#x5F53;&#x524D;&#x7684;&#x5C0F;&#x6279;&#x91CF;&#x8F93;&#x5165;&#x6570;&#x636E;&#x548C;&#x76EE;&#x6807;&#x63D0;&#x4F9B;&#x3002; &#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x5728;&#x6BCF;&#x4E2A;&#x65F6;&#x671F;&#x7ED3;&#x675F;&#x65F6;&#xFF0C;&#x4EE3;&#x7801;&#x8BC4;&#x4F30;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5C0F;&#x6279;&#x91CF;&#x548C;&#x5B8C;&#x6574;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x5E76;&#x6253;&#x5370;&#x51FA;&#x7ED3;&#x679C;&#x3002; &#x6700;&#x540E;&#xFF0C;&#x6A21;&#x578B;&#x53C2;&#x6570;&#x4FDD;&#x5B58;&#x5230;&#x78C1;&#x76D8;&#x3002;</p>
<h2 id="&#x4F7F;&#x7528;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;">&#x4F7F;&#x7528;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;</h2>
<p>&#x73B0;&#x5728;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x88AB;&#x8BAD;&#x7EC3;&#x4E86;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x5B83;&#x8FDB;&#x884C;&#x9884;&#x6D4B;&#x3002; &#x4E3A;&#x6B64;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x91CD;&#x590D;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x5EFA;&#x6A21;&#x9636;&#x6BB5;&#xFF0C;&#x4F46;&#x662F;&#x66F4;&#x6539;&#x6267;&#x884C;&#x9636;&#x6BB5;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<pre><code class="lang-python"><span class="hljs-keyword">with</span> tf.Session() <span class="hljs-keyword">as</span> sess:
    saver.restore(sess, <span class="hljs-string">&quot;./my_model_final.ckpt&quot;</span>) <span class="hljs-comment"># or better, use save_path</span>
    X_new_scaled = mnist.test.images[:<span class="hljs-number">20</span>]
    Z = logits.eval(feed_dict={X: X_new_scaled})
    y_pred = np.argmax(Z, axis=<span class="hljs-number">1</span>)
</code></pre>
<p>&#x9996;&#x5148;&#xFF0C;&#x4EE3;&#x7801;&#x4ECE;&#x78C1;&#x76D8;&#x52A0;&#x8F7D;&#x6A21;&#x578B;&#x53C2;&#x6570;&#x3002; &#x7136;&#x540E;&#x52A0;&#x8F7D;&#x4E00;&#x4E9B;&#x60A8;&#x60F3;&#x8981;&#x5206;&#x7C7B;&#x7684;&#x65B0;&#x56FE;&#x50CF;&#x3002; &#x8BB0;&#x4F4F;&#x5E94;&#x7528;&#x4E0E;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x76F8;&#x540C;&#x7684;&#x7279;&#x5F81;&#x7F29;&#x653E;&#xFF08;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5C06;&#x5176;&#x4ECE; 0 &#x7F29;&#x653E;&#x5230; 1&#xFF09;&#x3002; &#x7136;&#x540E;&#x4EE3;&#x7801;&#x8BC4;&#x4F30;&#x5BF9;&#x6570;&#x70B9;&#x8282;&#x70B9;&#x3002; &#x5982;&#x679C;&#x60A8;&#x60F3;&#x77E5;&#x9053;&#x6240;&#x6709;&#x4F30;&#x8BA1;&#x7684;&#x7C7B;&#x6982;&#x7387;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x5C06;<code>softmax()</code>&#x51FD;&#x6570;&#x5E94;&#x7528;&#x4E8E;&#x5BF9;&#x6570;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x60A8;&#x53EA;&#x60F3;&#x9884;&#x6D4B;&#x4E00;&#x4E2A;&#x7C7B;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x5730;&#x9009;&#x62E9;&#x5177;&#x6709;&#x6700;&#x9AD8; logit &#x503C;&#x7684;&#x7C7B;&#xFF08;&#x4F7F;&#x7528;<code>argmax()</code>&#x51FD;&#x6570;&#x505A;&#x7684;&#x4F0E;&#x4FE9;&#xFF09;&#x3002;</p>
<h2 id="&#x5FAE;&#x8C03;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8D85;&#x53C2;&#x6570;">&#x5FAE;&#x8C03;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8D85;&#x53C2;&#x6570;</h2>
<p>&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x4E5F;&#x662F;&#x5176;&#x4E3B;&#x8981;&#x7F3A;&#x70B9;&#x4E4B;&#x4E00;&#xFF1A;&#x6709;&#x5F88;&#x591A;&#x8D85;&#x53C2;&#x6570;&#x8981;&#x8FDB;&#x884C;&#x8C03;&#x6574;&#x3002; &#x4E0D;&#x4EC5;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4EFB;&#x4F55;&#x53EF;&#x60F3;&#x8C61;&#x7684;&#x7F51;&#x7EDC;&#x62D3;&#x6251;&#xFF08;&#x5982;&#x4F55;&#x795E;&#x7ECF;&#x5143;&#x4E92;&#x8FDE;&#xFF09;&#xFF0C;&#x800C;&#x4E14;&#x5373;&#x4F7F;&#x5728;&#x7B80;&#x5355;&#x7684; MLP &#x4E2D;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x66F4;&#x6539;&#x5C42;&#x6570;&#xFF0C;&#x6BCF;&#x5C42;&#x795E;&#x7ECF;&#x5143;&#x6570;&#xFF0C;&#x6BCF;&#x5C42;&#x4F7F;&#x7528;&#x7684;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x7C7B;&#x578B;&#xFF0C;&#x6743;&#x91CD;&#x521D;&#x59CB;&#x5316;&#x903B;&#x8F91;&#x7B49;&#x7B49;&#x3002; &#x4F60;&#x600E;&#x4E48;&#x77E5;&#x9053;&#x4EC0;&#x4E48;&#x7EC4;&#x5408;&#x7684;&#x8D85;&#x53C2;&#x6570;&#x662F;&#x6700;&#x9002;&#x5408;&#x4F60;&#x7684;&#x4EFB;&#x52A1;&#xFF1F;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5177;&#x6709;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x7684;&#x7F51;&#x683C;&#x641C;&#x7D22;&#x6765;&#x67E5;&#x627E;&#x6B63;&#x786E;&#x7684;&#x8D85;&#x53C2;&#x6570;&#xFF0C;&#x5C31;&#x50CF;&#x60A8;&#x5728;&#x524D;&#x51E0;&#x7AE0;&#x4E2D;&#x6240;&#x505A;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x8981;&#x8C03;&#x6574;&#x8BB8;&#x591A;&#x8D85;&#x53C2;&#x6570;&#xFF0C;&#x5E76;&#x4E14;&#x7531;&#x4E8E;&#x5728;&#x5927;&#x578B;&#x6570;&#x636E;&#x96C6;&#x4E0A;&#x8BAD;&#x7EC3;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x9700;&#x8981;&#x5F88;&#x591A;&#x65F6;&#x95F4;&#xFF0C; &#x60A8;&#x53EA;&#x80FD;&#x5728;&#x5408;&#x7406;&#x7684;&#x65F6;&#x95F4;&#x5185;&#x63A2;&#x7D22;&#x8D85;&#x53C2;&#x6570;&#x7A7A;&#x95F4;&#x7684;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#x3002; &#x6B63;&#x5982;&#x6211;&#x4EEC;&#x5728;&#x7B2C;2&#x7AE0;&#x4E2D;&#x8BA8;&#x8BBA;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x4F7F;&#x7528;<a href="http/www.jmlr.org/papers/volume13/bergstra12a/bergstra12a.pdf">&#x968F;&#x673A;&#x641C;&#x7D22;</a>&#x8981;&#x597D;&#x5F97;&#x591A;&#x3002;&#x53E6;&#x4E00;&#x4E2A;&#x9009;&#x62E9;&#x662F;&#x4F7F;&#x7528;&#x8BF8;&#x5982; Oscar &#x4E4B;&#x7C7B;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x66F4;&#x590D;&#x6742;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x4EE5;&#x5E2E;&#x52A9;&#x60A8;&#x5FEB;&#x901F;&#x627E;&#x5230;&#x4E00;&#x7EC4;&#x597D;&#x7684;&#x8D85;&#x53C2;&#x6570;.</p>
<p>&#x5B83;&#x6709;&#x52A9;&#x4E8E;&#x4E86;&#x89E3;&#x6BCF;&#x4E2A;&#x8D85;&#x7EA7;&#x53C2;&#x6570;&#x7684;&#x503C;&#x662F;&#x5408;&#x7406;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x60A8;&#x53EF;&#x4EE5;&#x9650;&#x5236;&#x641C;&#x7D22;&#x7A7A;&#x95F4;&#x3002; &#x6211;&#x4EEC;&#x4ECE;&#x9690;&#x85CF;&#x5C42;&#x6570;&#x5F00;&#x59CB;&#x3002;</p>
<h2 id="&#x9690;&#x85CF;&#x5C42;&#x6570;&#x91CF;">&#x9690;&#x85CF;&#x5C42;&#x6570;&#x91CF;</h2>
<p>&#x5BF9;&#x4E8E;&#x8BB8;&#x591A;&#x95EE;&#x9898;&#xFF0C;&#x60A8;&#x53EA;&#x9700;&#x4ECE;&#x5355;&#x4E2A;&#x9690;&#x85CF;&#x5C42;&#x5F00;&#x59CB;&#xFF0C;&#x60A8;&#x5C06;&#x83B7;&#x5F97;&#x5408;&#x7406;&#x7684;&#x7ED3;&#x679C;&#x3002; &#x5B9E;&#x9645;&#x4E0A;&#x5DF2;&#x7ECF;&#x8868;&#x660E;&#xFF0C;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x9690;&#x85CF;&#x5C42;&#x7684; MLP &#x53EF;&#x4EE5;&#x5EFA;&#x6A21;&#x751A;&#x81F3;&#x6700;&#x590D;&#x6742;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x53EA;&#x8981;&#x5B83;&#x5177;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x3002; &#x957F;&#x671F;&#x4EE5;&#x6765;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E8B;&#x5B9E;&#x8BF4;&#x670D;&#x4E86;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#xFF0C;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x8C03;&#x67E5;&#x4EFB;&#x4F55;&#x66F4;&#x6DF1;&#x5C42;&#x6B21;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002; &#x4F46;&#x662F;&#x4ED6;&#x4EEC;&#x5FFD;&#x7565;&#x4E86;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x4E8B;&#x5B9E;&#xFF1A;&#x6DF1;&#x5C42;&#x7F51;&#x7EDC;&#x5177;&#x6709;&#x6BD4;&#x6D45;&#x5C42;&#x7F51;&#x7EDC;&#x66F4;&#x9AD8;&#x7684;&#x53C2;&#x6570;&#x6548;&#x7387;&#xFF1A;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6BD4;&#x6D45;&#x7F51;&#x683C;&#x66F4;&#x5C11;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x6765;&#x5EFA;&#x6A21;&#x590D;&#x6742;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x4F7F;&#x5F97;&#x8BAD;&#x7EC3;&#x66F4;&#x5FEB;&#x3002;</p>
<p>&#x8981;&#x4E86;&#x89E3;&#x4E3A;&#x4EC0;&#x4E48;&#xFF0C;&#x5047;&#x8BBE;&#x60A8;&#x88AB;&#x8981;&#x6C42;&#x4F7F;&#x7528;&#x4E00;&#x4E9B;&#x7ED8;&#x56FE;&#x8F6F;&#x4EF6;&#x7ED8;&#x5236;&#x4E00;&#x4E2A;&#x68EE;&#x6797;&#xFF0C;&#x4F46;&#x662F;&#x60A8;&#x88AB;&#x7981;&#x6B62;&#x4F7F;&#x7528;&#x590D;&#x5236;/&#x7C98;&#x8D34;&#x3002; &#x4F60;&#x5FC5;&#x987B;&#x5355;&#x72EC;&#x7ED8;&#x5236;&#x6BCF;&#x68F5;&#x6811;&#xFF0C;&#x6BCF;&#x679D;&#x5206;&#x679D;&#xFF0C;&#x6BCF;&#x53F6;&#x53F6;&#x3002; &#x5982;&#x679C;&#x4F60;&#x53EF;&#x4EE5;&#x753B;&#x4E00;&#x4E2A;&#x53F6;&#xFF0C;&#x590D;&#x5236;/&#x7C98;&#x8D34;&#x5B83;&#x6765;&#x7ED8;&#x5236;&#x4E00;&#x4E2A;&#x5206;&#x652F;&#xFF0C;&#x7136;&#x540E;&#x590D;&#x5236;/&#x7C98;&#x8D34;&#x8BE5;&#x5206;&#x652F;&#x6765;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6811;&#xFF0C;&#x6700;&#x540E;&#x590D;&#x5236;/&#x7C98;&#x8D34;&#x8FD9;&#x4E2A;&#x6811;&#x6765;&#x5236;&#x4F5C;&#x4E00;&#x4E2A;&#x6797;&#xFF0C;&#x4F60;&#x5C06;&#x5F88;&#x5FEB;&#x5B8C;&#x6210;&#x3002; &#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x7684;&#x6570;&#x636E;&#x901A;&#x5E38;&#x4EE5;&#x8FD9;&#x6837;&#x4E00;&#x79CD;&#x5206;&#x5C42;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x7ED3;&#x6784;&#x5316;&#xFF0C;DNN &#x81EA;&#x52A8;&#x5229;&#x7528;&#x8FD9;&#x4E00;&#x4E8B;&#x5B9E;&#xFF1A;&#x8F83;&#x4F4E;&#x7684;&#x9690;&#x85CF;&#x5C42;&#x6A21;&#x62DF;&#x4F4E;&#x7EA7;&#x7ED3;&#x6784;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5404;&#x79CD;&#x5F62;&#x72B6;&#x548C;&#x65B9;&#x5411;&#x7684;&#x7EBF;&#x6BB5;&#xFF09;&#xFF0C;&#x4E2D;&#x95F4;&#x9690;&#x85CF;&#x5C42;&#x5C06;&#x8FD9;&#x4E9B;&#x4F4E;&#x7EA7;&#x7ED3;&#x6784;&#x7EC4;&#x5408;&#x5230; &#x6A21;&#x578B;&#x4E2D;&#x7EA7;&#x7ED3;&#x6784;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x6B63;&#x65B9;&#x5F62;&#xFF0C;&#x5706;&#x5F62;&#xFF09;&#x548C;&#x6700;&#x9AD8;&#x9690;&#x85CF;&#x5C42;&#x548C;&#x8F93;&#x51FA;&#x5C42;&#x5C06;&#x8FD9;&#x4E9B;&#x4E2D;&#x95F4;&#x7ED3;&#x6784;&#x7EC4;&#x5408;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x4EE5;&#x6A21;&#x62DF;&#x9AD8;&#x7EA7;&#x7ED3;&#x6784;&#xFF08;&#x5982;&#x9762;&#xFF09;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x5206;&#x5C42;&#x67B6;&#x6784;&#x4E0D;&#x4EC5;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9; DNN &#x66F4;&#x5FEB;&#x5730;&#x878D;&#x5408;&#x5230;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x5176;&#x5C06;&#x5176;&#x63A8;&#x5E7F;&#x5230;&#x65B0;&#x6570;&#x636E;&#x96C6;&#x7684;&#x80FD;&#x529B;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x5DF2;&#x7ECF;&#x8BAD;&#x7EC3;&#x4E86;&#x6A21;&#x578B;&#x4EE5;&#x8BC6;&#x522B;&#x56FE;&#x7247;&#x4E2D;&#x7684;&#x8138;&#x90E8;&#xFF0C;&#x5E76;&#x4E14;&#x60A8;&#x73B0;&#x5728;&#x60F3;&#x8981;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6765;&#x8BC6;&#x522B;&#x53D1;&#x578B;&#xFF0C;&#x90A3;&#x4E48;&#x60A8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x91CD;&#x65B0;&#x4F7F;&#x7528;&#x7B2C;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x7684;&#x8F83;&#x4F4E;&#x5C42;&#x6B21;&#x6765;&#x542F;&#x52A8;&#x8BAD;&#x7EC3;&#x3002; &#x800C;&#x4E0D;&#x662F;&#x968F;&#x673A;&#x521D;&#x59CB;&#x5316;&#x65B0;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x524D;&#x51E0;&#x5C42;&#x7684;&#x6743;&#x91CD;&#x548C;&#x504F;&#x7F6E;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x521D;&#x59CB;&#x5316;&#x4E3A;&#x7B2C;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x7684;&#x8F83;&#x4F4E;&#x5C42;&#x7684;&#x6743;&#x91CD;&#x548C;&#x504F;&#x7F6E;&#x7684;&#x503C;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x7F51;&#x7EDC;&#x5C06;&#x4E0D;&#x5FC5;&#x4ECE;&#x5927;&#x591A;&#x6570;&#x56FE;&#x7247;&#x4E2D;&#x4F4E;&#x7ED3;&#x6784;&#x4E2D;&#x4ECE;&#x5934;&#x5B66;&#x4E60;&#xFF1B;&#x5B83;&#x53EA;&#x9700;&#x8981;&#x5B66;&#x4E60;&#x66F4;&#x9AD8;&#x5C42;&#x6B21;&#x7684;&#x7ED3;&#x6784;&#xFF08;&#x4F8B;&#x5982;&#x53D1;&#x578B;&#xFF09;&#x3002;</p>
<p>&#x603B;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x5BF9;&#x4E8E;&#x8BB8;&#x591A;&#x95EE;&#x9898;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x4ECE;&#x4E00;&#x4E2A;&#x6216;&#x4E24;&#x4E2A;&#x9690;&#x85CF;&#x5C42;&#x5F00;&#x59CB;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x9690;&#x85CF;&#x5C42;&#x548C;&#x51E0;&#x767E;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#xFF0C;&#x5728; MNIST &#x6570;&#x636E;&#x96C6;&#x4E0A;&#x5BB9;&#x6613;&#x8FBE;&#x5230; 97% &#x4EE5;&#x4E0A;&#x7684;&#x51C6;&#x786E;&#x5EA6;&#x4F7F;&#x7528;&#x4E24;&#x4E2A;&#x5177;&#x6709;&#x76F8;&#x540C;&#x603B;&#x795E;&#x7ECF;&#x5143;&#x6570;&#x91CF;&#x7684;&#x9690;&#x85CF;&#x5C42;&#xFF0C;&#x5728;&#x5927;&#x81F4;&#x76F8;&#x540C;&#x7684;&#x8BAD;&#x7EC3;&#x65F6;&#x95F4;&#x91CF;&#x4E2D;&#x7CBE;&#x786E;&#x5EA6;&#x4E3A; 98%&#xFF09;&#x3002;&#x5BF9;&#x4E8E;&#x66F4;&#x590D;&#x6742;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x9010;&#x6E10;&#x589E;&#x52A0;&#x9690;&#x85CF;&#x5C42;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x76F4;&#x5230;&#x60A8;&#x5F00;&#x59CB;&#x8986;&#x76D6;&#x8BAD;&#x7EC3;&#x96C6;&#x3002;&#x975E;&#x5E38;&#x590D;&#x6742;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x4F8B;&#x5982;&#x5927;&#x578B;&#x56FE;&#x50CF;&#x5206;&#x7C7B;&#x6216;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#xFF0C;&#x901A;&#x5E38;&#x9700;&#x8981;&#x5177;&#x6709;&#x6570;&#x5341;&#x4E2A;&#x5C42;&#xFF08;&#x6216;&#x751A;&#x81F3;&#x6570;&#x767E;&#x4E2A;&#x4F46;&#x4E0D;&#x5B8C;&#x5168;&#x76F8;&#x8FDE;&#x7684;&#x7F51;&#x7EDC;&#xFF09;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x7B2C; 13 &#x7AE0;&#x4E2D;&#x770B;&#x5230;&#x7684;&#x90A3;&#x6837;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x9700;&#x8981;&#x5927;&#x91CF;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x60A8;&#x5C06;&#x5F88;&#x5C11;&#x4ECE;&#x5934;&#x5F00;&#x59CB;&#x8BAD;&#x7EC3;&#x8FD9;&#x6837;&#x7684;&#x7F51;&#x7EDC;&#xFF1A;&#x91CD;&#x7528;&#x9884;&#x5148;&#x8BAD;&#x7EC3;&#x7684;&#x6700;&#x5148;&#x8FDB;&#x7684;&#x7F51;&#x7EDC;&#x6267;&#x884C;&#x7C7B;&#x4F3C;&#x4EFB;&#x52A1;&#x7684;&#x90E8;&#x5206;&#x66F4;&#x4E3A;&#x5E38;&#x89C1;&#x3002;&#x8BAD;&#x7EC3;&#x5C06;&#x4F1A;&#x66F4;&#x5FEB;&#xFF0C;&#x9700;&#x8981;&#x66F4;&#x5C11;&#x7684;&#x6570;&#x636E;&#xFF08;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x7B2C; 11 &#x7AE0;&#x4E2D;&#x8FDB;&#x884C;&#x8BA8;&#x8BBA;&#xFF09;</p>
<h2 id="&#x6BCF;&#x5C42;&#x9690;&#x85CF;&#x5C42;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x6570;&#x91CF;">&#x6BCF;&#x5C42;&#x9690;&#x85CF;&#x5C42;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x6570;&#x91CF;</h2>
<p>&#x663E;&#x7136;&#xFF0C;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x5C42;&#x4E2D;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x6570;&#x91CF;&#x7531;&#x60A8;&#x7684;&#x4EFB;&#x52A1;&#x9700;&#x8981;&#x7684;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x7C7B;&#x578B;&#x51B3;&#x5B9A;&#x3002;&#x4F8B;&#x5982;&#xFF0C;MNIST &#x4EFB;&#x52A1;&#x9700;&#x8981;<code>28&#xD7;28 = 784</code>&#x4E2A;&#x8F93;&#x5165;&#x795E;&#x7ECF;&#x5143;&#x548C; 10 &#x4E2A;&#x8F93;&#x51FA;&#x795E;&#x7ECF;&#x5143;&#x3002;&#x5BF9;&#x4E8E;&#x9690;&#x85CF;&#x7684;&#x5C42;&#x6B21;&#x6765;&#x8BF4;&#xFF0C;&#x901A;&#x5E38;&#x7684;&#x505A;&#x6CD5;&#x662F;&#x5C06;&#x5176;&#x8BBE;&#x7F6E;&#x4E3A;&#x5F62;&#x6210;&#x4E00;&#x4E2A;&#x6F0F;&#x6597;&#xFF0C;&#x6BCF;&#x4E2A;&#x5C42;&#x9762;&#x4E0A;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x8D8A;&#x6765;&#x8D8A;&#x5C11;&#xFF0C;&#x539F;&#x56E0;&#x5728;&#x4E8E;&#x8BB8;&#x591A;&#x4F4E;&#x7EA7;&#x522B;&#x529F;&#x80FD;&#x53EF;&#x4EE5;&#x5408;&#x5E76;&#x6210;&#x66F4;&#x5C11;&#x7684;&#x9AD8;&#x7EA7;&#x529F;&#x80FD;&#x3002;&#x4F8B;&#x5982;&#xFF0C;MNIST &#x7684;&#x5178;&#x578B;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x53EF;&#x80FD;&#x5177;&#x6709;&#x4E24;&#x4E2A;&#x9690;&#x85CF;&#x5C42;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x5177;&#x6709; 300 &#x4E2A;&#x795E;&#x7ECF;&#x5143;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x5177;&#x6709; 100 &#x4E2A;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x79CD;&#x505A;&#x6CD5;&#x73B0;&#x5728;&#x5E76;&#x4E0D;&#x5E38;&#x89C1;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x4E3A;&#x6240;&#x6709;&#x9690;&#x85CF;&#x5C42;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x5927;&#x5C0F; - &#x4F8B;&#x5982;&#xFF0C;&#x6240;&#x6709;&#x9690;&#x85CF;&#x7684;&#x5C42;&#x4E0E; 150 &#x4E2A;&#x795E;&#x7ECF;&#x5143;&#xFF1A;&#x8FD9;&#x6837;&#x53EA;&#x7528;&#x8C03;&#x6574;&#x4E00;&#x6B21;&#x8D85;&#x53C2;&#x6570;&#x800C;&#x4E0D;&#x662F;&#x6BCF;&#x5C42;&#x90FD;&#x9700;&#x8981;&#x8C03;&#x6574;&#xFF08;&#x56E0;&#x4E3A;&#x5982;&#x679C;&#x6BCF;&#x5C42;&#x4E00;&#x6837;&#xFF0C;&#x6BD4;&#x5982; 150&#xFF0C;&#x4E4B;&#x540E;&#x8C03;&#x5C31;&#x6BCF;&#x5C42;&#x90FD;&#x8C03;&#x6210; 160&#xFF09;&#x3002;&#x5C31;&#x50CF;&#x5C42;&#x6570;&#x4E00;&#x6837;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x9010;&#x6E10;&#x589E;&#x52A0;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x76F4;&#x5230;&#x7F51;&#x7EDC;&#x5F00;&#x59CB;&#x8FC7;&#x5EA6;&#x62DF;&#x5408;&#x3002;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x901A;&#x8FC7;&#x589E;&#x52A0;&#x6BCF;&#x5C42;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x6570;&#x91CF;&#xFF0C;&#x53EF;&#x4EE5;&#x589E;&#x52A0;&#x5C42;&#x6570;&#xFF0C;&#x4ECE;&#x800C;&#x83B7;&#x5F97;&#x66F4;&#x591A;&#x7684;&#x6D88;&#x8017;&#x3002;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x6B63;&#x5982;&#x4F60;&#x6240;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x627E;&#x5230;&#x5B8C;&#x7F8E;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x6570;&#x91CF;&#x4ECD;&#x7136;&#x662F;&#x9ED1;&#x8272;&#x7684;&#x827A;&#x672F;.</p>
<p>&#x4E00;&#x4E2A;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x5177;&#x6709;&#x6BD4;&#x5B9E;&#x9645;&#x9700;&#x8981;&#x7684;&#x66F4;&#x591A;&#x5C42;&#x6B21;&#x548C;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x65E9;&#x671F;&#x505C;&#x6B62;&#x6765;&#x9632;&#x6B62;&#x5B83;&#x8FC7;&#x5EA6;&#x62DF;&#x5408;&#xFF08;&#x4EE5;&#x53CA;&#x5176;&#x4ED6;&#x6B63;&#x5219;&#x5316;&#x6280;&#x672F;&#xFF0C;&#x7279;&#x522B;&#x662F; drop out&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x7B2C; 11 &#x7AE0;&#x4E2D;&#x770B;&#x5230;&#xFF09;&#x3002; &#x8FD9;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x62C9;&#x4F38;&#x88E4;&#x201D;&#x7684;&#x65B9;&#x6CD5;&#xFF1A;&#x800C;&#x4E0D;&#x662F;&#x6D6A;&#x8D39;&#x65F6;&#x95F4;&#x5BFB;&#x627E;&#x5B8C;&#x7F8E;&#x5339;&#x914D;&#x60A8;&#x7684;&#x5927;&#x5C0F;&#x7684;&#x88E4;&#x5B50;&#xFF0C;&#x53EA;&#x9700;&#x4F7F;&#x7528;&#x5927;&#x578B;&#x4F38;&#x7F29;&#x88E4;&#xFF0C;&#x7F29;&#x5C0F;&#x5230;&#x5408;&#x9002;&#x7684;&#x5C3A;&#x5BF8;&#x3002;</p>
<h2 id="&#x6FC0;&#x6D3B;&#x51FD;&#x6570;">&#x6FC0;&#x6D3B;&#x51FD;&#x6570;</h2>
<p>&#x5728;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5728;&#x9690;&#x85CF;&#x5C42;&#x4E2D;&#x4F7F;&#x7528; ReLU &#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF08;&#x6216;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x53D8;&#x4F53;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x7B2C; 11 &#x7AE0;&#x4E2D;&#x770B;&#x5230;&#xFF09;&#x3002; &#x4E0E;&#x5176;&#x4ED6;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x76F8;&#x6BD4;&#xFF0C;&#x8BA1;&#x7B97;&#x901F;&#x5EA6;&#x8981;&#x5FEB;&#x4E00;&#x4E9B;&#xFF0C;&#x800C;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x5728;&#x5C40;&#x90E8;&#x6700;&#x9AD8;&#x70B9;&#x4E0A;&#x5E76;&#x4E0D;&#x4F1A;&#x88AB;&#x5361;&#x4F4F;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4E0D;&#x4F1A;&#x5BF9;&#x5927;&#x7684;&#x8F93;&#x5165;&#x503C;&#x9971;&#x548C;&#xFF08;&#x4E0E;&#x903B;&#x8F91;&#x51FD;&#x6570;&#x6216;&#x53CC;&#x66F2;&#x6B63;&#x5207;&#x51FD;&#x6570;&#x76F8;&#x53CD;, &#x4ED6;&#x4EEC;&#x5BB9;&#x6613;&#x5728; 1 &#x9971;&#x548C;)</p>
<p>&#x5BF9;&#x4E8E;&#x8F93;&#x51FA;&#x5C42;&#xFF0C;softmax &#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x901A;&#x5E38;&#x662F;&#x5206;&#x7C7B;&#x4EFB;&#x52A1;&#x7684;&#x826F;&#x597D;&#x9009;&#x62E9;&#xFF08;&#x5F53;&#x8FD9;&#x4E9B;&#x7C7B;&#x662F;&#x4E92;&#x65A5;&#x7684;&#x65F6;&#xFF09;&#x3002; &#x5BF9;&#x4E8E;&#x56DE;&#x5F52;&#x4EFB;&#x52A1;&#xFF0C;&#x60A8;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x4E0D;&#x4F7F;&#x7528;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x4EBA;&#x9020;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x8FD9;&#x4E2A;&#x4ECB;&#x7ECD;&#x3002; &#x5728;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x7AE0;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8BA8;&#x8BBA;&#x8BAD;&#x7EC3;&#x975E;&#x5E38;&#x6DF1;&#x7684;&#x7F51;&#x7EDC;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x5E76;&#x5206;&#x53D1;&#x591A;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x548C; GPU &#x7684;&#x8BAD;&#x7EC3;&#x3002; &#x7136;&#x540E;&#x6211;&#x4EEC;&#x5C06;&#x63A2;&#x8BA8;&#x4E00;&#x4E9B;&#x5176;&#x4ED6;&#x6D41;&#x884C;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x67B6;&#x6784;&#xFF1A;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x548C;&#x81EA;&#x52A8;&#x7F16;&#x7801;&#x5668;&#x3002;</p>
<h2 id="&#x5B8C;&#x6574;&#x4EE3;&#x7801;">&#x5B8C;&#x6574;&#x4EE3;&#x7801;</h2>
<pre><code class="lang-python"><span class="hljs-keyword">from</span> tensorflow.examples.tutorials.mnist <span class="hljs-keyword">import</span> input_data
<span class="hljs-keyword">import</span> tensorflow <span class="hljs-keyword">as</span> tf
<span class="hljs-keyword">from</span> sklearn.metrics <span class="hljs-keyword">import</span> accuracy_score
<span class="hljs-keyword">import</span> numpy <span class="hljs-keyword">as</span> np

<span class="hljs-keyword">if</span> __name__ == <span class="hljs-string">&apos;__main__&apos;</span>:
    n_inputs = <span class="hljs-number">28</span> * <span class="hljs-number">28</span>
    n_hidden1 = <span class="hljs-number">300</span>
    n_hidden2 = <span class="hljs-number">100</span>
    n_outputs = <span class="hljs-number">10</span>

    mnist = input_data.read_data_sets(<span class="hljs-string">&quot;/tmp/data/&quot;</span>)

    X_train = mnist.train.images
    X_test = mnist.test.images
    y_train = mnist.train.labels.astype(<span class="hljs-string">&quot;int&quot;</span>)
    y_test = mnist.test.labels.astype(<span class="hljs-string">&quot;int&quot;</span>)

    X = tf.placeholder(tf.float32, shape= (<span class="hljs-keyword">None</span>, n_inputs), name=<span class="hljs-string">&apos;X&apos;</span>)
    y = tf.placeholder(tf.int64, shape=(<span class="hljs-keyword">None</span>), name = <span class="hljs-string">&apos;y&apos;</span>)

    <span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&apos;dnn&apos;</span>):
        hidden1 = tf.layers.dense(X, n_hidden1, activation=tf.nn.relu
                                  ,name= <span class="hljs-string">&apos;hidden1&apos;</span>)

        hidden2 = tf.layers.dense(hidden1, n_hidden2, name=<span class="hljs-string">&apos;hidden2&apos;</span>,
                                  activation= tf.nn.relu)

        logits = tf.layers.dense(hidden2, n_outputs, name=<span class="hljs-string">&apos;outputs&apos;</span>)

    <span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&apos;loss&apos;</span>):
        xentropy = tf.nn.sparse_softmax_cross_entropy_with_logits(labels = y,
                                                                  logits = logits)
        loss = tf.reduce_mean(xentropy, name=<span class="hljs-string">&apos;loss&apos;</span>)<span class="hljs-comment">#&#x6240;&#x6709;&#x503C;&#x6C42;&#x5E73;&#x5747;</span>

    learning_rate = <span class="hljs-number">0.01</span>

    <span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&apos;train&apos;</span>):
        optimizer = tf.train.GradientDescentOptimizer(learning_rate)
        training_op = optimizer.minimize(loss)

    <span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&apos;eval&apos;</span>):
        correct = tf.nn.in_top_k(logits ,y ,<span class="hljs-number">1</span>)<span class="hljs-comment">#&#x662F;&#x5426;&#x4E0E;&#x771F;&#x503C;&#x4E00;&#x81F4; &#x8FD4;&#x56DE;&#x5E03;&#x5C14;&#x503C;</span>
        accuracy = tf.reduce_mean(tf.cast(correct, tf.float32)) <span class="hljs-comment">#tf.cast&#x5C06;&#x6570;&#x636E;&#x8F6C;&#x5316;&#x4E3A;0,1&#x5E8F;&#x5217;</span>

    init = tf.global_variables_initializer()

    n_epochs = <span class="hljs-number">20</span>
    batch_size = <span class="hljs-number">50</span>
    <span class="hljs-keyword">with</span> tf.Session() <span class="hljs-keyword">as</span> sess:
        init.run()
        <span class="hljs-keyword">for</span> epoch <span class="hljs-keyword">in</span> range(n_epochs):
            <span class="hljs-keyword">for</span> iteration <span class="hljs-keyword">in</span> range(mnist.train.num_examples // batch_size):
                X_batch, y_batch = mnist.train.next_batch(batch_size)
                sess.run(training_op,feed_dict={X:X_batch,
                                                y: y_batch})
            acc_train = accuracy.eval(feed_dict={X:X_batch,
                                                y: y_batch})
            acc_test = accuracy.eval(feed_dict={X: mnist.test.images,
                                                y: mnist.test.labels})
            print(epoch, <span class="hljs-string">&quot;Train accuracy:&quot;</span>, acc_train, <span class="hljs-string">&quot;Test accuracy:&quot;</span>, acc_test)
</code></pre>
<h2 id="&#x7EC3;&#x4E60;">&#x7EC3;&#x4E60;</h2>
<ol>
<li><p>&#x4F7F;&#x7528;&#x539F;&#x59CB;&#x7684;&#x4EBA;&#x5DE5;&#x795E;&#x7ECF;&#x5143;&#xFF08;&#x5982;&#x56FE; 10-3 &#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#xFF09;&#x6765;&#x8BA1;&#x7B97;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x8BA1;&#x7B97;<code>A &#x2295; B</code>&#xFF08;<code>&#x2295;</code>&#x8868;&#x793A; XOR &#x8FD0;&#x7B97;&#xFF09;&#x3002;&#x63D0;&#x793A;&#xFF1A;<code>A &#x2295; B = (A &#x2227; &#xAC; B) &#x2228; (&#xAC; A &#x2227; B)</code>&#x3002;</p>
</li>
<li><p>&#x4E3A;&#x4EC0;&#x4E48;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x903B;&#x8F91;&#x65AF;&#x8482;&#x56DE;&#x5F52;&#x5206;&#x7C7B;&#x5668;&#x800C;&#x4E0D;&#x662F;&#x7ECF;&#x5178;&#x611F;&#x77E5;&#x5668;&#xFF08;&#x5373;&#x4F7F;&#x7528;&#x611F;&#x77E5;&#x5668;&#x8BAD;&#x7EC3;&#x7B97;&#x6CD5;&#x8BAD;&#x7EC3;&#x5355;&#x5C42;&#x7684;&#x7EBF;&#x6027;&#x9608;&#x503C;&#x5355;&#x5143;&#xFF09;&#xFF1F;&#x4F60;&#x5982;&#x4F55;&#x8C03;&#x6574;&#x611F;&#x77E5;&#x5668;&#x4F7F;&#x4E4B;&#x7B49;&#x540C;&#x4E8E;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x5206;&#x7C7B;&#x5668;&#xFF1F;</p>
</li>
<li><p>&#x4E3A;&#x4EC0;&#x4E48;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x662F;&#x8BAD;&#x7EC3;&#x7B2C;&#x4E00;&#x4E2A; MLP &#x7684;&#x5173;&#x952E;&#x56E0;&#x7D20;&#xFF1F;</p>
</li>
<li><p>&#x8BF4;&#x51FA;&#x4E09;&#x79CD;&#x6D41;&#x884C;&#x7684;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x3002;&#x4F60;&#x80FD;&#x753B;&#x51FA;&#x5B83;&#x4EEC;&#x5417;&#xFF1F;</p>
</li>
<li><p>&#x5047;&#x8BBE;&#x6709;&#x4E00;&#x4E2A; MLP &#x6709;&#x4E00;&#x4E2A; 10 &#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x7EC4;&#x6210;&#x7684;&#x8F93;&#x5165;&#x5C42;&#xFF0C;&#x63A5;&#x7740;&#x662F;&#x4E00;&#x4E2A; 50 &#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x9690;&#x85CF;&#x5C42;&#xFF0C;&#x6700;&#x540E;&#x4E00;&#x4E2A; 3 &#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x8F93;&#x51FA;&#x5C42;&#x3002;&#x6240;&#x6709;&#x4EBA;&#x5DE5;&#x795E;&#x7ECF;&#x5143;&#x4F7F;&#x7528; Relu &#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x3002;</p>
<ul>
<li><p>&#x8F93;&#x5165;&#x77E9;&#x9635;<code>X</code>&#x7684;&#x5F62;&#x72B6;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</p>
</li>
<li><p>&#x9690;&#x85CF;&#x5C42;&#x7684;&#x6743;&#x91CD;&#x5411;&#x91CF;&#x7684;&#x5F62;&#x72B6;&#x4EE5;&#x53CA;&#x5B83;&#x7684;&#x504F;&#x7F6E;&#x5411;&#x91CF;&#x7684;&#x5F62;&#x72B6;&#x5982;&#x4F55;&#xFF1F;</p>
</li>
<li><p>&#x8F93;&#x51FA;&#x5C42;&#x7684;&#x6743;&#x91CD;&#x5411;&#x91CF;&#x548C;&#x5B83;&#x7684;&#x504F;&#x7F6E;&#x5411;&#x91CF;&#x7684;&#x5F62;&#x72B6;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</p>
</li>
<li><p>&#x7F51;&#x7EDC;&#x7684;&#x8F93;&#x51FA;&#x77E9;&#x9635;<code>Y</code>&#x662F;&#x4EC0;&#x4E48;&#x5F62;&#x72B6;&#xFF1F;</p>
</li>
<li><p>&#x5199;&#x51FA;&#x8BA1;&#x7B97;&#x7F51;&#x7EDC;&#x8F93;&#x51FA;&#x77E9;&#x9635;&#x7684;&#x65B9;&#x7A0B;</p>
</li>
</ul>
</li>
<li><p>&#x5982;&#x679C;&#x4F60;&#x60F3;&#x628A;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x5206;&#x7C7B;&#x6210;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x6216;&#x6B63;&#x5E38;&#x90AE;&#x4EF6;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x5728;&#x8F93;&#x51FA;&#x5C42;&#x4E2D;&#x6709;&#x591A;&#x5C11;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#xFF1F;&#x5728;&#x8F93;&#x51FA;&#x5C42;&#x4E2D;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF1F;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x89E3;&#x51B3; MNIST &#x95EE;&#x9898;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x591A;&#x5C11;&#x795E;&#x7ECF;&#x5143;&#x5728;&#x8F93;&#x51FA;&#x5C42;&#xFF0C;&#x4F7F;&#x7528;&#x4EC0;&#x4E48;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF1F;&#x5982;&#x7B2C; 2 &#x7AE0;&#xFF0C;&#x4E00;&#x6837;&#x8BA9;&#x4F60;&#x7684;&#x7F51;&#x7EDC;&#x9884;&#x6D4B;&#x623F;&#x5C4B;&#x4EF7;&#x683C;&#x3002;</p>
</li>
<li><p>&#x4EC0;&#x4E48;&#x662F;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#xFF0C;&#x5B83;&#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#xFF1F;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x4E0E;&#x53CD;&#x5411;&#x81EA;&#x52A8;&#x5FAE;&#x5206;&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#xFF1F;</p>
</li>
<li><p>&#x4F60;&#x80FD;&#x5217;&#x51FA;&#x6240;&#x6709;&#x53EF;&#x4EE5;&#x5728; MLP &#x4E2D;&#x8C03;&#x6574;&#x7684;&#x8D85;&#x53C2;&#x6570;&#x5417;&#xFF1F;&#x5982;&#x679C; MLP &#x4E0E;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x76F8;&#x5339;&#x914D;&#xFF0C;&#x4F60;&#x5982;&#x4F55;&#x8C03;&#x6574;&#x8FD9;&#x4E9B;&#x8D85;&#x53C2;&#x6570;&#x6765;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF1F;</p>
</li>
<li><p>&#x5728; MNIST &#x6570;&#x636E;&#x96C6;&#x4E0A;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x6DF1;&#x5C42; MLP &#x5E76;&#x67E5;&#x770B;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x8D85;&#x8FC7; 98% &#x7684;&#x7CBE;&#x5EA6;&#x3002;&#x5C31;&#x50CF;&#x5728;&#x7B2C; 9 &#x7AE0;&#x7684;&#x6700;&#x540E;&#x4E00;&#x6B21;&#x7EC3;&#x4E60;&#x4E2D;&#xFF0C;&#x5C1D;&#x8BD5;&#x6DFB;&#x52A0;&#x6240;&#x6709;&#x7684;&#x94C3;&#x58F0;&#x548C;&#x54E8;&#x5B50;&#xFF08;&#x5373;&#xFF0C;&#x4FDD;&#x5B58;&#x68C0;&#x67E5;&#x70B9;&#xFF0C;&#x5728;&#x4E2D;&#x65AD;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x6062;&#x590D;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x68C0;&#x67E5;&#x70B9;&#xFF0C;&#x6DFB;&#x52A0;&#x6458;&#x8981;&#xFF0C;&#x4F7F;&#x7528; TensorBoard &#x7ED8;&#x5236;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;&#xFF0C;&#x7B49;&#x7B49;&#xFF09;&#x3002;</p>
</li>
</ol>
<p>&#x7EC3;&#x4E60;&#x7684;&#x7B54;&#x6848;&#x8BF7;&#x53C2;&#x7167;&#x9644;&#x5F55; A</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="9.启动并运行_TensorFlow.html" class="navigation navigation-prev " aria-label="Previous page: 九、启动并运行 TensorFlow">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="11.训练深层神经网络.html" class="navigation navigation-next " aria-label="Next page: 十一、训练深层神经网络">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"十、人工神经网络介绍","level":"1.12","depth":1,"next":{"title":"十一、训练深层神经网络","level":"1.13","depth":1,"path":"docs/11.训练深层神经网络.md","ref":"docs/11.训练深层神经网络.md","articles":[]},"previous":{"title":"九、启动并运行 TensorFlow","level":"1.11","depth":1,"path":"docs/9.启动并运行_TensorFlow.md","ref":"docs/9.启动并运行_TensorFlow.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"docs/10.人工神经网络介绍.md","mtime":"2019-04-18T03:01:37.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-05-07T09:41:36.357Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

