
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>十一、训练深层神经网络 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="12.设备和服务器上的分布式_TensorFlow.html" />
    
    
    <link rel="prev" href="10.人工神经网络介绍.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Sklearn 与 TensorFlow 机器学习实用指南
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="0.前言.html">
            
                <a href="0.前言.html">
            
                    
                    零、前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="1.机器学习概览.html">
            
                <a href="1.机器学习概览.html">
            
                    
                    一、机器学习概览
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="2.一个完整的机器学习项目.html">
            
                <a href="2.一个完整的机器学习项目.html">
            
                    
                    二、一个完整的机器学习项目
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="3.分类.html">
            
                <a href="3.分类.html">
            
                    
                    三、分类
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="4.训练模型.html">
            
                <a href="4.训练模型.html">
            
                    
                    四、训练模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="5.支持向量机.html">
            
                <a href="5.支持向量机.html">
            
                    
                    五、支持向量机
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="6.决策树.html">
            
                <a href="6.决策树.html">
            
                    
                    六、决策树
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="7.集成学习和随机森林.html">
            
                <a href="7.集成学习和随机森林.html">
            
                    
                    七、集成学习和随机森林
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="8.降维.html">
            
                <a href="8.降维.html">
            
                    
                    八、降维
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="9.启动并运行_TensorFlow.html">
            
                <a href="9.启动并运行_TensorFlow.html">
            
                    
                    九、启动并运行 TensorFlow
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="10.人工神经网络介绍.html">
            
                <a href="10.人工神经网络介绍.html">
            
                    
                    十、人工神经网络介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.13" data-path="11.训练深层神经网络.html">
            
                <a href="11.训练深层神经网络.html">
            
                    
                    十一、训练深层神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="12.设备和服务器上的分布式_TensorFlow.html">
            
                <a href="12.设备和服务器上的分布式_TensorFlow.html">
            
                    
                    十二、设备和服务器上的分布式 TensorFlow
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="13.卷积神经网络.html">
            
                <a href="13.卷积神经网络.html">
            
                    
                    十三、卷积神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="14.循环神经网络.html">
            
                <a href="14.循环神经网络.html">
            
                    
                    十四、循环神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="15.自编码器.html">
            
                <a href="15.自编码器.html">
            
                    
                    十五、自编码器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="16.强化学习.html">
            
                <a href="16.强化学习.html">
            
                    
                    十六、强化学习
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="B.机器学习项目清单.html">
            
                <a href="B.机器学习项目清单.html">
            
                    
                    附录 B、机器学习项目清单
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="C.SVM_对偶问题.html">
            
                <a href="C.SVM_对偶问题.html">
            
                    
                    附录 C、SVM 对偶问题
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="D.自动微分.html">
            
                <a href="D.自动微分.html">
            
                    
                    附录 D、自动微分
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >十一、训练深层神经网络</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x5341;&#x4E00;&#x3001;&#x8BAD;&#x7EC3;&#x6DF1;&#x5C42;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;">&#x5341;&#x4E00;&#x3001;&#x8BAD;&#x7EC3;&#x6DF1;&#x5C42;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;</h1>
<blockquote>
<p>&#x8BD1;&#x8005;&#xFF1A;<a href="https://github.com/wangxupeng" target="_blank">@akonwang</a>&#x3001;<a href="https://github.com/wizardforcel" target="_blank">@&#x98DE;&#x9F99;</a></p>
<p>&#x6821;&#x5BF9;&#x8005;&#xFF1A;<a href="https://github.com/wizardforcel" target="_blank">@&#x98DE;&#x9F99;</a>&#x3001;<a href="https://github.com/zhearing" target="_blank">@ZeyuZhong</a></p>
</blockquote>
<p>&#x7B2C; 10 &#x7AE0;&#x4ECB;&#x7ECD;&#x4E86;&#x4EBA;&#x5DE5;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x5E76;&#x8BAD;&#x7EC3;&#x4E86;&#x6211;&#x4EEC;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002; &#x4F46;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x6D45;&#x7684; DNN&#xFF0C;&#x53EA;&#x6709;&#x4E24;&#x4E2A;&#x9690;&#x85CF;&#x5C42;&#x3002; &#x5982;&#x679C;&#x4F60;&#x9700;&#x8981;&#x89E3;&#x51B3;&#x975E;&#x5E38;&#x590D;&#x6742;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4F8B;&#x5982;&#x68C0;&#x6D4B;&#x9AD8;&#x5206;&#x8FA8;&#x7387;&#x56FE;&#x50CF;&#x4E2D;&#x7684;&#x6570;&#x767E;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x8BE5;&#x600E;&#x4E48;&#x529E;&#xFF1F; &#x4F60;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x8BAD;&#x7EC3;&#x66F4;&#x6DF1;&#x7684; DNN&#xFF0C;&#x4E5F;&#x8BB8;&#x6709; 10 &#x5C42;&#xFF0C;&#x6BCF;&#x5C42;&#x5305;&#x542B;&#x6570;&#x767E;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#xFF0C;&#x901A;&#x8FC7;&#x6570;&#x5341;&#x4E07;&#x4E2A;&#x8FDE;&#x63A5;&#x6765;&#x8FDE;&#x63A5;&#x3002; &#x8FD9;&#x4E0D;&#x4F1A;&#x662F;&#x95F2;&#x5EAD;&#x4FE1;&#x6B65;&#xFF1A;</p>
<ul>
<li>&#x9996;&#x5148;&#xFF0C;&#x4F60;&#x5C06;&#x9762;&#x4E34;&#x68D8;&#x624B;&#x7684;&#x68AF;&#x5EA6;&#x6D88;&#x5931;&#x95EE;&#x9898;&#xFF08;&#x6216;&#x76F8;&#x5173;&#x7684;&#x68AF;&#x5EA6;&#x7206;&#x70B8;&#x95EE;&#x9898;&#xFF09;&#xFF0C;&#x8FD9;&#x4F1A;&#x5F71;&#x54CD;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x5E76;&#x4F7F;&#x8F83;&#x4F4E;&#x5C42;&#x96BE;&#x4EE5;&#x8BAD;&#x7EC3;&#x3002;</li>
<li>&#x5176;&#x6B21;&#xFF0C;&#x5BF9;&#x4E8E;&#x5982;&#x6B64;&#x5E9E;&#x5927;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x8BAD;&#x7EC3;&#x5C06;&#x975E;&#x5E38;&#x7F13;&#x6162;&#x3002;</li>
<li>&#x7B2C;&#x4E09;&#xFF0C;&#x5177;&#x6709;&#x6570;&#x767E;&#x4E07;&#x53C2;&#x6570;&#x7684;&#x6A21;&#x578B;&#x5C06;&#x4F1A;&#x6709;&#x4E25;&#x91CD;&#x7684;&#x8FC7;&#x62DF;&#x5408;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x98CE;&#x9669;&#x3002;</li>
</ul>
<p>&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F9D;&#x6B21;&#x8BA8;&#x8BBA;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x63D0;&#x51FA;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x6280;&#x5DE7;&#x3002; &#x6211;&#x4EEC;&#x5C06;&#x4ECE;&#x89E3;&#x91CA;&#x68AF;&#x5EA6;&#x6D88;&#x5931;&#x95EE;&#x9898;&#x5F00;&#x59CB;&#xFF0C;&#x5E76;&#x63A2;&#x8BA8;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x4E00;&#x4E9B;&#x6700;&#x6D41;&#x884C;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002; &#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x770B;&#x5404;&#x79CD;&#x4F18;&#x5316;&#x5668;&#xFF0C;&#x4E0E;&#x666E;&#x901A;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x76F8;&#x6BD4;&#xFF0C;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x52A0;&#x901F;&#x5927;&#x578B;&#x6A21;&#x578B;&#x7684;&#x8BAD;&#x7EC3;&#x3002; &#x6700;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x6D4F;&#x89C8;&#x4E00;&#x4E9B;&#x6D41;&#x884C;&#x7684;&#x5927;&#x578B;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6B63;&#x5219;&#x5316;&#x6280;&#x672F;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#xFF0C;&#x4F60;&#x5C06;&#x80FD;&#x591F;&#x8BAD;&#x7EC3;&#x975E;&#x5E38;&#x6DF1;&#x7684;&#x7F51;&#x7EDC;&#xFF1A;&#x6B22;&#x8FCE;&#x6765;&#x5230;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x4E16;&#x754C;&#xFF01;</p>
<h2 id="&#x68AF;&#x5EA6;&#x6D88;&#x5931;&#x7206;&#x70B8;&#x95EE;&#x9898;">&#x68AF;&#x5EA6;&#x6D88;&#x5931;/&#x7206;&#x70B8;&#x95EE;&#x9898;</h2>
<p>&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x5728;&#x7B2C; 10 &#x7AE0;&#x4E2D;&#x6240;&#x8BA8;&#x8BBA;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x7B97;&#x6CD5;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x662F;&#x4ECE;&#x8F93;&#x51FA;&#x5C42;&#x5230;&#x8F93;&#x5165;&#x5C42;&#xFF0C;&#x4F20;&#x64AD;&#x8BEF;&#x5DEE;&#x7684;&#x68AF;&#x5EA6;&#x3002; &#x4E00;&#x65E6;&#x8BE5;&#x7B97;&#x6CD5;&#x5DF2;&#x7ECF;&#x8BA1;&#x7B97;&#x4E86;&#x7F51;&#x7EDC;&#x4E2D;&#x6BCF;&#x4E2A;&#x53C2;&#x6570;&#x7684;&#x635F;&#x5931;&#x51FD;&#x6570;&#x7684;&#x68AF;&#x5EA6;&#xFF0C;&#x5B83;&#x5C31;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x68AF;&#x5EA6;&#x6765;&#x7528;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x6B65;&#x9AA4;&#x6765;&#x66F4;&#x65B0;&#x6BCF;&#x4E2A;&#x53C2;&#x6570;&#x3002;</p>
<p>&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x68AF;&#x5EA6;&#x5F80;&#x5F80;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x5C0F;&#xFF0C;&#x968F;&#x7740;&#x7B97;&#x6CD5;&#x8FDB;&#x5C55;&#x5230;&#x8F83;&#x4F4E;&#x5C42;&#x3002; &#x7ED3;&#x679C;&#xFF0C;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x66F4;&#x65B0;&#x4F7F;&#x5F97;&#x4F4E;&#x5C42;&#x8FDE;&#x63A5;&#x6743;&#x91CD;&#x5B9E;&#x9645;&#x4E0A;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#xFF0C;&#x5E76;&#x4E14;&#x8BAD;&#x7EC3;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x6536;&#x655B;&#x5230;&#x826F;&#x597D;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002; &#x8FD9;&#x88AB;&#x79F0;&#x4E3A;&#x68AF;&#x5EA6;&#x6D88;&#x5931;&#x95EE;&#x9898;&#x3002; &#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x751F;&#x76F8;&#x53CD;&#x7684;&#x60C5;&#x51B5;&#xFF1A;&#x68AF;&#x5EA6;&#x53EF;&#x80FD;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x5927;&#xFF0C;&#x8BB8;&#x591A;&#x5C42;&#x5F97;&#x5230;&#x4E86;&#x975E;&#x5E38;&#x5927;&#x7684;&#x6743;&#x91CD;&#x66F4;&#x65B0;&#xFF0C;&#x7B97;&#x6CD5;&#x53D1;&#x6563;&#x3002;&#x8FD9;&#x662F;&#x68AF;&#x5EA6;&#x7206;&#x70B8;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5728;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x6700;&#x4E3A;&#x5E38;&#x89C1;&#xFF08;&#x89C1;&#x7B2C; 14 &#x7AE0;&#xFF09;&#x3002; &#x66F4;&#x4E00;&#x822C;&#x5730;&#x8BF4;&#xFF0C;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x53D7;&#x68AF;&#x5EA6;&#x4E0D;&#x7A33;&#x5B9A;&#x4E4B;&#x82E6;; &#x4E0D;&#x540C;&#x7684;&#x5C42;&#x6B21;&#x53EF;&#x80FD;&#x4EE5;&#x975E;&#x5E38;&#x4E0D;&#x540C;&#x7684;&#x901F;&#x5EA6;&#x5B66;&#x4E60;&#x3002;</p>
<p>&#x867D;&#x7136;&#x8FD9;&#x79CD;&#x4E0D;&#x5E78;&#x7684;&#x884C;&#x4E3A;&#x5DF2;&#x7ECF;&#x7ECF;&#x8FC7;&#x4E86;&#x76F8;&#x5F53;&#x957F;&#x7684;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x7684;&#x5B9E;&#x9A8C;&#x89C2;&#x5BDF;&#xFF08;&#x8FD9;&#x662F;&#x9020;&#x6210;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5927;&#x90E8;&#x5206;&#x65F6;&#x95F4;&#x90FD;&#x88AB;&#x629B;&#x5F03;&#x7684;&#x539F;&#x56E0;&#x4E4B;&#x4E00;&#xFF09;&#xFF0C;&#x4F46;&#x76F4;&#x5230; 2010 &#x5E74;&#x5DE6;&#x53F3;&#xFF0C;&#x4EBA;&#x4EEC;&#x624D;&#x6709;&#x4E86;&#x660E;&#x663E;&#x7684;&#x8FDB;&#x6B65;&#x3002; Xavier Glorot &#x548C; Yoshua Bengio &#x53D1;&#x8868;&#x7684;&#x9898;&#x4E3A;&#x300A;Understanding the Difficulty of Training Deep Feedforward Neural Networks&#x300B;&#x7684;&#x8BBA;&#x6587;&#x53D1;&#x73B0;&#x4E86;&#x4E00;&#x4E9B;&#x7591;&#x95EE;&#xFF0C;&#x5305;&#x62EC;&#x6D41;&#x884C;&#x7684; sigmoid &#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x548C;&#x5F53;&#x65F6;&#x6700;&#x53D7;&#x6B22;&#x8FCE;&#x7684;&#x6743;&#x91CD;&#x521D;&#x59CB;&#x5316;&#x6280;&#x672F;&#x7684;&#x7EC4;&#x5408;&#xFF0C;&#x5373;&#x968F;&#x673A;&#x521D;&#x59CB;&#x5316;&#x65F6;&#x4F7F;&#x7528;&#x5E73;&#x5747;&#x503C;&#x4E3A; 0&#xFF0C;&#x6807;&#x51C6;&#x5DEE;&#x4E3A; 1 &#x7684;&#x6B63;&#x6001;&#x5206;&#x5E03;&#x3002;&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x4ED6;&#x4EEC;&#x8868;&#x660E;&#xFF0C;&#x7528;&#x8FD9;&#x4E2A;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x548C;&#x8FD9;&#x4E2A;&#x521D;&#x59CB;&#x5316;&#x65B9;&#x6848;&#xFF0C;&#x6BCF;&#x5C42;&#x8F93;&#x51FA;&#x7684;&#x65B9;&#x5DEE;&#x8FDC;&#x5927;&#x4E8E;&#x5176;&#x8F93;&#x5165;&#x7684;&#x65B9;&#x5DEE;&#x3002;&#x7F51;&#x7EDC;&#x6B63;&#x5411;&#xFF0C;&#x6BCF;&#x5C42;&#x7684;&#x65B9;&#x5DEE;&#x6301;&#x7EED;&#x589E;&#x52A0;&#xFF0C;&#x76F4;&#x5230;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x5728;&#x9876;&#x5C42;&#x9971;&#x548C;&#x3002;&#x8FD9;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x56E0;&#x4E3A;logistic&#x51FD;&#x6570;&#x7684;&#x5E73;&#x5747;&#x503C;&#x4E3A; 0.5 &#x800C;&#x4E0D;&#x662F; 0&#xFF08;&#x53CC;&#x66F2;&#x6B63;&#x5207;&#x51FD;&#x6570;&#x7684;&#x5E73;&#x5747;&#x503C;&#x4E3A; 0&#xFF0C;&#x8868;&#x73B0;&#x7565;&#x597D;&#x4E8E;&#x6DF1;&#x5C42;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;logistic&#x51FD;&#x6570;&#xFF09;</p>
<p>&#x770B;&#x4E00;&#x4E0B;logistic &#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF08;&#x53C2;&#x89C1;&#x56FE; 11-1&#xFF09;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5F53;&#x8F93;&#x5165;&#x53D8;&#x5927;&#xFF08;&#x8D1F;&#x6216;&#x6B63;&#xFF09;&#x65F6;&#xFF0C;&#x51FD;&#x6570;&#x9971;&#x548C;&#x5728; 0 &#x6216; 1&#xFF0C;&#x5BFC;&#x6570;&#x975E;&#x5E38;&#x63A5;&#x8FD1; 0&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5F53;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x5F00;&#x59CB;&#x65F6;&#xFF0C; &#x5B83;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x68AF;&#x5EA6;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x4F20;&#x64AD;&#x56DE;&#x6765;&#xFF0C;&#x800C;&#x4E14;&#x7531;&#x4E8E;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x901A;&#x8FC7;&#x9876;&#x5C42;&#x5411;&#x4E0B;&#x4F20;&#x9012;&#xFF0C;&#x6240;&#x4EE5;&#x5B58;&#x5728;&#x7684;&#x5C0F;&#x68AF;&#x5EA6;&#x4E0D;&#x65AD;&#x5730;&#x88AB;&#x7A00;&#x91CA;&#xFF0C;&#x56E0;&#x6B64;&#x8F83;&#x4F4E;&#x5C42;&#x786E;&#x5B9E;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#x53EF;&#x7528;&#x3002;</p>
<p><img src="../images/chapter_11/11-1.png" alt=""></p>
<p>Glorot &#x548C; Bengio &#x5728;&#x4ED6;&#x4EEC;&#x7684;&#x8BBA;&#x6587;&#x4E2D;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x79CD;&#x663E;&#x8457;&#x7F13;&#x89E3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x6CD5;&#x3002; &#x6211;&#x4EEC;&#x9700;&#x8981;&#x4FE1;&#x53F7;&#x5728;&#x4E24;&#x4E2A;&#x65B9;&#x5411;&#x4E0A;&#x6B63;&#x786E;&#x5730;&#x6D41;&#x52A8;&#xFF1A;&#x5728;&#x8FDB;&#x884C;&#x9884;&#x6D4B;&#x65F6;&#x662F;&#x6B63;&#x5411;&#x7684;&#xFF0C;&#x5728;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x68AF;&#x5EA6;&#x65F6;&#x662F;&#x53CD;&#x5411;&#x7684;&#x3002; &#x6211;&#x4EEC;&#x4E0D;&#x5E0C;&#x671B;&#x4FE1;&#x53F7;&#x6D88;&#x5931;&#xFF0C;&#x4E5F;&#x4E0D;&#x5E0C;&#x671B;&#x5B83;&#x7206;&#x70B8;&#x5E76;&#x9971;&#x548C;&#x3002; &#x4E3A;&#x4E86;&#x4F7F;&#x4FE1;&#x53F7;&#x6B63;&#x786E;&#x6D41;&#x52A8;&#xFF0C;&#x4F5C;&#x8005;&#x8BA4;&#x4E3A;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x6BCF;&#x5C42;&#x8F93;&#x51FA;&#x7684;&#x65B9;&#x5DEE;&#x7B49;&#x4E8E;&#x5176;&#x8F93;&#x5165;&#x7684;&#x65B9;&#x5DEE;&#x3002;&#xFF08;&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x4E2A;&#x6BD4;&#x55BB;&#xFF1A;&#x5982;&#x679C;&#x5C06;&#x9EA6;&#x514B;&#x98CE;&#x653E;&#x5927;&#x5668;&#x7684;&#x65CB;&#x94AE;&#x8BBE;&#x7F6E;&#x5F97;&#x592A;&#x63A5;&#x8FD1;&#x4E8E;&#x96F6;&#xFF0C;&#x4EBA;&#x4EEC;&#x542C;&#x4E0D;&#x5230;&#x58F0;&#x97F3;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x5C06;&#x9EA6;&#x514B;&#x98CE;&#x653E;&#x5927;&#x5668;&#x8BBE;&#x7F6E;&#x5F97;&#x592A;&#x5927;&#xFF0C;&#x58F0;&#x97F3;&#x5C31;&#x4F1A;&#x9971;&#x548C;&#xFF0C;&#x4EBA;&#x4EEC;&#x5C31;&#x4F1A;&#x542C;&#x4E0D;&#x61C2;&#x4F60;&#x5728;&#x8BF4;&#x4EC0;&#x4E48;&#x3002; &#x73B0;&#x5728;&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x653E;&#x5927;&#x5668;&#x7684;&#x94FE;&#x6761;&#xFF1A;&#x5B83;&#x4EEC;&#x90FD;&#x9700;&#x8981;&#x6B63;&#x786E;&#x8BBE;&#x7F6E;&#xFF0C;&#x4EE5;&#x4FBF;&#x5728;&#x94FE;&#x6761;&#x7684;&#x672B;&#x7AEF;&#x54CD;&#x4EAE;&#x800C;&#x6E05;&#x6670;&#x5730;&#x53D1;&#x51FA;&#x58F0;&#x97F3;&#x3002; &#x4F60;&#x7684;&#x58F0;&#x97F3;&#x5FC5;&#x987B;&#x4EE5;&#x6BCF;&#x4E2A;&#x653E;&#x5927;&#x5668;&#x7684;&#x632F;&#x5E45;&#x76F8;&#x540C;&#x7684;&#x5E45;&#x5EA6;&#x51FA;&#x6765;&#x3002;&#xFF09;&#x800C;&#x4E14;&#x6211;&#x4EEC;&#x4E5F;&#x9700;&#x8981;&#x68AF;&#x5EA6;&#x5728;&#x76F8;&#x53CD;&#x65B9;&#x5411;&#x4E0A;&#x6D41;&#x8FC7;&#x4E00;&#x5C42;&#x4E4B;&#x524D;&#x548C;&#x4E4B;&#x540E;&#x6709;&#x76F8;&#x540C;&#x7684;&#x65B9;&#x5DEE;&#xFF08;&#x5982;&#x679C;&#x60A8;&#x5BF9;&#x6570;&#x5B66;&#x7EC6;&#x8282;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x8BF7;&#x67E5;&#x9605;&#x8BBA;&#x6587;&#xFF09;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#x4E0D;&#x53EF;&#x80FD;&#x4FDD;&#x8BC1;&#x4E24;&#x8005;&#x90FD;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x9664;&#x975E;&#x8FD9;&#x4E2A;&#x5C42;&#x5177;&#x6709;&#x76F8;&#x540C;&#x6570;&#x91CF;&#x7684;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x8FDE;&#x63A5;&#xFF0C;&#x4F46;&#x662F;&#x4ED6;&#x4EEC;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x6298;&#x8877;&#x529E;&#x6CD5;&#xFF0C;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x8BC1;&#x660E;&#x8FD9;&#x4E2A;&#x6298;&#x4E2D;&#x529E;&#x6CD5;&#x975E;&#x5E38;&#x597D;&#xFF1A;&#x968F;&#x673A;&#x521D;&#x59CB;&#x5316;&#x8FDE;&#x63A5;&#x6743;&#x91CD;&#x5FC5;&#x987B;&#x5982;&#x516C;&#x5F0F; 11-1 &#x6240;&#x63CF;&#x8FF0;&#x7684;&#x90A3;&#x6837;&#x3002;&#x5176;&#x4E2D;<code>n_inputs</code>&#x548C;<code>n_outputs</code>&#x662F;&#x6743;&#x91CD;&#x6B63;&#x5728;&#x88AB;&#x521D;&#x59CB;&#x5316;&#x7684;&#x5C42;&#xFF08;&#x4E5F;&#x79F0;&#x4E3A;&#x6247;&#x5165;&#x548C;&#x6247;&#x51FA;&#xFF09;&#x7684;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x8FDE;&#x63A5;&#x7684;&#x6570;&#x91CF;&#x3002; &#x8FD9;&#x79CD;&#x521D;&#x59CB;&#x5316;&#x7B56;&#x7565;&#x901A;&#x5E38;&#x88AB;&#x79F0;&#x4E3A;Xavier&#x521D;&#x59CB;&#x5316;&#xFF08;&#x5728;&#x4F5C;&#x8005;&#x7684;&#x540D;&#x5B57;&#x4E4B;&#x540E;&#xFF09;&#xFF0C;&#x6216;&#x8005;&#x6709;&#x65F6;&#x662F; Glorot &#x521D;&#x59CB;&#x5316;&#x3002;</p>
<p><img src="../images/chapter_11/e-11-1.jpg" alt=""></p>
<p>&#x5F53;&#x8F93;&#x5165;&#x8FDE;&#x63A5;&#x7684;&#x6570;&#x91CF;&#x5927;&#x81F4;&#x7B49;&#x4E8E;&#x8F93;&#x51FA;&#x8FDE;&#x63A5;&#x7684;&#x6570;&#x91CF;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x7B49;&#x5F0F; <img src="../images/chapter_11/o-11-1.jpg" alt=""> &#x6211;&#x4EEC;&#x5728;&#x7B2C; 10 &#x7AE0;&#x4E2D;&#x4F7F;&#x7528;&#x4E86;&#x8FD9;&#x4E2A;&#x7B80;&#x5316;&#x7684;&#x7B56;&#x7565;&#x3002;</p>
<p>&#x4F7F;&#x7528; Xavier &#x521D;&#x59CB;&#x5316;&#x7B56;&#x7565;&#x53EF;&#x4EE5;&#x5927;&#x5927;&#x52A0;&#x5FEB;&#x8BAD;&#x7EC3;&#x901F;&#x5EA6;&#xFF0C;&#x8FD9;&#x662F;&#x5BFC;&#x81F4;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x76EE;&#x524D;&#x53D6;&#x5F97;&#x6210;&#x529F;&#x7684;&#x6280;&#x5DE7;&#x4E4B;&#x4E00;&#x3002; &#x6700;&#x8FD1;&#x7684;&#x4E00;&#x4E9B;&#x8BBA;&#x6587;&#x9488;&#x5BF9;&#x4E0D;&#x540C;&#x7684;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x63D0;&#x4F9B;&#x4E86;&#x7C7B;&#x4F3C;&#x7684;&#x7B56;&#x7565;&#xFF0C;&#x5982;&#x8868; 11-1 &#x6240;&#x793A;&#x3002; ReLU &#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF08;&#x53CA;&#x5176;&#x53D8;&#x4F53;&#xFF0C;&#x5305;&#x62EC;&#x7B80;&#x79F0; ELU &#x6FC0;&#x6D3B;&#xFF09;&#x7684;&#x521D;&#x59CB;&#x5316;&#x7B56;&#x7565;&#x6709;&#x65F6;&#x79F0;&#x4E3A; He &#x521D;&#x59CB;&#x5316;&#xFF08;&#x5728;&#x5176;&#x4F5C;&#x8005;&#x7684;&#x59D3;&#x6C0F;&#x4E4B;&#x540E;&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_11/t-11-1.jpg" alt=""></p>
<p>&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;<code>fully_connected()</code>&#x51FD;&#x6570;&#xFF08;&#x5728;&#x7B2C; 10 &#x7AE0;&#x4E2D;&#x4ECB;&#x7ECD;&#xFF09;&#x4F7F;&#x7528; Xavier &#x521D;&#x59CB;&#x5316;&#xFF08;&#x5177;&#x6709;&#x7EDF;&#x4E00;&#x7684;&#x5206;&#x5E03;&#xFF09;&#x3002; &#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x5982;&#x4E0B;&#x6240;&#x793A;&#x7684;<code>variance_scaling_initializer()</code>&#x51FD;&#x6570;&#x6765;&#x5C06;&#x5176;&#x66F4;&#x6539;&#x4E3A; He &#x521D;&#x59CB;&#x5316;&#xFF1A;</p>
<p>&#x6CE8;&#x610F;&#xFF1A;&#x672C;&#x4E66;&#x4F7F;&#x7528;<code>tensorflow.contrib.layers.fully_connected()</code>&#x800C;&#x4E0D;&#x662F;<code>tf.layers.dense()</code>&#xFF08;&#x672C;&#x7AE0;&#x7F16;&#x5199;&#x65F6;&#x4E0D;&#x5B58;&#x5728;&#xFF09;&#x3002; &#x73B0;&#x5728;&#x6700;&#x597D;&#x4F7F;&#x7528;<code>tf.layers.dense()</code>&#xFF0C;&#x56E0;&#x4E3A;<code>contrib</code>&#x6A21;&#x5757;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x5185;&#x5BB9;&#x53EF;&#x80FD;&#x4F1A;&#x66F4;&#x6539;&#x6216;&#x5220;&#x9664;&#xFF0C;&#x6055;&#x4E0D;&#x53E6;&#x884C;&#x901A;&#x77E5;&#x3002; <code>dense()</code>&#x51FD;&#x6570;&#x51E0;&#x4E4E;&#x4E0E;<code>fully_connected()</code>&#x51FD;&#x6570;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x3002; &#x4E0E;&#x672C;&#x7AE0;&#x6709;&#x5173;&#x7684;&#x4E3B;&#x8981;&#x5DEE;&#x5F02;&#x662F;&#xFF1A;</p>
<p>&#x51E0;&#x4E2A;&#x53C2;&#x6570;&#x88AB;&#x91CD;&#x65B0;&#x547D;&#x540D;&#xFF1A;&#x8303;&#x56F4;&#x53D8;&#x6210;&#x540D;&#x5B57;&#xFF0C;<code>activation_fn</code>&#x53D8;&#x6210;&#x6FC0;&#x6D3B;&#xFF08;&#x7C7B;&#x4F3C;&#x5730;&#xFF0C;<code>_fn</code>&#x540E;&#x7F00;&#x4ECE;&#x8BF8;&#x5982;<code>normalizer_fn</code>&#x4E4B;&#x7C7B;&#x7684;&#x5176;&#x4ED6;&#x53C2;&#x6570;&#x4E2D;&#x79FB;&#x9664;&#xFF09;&#xFF0C;<code>weights_initializer</code>&#x53D8;&#x6210;<code>kernel_initializer</code>&#x7B49;&#x7B49;&#x3002;&#x9ED8;&#x8BA4;&#x6FC0;&#x6D3B;&#x73B0;&#x5728;&#x662F;<code>None</code>&#xFF0C;&#x800C;&#x4E0D;&#x662F;<code>tf.nn.relu</code>&#x3002; &#x5B83;&#x4E0D;&#x652F;&#x6301;<code>tensorflow.contrib.framework.arg_scope()</code>&#xFF08;&#x7A0D;&#x540E;&#x5728;&#x7B2C; 11 &#x7AE0;&#x4E2D;&#x4ECB;&#x7ECD;&#xFF09;&#x3002; &#x5B83;&#x4E0D;&#x652F;&#x6301;&#x6B63;&#x5219;&#x5316;&#x7684;&#x53C2;&#x6570;&#xFF08;&#x7A0D;&#x540E;&#x5728;&#x7B2C; 11 &#x7AE0;&#x4ECB;&#x7ECD;&#xFF09;&#x3002;</p>
<pre><code class="lang-py">he_init = tf.contrib.layers.variance_scaling_initializer()
hidden1 = tf.layers.dense(X, n_hidden1, activation=tf.nn.relu,
                          kernel_initializer=he_init, name=<span class="hljs-string">&quot;hidden1&quot;</span>)
</code></pre>
<p> He &#x521D;&#x59CB;&#x5316;&#x53EA;&#x8003;&#x8651;&#x4E86;&#x6247;&#x5165;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x50CF; Xavier &#x521D;&#x59CB;&#x5316;&#x90A3;&#x6837;&#x6247;&#x5165;&#x548C;&#x6247;&#x51FA;&#x4E4B;&#x95F4;&#x7684;&#x5E73;&#x5747;&#x503C;&#x3002; &#x8FD9;&#x4E5F;&#x662F;<code>variance_scaling_initializer()</code>&#x51FD;&#x6570;&#x7684;&#x9ED8;&#x8BA4;&#x503C;&#xFF0C;&#x4F46;&#x60A8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8BBE;&#x7F6E;&#x53C2;&#x6570;<code>mode =&quot;FAN_AVG&quot;</code>&#x6765;&#x66F4;&#x6539;&#x5B83;&#x3002;</p>
<h2 id="&#x975E;&#x9971;&#x548C;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;">&#x975E;&#x9971;&#x548C;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;</h2>
<p>Glorot &#x548C; Bengio &#x5728; 2010 &#x5E74;&#x7684;&#x8BBA;&#x6587;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x89C1;&#x89E3;&#x662F;&#xFF0C;&#x6D88;&#x5931;/&#x7206;&#x70B8;&#x7684;&#x68AF;&#x5EA6;&#x95EE;&#x9898;&#x90E8;&#x5206;&#x662F;&#x7531;&#x4E8E;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x7684;&#x9009;&#x62E9;&#x4E0D;&#x597D;&#x9020;&#x6210;&#x7684;&#x3002; &#x5728;&#x90A3;&#x4E4B;&#x524D;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x90FD;&#x8BA4;&#x4E3A;&#xFF0C;&#x5982;&#x679C;&#x5927;&#x81EA;&#x7136;&#x9009;&#x62E9;&#x5728;&#x751F;&#x7269;&#x795E;&#x7ECF;&#x5143;&#x4E2D;&#x4F7F;&#x7528; sigmoid &#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF0C;&#x5B83;&#x4EEC;&#x5FC5;&#x5B9A;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x9009;&#x62E9;&#x3002; &#x4F46;&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#xFF0C;&#x5176;&#x4ED6;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x5728;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x8868;&#x73B0;&#x5F97;&#x66F4;&#x597D;&#xFF0C;&#x7279;&#x522B;&#x662F; ReLU &#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x5BF9;&#x6B63;&#x503C;&#x4E0D;&#x4F1A;&#x9971;&#x548C;&#xFF08;&#x4E5F;&#x56E0;&#x4E3A;&#x5B83;&#x7684;&#x8BA1;&#x7B97;&#x901F;&#x5EA6;&#x5F88;&#x5FEB;&#xFF09;&#x3002;</p>
<p>&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;ReLU&#x6FC0;&#x6D3B;&#x529F;&#x80FD;&#x5E76;&#x4E0D;&#x5B8C;&#x7F8E;&#x3002; &#x5B83;&#x6709;&#x4E00;&#x4E2A;&#x88AB;&#x79F0;&#x4E3A; &#x201C;ReLU &#x6B7B;&#x533A;&#x201D; &#x7684;&#x95EE;&#x9898;&#xFF1A;&#x5728;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4E00;&#x4E9B;&#x795E;&#x7ECF;&#x5143;&#x6709;&#x6548;&#x5730;&#x6B7B;&#x4EA1;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x5B83;&#x4EEC;&#x505C;&#x6B62;&#x8F93;&#x51FA; 0 &#x4EE5;&#x5916;&#x7684;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#x3002;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x73B0;&#x4F60;&#x7F51;&#x7EDC;&#x7684;&#x4E00;&#x534A;&#x795E;&#x7ECF;&#x5143;&#x5DF2;&#x7ECF;&#x6B7B;&#x4EA1;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;&#x5927;&#x5B66;&#x4E60;&#x7387;&#x3002; &#x5728;&#x8BAD;&#x7EC3;&#x671F;&#x95F4;&#xFF0C;&#x5982;&#x679C;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x6743;&#x91CD;&#x5F97;&#x5230;&#x66F4;&#x65B0;&#xFF0C;&#x4F7F;&#x5F97;&#x795E;&#x7ECF;&#x5143;&#x8F93;&#x5165;&#x7684;&#x52A0;&#x6743;&#x548C;&#x4E3A;&#x8D1F;&#xFF0C;&#x5219;&#x5B83;&#x5C06;&#x5F00;&#x59CB;&#x8F93;&#x51FA; 0 &#x3002;&#x5F53;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x53D1;&#x751F;&#x65F6;&#xFF0C;&#x7531;&#x4E8E;&#x5F53;&#x8F93;&#x5165;&#x4E3A;&#x8D1F;&#x65F6;&#xFF0C;ReLU&#x51FD;&#x6570;&#x7684;&#x68AF;&#x5EA6;&#x4E3A;0&#xFF0C;&#x795E;&#x7ECF;&#x5143;&#x4E0D;&#x53EF;&#x80FD;&#x6062;&#x590D;&#x751F;&#x673A;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x4F7F;&#x7528; ReLU &#x51FD;&#x6570;&#x7684;&#x4E00;&#x4E2A;&#x53D8;&#x4F53;&#xFF0C;&#x6BD4;&#x5982; leaky ReLU&#x3002;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x4E3A;<code>LeakyReLU&#x3B1;(z)= max(&#x3B1;z&#xFF0C;z)</code>&#xFF08;&#x89C1;&#x56FE; 11-2&#xFF09;&#x3002;&#x8D85;&#x53C2;&#x6570;<code>&#x3B1;</code>&#x5B9A;&#x4E49;&#x4E86;&#x51FD;&#x6570;&#x201C;leaks&#x201D;&#x7684;&#x7A0B;&#x5EA6;&#xFF1A;&#x5B83;&#x662F;<code>z &lt; 0</code>&#x65F6;&#x51FD;&#x6570;&#x7684;&#x659C;&#x7387;&#xFF0C;&#x901A;&#x5E38;&#x8BBE;&#x7F6E;&#x4E3A; 0.01&#x3002;&#x8FD9;&#x4E2A;&#x5C0F;&#x659C;&#x5761;&#x786E;&#x4FDD; leaky ReLU &#x6C38;&#x4E0D;&#x6B7B;&#x4EA1;&#xFF1B;&#x4ED6;&#x4EEC;&#x53EF;&#x80FD;&#x4F1A;&#x957F;&#x671F;&#x660F;&#x8FF7;&#xFF0C;&#x4F46;&#x4ED6;&#x4EEC;&#x6709;&#x673A;&#x4F1A;&#x6700;&#x7EC8;&#x9192;&#x6765;&#x3002;&#x6700;&#x8FD1;&#x7684;&#x4E00;&#x7BC7;&#x8BBA;&#x6587;&#x6BD4;&#x8F83;&#x4E86;&#x51E0;&#x79CD; ReLU &#x6FC0;&#x6D3B;&#x529F;&#x80FD;&#x7684;&#x53D8;&#x4F53;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x7ED3;&#x8BBA;&#x662F; leaky Relu &#x603B;&#x662F;&#x4F18;&#x4E8E;&#x4E25;&#x683C;&#x7684; ReLU &#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x8BBE;&#x5B9A;<code>&#x3B1;= 0.2</code>&#xFF08;&#x5DE8;&#x5927; leak&#xFF09;&#x4F3C;&#x4E4E;&#x5BFC;&#x81F4;&#x6BD4;<code>&#x3B1;= 0.01</code>&#xFF08;&#x5C0F; leak&#xFF09;&#x66F4;&#x597D;&#x7684;&#x6027;&#x80FD;&#x3002;&#x4ED6;&#x4EEC;&#x8FD8;&#x8BC4;&#x4F30;&#x4E86;&#x968F;&#x673A;&#x5316; leaky ReLU&#xFF08;RReLU&#xFF09;&#xFF0C;&#x5176;&#x4E2D;<code>&#x3B1;</code>&#x5728;&#x8BAD;&#x7EC3;&#x671F;&#x95F4;&#x5728;&#x7ED9;&#x5B9A;&#x8303;&#x56F4;&#x5185;&#x968F;&#x673A;&#x6311;&#x9009;&#xFF0C;&#x5E76;&#x5728;&#x6D4B;&#x8BD5;&#x671F;&#x95F4;&#x56FA;&#x5B9A;&#x4E3A;&#x5E73;&#x5747;&#x503C;&#x3002;&#x5B83;&#x8868;&#x73B0;&#x76F8;&#x5F53;&#x597D;&#xFF0C;&#x4F3C;&#x4E4E;&#x662F;&#x4E00;&#x4E2A;&#x6B63;&#x5219;&#x9879;&#xFF08;&#x51CF;&#x5C11;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x8FC7;&#x62DF;&#x5408;&#x98CE;&#x9669;&#xFF09;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x4ED6;&#x4EEC;&#x8FD8;&#x8BC4;&#x4F30;&#x4E86;&#x53C2;&#x6570; leaky ReLU&#xFF08;PReLU&#xFF09;&#xFF0C;&#x5176;&#x4E2D;<code>&#x3B1;</code>&#x88AB;&#x6388;&#x6743;&#x5728;&#x8BAD;&#x7EC3;&#x671F;&#x95F4;&#x88AB;&#x5B66;&#x4E60;&#xFF08;&#x800C;&#x4E0D;&#x662F;&#x8D85;&#x53C2;&#x6570;&#xFF0C;&#x5B83;&#x53D8;&#x6210;&#x53EF;&#x4EE5;&#x50CF;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x53C2;&#x6570;&#x4E00;&#x6837;&#x88AB;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x4FEE;&#x6539;&#x7684;&#x53C2;&#x6570;&#xFF09;&#x3002;&#x636E;&#x62A5;&#x9053;&#x8FD9;&#x5728;&#x5927;&#x578B;&#x56FE;&#x50CF;&#x6570;&#x636E;&#x96C6;&#x4E0A;&#x7684;&#x8868;&#x73B0;&#x5F3A;&#x4E8E; ReLU&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x8F83;&#x5C0F;&#x7684;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x5176;&#x5177;&#x6709;&#x8FC7;&#x5EA6;&#x62DF;&#x5408;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x98CE;&#x9669;&#x3002;</p>
<p><img src="../images/chapter_11/11-2.png" alt=""></p>
<p>&#x6700;&#x540E;&#xFF0C;Djork-Arn&#xE9; Clevert &#x7B49;&#x4EBA;&#x5728; 2015 &#x5E74;&#x7684;&#x4E00;&#x7BC7;&#x8BBA;&#x6587;&#x4E2D;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x79CD;&#x79F0;&#x4E3A;&#x6307;&#x6570;&#x7EBF;&#x6027;&#x5355;&#x5143;&#xFF08;exponential linear unit&#xFF0C;ELU&#xFF09;&#x7684;&#x65B0;&#x7684;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF0C;&#x5728;&#x4ED6;&#x4EEC;&#x7684;&#x5B9E;&#x9A8C;&#x4E2D;&#x8868;&#x73B0;&#x4F18;&#x4E8E;&#x6240;&#x6709;&#x7684; ReLU &#x53D8;&#x4F53;&#xFF1A;&#x8BAD;&#x7EC3;&#x65F6;&#x95F4;&#x51CF;&#x5C11;&#xFF0C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5728;&#x6D4B;&#x8BD5;&#x96C6;&#x4E0A;&#x8868;&#x73B0;&#x7684;&#x66F4;&#x597D;&#x3002; &#x5982;&#x56FE; 11-3 &#x6240;&#x793A;&#xFF0C;&#x516C;&#x5F0F; 11-2 &#x7ED9;&#x51FA;&#x4E86;&#x5B83;&#x7684;&#x5B9A;&#x4E49;&#x3002;</p>
<p><img src="../images/chapter_11/e-11-2.png" alt=""></p>
<p>&#x5B83;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x50CF; ReLU &#x51FD;&#x6570;&#xFF0C;&#x4F46;&#x6709;&#x4E00;&#x4E9B;&#x533A;&#x522B;&#xFF0C;&#x4E3B;&#x8981;&#x533A;&#x522B;&#x5728;&#x4E8E;&#xFF1A;</p>
<ul>
<li>&#x9996;&#x5148;&#x5B83;&#x5728;<code>z &lt; 0</code>&#x65F6;&#x53D6;&#x8D1F;&#x503C;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x8BE5;&#x5355;&#x5143;&#x7684;&#x5E73;&#x5747;&#x8F93;&#x51FA;&#x63A5;&#x8FD1;&#x4E8E; 0&#x3002;&#x8FD9;&#x6709;&#x52A9;&#x4E8E;&#x51CF;&#x8F7B;&#x68AF;&#x5EA6;&#x6D88;&#x5931;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x524D;&#x6240;&#x8FF0;&#x3002; &#x8D85;&#x53C2;&#x6570;<code>&#x3B1;</code>&#x5B9A;&#x4E49;&#x4E3A;&#x5F53;<code>z</code>&#x662F;&#x4E00;&#x4E2A;&#x5927;&#x7684;&#x8D1F;&#x6570;&#x65F6;&#xFF0C;ELU &#x51FD;&#x6570;&#x63A5;&#x8FD1;&#x7684;&#x503C;&#x3002;&#x5B83;&#x901A;&#x5E38;&#x8BBE;&#x7F6E;&#x4E3A; 1&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x4F60;&#x613F;&#x610F;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x50CF;&#x8C03;&#x6574;&#x5176;&#x4ED6;&#x8D85;&#x53C2;&#x6570;&#x4E00;&#x6837;&#x8C03;&#x6574;&#x5B83;&#x3002;</li>
<li>&#x5176;&#x6B21;&#xFF0C;&#x5B83;&#x5BF9;<code>z &lt; 0</code>&#x6709;&#x4E00;&#x4E2A;&#x975E;&#x96F6;&#x7684;&#x68AF;&#x5EA6;&#xFF0C;&#x907F;&#x514D;&#x4E86;&#x795E;&#x7ECF;&#x5143;&#x6B7B;&#x4EA1;&#x7684;&#x95EE;&#x9898;&#x3002;</li>
<li>&#x7B2C;&#x4E09;&#xFF0C;&#x51FD;&#x6570;&#x5728;&#x4EFB;&#x4F55;&#x5730;&#x65B9;&#x90FD;&#x662F;&#x5E73;&#x6ED1;&#x7684;&#xFF0C;&#x5305;&#x62EC;<code>z = 0</code>&#x5DE6;&#x53F3;&#xFF0C;&#x8FD9;&#x6709;&#x52A9;&#x4E8E;&#x52A0;&#x901F;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4E0D;&#x4F1A;&#x5F39;&#x56DE;<code>z = 0</code>&#x7684;&#x5DE6;&#x4FA7;&#x548C;&#x53F3;&#x4FA7;&#x3002;</li>
</ul>
<p>ELU &#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x7684;&#x4E3B;&#x8981;&#x7F3A;&#x70B9;&#x662F;&#x8BA1;&#x7B97;&#x901F;&#x5EA6;&#x6162;&#x4E8E; ReLU &#x53CA;&#x5176;&#x53D8;&#x4F53;&#xFF08;&#x7531;&#x4E8E;&#x4F7F;&#x7528;&#x6307;&#x6570;&#x51FD;&#x6570;&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x8FD9;&#x662F;&#x901A;&#x8FC7;&#x66F4;&#x5FEB;&#x7684;&#x6536;&#x655B;&#x901F;&#x5EA6;&#x6765;&#x8865;&#x507F;&#x7684;&#x3002; &#x7136;&#x800C;&#xFF0C;&#x5728;&#x6D4B;&#x8BD5;&#x65F6;&#x95F4;&#xFF0C;ELU &#x7F51;&#x7EDC;&#x5C06;&#x6BD4; ReLU &#x7F51;&#x7EDC;&#x6162;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x4F60;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x54EA;&#x4E2A;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x6765;&#x5904;&#x7406;&#x6DF1;&#x5C42;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x9690;&#x85CF;&#x5C42;&#xFF1F; &#x867D;&#x7136;&#x4F60;&#x7684;&#x91CC;&#x7A0B;&#x4F1A;&#x6709;&#x6240;&#x4E0D;&#x540C;&#xFF0C;&#x4E00;&#x822C; ELU &gt; leaky ReLU&#xFF08;&#x53CA;&#x5176;&#x53D8;&#x4F53;&#xFF09;&gt; ReLU &gt; tanh &gt; sigmoid&#x3002; &#x5982;&#x679C;&#x60A8;&#x5173;&#x5FC3;&#x8FD0;&#x884C;&#x65F6;&#x6027;&#x80FD;&#xFF0C;&#x90A3;&#x4E48;&#x60A8;&#x53EF;&#x80FD;&#x559C;&#x6B22; leaky ReLU&#x8D85;&#x8FC7;ELU&#x3002; &#x5982;&#x679C;&#x4F60;&#x4E0D;&#x60F3;&#x8C03;&#x6574;&#x53E6;&#x4E00;&#x4E2A;&#x8D85;&#x53C2;&#x6570;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x524D;&#x9762;&#x63D0;&#x5230;&#x7684;&#x9ED8;&#x8BA4;&#x7684;<code>&#x3B1;</code>&#x503C;&#xFF08;leaky ReLU &#x4E3A; 0.01&#xFF0C;ELU &#x4E3A; 1&#xFF09;&#x3002; &#x5982;&#x679C;&#x60A8;&#x6709;&#x5145;&#x8DB3;&#x7684;&#x65F6;&#x95F4;&#x548C;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x6765;&#x8BC4;&#x4F30;&#x5176;&#x4ED6;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5982;&#x679C;&#x60A8;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8FC7;&#x62DF;&#x5408;&#xFF0C;&#x5219;&#x4E3A;RReLU; &#x5982;&#x679C;&#x60A8;&#x62E5;&#x6709;&#x5E9E;&#x5927;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x5219;&#x4E3A; PReLU&#x3002;</p>
<p>TensorFlow &#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x5EFA;&#x7ACB;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;<code>elu()</code>&#x51FD;&#x6570;&#x3002; &#x8C03;&#x7528;<code>fully_connected()</code>&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x53EA;&#x9700;&#x8BBE;&#x7F6E;<code>activation_fn</code>&#x53C2;&#x6570;&#x5373;&#x53EF;&#xFF1A;</p>
<pre><code class="lang-py">hidden1 = tf.layers.dense(X, n_hidden1, activation=tf.nn.elu, name=<span class="hljs-string">&quot;hidden1&quot;</span>)
</code></pre>
<p>TensorFlow &#x6CA1;&#x6709;&#x9488;&#x5BF9; leaky ReLU &#x7684;&#x9884;&#x5B9A;&#x4E49;&#x51FD;&#x6570;&#xFF0C;&#x4F46;&#x662F;&#x5F88;&#x5BB9;&#x6613;&#x5B9A;&#x4E49;&#xFF1A;</p>
<pre><code class="lang-py"><span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">leaky_relu</span><span class="hljs-params">(z, name=None)</span>:</span>
    <span class="hljs-keyword">return</span> tf.maximum(<span class="hljs-number">0.01</span> * z, z, name=name)

hidden1 = tf.layers.dense(X, n_hidden1, activation=leaky_relu, name=<span class="hljs-string">&quot;hidden1&quot;</span>)
</code></pre>
<h2 id="&#x6279;&#x91CF;&#x6807;&#x51C6;&#x5316;">&#x6279;&#x91CF;&#x6807;&#x51C6;&#x5316;</h2>
<p>&#x5C3D;&#x7BA1;&#x4F7F;&#x7528; He&#x521D;&#x59CB;&#x5316;&#x548C; ELU&#xFF08;&#x6216;&#x4EFB;&#x4F55; ReLU &#x53D8;&#x4F53;&#xFF09;&#x53EF;&#x4EE5;&#x663E;&#x8457;&#x51CF;&#x5C11;&#x8BAD;&#x7EC3;&#x5F00;&#x59CB;&#x9636;&#x6BB5;&#x7684;&#x68AF;&#x5EA6;&#x6D88;&#x5931;/&#x7206;&#x70B8;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x4E0D;&#x4FDD;&#x8BC1;&#x5728;&#x8BAD;&#x7EC3;&#x671F;&#x95F4;&#x95EE;&#x9898;&#x4E0D;&#x4F1A;&#x56DE;&#x6765;&#x3002;</p>
<p>&#x5728; 2015 &#x5E74;&#x7684;&#x4E00;&#x7BC7;&#x8BBA;&#x6587;&#x4E2D;&#xFF0C;Sergey Ioffe &#x548C; Christian Szegedy &#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x79CD;&#x79F0;&#x4E3A;&#x6279;&#x91CF;&#x6807;&#x51C6;&#x5316;&#xFF08;Batch Normalization&#xFF0C;BN&#xFF09;&#x7684;&#x6280;&#x672F;&#x6765;&#x89E3;&#x51B3;&#x68AF;&#x5EA6;&#x6D88;&#x5931;/&#x7206;&#x70B8;&#x95EE;&#x9898;&#xFF0C;&#x6BCF;&#x5C42;&#x8F93;&#x5165;&#x7684;&#x5206;&#x5E03;&#x5728;&#x8BAD;&#x7EC3;&#x671F;&#x95F4;&#x6539;&#x53D8;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x66F4;&#x666E;&#x904D;&#x7684;&#x95EE;&#x9898;&#x662F;&#x5F53;&#x524D;&#x4E00;&#x5C42;&#x7684;&#x53C2;&#x6570;&#x6539;&#x53D8;&#xFF0C;&#x6BCF;&#x5C42;&#x8F93;&#x5165;&#x7684;&#x5206;&#x5E03;&#x4F1A;&#x5728;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#x4E2D;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF08;&#x4ED6;&#x4EEC;&#x79F0;&#x4E4B;&#x4E3A;&#x5185;&#x90E8;&#x534F;&#x53D8;&#x91CF;&#x504F;&#x79FB;&#x95EE;&#x9898;&#xFF09;&#x3002;</p>
<p>&#x8BE5;&#x6280;&#x672F;&#x5305;&#x62EC;&#x5728;&#x6BCF;&#x5C42;&#x7684;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x4E4B;&#x524D;&#x5728;&#x6A21;&#x578B;&#x4E2D;&#x6DFB;&#x52A0;&#x64CD;&#x4F5C;&#xFF0C;&#x7B80;&#x5355;&#x5730;&#x5BF9;&#x8F93;&#x5165;&#x8FDB;&#x884C;zero-centering&#x548C;&#x89C4;&#x8303;&#x5316;&#xFF0C;&#x7136;&#x540E;&#x6BCF;&#x5C42;&#x4F7F;&#x7528;&#x4E24;&#x4E2A;&#x65B0;&#x53C2;&#x6570;&#xFF08;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x5C3A;&#x5EA6;&#x53D8;&#x6362;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x504F;&#x79FB;&#xFF09;&#x5BF9;&#x7ED3;&#x679C;&#x8FDB;&#x884C;&#x5C3A;&#x5EA6;&#x53D8;&#x6362;&#x548C;&#x504F;&#x79FB;&#x3002; &#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E2A;&#x64CD;&#x4F5C;&#x53EF;&#x4EE5;&#x8BA9;&#x6A21;&#x578B;&#x5B66;&#x4E60;&#x5230;&#x6BCF;&#x5C42;&#x8F93;&#x5165;&#x503C;&#x7684;&#x6700;&#x4F73;&#x5C3A;&#x5EA6;,&#x5747;&#x503C;&#x3002;&#x4E3A;&#x4E86;&#x5BF9;&#x8F93;&#x5165;&#x8FDB;&#x884C;&#x5F52;&#x96F6;&#x548C;&#x5F52;&#x4E00;&#x5316;&#xFF0C;&#x7B97;&#x6CD5;&#x9700;&#x8981;&#x4F30;&#x8BA1;&#x8F93;&#x5165;&#x7684;&#x5747;&#x503C;&#x548C;&#x6807;&#x51C6;&#x5DEE;&#x3002; &#x5B83;&#x901A;&#x8FC7;&#x8BC4;&#x4F30;&#x5F53;&#x524D;&#x5C0F;&#x6279;&#x91CF;&#x8F93;&#x5165;&#x7684;&#x5747;&#x503C;&#x548C;&#x6807;&#x51C6;&#x5DEE;&#xFF08;&#x56E0;&#x6B64;&#x547D;&#x540D;&#x4E3A;&#x201C;&#x6279;&#x91CF;&#x6807;&#x51C6;&#x5316;&#x201D;&#xFF09;&#x6765;&#x5B9E;&#x73B0;&#x3002; &#x6574;&#x4E2A;&#x64CD;&#x4F5C;&#x5728;&#x65B9;&#x7A0B; 11-3 &#x4E2D;&#x3002;</p>
<p><img src="../images/chapter_11/e-11-3.png" alt=""></p>
<p><img src="../images/tex-4b7a4c54b57c9297141ab648398f6dfc.gif" alt="\mu_B"> &#x662F;&#x6574;&#x4E2A;&#x5C0F;&#x6279;&#x91CF;B&#x7684;&#x7ECF;&#x9A8C;&#x5747;&#x503C;</p>
<p><img src="../images/tex-1b105b1e9533074584d7bc91d314181d.gif" alt="\sigma_B"> &#x662F;&#x7ECF;&#x9A8C;&#x6027;&#x7684;&#x6807;&#x51C6;&#x5DEE;&#xFF0C;&#x4E5F;&#x662F;&#x6765;&#x8BC4;&#x4F30;&#x6574;&#x4E2A;&#x5C0F;&#x6279;&#x91CF;&#x7684;&#x3002;</p>
<p><img src="../images/tex-db0654cb860481923a03a3c19530b99a.gif" alt="m_B"> &#x662F;&#x5C0F;&#x6279;&#x91CF;&#x4E2D;&#x7684;&#x5B9E;&#x4F8B;&#x6570;&#x91CF;&#x3002;</p>
<p><img src="../images/tex-4b9ba7fdd541374f7e1e0572e6a0be1e.gif" alt="\hat x^{(i)}"> &#x662F;&#x4EE5;&#x4E3A;&#x96F6;&#x4E2D;&#x5FC3;&#x548C;&#x6807;&#x51C6;&#x5316;&#x7684;&#x8F93;&#x5165;&#x3002;</p>
<p><img src="../images/tex-ae539dfcc999c28e25a0f3ae65c1de79.gif" alt="\gamma"> &#x662F;&#x5C42;&#x7684;&#x7F29;&#x653E;&#x53C2;&#x6570;&#x3002;</p>
<p><img src="../images/tex-b0603860fcffe94e5b8eec59ed813421.gif" alt="\beta"> &#x662F;&#x5C42;&#x7684;&#x79FB;&#x52A8;&#x53C2;&#x6570;&#xFF08;&#x504F;&#x79FB;&#x91CF;&#xFF09;</p>
<p><img src="../images/tex-92e4da341fe8f4cd46192f21b6ff3aa7.gif" alt="\epsilon"> &#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x5C0F;&#x7684;&#x6570;&#x5B57;&#xFF0C;&#x4EE5;&#x907F;&#x514D;&#x88AB;&#x96F6;&#x9664;&#xFF08;&#x901A;&#x5E38;&#x4E3A;<code>10 ^ -3</code>&#xFF09;&#x3002; &#x8FD9;&#x88AB;&#x79F0;&#x4E3A;&#x5E73;&#x6ED1;&#x9879;&#xFF08;&#x62C9;&#x5E03;&#x62C9;&#x65AF;&#x5E73;&#x6ED1;&#xFF0C;Laplace Smoothing&#xFF09;&#x3002;</p>
<p><img src="../images/tex-a6f367725930ab547e010046a9c80bb4.gif" alt="z^{(i)}"> &#x662F;BN&#x64CD;&#x4F5C;&#x7684;&#x8F93;&#x51FA;&#xFF1A;&#x5B83;&#x662F;&#x8F93;&#x5165;&#x7684;&#x7F29;&#x653E;&#x548C;&#x79FB;&#x4F4D;&#x7248;&#x672C;&#x3002;</p>
<p>&#x5728;&#x6D4B;&#x8BD5;&#x65F6;&#xFF0C;&#x6CA1;&#x6709;&#x5C0F;&#x6279;&#x91CF;&#x8BA1;&#x7B97;&#x7ECF;&#x9A8C;&#x5747;&#x503C;&#x548C;&#x6807;&#x51C6;&#x5DEE;&#xFF0C;&#x6240;&#x4EE5;&#x60A8;&#x53EA;&#x9700;&#x4F7F;&#x7528;&#x6574;&#x4E2A;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x5747;&#x503C;&#x548C;&#x6807;&#x51C6;&#x5DEE;&#x3002; &#x8FD9;&#x4E9B;&#x901A;&#x5E38;&#x5728;&#x8BAD;&#x7EC3;&#x671F;&#x95F4;&#x4F7F;&#x7528;&#x79FB;&#x52A8;&#x5E73;&#x5747;&#x503C;&#x8FDB;&#x884C;&#x6709;&#x6548;&#x8BA1;&#x7B97;&#x3002; &#x56E0;&#x6B64;&#xFF0C;&#x603B;&#x7684;&#x6765;&#x8BF4;&#xFF0C;&#x6BCF;&#x4E2A;&#x6279;&#x6B21;&#x6807;&#x51C6;&#x5316;&#x7684;&#x5C42;&#x6B21;&#x90FD;&#x5B66;&#x4E60;&#x4E86;&#x56DB;&#x4E2A;&#x53C2;&#x6570;&#xFF1A;<code>&#x3B3;</code>&#xFF08;&#x6807;&#x5EA6;&#xFF09;&#xFF0C;<code>&#x3B2;</code>&#xFF08;&#x504F;&#x79FB;&#xFF09;&#xFF0C;<code>&#x3BC;</code>&#xFF08;&#x5E73;&#x5747;&#x503C;&#xFF09;&#x548C;<code>&#x3C3;</code>&#xFF08;&#x6807;&#x51C6;&#x5DEE;&#xFF09;&#x3002;</p>
<p>&#x4F5C;&#x8005;&#x8BC1;&#x660E;&#xFF0C;&#x8FD9;&#x9879;&#x6280;&#x672F;&#x5927;&#x5927;&#x6539;&#x5584;&#x4E86;&#x4ED6;&#x4EEC;&#x8BD5;&#x9A8C;&#x7684;&#x6240;&#x6709;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;&#x68AF;&#x5EA6;&#x6D88;&#x5931;&#x95EE;&#x9898;&#x5927;&#x5927;&#x51CF;&#x5C11;&#x4E86;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x9971;&#x548C;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF0C;&#x5982; tanh &#x751A;&#x81F3; sigmoid &#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x3002;&#x7F51;&#x7EDC;&#x5BF9;&#x6743;&#x91CD;&#x521D;&#x59CB;&#x5316;&#x4E5F;&#x4E0D;&#x90A3;&#x4E48;&#x654F;&#x611F;&#x3002;&#x4ED6;&#x4EEC;&#x80FD;&#x591F;&#x4F7F;&#x7528;&#x66F4;&#x5927;&#x7684;&#x5B66;&#x4E60;&#x7387;&#xFF0C;&#x663E;&#x8457;&#x52A0;&#x5FEB;&#x4E86;&#x5B66;&#x4E60;&#x8FC7;&#x7A0B;&#x3002;&#x5177;&#x4F53;&#x5730;&#xFF0C;&#x4ED6;&#x4EEC;&#x6307;&#x51FA;&#xFF0C;&#x201C;&#x5E94;&#x7528;&#x4E8E;&#x6700;&#x5148;&#x8FDB;&#x7684;&#x56FE;&#x50CF;&#x5206;&#x7C7B;&#x6A21;&#x578B;&#xFF0C;&#x6279;&#x6807;&#x51C6;&#x5316;&#x7528;&#x5C11;&#x4E86; 14 &#x500D;&#x7684;&#x8BAD;&#x7EC3;&#x6B65;&#x9AA4;&#x5B9E;&#x73B0;&#x4E86;&#x76F8;&#x540C;&#x7684;&#x7CBE;&#x5EA6;&#xFF0C;&#x4EE5;&#x663E;&#x8457;&#x7684;&#x4F18;&#x52BF;&#x51FB;&#x8D25;&#x4E86;&#x539F;&#x59CB;&#x6A21;&#x578B;&#x3002;[...] &#x4F7F;&#x7528;&#x6279;&#x91CF;&#x6807;&#x51C6;&#x5316;&#x7684;&#x7F51;&#x7EDC;&#x96C6;&#x5408;&#xFF0C;&#x6211;&#x4EEC;&#x6539;&#x8FDB;&#x4E86; ImageNet &#x5206;&#x7C7B;&#x4E0A;&#x7684;&#x6700;&#x4F73;&#x516C;&#x5E03;&#x7ED3;&#x679C;&#xFF1A;&#x8FBE;&#x5230;4.9% &#x7684;&#x524D;5&#x4E2A;&#x9A8C;&#x8BC1;&#x9519;&#x8BEF;&#xFF08;&#x548C; 4.8% &#x7684;&#x6D4B;&#x8BD5;&#x9519;&#x8BEF;&#xFF09;&#xFF0C;&#x8D85;&#x51FA;&#x4E86;&#x4EBA;&#x7C7B;&#x8BC4;&#x4F30;&#x8005;&#x7684;&#x51C6;&#x786E;&#x6027;&#x3002;&#x6279;&#x91CF;&#x6807;&#x51C6;&#x5316;&#x4E5F;&#x50CF;&#x4E00;&#x4E2A;&#x6B63;&#x5219;&#x5316;&#x9879;&#x4E00;&#x6837;&#xFF0C;&#x51CF;&#x5C11;&#x4E86;&#x5BF9;&#x5176;&#x4ED6;&#x6B63;&#x5219;&#x5316;&#x6280;&#x672F;&#x7684;&#x9700;&#x6C42;&#xFF08;&#x5982;&#x672C;&#x7AE0;&#x7A0D;&#x540E;&#x63CF;&#x8FF0;&#x7684; dropout&#xFF09;.</p>
<p>&#x7136;&#x800C;&#xFF0C;&#x6279;&#x91CF;&#x6807;&#x51C6;&#x5316;&#x7684;&#x786E;&#x4F1A;&#x589E;&#x52A0;&#x6A21;&#x578B;&#x7684;&#x590D;&#x6742;&#x6027;&#xFF08;&#x5C3D;&#x7BA1;&#x5B83;&#x4E0D;&#x9700;&#x8981;&#x5BF9;&#x8F93;&#x5165;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x6807;&#x51C6;&#x5316;&#xFF0C;&#x56E0;&#x4E3A;&#x7B2C;&#x4E00;&#x4E2A;&#x9690;&#x85CF;&#x5C42;&#x4F1A;&#x7167;&#x987E;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x53EA;&#x8981;&#x5B83;&#x662F;&#x6279;&#x91CF;&#x6807;&#x51C6;&#x5316;&#x7684;&#xFF09;&#x3002; &#x6B64;&#x5916;&#xFF0C;&#x8FD8;&#x5B58;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#x7684;&#x635F;&#x5931;&#xFF1A;&#x7531;&#x4E8E;&#x6BCF;&#x5C42;&#x6240;&#x9700;&#x7684;&#x989D;&#x5916;&#x8BA1;&#x7B97;&#xFF0C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x9884;&#x6D4B;&#x901F;&#x5EA6;&#x8F83;&#x6162;&#x3002; &#x6240;&#x4EE5;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x9700;&#x8981;&#x9884;&#x6D4B;&#x95EA;&#x7535;&#x822C;&#x5FEB;&#x901F;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x60F3;&#x8981;&#x68C0;&#x67E5;&#x666E;&#x901A;ELU + He&#x521D;&#x59CB;&#x5316;&#x6267;&#x884C;&#x4E4B;&#x524D;&#x5982;&#x4F55;&#x6267;&#x884C;&#x6279;&#x91CF;&#x6807;&#x51C6;&#x5316;&#x3002;</p>
<p>&#x60A8;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x8BAD;&#x7EC3;&#x8D77;&#x521D;&#x76F8;&#x5F53;&#x7F13;&#x6162;&#xFF0C;&#x800C;&#x6E10;&#x53D8;&#x4E0B;&#x964D;&#x6B63;&#x5728;&#x5BFB;&#x627E;&#x6BCF;&#x5C42;&#x7684;&#x6700;&#x4F73;&#x5C3A;&#x5EA6;&#x548C;&#x504F;&#x79FB;&#x91CF;&#xFF0C;&#x4F46;&#x4E00;&#x65E6;&#x627E;&#x5230;&#x5408;&#x7406;&#x7684;&#x597D;&#x503C;&#xFF0C;&#x5B83;&#x5C31;&#x4F1A;&#x52A0;&#x901F;&#x3002;</p>
<p>&#x4F7F;&#x7528; TensorFlow &#x5B9E;&#x73B0;&#x6279;&#x91CF;&#x6807;&#x51C6;&#x5316;</p>
<p>TensorFlow &#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;<code>batch_normalization()</code>&#x51FD;&#x6570;&#xFF0C;&#x5B83;&#x7B80;&#x5355;&#x5730;&#x5BF9;&#x8F93;&#x5165;&#x8FDB;&#x884C;&#x5C45;&#x4E2D;&#x548C;&#x6807;&#x51C6;&#x5316;&#xFF0C;&#x4F46;&#x662F;&#x60A8;&#x5FC5;&#x987B;&#x81EA;&#x5DF1;&#x8BA1;&#x7B97;&#x5E73;&#x5747;&#x503C;&#x548C;&#x6807;&#x51C6;&#x5DEE;&#xFF08;&#x57FA;&#x4E8E;&#x8BAD;&#x7EC3;&#x671F;&#x95F4;&#x7684;&#x5C0F;&#x6279;&#x91CF;&#x6570;&#x636E;&#x6216;&#x6D4B;&#x8BD5;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x5B8C;&#x6574;&#x6570;&#x636E;&#x96C6;&#xFF09; &#x4F5C;&#x4E3A;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x5E76;&#x4E14;&#x8FD8;&#x5FC5;&#x987B;&#x5904;&#x7406;&#x7F29;&#x653E;&#x548C;&#x504F;&#x79FB;&#x91CF;&#x53C2;&#x6570;&#x7684;&#x521B;&#x5EFA;&#xFF08;&#x5E76;&#x5C06;&#x5B83;&#x4EEC;&#x4F20;&#x9012;&#x7ED9;&#x6B64;&#x51FD;&#x6570;&#xFF09;&#x3002; &#x8FD9;&#x662F;&#x53EF;&#x884C;&#x7684;&#xFF0C;&#x4F46;&#x4E0D;&#x662F;&#x6700;&#x65B9;&#x4FBF;&#x7684;&#x65B9;&#x6CD5;&#x3002; &#x76F8;&#x53CD;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;<code>batch_norm()</code>&#x51FD;&#x6570;&#xFF0C;&#x5B83;&#x4E3A;&#x4F60;&#x5904;&#x7406;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x3002; &#x60A8;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x8C03;&#x7528;&#x5B83;&#xFF0C;&#x6216;&#x8005;&#x544A;&#x8BC9;<code>fully_connected()</code>&#x51FD;&#x6570;&#x4F7F;&#x7528;&#x5B83;&#xFF0C;&#x5982;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x6240;&#x793A;&#xFF1A;</p>
<p>&#x6CE8;&#x610F;&#xFF1A;&#x672C;&#x4E66;&#x4F7F;&#x7528;<code>tensorflow.contrib.layers.batch_norm()</code>&#x800C;&#x4E0D;&#x662F;<code>tf.layers.batch_normalization()</code>&#xFF08;&#x672C;&#x7AE0;&#x5199;&#x4F5C;&#x65F6;&#x4E0D;&#x5B58;&#x5728;&#xFF09;&#x3002; &#x73B0;&#x5728;&#x6700;&#x597D;&#x4F7F;&#x7528;<code>tf.layers.batch_normalization()</code>&#xFF0C;&#x56E0;&#x4E3A;<code>contrib</code>&#x6A21;&#x5757;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x5185;&#x5BB9;&#x90FD;&#x53EF;&#x80FD;&#x4F1A;&#x6539;&#x53D8;&#x6216;&#x88AB;&#x5220;&#x9664;&#xFF0C;&#x6055;&#x4E0D;&#x53E6;&#x884C;&#x901A;&#x77E5;&#x3002; &#x6211;&#x4EEC;&#x73B0;&#x5728;&#x4E0D;&#x4F7F;&#x7528;<code>batch_norm()</code>&#x51FD;&#x6570;&#x4F5C;&#x4E3A;<code>fully_connected()</code>&#x51FD;&#x6570;&#x7684;&#x6B63;&#x5219;&#x5316;&#x53C2;&#x6570;&#xFF0C;&#x800C;&#x662F;&#x4F7F;&#x7528;<code>batch_normalization()</code>&#xFF0C;&#x5E76;&#x660E;&#x786E;&#x5730;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x5C42;&#x3002; &#x53C2;&#x6570;&#x6709;&#x4E9B;&#x4E0D;&#x540C;&#xFF0C;&#x7279;&#x522B;&#x662F;&#xFF1A;</p>
<ul>
<li><code>decay</code>&#x66F4;&#x540D;&#x4E3A;<code>momentum</code></li>
<li><code>is_training</code>&#x88AB;&#x91CD;&#x547D;&#x540D;&#x4E3A;<code>training</code></li>
<li><code>updates_collections</code>&#x88AB;&#x5220;&#x9664;&#xFF1A;&#x6279;&#x91CF;&#x6807;&#x51C6;&#x5316;&#x6240;&#x9700;&#x7684;&#x66F4;&#x65B0;&#x64CD;&#x4F5C;&#x88AB;&#x6DFB;&#x52A0;&#x5230;<code>UPDATE_OPS</code>&#x96C6;&#x5408;&#x4E2D;&#xFF0C;&#x5E76;&#x4E14;&#x60A8;&#x9700;&#x8981;&#x5728;&#x8BAD;&#x7EC3;&#x671F;&#x95F4;&#x660E;&#x786E;&#x5730;&#x8FD0;&#x884C;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x4E0B;&#x9762;&#x7684;&#x6267;&#x884C;&#x9636;&#x6BB5;&#xFF09;</li>
<li>&#x6211;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x6307;&#x5B9A;<code>scale = True</code>&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x662F;&#x9ED8;&#x8BA4;&#x503C;&#x3002;</li>
</ul>
<p>&#x8FD8;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x4E3A;&#x4E86;&#x5728;&#x6BCF;&#x4E2A;&#x9690;&#x85CF;&#x5C42;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x4E4B;&#x524D;&#x8FD0;&#x884C;&#x6279;&#x91CF;&#x6807;&#x51C6;&#x5316;&#xFF0C;&#x6211;&#x4EEC;&#x624B;&#x52A8;&#x5E94;&#x7528; RELU &#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF0C;&#x5728;&#x6279;&#x91CF;&#x89C4;&#x8303;&#x5C42;&#x4E4B;&#x540E;&#x3002;&#x6CE8;&#x610F;&#xFF1A;&#x7531;&#x4E8E;<code>tf.layers.dense()</code>&#x51FD;&#x6570;&#x4E0E;&#x672C;&#x4E66;&#x4E2D;&#x4F7F;&#x7528;&#x7684;<code>tf.contrib.layers.arg_scope()</code>&#x4E0D;&#x517C;&#x5BB9;&#xFF0C;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x4F7F;&#x7528; python &#x7684;<code>functools.partial()</code>&#x51FD;&#x6570;&#x3002; &#x5B83;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;<code>my_dense_layer()</code>&#x51FD;&#x6570;&#xFF0C;&#x53EA;&#x9700;&#x8C03;&#x7528;<code>tf.layers.dense()</code>&#xFF0C;&#x5E76;&#x81EA;&#x52A8;&#x8BBE;&#x7F6E;&#x6240;&#x9700;&#x7684;&#x53C2;&#x6570;&#xFF08;&#x9664;&#x975E;&#x5728;&#x8C03;&#x7528;<code>my_dense_layer()</code>&#x65F6;&#x8986;&#x76D6;&#x5B83;&#x4EEC;&#xFF09;&#x3002; &#x5982;&#x60A8;&#x6240;&#x89C1;&#xFF0C;&#x4EE3;&#x7801;&#x4FDD;&#x6301;&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#x3002;</p>
<pre><code class="lang-py"><span class="hljs-keyword">import</span> tensorflow <span class="hljs-keyword">as</span> tf

n_inputs = <span class="hljs-number">28</span> * <span class="hljs-number">28</span>
n_hidden1 = <span class="hljs-number">300</span>
n_hidden2 = <span class="hljs-number">100</span>
n_outputs = <span class="hljs-number">10</span>

X = tf.placeholder(tf.float32, shape=(<span class="hljs-keyword">None</span>, n_inputs), name=<span class="hljs-string">&quot;X&quot;</span>)

training = tf.placeholder_with_default(<span class="hljs-keyword">False</span>, shape=(), name=<span class="hljs-string">&apos;training&apos;</span>)

hidden1 = tf.layers.dense(X, n_hidden1, name=<span class="hljs-string">&quot;hidden1&quot;</span>)
bn1 = tf.layers.batch_normalization(hidden1, training=training, momentum=<span class="hljs-number">0.9</span>)
bn1_act = tf.nn.elu(bn1)

hidden2 = tf.layers.dense(bn1_act, n_hidden2, name=<span class="hljs-string">&quot;hidden2&quot;</span>)
bn2 = tf.layers.batch_normalization(hidden2, training=training, momentum=<span class="hljs-number">0.9</span>)
bn2_act = tf.nn.elu(bn2)

logits_before_bn = tf.layers.dense(bn2_act, n_outputs, name=<span class="hljs-string">&quot;outputs&quot;</span>)
logits = tf.layers.batch_normalization(logits_before_bn, training=training,
                                       momentum=<span class="hljs-number">0.9</span>)
</code></pre>
<pre><code class="lang-py">X = tf.placeholder(tf.float32, shape=(<span class="hljs-keyword">None</span>, n_inputs), name=<span class="hljs-string">&quot;X&quot;</span>)
training = tf.placeholder_with_default(<span class="hljs-keyword">False</span>, shape=(), name=<span class="hljs-string">&apos;training&apos;</span>)
</code></pre>
<p>&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x4E00;&#x904D;&#x53C8;&#x4E00;&#x904D;&#x91CD;&#x590D;&#x76F8;&#x540C;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; Python &#x7684;<code>partial()</code>&#x51FD;&#x6570;&#xFF1A;</p>
<pre><code class="lang-py"><span class="hljs-keyword">from</span> functools <span class="hljs-keyword">import</span> partial

my_batch_norm_layer = partial(tf.layers.batch_normalization,
                              training=training, momentum=<span class="hljs-number">0.9</span>)

hidden1 = tf.layers.dense(X, n_hidden1, name=<span class="hljs-string">&quot;hidden1&quot;</span>)
bn1 = my_batch_norm_layer(hidden1)
bn1_act = tf.nn.elu(bn1)
hidden2 = tf.layers.dense(bn1_act, n_hidden2, name=<span class="hljs-string">&quot;hidden2&quot;</span>)
bn2 = my_batch_norm_layer(hidden2)
bn2_act = tf.nn.elu(bn2)
logits_before_bn = tf.layers.dense(bn2_act, n_outputs, name=<span class="hljs-string">&quot;outputs&quot;</span>)
logits = my_batch_norm_layer(logits_before_bn)
</code></pre>
<p>&#x5B8C;&#x6574;&#x4EE3;&#x7801;</p>
<pre><code class="lang-py"><span class="hljs-keyword">from</span> functools <span class="hljs-keyword">import</span> partial
<span class="hljs-keyword">from</span> tensorflow.examples.tutorials.mnist <span class="hljs-keyword">import</span> input_data
<span class="hljs-keyword">import</span> tensorflow <span class="hljs-keyword">as</span> tf

<span class="hljs-keyword">if</span> __name__ == <span class="hljs-string">&apos;__main__&apos;</span>:
    n_inputs = <span class="hljs-number">28</span> * <span class="hljs-number">28</span>
    n_hidden1 = <span class="hljs-number">300</span>
    n_hidden2 = <span class="hljs-number">100</span>
    n_outputs = <span class="hljs-number">10</span>

    mnist = input_data.read_data_sets(<span class="hljs-string">&quot;/tmp/data/&quot;</span>)

    batch_norm_momentum = <span class="hljs-number">0.9</span>
    learning_rate = <span class="hljs-number">0.01</span>

    X = tf.placeholder(tf.float32, shape=(<span class="hljs-keyword">None</span>, n_inputs), name = <span class="hljs-string">&apos;X&apos;</span>)
    y = tf.placeholder(tf.int64, shape=<span class="hljs-keyword">None</span>, name = <span class="hljs-string">&apos;y&apos;</span>)
    training = tf.placeholder_with_default(<span class="hljs-keyword">False</span>, shape=(), name = <span class="hljs-string">&apos;training&apos;</span>)<span class="hljs-comment">#&#x7ED9;Batch norm&#x52A0;&#x4E00;&#x4E2A;placeholder</span>

    <span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&quot;dnn&quot;</span>):
        he_init = tf.contrib.layers.variance_scaling_initializer()
        <span class="hljs-comment">#&#x5BF9;&#x6743;&#x91CD;&#x7684;&#x521D;&#x59CB;&#x5316;</span>

        my_batch_norm_layer = partial(
            tf.layers.batch_normalization,
            training = training,
            momentum = batch_norm_momentum
        )

        my_dense_layer = partial(
            tf.layers.dense,
            kernel_initializer = he_init
        )

        hidden1 = my_dense_layer(X ,n_hidden1 ,name = <span class="hljs-string">&apos;hidden1&apos;</span>)
        bn1 = tf.nn.elu(my_batch_norm_layer(hidden1))
        hidden2 = my_dense_layer(bn1, n_hidden2, name = <span class="hljs-string">&apos;hidden2&apos;</span>)
        bn2 = tf.nn.elu(my_batch_norm_layer(hidden2))
        logists_before_bn = my_dense_layer(bn2, n_outputs, name = <span class="hljs-string">&apos;outputs&apos;</span>)
        logists = my_batch_norm_layer(logists_before_bn)

    <span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&apos;loss&apos;</span>):
        xentropy = tf.nn.sparse_softmax_cross_entropy_with_logits(labels = y, logits= logists)
        loss = tf.reduce_mean(xentropy, name = <span class="hljs-string">&apos;loss&apos;</span>)

    <span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&apos;train&apos;</span>):
        optimizer = tf.train.GradientDescentOptimizer(learning_rate)
        training_op = optimizer.minimize(loss)

    <span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&quot;eval&quot;</span>):
        correct = tf.nn.in_top_k(logists, y, <span class="hljs-number">1</span>)
        accuracy = tf.reduce_mean(tf.cast(correct, tf.float32))

    init = tf.global_variables_initializer()
    saver = tf.train.Saver()

    n_epoches = <span class="hljs-number">20</span>
    batch_size = <span class="hljs-number">200</span>
<span class="hljs-comment"># &#x6CE8;&#x610F;&#xFF1A;&#x7531;&#x4E8E;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x7684;&#x662F; tf.layers.batch_normalization() &#x800C;&#x4E0D;&#x662F; tf.contrib.layers.batch_norm()&#xFF08;&#x5982;&#x672C;&#x4E66;&#x6240;&#x8FF0;&#xFF09;&#xFF0C;</span>
<span class="hljs-comment"># &#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x660E;&#x786E;&#x8FD0;&#x884C;&#x6279;&#x91CF;&#x89C4;&#x8303;&#x5316;&#x6240;&#x9700;&#x7684;&#x989D;&#x5916;&#x66F4;&#x65B0;&#x64CD;&#x4F5C;&#xFF08;sess.run([ training_op&#xFF0C;extra_update_ops], ...)&#x3002;</span>
    extra_update_ops = tf.get_collection(tf.GraphKeys.UPDATE_OPS)

    <span class="hljs-keyword">with</span> tf.Session() <span class="hljs-keyword">as</span> sess:
        init.run()
        <span class="hljs-keyword">for</span> epoch <span class="hljs-keyword">in</span> range(n_epoches):
            <span class="hljs-keyword">for</span> iteraton <span class="hljs-keyword">in</span> range(mnist.train.num_examples//batch_size):
                X_batch, y_batch = mnist.train.next_batch(batch_size)
                sess.run([training_op,extra_update_ops],
                         feed_dict={training:<span class="hljs-keyword">True</span>, X:X_batch, y:y_batch})
            accuracy_val = accuracy.eval(feed_dict= {X:mnist.test.images,
                                                    y:mnist.test.labels})
            print(epoch, <span class="hljs-string">&apos;Test accuracy:&apos;</span>, accuracy_val)
</code></pre>
<p><img src="../images/chapter_11/o-11-2.png" alt=""></p>
<p>&#x4EC0;&#x4E48;&#xFF01;&#xFF1F; &#x8FD9;&#x5BF9; MNIST &#x6765;&#x8BF4;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x51C6;&#x786E;&#x6027;&#x3002; &#x5F53;&#x7136;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8BAD;&#x7EC3;&#x7684;&#x65F6;&#x95F4;&#x8D8A;&#x957F;&#xFF0C;&#x51C6;&#x786E;&#x6027;&#x5C31;&#x8D8A;&#x597D;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x6D45;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x6279;&#x91CF;&#x8303;&#x6570;&#x548C; ELU &#x4E0D;&#x592A;&#x53EF;&#x80FD;&#x4EA7;&#x751F;&#x975E;&#x5E38;&#x79EF;&#x6781;&#x7684;&#x5F71;&#x54CD;&#xFF1A;&#x5B83;&#x4EEC;&#x5927;&#x90E8;&#x5206;&#x90FD;&#x662F;&#x4E3A;&#x4E86;&#x66F4;&#x6DF1;&#x7684;&#x7F51;&#x7EDC;&#x800C;&#x53D1;&#x5149;&#x3002;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x60A8;&#x8FD8;&#x53EF;&#x4EE5;&#x8BAD;&#x7EC3;&#x64CD;&#x4F5C;&#x53D6;&#x51B3;&#x4E8E;&#x66F4;&#x65B0;&#x64CD;&#x4F5C;&#xFF1A;</p>
<pre><code class="lang-py"><span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&quot;train&quot;</span>):
    optimizer = tf.train.GradientDescentOptimizer(learning_rate)
    extra_update_ops = tf.get_collection(tf.GraphKeys.UPDATE_OPS)
    <span class="hljs-keyword">with</span> tf.control_dependencies(extra_update_ops):
        training_op = optimizer.minimize(loss)
</code></pre>
<p>&#x8FD9;&#x6837;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x5728;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#x4E2D;&#x8BC4;&#x4F30;training_op&#xFF0C;TensorFlow&#x4E5F;&#x4F1A;&#x81EA;&#x52A8;&#x8FD0;&#x884C;&#x66F4;&#x65B0;&#x64CD;&#x4F5C;&#xFF1A;</p>
<pre><code class="lang-py">sess.run(training_op, feed_dict={training: <span class="hljs-keyword">True</span>, X: X_batch, y: y_batch})
</code></pre>
<h2 id="&#x68AF;&#x5EA6;&#x88C1;&#x526A;">&#x68AF;&#x5EA6;&#x88C1;&#x526A;</h2>
<p>&#x51CF;&#x5C11;&#x68AF;&#x5EA6;&#x7206;&#x70B8;&#x95EE;&#x9898;&#x7684;&#x4E00;&#x79CD;&#x5E38;&#x7528;&#x6280;&#x672F;&#x662F;&#x5728;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x8FC7;&#x7A0B;&#x4E2D;&#x7B80;&#x5355;&#x5730;&#x526A;&#x5207;&#x68AF;&#x5EA6;&#xFF0C;&#x4F7F;&#x5B83;&#x4EEC;&#x4E0D;&#x8D85;&#x8FC7;&#x67D0;&#x4E2A;&#x9608;&#x503C;&#xFF08;&#x8FD9;&#x5BF9;&#x4E8E;&#x9012;&#x5F52;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x662F;&#x975E;&#x5E38;&#x6709;&#x7528;&#x7684;&#xFF1B;&#x53C2;&#x89C1;&#x7B2C; 14 &#x7AE0;&#xFF09;&#x3002; &#x8FD9;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684;&#x68AF;&#x5EA6;&#x88C1;&#x526A;&#x3002;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x4EBA;&#x4EEC;&#x66F4;&#x559C;&#x6B22;&#x6279;&#x91CF;&#x6807;&#x51C6;&#x5316;&#xFF0C;&#x4F46;&#x4E86;&#x89E3;&#x68AF;&#x5EA6;&#x88C1;&#x526A;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x5B83;&#x4ECD;&#x7136;&#x662F;&#x6709;&#x7528;&#x7684;&#x3002;</p>
<p>&#x5728; TensorFlow &#x4E2D;&#xFF0C;&#x4F18;&#x5316;&#x5668;&#x7684;<code>minimize()</code>&#x51FD;&#x6570;&#x8D1F;&#x8D23;&#x8BA1;&#x7B97;&#x68AF;&#x5EA6;&#x5E76;&#x5E94;&#x7528;&#x5B83;&#x4EEC;&#xFF0C;&#x6240;&#x4EE5;&#x60A8;&#x5FC5;&#x987B;&#x9996;&#x5148;&#x8C03;&#x7528;&#x4F18;&#x5316;&#x5668;&#x7684;<code>compute_gradients()</code>&#x65B9;&#x6CD5;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;<code>clip_by_value()</code>&#x51FD;&#x6570;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x88C1;&#x526A;&#x68AF;&#x5EA6;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x6700;&#x540E; &#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x6765;&#x4F7F;&#x7528;&#x4F18;&#x5316;&#x5668;&#x7684;<code>apply_gradients()</code>&#x65B9;&#x6CD5;&#x5E94;&#x7528;&#x88C1;&#x526A;&#x68AF;&#x5EA6;&#xFF1A;</p>
<pre><code class="lang-py">threshold = <span class="hljs-number">1.0</span>

optimizer = tf.train.GradientDescentOptimizer(learning_rate)
grads_and_vars = optimizer.compute_gradients(loss)
capped_gvs = [(tf.clip_by_value(grad, -threshold, threshold), var)
              <span class="hljs-keyword">for</span> grad, var <span class="hljs-keyword">in</span> grads_and_vars]
training_op = optimizer.apply_gradients(capped_gvs)
</code></pre>
<p>&#x50CF;&#x5F80;&#x5E38;&#x4E00;&#x6837;&#xFF0C;&#x60A8;&#x5C06;&#x5728;&#x6BCF;&#x4E2A;&#x8BAD;&#x7EC3;&#x9636;&#x6BB5;&#x8FD0;&#x884C;&#x8FD9;&#x4E2A;<code>training_op</code>&#x3002; &#x5B83;&#x5C06;&#x8BA1;&#x7B97;&#x68AF;&#x5EA6;&#xFF0C;&#x5C06;&#x5B83;&#x4EEC;&#x88C1;&#x526A;&#x5230; -1.0 &#x548C; 1.0 &#x4E4B;&#x95F4;&#xFF0C;&#x5E76;&#x5E94;&#x7528;&#x5B83;&#x4EEC;&#x3002; <code>threhold</code>&#x662F;&#x60A8;&#x53EF;&#x4EE5;&#x8C03;&#x6574;&#x7684;&#x8D85;&#x53C2;&#x6570;&#x3002;</p>
<h2 id="&#x590D;&#x7528;&#x9884;&#x8BAD;&#x7EC3;&#x5C42;">&#x590D;&#x7528;&#x9884;&#x8BAD;&#x7EC3;&#x5C42;</h2>
<p>&#x4ECE;&#x96F6;&#x5F00;&#x59CB;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x5927;&#x7684; DNN &#x901A;&#x5E38;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x4E3B;&#x610F;&#xFF0C;&#x76F8;&#x53CD;&#xFF0C;&#x60A8;&#x5E94;&#x8BE5;&#x603B;&#x662F;&#x5C1D;&#x8BD5;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x73B0;&#x6709;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6765;&#x5B8C;&#x6210;&#x4E0E;&#x60A8;&#x6B63;&#x5728;&#x5C1D;&#x8BD5;&#x89E3;&#x51B3;&#x7684;&#x4EFB;&#x52A1;&#x7C7B;&#x4F3C;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x7136;&#x540E;&#x590D;&#x7528;&#x8FD9;&#x4E2A;&#x7F51;&#x7EDC;&#x7684;&#x8F83;&#x4F4E;&#x5C42;&#xFF1A;&#x8FD9;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x3002;&#x8FD9;&#x4E0D;&#x4EC5;&#x4F1A;&#x5927;&#x5927;&#x52A0;&#x5FEB;&#x8BAD;&#x7EC3;&#x901F;&#x5EA6;&#xFF0C;&#x8FD8;&#x5C06;&#x9700;&#x8981;&#x66F4;&#x5C11;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x5047;&#x8BBE;&#x60A8;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x7ECF;&#x8FC7;&#x8BAD;&#x7EC3;&#x7684; DNN&#xFF0C;&#x5C06;&#x56FE;&#x7247;&#x5206;&#x4E3A; 100 &#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x7C7B;&#x522B;&#xFF0C;&#x5305;&#x62EC;&#x52A8;&#x7269;&#xFF0C;&#x690D;&#x7269;&#xFF0C;&#x8F66;&#x8F86;&#x548C;&#x65E5;&#x5E38;&#x7269;&#x54C1;&#x3002; &#x60A8;&#x73B0;&#x5728;&#x60F3;&#x8981;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A; DNN &#x6765;&#x5BF9;&#x7279;&#x5B9A;&#x7C7B;&#x578B;&#x7684;&#x8F66;&#x8F86;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#x3002; &#x8FD9;&#x4E9B;&#x4EFB;&#x52A1;&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#xFF0C;&#x56E0;&#x6B64;&#x60A8;&#x5E94;&#x8BE5;&#x5C1D;&#x8BD5;&#x91CD;&#x65B0;&#x4F7F;&#x7528;&#x7B2C;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF08;&#x8BF7;&#x53C2;&#x89C1;&#x56FE; 11-4&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_11/11-4.png" alt=""></p>
<p>&#x5982;&#x679C;&#x65B0;&#x4EFB;&#x52A1;&#x7684;&#x8F93;&#x5165;&#x56FE;&#x50CF;&#x4E0E;&#x539F;&#x59CB;&#x4EFB;&#x52A1;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x8F93;&#x5165;&#x56FE;&#x50CF;&#x7684;&#x5927;&#x5C0F;&#x4E0D;&#x4E00;&#x81F4;&#xFF0C;&#x5219;&#x5FC5;&#x987B;&#x6DFB;&#x52A0;&#x9884;&#x5904;&#x7406;&#x6B65;&#x9AA4;&#x4EE5;&#x5C06;&#x5176;&#x5927;&#x5C0F;&#x8C03;&#x6574;&#x4E3A;&#x539F;&#x59CB;&#x6A21;&#x578B;&#x7684;&#x9884;&#x671F;&#x5927;&#x5C0F;&#x3002; &#x66F4;&#x4E00;&#x822C;&#x5730;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x8F93;&#x5165;&#x5177;&#x6709;&#x7C7B;&#x4F3C;&#x7684;&#x4F4E;&#x7EA7;&#x5C42;&#x6B21;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x5219;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x5C06;&#x5F88;&#x597D;&#x5730;&#x5DE5;&#x4F5C;&#x3002;</p>
<h2 id="&#x590D;&#x7528;-tensorflow-&#x6A21;&#x578B;">&#x590D;&#x7528; TensorFlow &#x6A21;&#x578B;</h2>
<p>&#x5982;&#x679C;&#x539F;&#x59CB;&#x6A21;&#x578B;&#x4F7F;&#x7528; TensorFlow &#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x5730;&#x5C06;&#x5176;&#x6062;&#x590D;&#x5E76;&#x5728;&#x65B0;&#x4EFB;&#x52A1;&#x4E0A;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#xFF1A;</p>
<pre><code class="lang-py">[...] <span class="hljs-comment"># construct the original model</span>
</code></pre>
<pre><code class="lang-py"><span class="hljs-keyword">with</span> tf.Session() <span class="hljs-keyword">as</span> sess:
    saver.restore(sess, <span class="hljs-string">&quot;./my_model_final.ckpt&quot;</span>)
    <span class="hljs-comment"># continue training the model...</span>
</code></pre>
<p>&#x5B8C;&#x6574;&#x4EE3;&#x7801;:</p>
<pre><code class="lang-py">n_inputs = <span class="hljs-number">28</span> * <span class="hljs-number">28</span>  <span class="hljs-comment"># MNIST</span>
n_hidden1 = <span class="hljs-number">300</span>
n_hidden2 = <span class="hljs-number">50</span>
n_hidden3 = <span class="hljs-number">50</span>
n_hidden4 = <span class="hljs-number">50</span>
n_outputs = <span class="hljs-number">10</span>

X = tf.placeholder(tf.float32, shape=(<span class="hljs-keyword">None</span>, n_inputs), name=<span class="hljs-string">&quot;X&quot;</span>)
y = tf.placeholder(tf.int64, shape=(<span class="hljs-keyword">None</span>), name=<span class="hljs-string">&quot;y&quot;</span>)

<span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&quot;dnn&quot;</span>):
    hidden1 = tf.layers.dense(X, n_hidden1, activation=tf.nn.relu, name=<span class="hljs-string">&quot;hidden1&quot;</span>)
    hidden2 = tf.layers.dense(hidden1, n_hidden2, activation=tf.nn.relu, name=<span class="hljs-string">&quot;hidden2&quot;</span>)
    hidden3 = tf.layers.dense(hidden2, n_hidden3, activation=tf.nn.relu, name=<span class="hljs-string">&quot;hidden3&quot;</span>)
    hidden4 = tf.layers.dense(hidden3, n_hidden4, activation=tf.nn.relu, name=<span class="hljs-string">&quot;hidden4&quot;</span>)
    hidden5 = tf.layers.dense(hidden4, n_hidden5, activation=tf.nn.relu, name=<span class="hljs-string">&quot;hidden5&quot;</span>)
    logits = tf.layers.dense(hidden5, n_outputs, name=<span class="hljs-string">&quot;outputs&quot;</span>)

<span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&quot;loss&quot;</span>):
    xentropy = tf.nn.sparse_softmax_cross_entropy_with_logits(labels=y, logits=logits)
    loss = tf.reduce_mean(xentropy, name=<span class="hljs-string">&quot;loss&quot;</span>)

<span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&quot;eval&quot;</span>):
    correct = tf.nn.in_top_k(logits, y, <span class="hljs-number">1</span>)
    accuracy = tf.reduce_mean(tf.cast(correct, tf.float32), name=<span class="hljs-string">&quot;accuracy&quot;</span>)

learning_rate = <span class="hljs-number">0.01</span>
threshold = <span class="hljs-number">1.0</span>

optimizer = tf.train.GradientDescentOptimizer(learning_rate)
grads_and_vars = optimizer.compute_gradients(loss)
capped_gvs = [(tf.clip_by_value(grad, -threshold, threshold), var)
              <span class="hljs-keyword">for</span> grad, var <span class="hljs-keyword">in</span> grads_and_vars]
training_op = optimizer.apply_gradients(capped_gvs)

init = tf.global_variables_initializer()
saver = tf.train.Saver()
</code></pre>
<pre><code class="lang-py"><span class="hljs-keyword">with</span> tf.Session() <span class="hljs-keyword">as</span> sess:
    saver.restore(sess, <span class="hljs-string">&quot;./my_model_final.ckpt&quot;</span>)

    <span class="hljs-keyword">for</span> epoch <span class="hljs-keyword">in</span> range(n_epochs):
        <span class="hljs-keyword">for</span> iteration <span class="hljs-keyword">in</span> range(mnist.train.num_examples // batch_size):
            X_batch, y_batch = mnist.train.next_batch(batch_size)
            sess.run(training_op, feed_dict={X: X_batch, y: y_batch})
        accuracy_val = accuracy.eval(feed_dict={X: mnist.test.images,
                                                y: mnist.test.labels})
        print(epoch, <span class="hljs-string">&quot;Test accuracy:&quot;</span>, accuracy_val)

    save_path = saver.save(sess, <span class="hljs-string">&quot;./my_new_model_final.ckpt&quot;</span>)
</code></pre>
<p>&#x4F46;&#x662F;&#xFF0C;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x60A8;&#x53EA;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x4F7F;&#x7528;&#x539F;&#x59CB;&#x6A21;&#x578B;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF08;&#x5C31;&#x50CF;&#x6211;&#x4EEC;&#x5C06;&#x8981;&#x8BA8;&#x8BBA;&#x7684;&#x90A3;&#x6837;&#xFF09;&#x3002; &#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x5C06;<code>Saver</code>&#x914D;&#x7F6E;&#x4E3A;&#x4EC5;&#x6062;&#x590D;&#x539F;&#x59CB;&#x6A21;&#x578B;&#x4E2D;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x53D8;&#x91CF;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x53EA;&#x6062;&#x590D;&#x9690;&#x85CF;&#x7684;&#x5C42;1,2&#x548C;3&#xFF1A;</p>
<pre><code class="lang-py">n_inputs = <span class="hljs-number">28</span> * <span class="hljs-number">28</span>  <span class="hljs-comment"># MNIST</span>
n_hidden1 = <span class="hljs-number">300</span> <span class="hljs-comment"># reused</span>
n_hidden2 = <span class="hljs-number">50</span>  <span class="hljs-comment"># reused</span>
n_hidden3 = <span class="hljs-number">50</span>  <span class="hljs-comment"># reused</span>
n_hidden4 = <span class="hljs-number">20</span>  <span class="hljs-comment"># new!</span>
n_outputs = <span class="hljs-number">10</span>  <span class="hljs-comment"># new!</span>

X = tf.placeholder(tf.float32, shape=(<span class="hljs-keyword">None</span>, n_inputs), name=<span class="hljs-string">&quot;X&quot;</span>)
y = tf.placeholder(tf.int64, shape=(<span class="hljs-keyword">None</span>), name=<span class="hljs-string">&quot;y&quot;</span>)

<span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&quot;dnn&quot;</span>):
    hidden1 = tf.layers.dense(X, n_hidden1, activation=tf.nn.relu, name=<span class="hljs-string">&quot;hidden1&quot;</span>)       <span class="hljs-comment"># reused</span>
    hidden2 = tf.layers.dense(hidden1, n_hidden2, activation=tf.nn.relu, name=<span class="hljs-string">&quot;hidden2&quot;</span>) <span class="hljs-comment"># reused</span>
    hidden3 = tf.layers.dense(hidden2, n_hidden3, activation=tf.nn.relu, name=<span class="hljs-string">&quot;hidden3&quot;</span>) <span class="hljs-comment"># reused</span>
    hidden4 = tf.layers.dense(hidden3, n_hidden4, activation=tf.nn.relu, name=<span class="hljs-string">&quot;hidden4&quot;</span>) <span class="hljs-comment"># new!</span>
    logits = tf.layers.dense(hidden4, n_outputs, name=<span class="hljs-string">&quot;outputs&quot;</span>)                         <span class="hljs-comment"># new!</span>

<span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&quot;loss&quot;</span>):
    xentropy = tf.nn.sparse_softmax_cross_entropy_with_logits(labels=y, logits=logits)
    loss = tf.reduce_mean(xentropy, name=<span class="hljs-string">&quot;loss&quot;</span>)

<span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&quot;eval&quot;</span>):
    correct = tf.nn.in_top_k(logits, y, <span class="hljs-number">1</span>)
    accuracy = tf.reduce_mean(tf.cast(correct, tf.float32), name=<span class="hljs-string">&quot;accuracy&quot;</span>)

<span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&quot;train&quot;</span>):
    optimizer = tf.train.GradientDescentOptimizer(learning_rate)
    training_op = optimizer.minimize(loss)
</code></pre>
<pre><code class="lang-py">[...] <span class="hljs-comment"># build new model with the same definition as before for hidden layers 1-3</span>
</code></pre>
<pre><code class="lang-py">reuse_vars = tf.get_collection(tf.GraphKeys.GLOBAL_VARIABLES,
                               scope=<span class="hljs-string">&quot;hidden[123]&quot;</span>) <span class="hljs-comment"># regular expression</span>
reuse_vars_dict = dict([(var.op.name, var) <span class="hljs-keyword">for</span> var <span class="hljs-keyword">in</span> reuse_vars])
restore_saver = tf.train.Saver(reuse_vars_dict) <span class="hljs-comment"># to restore layers 1-3</span>

init = tf.global_variables_initializer()
saver = tf.train.Saver()

<span class="hljs-keyword">with</span> tf.Session() <span class="hljs-keyword">as</span> sess:
    init.run()
    restore_saver.restore(sess, <span class="hljs-string">&quot;./my_model_final.ckpt&quot;</span>)

    <span class="hljs-keyword">for</span> epoch <span class="hljs-keyword">in</span> range(n_epochs):                                      <span class="hljs-comment"># not shown in the book</span>
        <span class="hljs-keyword">for</span> iteration <span class="hljs-keyword">in</span> range(mnist.train.num_examples // batch_size): <span class="hljs-comment"># not shown</span>
            X_batch, y_batch = mnist.train.next_batch(batch_size)      <span class="hljs-comment"># not shown</span>
            sess.run(training_op, feed_dict={X: X_batch, y: y_batch})  <span class="hljs-comment"># not shown</span>
        accuracy_val = accuracy.eval(feed_dict={X: mnist.test.images,  <span class="hljs-comment"># not shown</span>
                                                y: mnist.test.labels}) <span class="hljs-comment"># not shown</span>
        print(epoch, <span class="hljs-string">&quot;Test accuracy:&quot;</span>, accuracy_val)                   <span class="hljs-comment"># not shown</span>

    save_path = saver.save(sess, <span class="hljs-string">&quot;./my_new_model_final.ckpt&quot;</span>)
</code></pre>
<p>&#x9996;&#x5148;&#x6211;&#x4EEC;&#x5EFA;&#x7ACB;&#x65B0;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x786E;&#x4FDD;&#x590D;&#x5236;&#x539F;&#x59CB;&#x6A21;&#x578B;&#x7684;&#x9690;&#x85CF;&#x5C42; 1 &#x5230; 3&#x3002;&#x6211;&#x4EEC;&#x8FD8;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x6765;&#x521D;&#x59CB;&#x5316;&#x6240;&#x6709;&#x53D8;&#x91CF;&#x3002; &#x7136;&#x540E;&#x6211;&#x4EEC;&#x5F97;&#x5230;&#x521A;&#x521A;&#x7528;<code>trainable = True</code>&#xFF08;&#x8FD9;&#x662F;&#x9ED8;&#x8BA4;&#x503C;&#xFF09;&#x521B;&#x5EFA;&#x7684;&#x6240;&#x6709;&#x53D8;&#x91CF;&#x7684;&#x5217;&#x8868;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x4FDD;&#x7559;&#x90A3;&#x4E9B;&#x8303;&#x56F4;&#x4E0E;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;<code>hidden [123]</code>&#x76F8;&#x5339;&#x914D;&#x7684;&#x53D8;&#x91CF;&#xFF08;&#x5373;&#xFF0C;&#x6211;&#x4EEC;&#x5F97;&#x5230;&#x6240;&#x6709;&#x53EF;&#x8BAD;&#x7EC3;&#x7684;&#x9690;&#x85CF;&#x5C42; 1 &#x5230; 3 &#x4E2D;&#x7684;&#x53D8;&#x91CF;&#xFF09;&#x3002; &#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5B57;&#x5178;&#xFF0C;&#x5C06;&#x539F;&#x59CB;&#x6A21;&#x578B;&#x4E2D;&#x6BCF;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x540D;&#x79F0;&#x6620;&#x5C04;&#x5230;&#x65B0;&#x6A21;&#x578B;&#x4E2D;&#x7684;&#x540D;&#x79F0;&#xFF08;&#x901A;&#x5E38;&#x9700;&#x8981;&#x4FDD;&#x6301;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x7684;&#x540D;&#x79F0;&#xFF09;&#x3002; &#x7136;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;<code>Saver</code>&#xFF0C;&#x5B83;&#x5C06;&#x53EA;&#x6062;&#x590D;&#x8FD9;&#x4E9B;&#x53D8;&#x91CF;&#xFF0C;&#x5E76;&#x4E14;&#x521B;&#x5EFA;&#x53E6;&#x4E00;&#x4E2A;<code>Saver</code>&#x6765;&#x4FDD;&#x5B58;&#x6574;&#x4E2A;&#x65B0;&#x6A21;&#x578B;&#xFF0C;&#x800C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x7B2C; 1 &#x5C42;&#x5230;&#x7B2C; 3 &#x5C42;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x4E00;&#x4E2A;&#x4F1A;&#x8BDD;&#x5E76;&#x521D;&#x59CB;&#x5316;&#x6A21;&#x578B;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x53D8;&#x91CF;&#xFF0C;&#x7136;&#x540E;&#x4ECE;&#x539F;&#x59CB;&#x6A21;&#x578B;&#x7684;&#x5C42; 1 &#x5230; 3&#x4E2D;&#x6062;&#x590D;&#x53D8;&#x91CF;&#x503C;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x65B0;&#x4EFB;&#x52A1;&#x4E0A;&#x8BAD;&#x7EC3;&#x6A21;&#x578B;&#x5E76;&#x4FDD;&#x5B58;&#x3002;</p>
<p>&#x4EFB;&#x52A1;&#x8D8A;&#x76F8;&#x4F3C;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x91CD;&#x590D;&#x4F7F;&#x7528;&#x7684;&#x5C42;&#x8D8A;&#x591A;&#xFF08;&#x4ECE;&#x8F83;&#x4F4E;&#x5C42;&#x5F00;&#x59CB;&#xFF09;&#x3002; &#x5BF9;&#x4E8E;&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x4FDD;&#x7559;&#x6240;&#x6709;&#x9690;&#x85CF;&#x7684;&#x5C42;&#xFF0C;&#x53EA;&#x66FF;&#x6362;&#x8F93;&#x51FA;&#x5C42;&#x3002;</p>
<h2 id="&#x590D;&#x7528;&#x6765;&#x81EA;&#x5176;&#x5B83;&#x6846;&#x67B6;&#x7684;&#x6A21;&#x578B;">&#x590D;&#x7528;&#x6765;&#x81EA;&#x5176;&#x5B83;&#x6846;&#x67B6;&#x7684;&#x6A21;&#x578B;</h2>
<p>&#x5982;&#x679C;&#x6A21;&#x578B;&#x662F;&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x6846;&#x67B6;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#x7684;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x624B;&#x52A8;&#x52A0;&#x8F7D;&#x6743;&#x91CD;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x4F7F;&#x7528; Theano &#x8BAD;&#x7EC3;&#xFF0C;&#x5219;&#x4F7F;&#x7528; Theano &#x4EE3;&#x7801;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x5B83;&#x4EEC;&#x5206;&#x914D;&#x7ED9;&#x76F8;&#x5E94;&#x7684;&#x53D8;&#x91CF;&#x3002; &#x8FD9;&#x53EF;&#x80FD;&#x662F;&#x76F8;&#x5F53;&#x4E4F;&#x5473;&#x7684;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x663E;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x590D;&#x5236;&#x4F7F;&#x7528;&#x53E6;&#x4E00;&#x4E2A;&#x6846;&#x67B6;&#x8BAD;&#x7EC3;&#x7684;&#x6A21;&#x578B;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x9690;&#x85CF;&#x5C42;&#x7684;&#x6743;&#x91CD;&#x548C;&#x504F;&#x7F6E;&#xFF1A;</p>
<p><img src="../images/chapter_11/o-11-3.png" alt=""></p>
<h2 id="&#x51BB;&#x7ED3;&#x8F83;&#x4F4E;&#x5C42;">&#x51BB;&#x7ED3;&#x8F83;&#x4F4E;&#x5C42;</h2>
<p>&#x7B2C;&#x4E00;&#x4E2A; DNN &#x7684;&#x8F83;&#x4F4E;&#x5C42;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x5B66;&#x4F1A;&#x4E86;&#x68C0;&#x6D4B;&#x56FE;&#x7247;&#x4E2D;&#x7684;&#x4F4E;&#x7EA7;&#x7279;&#x5F81;&#xFF0C;&#x8FD9;&#x5C06;&#x5728;&#x4E24;&#x4E2A;&#x56FE;&#x50CF;&#x5206;&#x7C7B;&#x4EFB;&#x52A1;&#x4E2D;&#x6709;&#x7528;&#xFF0C;&#x56E0;&#x6B64;&#x60A8;&#x53EF;&#x4EE5;&#x6309;&#x7167;&#x539F;&#x6837;&#x91CD;&#x65B0;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x5C42;&#x3002; &#x5728;&#x8BAD;&#x7EC3;&#x65B0;&#x7684; DNN &#x65F6;&#xFF0C;&#x201C;&#x51BB;&#x7ED3;&#x201D;&#x6743;&#x91CD;&#x901A;&#x5E38;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x4E3B;&#x610F;&#xFF1A;&#x5982;&#x679C;&#x8F83;&#x4F4E;&#x5C42;&#x6743;&#x91CD;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x8F83;&#x9AD8;&#x5C42;&#x6743;&#x91CD;&#x5C06;&#x66F4;&#x5BB9;&#x6613;&#x8BAD;&#x7EC3;&#xFF08;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x5B66;&#x4E60;&#x4E00;&#x4E2A;&#x79FB;&#x52A8;&#x7684;&#x76EE;&#x6807;&#xFF09;&#x3002; &#x8981;&#x5728;&#x8BAD;&#x7EC3;&#x671F;&#x95F4;&#x51BB;&#x7ED3;&#x8F83;&#x4F4E;&#x5C42;&#xFF0C;&#x6700;&#x7B80;&#x5355;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x7ED9;&#x4F18;&#x5316;&#x5668;&#x5217;&#x51FA;&#x8981;&#x8BAD;&#x7EC3;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x4E0D;&#x5305;&#x62EC;&#x6765;&#x81EA;&#x8F83;&#x4F4E;&#x5C42;&#x7684;&#x53D8;&#x91CF;&#xFF1A;</p>
<p><img src="../images/chapter_11/o-11-4.png" alt=""></p>
<p>&#x7B2C;&#x4E00;&#x884C;&#x83B7;&#x5F97;&#x9690;&#x85CF;&#x5C42; 3 &#x548C; 4 &#x4EE5;&#x53CA;&#x8F93;&#x51FA;&#x5C42;&#x4E2D;&#x6240;&#x6709;&#x53EF;&#x8BAD;&#x7EC3;&#x53D8;&#x91CF;&#x7684;&#x5217;&#x8868;&#x3002; &#x8FD9;&#x7559;&#x4E0B;&#x4E86;&#x9690;&#x85CF;&#x5C42; 1 &#x548C; 2 &#x4E2D;&#x7684;&#x53D8;&#x91CF;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8FD9;&#x4E2A;&#x53D7;&#x9650;&#x5236;&#x7684;&#x53EF;&#x5217;&#x8868;&#x53D8;&#x91CF;&#x5217;&#x8868;&#x63D0;&#x4F9B;&#x7ED9;<code>optimizer</code>&#x7684;<code>minimize()</code>&#x51FD;&#x6570;&#x3002;&#x5F53;&#x5F53;&#xFF01; &#x73B0;&#x5728;&#xFF0C;&#x5C42; 1 &#x548C;&#x5C42; 2 &#x88AB;&#x51BB;&#x7ED3;&#xFF1A;&#x5728;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF08;&#x901A;&#x5E38;&#x79F0;&#x4E3A;&#x51BB;&#x7ED3;&#x5C42;&#xFF09;&#x3002;</p>
<h2 id="&#x7F13;&#x5B58;&#x51BB;&#x7ED3;&#x5C42;">&#x7F13;&#x5B58;&#x51BB;&#x7ED3;&#x5C42;</h2>
<p>&#x7531;&#x4E8E;&#x51BB;&#x7ED3;&#x5C42;&#x4E0D;&#x4F1A;&#x6539;&#x53D8;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x4E3A;&#x6BCF;&#x4E2A;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#x7F13;&#x5B58;&#x6700;&#x4E0A;&#x9762;&#x7684;&#x51BB;&#x7ED3;&#x5C42;&#x7684;&#x8F93;&#x51FA;&#x3002; &#x7531;&#x4E8E;&#x8BAD;&#x7EC3;&#x8D2F;&#x7A7F;&#x6574;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#x5F88;&#x591A;&#x6B21;&#xFF0C;&#x8FD9;&#x5C06;&#x7ED9;&#x4F60;&#x4E00;&#x4E2A;&#x5DE8;&#x5927;&#x7684;&#x901F;&#x5EA6;&#x63D0;&#x5347;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x4E2A;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#x53EA;&#x9700;&#x8981;&#x7ECF;&#x8FC7;&#x4E00;&#x6B21;&#x51BB;&#x7ED3;&#x5C42;&#xFF08;&#x800C;&#x4E0D;&#x662F;&#x6BCF;&#x4E2A;&#x8FED;&#x4EE3;&#x4E00;&#x6B21;&#xFF09;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5148;&#x8FD0;&#x884C;&#x6574;&#x4E2A;&#x8BAD;&#x7EC3;&#x96C6;&#xFF08;&#x5047;&#x8BBE;&#x4F60;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x5185;&#x5B58;&#xFF09;&#xFF1A;</p>
<pre><code class="lang-py">hidden2_outputs = sess.run(hidden2, feed_dict={X: X_train})
</code></pre>
<p>&#x7136;&#x540E;&#x5728;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4E0D;&#x518D;&#x5BF9;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#x5EFA;&#x7ACB;&#x6279;&#x6B21;&#xFF0C;&#x800C;&#x662F;&#x4ECE;&#x9690;&#x85CF;&#x5C42;2&#x7684;&#x8F93;&#x51FA;&#x5EFA;&#x7ACB;&#x6279;&#x6B21;&#xFF0C;&#x5E76;&#x5C06;&#x5B83;&#x4EEC;&#x63D0;&#x4F9B;&#x7ED9;&#x8BAD;&#x7EC3;&#x64CD;&#x4F5C;&#xFF1A;</p>
<p><img src="../images/chapter_11/o-11-5.png" alt=""></p>
<p>&#x6700;&#x540E;&#x4E00;&#x884C;&#x8FD0;&#x884C;&#x5148;&#x524D;&#x5B9A;&#x4E49;&#x7684;&#x8BAD;&#x7EC3;&#x64CD;&#x4F5C;&#xFF08;&#x51BB;&#x7ED3;&#x5C42; 1 &#x548C; 2&#xFF09;&#xFF0C;&#x5E76;&#x4ECE;&#x7B2C;&#x4E8C;&#x4E2A;&#x9690;&#x85CF;&#x5C42;&#xFF08;&#x4EE5;&#x53CA;&#x8BE5;&#x6279;&#x6B21;&#x7684;&#x76EE;&#x6807;&#xFF09;&#x4E3A;&#x5176;&#x8F93;&#x51FA;&#x4E00;&#x6279;&#x8F93;&#x51FA;&#x3002; &#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x7ED9; TensorFlow &#x9690;&#x85CF;&#x5C42; 2 &#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x4E0D;&#x4F1A;&#x53BB;&#x8BC4;&#x4F30;&#x5B83;&#xFF08;&#x6216;&#x8005;&#x5B83;&#x6240;&#x4F9D;&#x8D56;&#x7684;&#x4EFB;&#x4F55;&#x8282;&#x70B9;&#xFF09;&#x3002;</p>
<h2 id="&#x8C03;&#x6574;&#xFF0C;&#x5220;&#x9664;&#x6216;&#x66FF;&#x6362;&#x8F83;&#x9AD8;&#x5C42;">&#x8C03;&#x6574;&#xFF0C;&#x5220;&#x9664;&#x6216;&#x66FF;&#x6362;&#x8F83;&#x9AD8;&#x5C42;</h2>
<p>&#x539F;&#x59CB;&#x6A21;&#x578B;&#x7684;&#x8F93;&#x51FA;&#x5C42;&#x901A;&#x5E38;&#x5E94;&#x8BE5;&#x88AB;&#x66FF;&#x6362;&#xFF0C;&#x56E0;&#x4E3A;&#x5BF9;&#x4E8E;&#x65B0;&#x7684;&#x4EFB;&#x52A1;&#x6765;&#x8BF4;&#xFF0C;&#x6700;&#x6709;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x7528;&#x5904;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x9002;&#x5408;&#x65B0;&#x4EFB;&#x52A1;&#x7684;&#x8F93;&#x51FA;&#x6570;&#x91CF;&#x3002;</p>
<p>&#x7C7B;&#x4F3C;&#x5730;&#xFF0C;&#x539F;&#x59CB;&#x6A21;&#x578B;&#x7684;&#x8F83;&#x9AD8;&#x9690;&#x85CF;&#x5C42;&#x4E0D;&#x592A;&#x53EF;&#x80FD;&#x50CF;&#x8F83;&#x4F4E;&#x5C42;&#x4E00;&#x6837;&#x6709;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x5BF9;&#x4E8E;&#x65B0;&#x4EFB;&#x52A1;&#x6765;&#x8BF4;&#x6700;&#x6709;&#x7528;&#x7684;&#x9AD8;&#x5C42;&#x7279;&#x5F81;&#x53EF;&#x80FD;&#x4E0E;&#x5BF9;&#x539F;&#x59CB;&#x4EFB;&#x52A1;&#x6700;&#x6709;&#x7528;&#x7684;&#x9AD8;&#x5C42;&#x7279;&#x5F81;&#x660E;&#x663E;&#x4E0D;&#x540C;&#x3002; &#x4F60;&#x9700;&#x8981;&#x627E;&#x5230;&#x6B63;&#x786E;&#x7684;&#x5C42;&#x6570;&#x6765;&#x590D;&#x7528;&#x3002;</p>
<p>&#x5C1D;&#x8BD5;&#x5148;&#x51BB;&#x7ED3;&#x6240;&#x6709;&#x590D;&#x5236;&#x7684;&#x5C42;&#xFF0C;&#x7136;&#x540E;&#x8BAD;&#x7EC3;&#x6A21;&#x578B;&#x5E76;&#x67E5;&#x770B;&#x5B83;&#x662F;&#x5982;&#x4F55;&#x6267;&#x884C;&#x7684;&#x3002; &#x7136;&#x540E;&#x5C1D;&#x8BD5;&#x89E3;&#x51BB;&#x4E00;&#x4E2A;&#x6216;&#x4E24;&#x4E2A;&#x8F83;&#x9AD8;&#x9690;&#x85CF;&#x5C42;&#xFF0C;&#x8BA9;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x8C03;&#x6574;&#x5B83;&#x4EEC;&#xFF0C;&#x770B;&#x770B;&#x6027;&#x80FD;&#x662F;&#x5426;&#x63D0;&#x9AD8;&#x3002; &#x60A8;&#x62E5;&#x6709;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x8D8A;&#x591A;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x89E3;&#x51BB;&#x7684;&#x5C42;&#x6570;&#x5C31;&#x8D8A;&#x591A;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4ECD;&#x7136;&#x65E0;&#x6CD5;&#x83B7;&#x5F97;&#x826F;&#x597D;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x5E76;&#x4E14;&#x60A8;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x5F88;&#x5C11;&#xFF0C;&#x8BF7;&#x5C1D;&#x8BD5;&#x5220;&#x9664;&#x9876;&#x90E8;&#x7684;&#x9690;&#x85CF;&#x5C42;&#xFF0C;&#x5E76;&#x518D;&#x6B21;&#x51BB;&#x7ED3;&#x6240;&#x6709;&#x5269;&#x4F59;&#x7684;&#x9690;&#x85CF;&#x5C42;&#x3002; &#x60A8;&#x53EF;&#x4EE5;&#x8FED;&#x4EE3;&#xFF0C;&#x76F4;&#x5230;&#x627E;&#x5230;&#x6B63;&#x786E;&#x7684;&#x5C42;&#x6570;&#x91CD;&#x590D;&#x4F7F;&#x7528;&#x3002; &#x5982;&#x679C;&#x60A8;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x66FF;&#x6362;&#x9876;&#x90E8;&#x7684;&#x9690;&#x85CF;&#x5C42;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E22;&#x6389;&#x5B83;&#x4EEC;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x6DFB;&#x52A0;&#x66F4;&#x591A;&#x7684;&#x9690;&#x85CF;&#x5C42;&#x3002;</p>
<h2 id="model-zoos">Model Zoos</h2>
<p>&#x4F60;&#x5728;&#x54EA;&#x91CC;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x7C7B;&#x4F3C;&#x4E8E;&#x4F60;&#x60F3;&#x8981;&#x89E3;&#x51B3;&#x7684;&#x4EFB;&#x52A1;&#x8BAD;&#x7EC3;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF1F; &#x9996;&#x5148;&#x770B;&#x770B;&#x663E;&#x7136;&#x662F;&#x5728;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x6A21;&#x578B;&#x76EE;&#x5F55;&#x3002; &#x8FD9;&#x662F;&#x4FDD;&#x5B58;&#x6240;&#x6709;&#x6A21;&#x578B;&#x5E76;&#x7EC4;&#x7EC7;&#x5B83;&#x4EEC;&#x7684;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x7406;&#x7531;&#xFF0C;&#x4EE5;&#x4FBF;&#x60A8;&#x4EE5;&#x540E;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x5730;&#x68C0;&#x7D22;&#x5B83;&#x4EEC;&#x3002; &#x53E6;&#x4E00;&#x4E2A;&#x9009;&#x62E9;&#x662F;&#x5728;&#x6A21;&#x578B;&#x52A8;&#x7269;&#x56ED;&#x4E2D;&#x641C;&#x7D22;&#x3002; &#x8BB8;&#x591A;&#x4EBA;&#x4E3A;&#x4E86;&#x5404;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x4EFB;&#x52A1;&#x800C;&#x8BAD;&#x7EC3;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6A21;&#x578B;&#xFF0C;&#x5E76;&#x4E14;&#x5584;&#x610F;&#x5730;&#x5411;&#x516C;&#x4F17;&#x53D1;&#x5E03;&#x9884;&#x8BAD;&#x7EC3;&#x6A21;&#x578B;&#x3002;</p>
<p>TensorFlow &#x5728; <a href="https://github.com/tensorflow/models" target="_blank">https://github.com/tensorflow/models</a> &#x4E2D;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x6A21;&#x578B;&#x52A8;&#x7269;&#x56ED;&#x3002; &#x7279;&#x522B;&#x662F;&#xFF0C;&#x5B83;&#x5305;&#x542B;&#x4E86;&#x5927;&#x591A;&#x6570;&#x6700;&#x5148;&#x8FDB;&#x7684;&#x56FE;&#x50CF;&#x5206;&#x7C7B;&#x7F51;&#x7EDC;&#xFF0C;&#x5982; VGG&#xFF0C;Inception &#x548C; ResNet&#xFF08;&#x53C2;&#x89C1;&#x7B2C; 13 &#x7AE0;&#xFF0C;&#x68C0;&#x67E5;<code>model/slim</code>&#x76EE;&#x5F55;&#xFF09;&#xFF0C;&#x5305;&#x62EC;&#x4EE3;&#x7801;&#xFF0C;&#x9884;&#x8BAD;&#x7EC3;&#x6A21;&#x578B;&#x548C; &#x5DE5;&#x5177;&#x6765;&#x4E0B;&#x8F7D;&#x6D41;&#x884C;&#x7684;&#x56FE;&#x50CF;&#x6570;&#x636E;&#x96C6;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x4E2A;&#x6D41;&#x884C;&#x7684;&#x6A21;&#x578B;&#x52A8;&#x7269;&#x56ED;&#x662F; Caffe &#x6A21;&#x578B;&#x52A8;&#x7269;&#x56ED;&#x3002; &#x5B83;&#x8FD8;&#x5305;&#x542B;&#x8BB8;&#x591A;&#x5728;&#x5404;&#x79CD;&#x6570;&#x636E;&#x96C6;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;ImageNet&#xFF0C;Places &#x6570;&#x636E;&#x5E93;&#xFF0C;CIFAR10 &#x7B49;&#xFF09;&#x4E0A;&#x8BAD;&#x7EC3;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x6A21;&#x578B;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;LeNet&#xFF0C;AlexNet&#xFF0C;ZFNet&#xFF0C;GoogLeNet&#xFF0C;VGGNet&#xFF0C;&#x5F00;&#x59CB;&#xFF09;&#x3002; Saumitro Dasgupta &#x5199;&#x4E86;&#x4E00;&#x4E2A;&#x8F6C;&#x6362;&#x5668;&#xFF0C;&#x53EF;&#x4EE5;&#x5728; <a href="https://github.com/ethereon/caffetensorflow" target="_blank">https://github.com/ethereon/caffetensorflow</a>&#x3002;</p>
<h2 id="&#x65E0;&#x76D1;&#x7763;&#x7684;&#x9884;&#x8BAD;&#x7EC3;">&#x65E0;&#x76D1;&#x7763;&#x7684;&#x9884;&#x8BAD;&#x7EC3;</h2>
<p><img src="../images/chapter_11/11-5.png" alt=""></p>
<p>&#x5047;&#x8BBE;&#x4F60;&#x60F3;&#x8981;&#x89E3;&#x51B3;&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x4F60;&#x6CA1;&#x6709;&#x592A;&#x591A;&#x7684;&#x6807;&#x8BB0;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#xFF0C;&#x4F46;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x4F60;&#x4E0D;&#x80FD;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x7C7B;&#x4F3C;&#x7684;&#x4EFB;&#x52A1;&#x8BAD;&#x7EC3;&#x6A21;&#x578B;&#x3002; &#x4E0D;&#x8981;&#x5931;&#x53BB;&#x6240;&#x6709;&#x5E0C;&#x671B;&#xFF01; &#x9996;&#x5148;&#xFF0C;&#x4F60;&#x5F53;&#x7136;&#x5E94;&#x8BE5;&#x5C1D;&#x8BD5;&#x6536;&#x96C6;&#x66F4;&#x591A;&#x7684;&#x6709;&#x6807;&#x7B7E;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x8FD9;&#x592A;&#x96BE;&#x6216;&#x592A;&#x6602;&#x8D35;&#xFF0C;&#x4F60;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x65E0;&#x76D1;&#x7763;&#x7684;&#x8BAD;&#x7EC3;&#xFF08;&#x89C1;&#x56FE; 11-5&#xFF09;&#x3002; &#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;&#x5F88;&#x591A;&#x672A;&#x6807;&#x8BB0;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x9010;&#x5C42;&#x8BAD;&#x7EC3;&#x5C42;&#xFF0C;&#x4ECE;&#x6700;&#x4F4E;&#x5C42;&#x5F00;&#x59CB;&#xFF0C;&#x7136;&#x540E;&#x4E0A;&#x5347;&#xFF0C;&#x4F7F;&#x7528;&#x65E0;&#x76D1;&#x7763;&#x7684;&#x7279;&#x5F81;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;&#xFF0C;&#x5982;&#x9650;&#x5236;&#x73BB;&#x5C14;&#x5179;&#x66FC;&#x673A;&#xFF08;RBM&#xFF1B;&#x89C1;&#x9644;&#x5F55; E&#xFF09;&#x6216;&#x81EA;&#x52A8;&#x7F16;&#x7801;&#x5668;&#xFF08;&#x89C1;&#x7B2C; 15 &#x7AE0;&#xFF09;&#x3002; &#x6BCF;&#x4E2A;&#x5C42;&#x90FD;&#x88AB;&#x8BAD;&#x7EC3;&#x6210;&#x5148;&#x524D;&#x8BAD;&#x7EC3;&#x8FC7;&#x7684;&#x5C42;&#x7684;&#x8F93;&#x51FA;&#xFF08;&#x9664;&#x4E86;&#x88AB;&#x8BAD;&#x7EC3;&#x7684;&#x5C42;&#x4E4B;&#x5916;&#x7684;&#x6240;&#x6709;&#x5C42;&#x90FD;&#x88AB;&#x51BB;&#x7ED3;&#xFF09;&#x3002; &#x4E00;&#x65E6;&#x6240;&#x6709;&#x5C42;&#x90FD;&#x4EE5;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x4E86;&#x8BAD;&#x7EC3;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x76D1;&#x7763;&#x5F0F;&#x5B66;&#x4E60;&#xFF08;&#x5373;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#xFF09;&#x5BF9;&#x7F51;&#x7EDC;&#x8FDB;&#x884C;&#x5FAE;&#x8C03;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x76F8;&#x5F53;&#x6F2B;&#x957F;&#x800C;&#x4E4F;&#x5473;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x4F46;&#x901A;&#x5E38;&#x8FD0;&#x4F5C;&#x826F;&#x597D;&#x3002; &#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x8FD9;&#x662F; Geoffrey Hinton &#x548C;&#x4ED6;&#x7684;&#x56E2;&#x961F;&#x5728; 2006 &#x5E74;&#x4F7F;&#x7528;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x5BFC;&#x81F4;&#x4E86;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x590D;&#x5174;&#x548C;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x6210;&#x529F;&#x3002; &#x76F4;&#x5230; 2010 &#x5E74;&#xFF0C;&#x65E0;&#x76D1;&#x7763;&#x9884;&#x8BAD;&#x7EC3;&#xFF08;&#x901A;&#x5E38;&#x4F7F;&#x7528; RBM&#xFF09;&#x662F;&#x6DF1;&#x5EA6;&#x7F51;&#x7EDC;&#x7684;&#x6807;&#x51C6;&#xFF0C;&#x53EA;&#x6709;&#x5728;&#x68AF;&#x5EA6;&#x6D88;&#x5931;&#x95EE;&#x9898;&#x5F97;&#x5230;&#x7F13;&#x89E3;&#x4E4B;&#x540E;&#xFF0C;&#x7EAF;&#x8BAD;&#x7EC3; DNN &#x624D;&#x66F4;&#x4E3A;&#x666E;&#x904D;&#x3002; &#x7136;&#x800C;&#xFF0C;&#x5F53;&#x60A8;&#x6709;&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x7684;&#x4EFB;&#x52A1;&#x9700;&#x8981;&#x89E3;&#x51B3;&#x65F6;&#xFF0C;&#x65E0;&#x76D1;&#x7763;&#x8BAD;&#x7EC3;&#xFF08;&#x73B0;&#x5728;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x81EA;&#x52A8;&#x7F16;&#x7801;&#x5668;&#x800C;&#x4E0D;&#x662F; RBM&#xFF09;&#x4ECD;&#x7136;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x6CA1;&#x6709;&#x7C7B;&#x4F3C;&#x7684;&#x6A21;&#x578B;&#x53EF;&#x4EE5;&#x91CD;&#x590D;&#x4F7F;&#x7528;&#xFF0C;&#x800C;&#x4E14;&#x6807;&#x8BB0;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x5F88;&#x5C11;&#xFF0C;&#x4F46;&#x662F;&#x5927;&#x91CF;&#x7684;&#x672A;&#x6807;&#x8BB0;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x3002;&#xFF08;&#x53E6;&#x4E00;&#x4E2A;&#x9009;&#x62E9;&#x662F;&#x63D0;&#x51FA;&#x4E00;&#x4E2A;&#x76D1;&#x7763;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x5730;&#x6536;&#x96C6;&#x5927;&#x91CF;&#x6807;&#x8BB0;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#xFF0C;&#x5982;&#x524D;&#x6240;&#x8FF0;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x6A21;&#x578B;&#x6765;&#x8BC6;&#x522B;&#x56FE;&#x7247;&#x4E2D;&#x7684;&#x670B;&#x53CB;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x4E0B;&#x8F7D;&#x6570;&#x767E;&#x4E07;&#x5F20;&#x8138;&#x5E76;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x5206;&#x7C7B;&#x5668;&#x6765;&#x68C0;&#x6D4B;&#x4E24;&#x5F20;&#x8138;&#x662F;&#x5426;&#x76F8;&#x540C;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x6B64;&#x5206;&#x7C7B;&#x5668;&#x5C06;&#x65B0;&#x56FE;&#x7247;&#x4E0E;&#x4F60;&#x670B;&#x53CB;&#x7684;&#x6BCF;&#x5F20;&#x7167;&#x7247;&#x505A;&#x6BD4;&#x8F83;&#x3002;&#xFF09;</p>
<h2 id="&#x5728;&#x8F85;&#x52A9;&#x4EFB;&#x52A1;&#x4E0A;&#x9884;&#x8BAD;&#x7EC3;">&#x5728;&#x8F85;&#x52A9;&#x4EFB;&#x52A1;&#x4E0A;&#x9884;&#x8BAD;&#x7EC3;</h2>
<p>&#x6700;&#x540E;&#x4E00;&#x79CD;&#x9009;&#x62E9;&#x662F;&#x5728;&#x8F85;&#x52A9;&#x4EFB;&#x52A1;&#x4E0A;&#x8BAD;&#x7EC3;&#x7B2C;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x83B7;&#x53D6;&#x6216;&#x751F;&#x6210;&#x6807;&#x8BB0;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#xFF0C;&#x7136;&#x540E;&#x91CD;&#x65B0;&#x4F7F;&#x7528;&#x8BE5;&#x7F51;&#x7EDC;&#x7684;&#x8F83;&#x4F4E;&#x5C42;&#x6765;&#x5B8C;&#x6210;&#x60A8;&#x7684;&#x5B9E;&#x9645;&#x4EFB;&#x52A1;&#x3002; &#x7B2C;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x8F83;&#x4F4E;&#x5C42;&#x5C06;&#x5B66;&#x4E60;&#x53EF;&#x80FD;&#x88AB;&#x7B2C;&#x4E8C;&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x91CD;&#x590D;&#x4F7F;&#x7528;&#x7684;&#x7279;&#x5F81;&#x68C0;&#x6D4B;&#x5668;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x8BC6;&#x522B;&#x9762;&#x5B54;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x53EA;&#x6709;&#x51E0;&#x4E2A;&#x4EBA;&#x7684;&#x7167;&#x7247; - &#x663E;&#x7136;&#x4E0D;&#x8DB3;&#x4EE5;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x5206;&#x7C7B;&#x5668;&#x3002; &#x6536;&#x96C6;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x6570;&#x767E;&#x5F20;&#x7167;&#x7247;&#x5C06;&#x662F;&#x4E0D;&#x5B9E;&#x9645;&#x7684;&#x3002; &#x4F46;&#x662F;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x6536;&#x96C6;&#x5927;&#x91CF;&#x968F;&#x673A;&#x4EBA;&#x5458;&#x7684;&#x7167;&#x7247;&#xFF0C;&#x5E76;&#x8BAD;&#x7EC3;&#x7B2C;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6765;&#x68C0;&#x6D4B;&#x4E24;&#x5F20;&#x4E0D;&#x540C;&#x7684;&#x7167;&#x7247;&#x662F;&#x5426;&#x5C5E;&#x4E8E;&#x540C;&#x4E00;&#x4E2A;&#x4EBA;&#x3002; &#x8FD9;&#x6837;&#x7684;&#x7F51;&#x7EDC;&#x5C06;&#x5B66;&#x4E60;&#x9762;&#x90E8;&#x4F18;&#x79C0;&#x7684;&#x7279;&#x5F81;&#x68C0;&#x6D4B;&#x5668;&#xFF0C;&#x6240;&#x4EE5;&#x91CD;&#x590D;&#x4F7F;&#x7528;&#x5B83;&#x7684;&#x8F83;&#x4F4E;&#x5C42;&#x5C06;&#x5141;&#x8BB8;&#x4F60;&#x4F7F;&#x7528;&#x5F88;&#x5C11;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x6765;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x9762;&#x90E8;&#x5206;&#x7C7B;&#x5668;&#x3002;</p>
<p>&#x6536;&#x96C6;&#x6CA1;&#x6709;&#x6807;&#x7B7E;&#x7684;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#x901A;&#x5E38;&#x662F;&#x76F8;&#x5F53;&#x4FBF;&#x5B9C;&#x7684;&#xFF0C;&#x4F46;&#x6807;&#x6CE8;&#x5B83;&#x4EEC;&#x5374;&#x76F8;&#x5F53;&#x6602;&#x8D35;&#x3002; &#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E00;&#x79CD;&#x5E38;&#x89C1;&#x7684;&#x6280;&#x672F;&#x662F;&#x5C06;&#x6240;&#x6709;&#x8BAD;&#x7EC3;&#x6837;&#x4F8B;&#x6807;&#x8BB0;&#x4E3A;&#x201C;&#x597D;&#x201D;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x7834;&#x574F;&#x597D;&#x7684;&#x8BAD;&#x7EC3;&#x6837;&#x4F8B;&#x4EA7;&#x751F;&#x8BB8;&#x591A;&#x65B0;&#x7684;&#x8BAD;&#x7EC3;&#x6837;&#x4F8B;&#xFF0C;&#x5E76;&#x5C06;&#x8FD9;&#x4E9B;&#x6837;&#x4F8B;&#x6807;&#x8BB0;&#x4E3A;&#x201C;&#x574F;&#x201D;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x8BAD;&#x7EC3;&#x7B2C;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC; &#x5C06;&#x5B9E;&#x4F8B;&#x5206;&#x7C7B;&#x4E3A;&#x597D;&#x6216;&#x4E0D;&#x597D;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x4E0B;&#x8F7D;&#x6570;&#x767E;&#x4E07;&#x4E2A;&#x53E5;&#x5B50;&#xFF0C;&#x5C06;&#x5176;&#x6807;&#x8BB0;&#x4E3A;&#x201C;&#x597D;&#x201D;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x6BCF;&#x4E2A;&#x53E5;&#x5B50;&#x4E2D;&#x968F;&#x673A;&#x66F4;&#x6539;&#x4E00;&#x4E2A;&#x5355;&#x8BCD;&#xFF0C;&#x5E76;&#x5C06;&#x7ED3;&#x679C;&#x8BED;&#x53E5;&#x6807;&#x8BB0;&#x4E3A;&#x201C;&#x4E0D;&#x597D;&#x201D;&#x3002;&#x5982;&#x679C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x53EF;&#x4EE5;&#x544A;&#x8BC9;&#x201C;The dog sleeps&#x201D;&#x662F;&#x597D;&#x7684;&#x53E5;&#x5B50;&#xFF0C;&#x4F46;&#x201C;The dog they&#x201D;&#x662F;&#x574F;&#x7684;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x77E5;&#x9053;&#x76F8;&#x5F53;&#x591A;&#x7684;&#x8BED;&#x8A00;&#x3002; &#x91CD;&#x7528;&#x5176;&#x8F83;&#x4F4E;&#x5C42;&#x53EF;&#x80FD;&#x6709;&#x52A9;&#x4E8E;&#x8BB8;&#x591A;&#x8BED;&#x8A00;&#x5904;&#x7406;&#x4EFB;&#x52A1;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x8BAD;&#x7EC3;&#x7B2C;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x4E3A;&#x6BCF;&#x4E2A;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#x8F93;&#x51FA;&#x4E00;&#x4E2A;&#x5206;&#x6570;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x635F;&#x5931;&#x51FD;&#x6570;&#x786E;&#x4FDD;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x5B9E;&#x4F8B;&#x7684;&#x5206;&#x6570;&#x5927;&#x4E8E;&#x4E00;&#x4E2A;&#x574F;&#x5B9E;&#x4F8B;&#x7684;&#x5206;&#x6570;&#x81F3;&#x5C11;&#x4E00;&#x5B9A;&#x7684;&#x8FB9;&#x9645;&#x3002; &#x8FD9;&#x88AB;&#x79F0;&#x4E3A;&#x6700;&#x5927;&#x8FB9;&#x9645;&#x5B66;&#x4E60;.</p>
<h2 id="&#x66F4;&#x5FEB;&#x7684;&#x4F18;&#x5316;&#x5668;">&#x66F4;&#x5FEB;&#x7684;&#x4F18;&#x5316;&#x5668;</h2>
<p>&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x5927;&#x7684;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x53EF;&#x80FD;&#x4F1A;&#x975E;&#x5E38;&#x7F13;&#x6162;&#x3002; &#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x770B;&#x5230;&#x4E86;&#x56DB;&#x79CD;&#x52A0;&#x901F;&#x8BAD;&#x7EC3;&#x7684;&#x65B9;&#x6CD5;&#xFF08;&#x5E76;&#x4E14;&#x8FBE;&#x5230;&#x66F4;&#x597D;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF09;&#xFF1A;&#x5BF9;&#x8FDE;&#x63A5;&#x6743;&#x91CD;&#x5E94;&#x7528;&#x826F;&#x597D;&#x7684;&#x521D;&#x59CB;&#x5316;&#x7B56;&#x7565;&#xFF0C;&#x4F7F;&#x7528;&#x826F;&#x597D;&#x7684;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF0C;&#x4F7F;&#x7528;&#x6279;&#x91CF;&#x89C4;&#x8303;&#x5316;&#x4EE5;&#x53CA;&#x91CD;&#x7528;&#x9884;&#x8BAD;&#x7EC3;&#x7F51;&#x7EDC;&#x7684;&#x90E8;&#x5206;&#x3002; &#x53E6;&#x4E00;&#x4E2A;&#x5DE8;&#x5927;&#x7684;&#x901F;&#x5EA6;&#x63D0;&#x5347;&#x6765;&#x81EA;&#x4F7F;&#x7528;&#x6BD4;&#x666E;&#x901A;&#x6E10;&#x53D8;&#x4E0B;&#x964D;&#x4F18;&#x5316;&#x5668;&#x66F4;&#x5FEB;&#x7684;&#x4F18;&#x5316;&#x5668;&#x3002; &#x5728;&#x672C;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4ECB;&#x7ECD;&#x6700;&#x6D41;&#x884C;&#x7684;&#xFF1A;&#x52A8;&#x91CF;&#x4F18;&#x5316;&#xFF0C;Nesterov &#x52A0;&#x901F;&#x68AF;&#x5EA6;&#xFF0C;AdaGrad&#xFF0C;RMSProp&#xFF0C;&#x6700;&#x540E;&#x662F; Adam &#x4F18;&#x5316;&#x3002;</p>
<p>&#x5267;&#x900F;&#xFF1A;&#x672C;&#x8282;&#x7684;&#x7ED3;&#x8BBA;&#x662F;&#xFF0C;&#x60A8;&#x51E0;&#x4E4E;&#x603B;&#x662F;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;<code>Adam_optimization</code>&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x60A8;&#x4E0D;&#x5173;&#x5FC3;&#x5B83;&#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#xFF0C;&#x53EA;&#x9700;&#x4F7F;&#x7528;<code>AdamOptimizer</code>&#x66FF;&#x6362;&#x60A8;&#x7684;<code>GradientDescentOptimizer</code>&#xFF0C;&#x7136;&#x540E;&#x8DF3;&#x5230;&#x4E0B;&#x4E00;&#x8282;&#xFF01; &#x53EA;&#x9700;&#x8981;&#x8FD9;&#x4E48;&#x5C0F;&#x7684;&#x6539;&#x52A8;&#xFF0C;&#x8BAD;&#x7EC3;&#x901A;&#x5E38;&#x4F1A;&#x5FEB;&#x51E0;&#x500D;&#x3002; &#x4F46;&#x662F;&#xFF0C;Adam &#x4F18;&#x5316;&#x786E;&#x5B9E;&#x6709;&#x4E09;&#x4E2A;&#x53EF;&#x4EE5;&#x8C03;&#x6574;&#x7684;&#x8D85;&#x53C2;&#x6570;&#xFF08;&#x52A0;&#x4E0A;&#x5B66;&#x4E60;&#x7387;&#xFF09;&#x3002; &#x9ED8;&#x8BA4;&#x503C;&#x901A;&#x5E38;&#x5DE5;&#x4F5C;&#x7684;&#x4E0D;&#x9519;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x60A8;&#x9700;&#x8981;&#x8C03;&#x6574;&#x5B83;&#x4EEC;&#xFF0C;&#x77E5;&#x9053;&#x4ED6;&#x4EEC;&#x600E;&#x4E48;&#x5B9E;&#x73B0;&#x7684;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x5E2E;&#x52A9;&#x3002; Adam &#x4F18;&#x5316;&#x7ED3;&#x5408;&#x4E86;&#x6765;&#x81EA;&#x5176;&#x4ED6;&#x4F18;&#x5316;&#x7B97;&#x6CD5;&#x7684;&#x51E0;&#x4E2A;&#x60F3;&#x6CD5;&#xFF0C;&#x6240;&#x4EE5;&#x5148;&#x770B;&#x770B;&#x8FD9;&#x4E9B;&#x7B97;&#x6CD5;&#x662F;&#x6709;&#x7528;&#x7684;&#x3002;</p>
<h2 id="&#x52A8;&#x91CF;&#x4F18;&#x5316;">&#x52A8;&#x91CF;&#x4F18;&#x5316;</h2>
<p>&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#xFF0C;&#x4E00;&#x4E2A;&#x4FDD;&#x9F84;&#x7403;&#x5728;&#x4E00;&#x4E2A;&#x5149;&#x6ED1;&#x7684;&#x8868;&#x9762;&#x4E0A;&#x5E73;&#x7F13;&#x7684;&#x659C;&#x5761;&#x4E0A;&#x6EDA;&#x52A8;&#xFF1A;&#x5B83;&#x4F1A;&#x7F13;&#x6162;&#x5730;&#x5F00;&#x59CB;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4F1A;&#x5F88;&#x5FEB;&#x5730;&#x8FBE;&#x5230;&#x6700;&#x7EC8;&#x7684;&#x901F;&#x5EA6;&#xFF08;&#x5982;&#x679C;&#x6709;&#x4E00;&#x4E9B;&#x6469;&#x64E6;&#x6216;&#x7A7A;&#x6C14;&#x963B;&#x529B;&#x7684;&#x8BDD;&#xFF09;&#x3002; &#x8FD9;&#x662F; Boris Polyak &#x5728; 1964 &#x5E74;&#x63D0;&#x51FA;&#x7684;&#x52A8;&#x91CF;&#x4F18;&#x5316;&#x80CC;&#x540E;&#x7684;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x60F3;&#x6CD5;&#x3002;&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x666E;&#x901A;&#x7684;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x53EA;&#x9700;&#x8981;&#x6CBF;&#x7740;&#x659C;&#x5761;&#x8FDB;&#x884C;&#x5C0F;&#x7684;&#x6709;&#x89C4;&#x5F8B;&#x7684;&#x4E0B;&#x964D;&#x6B65;&#x9AA4;&#xFF0C;&#x6240;&#x4EE5;&#x9700;&#x8981;&#x66F4;&#x591A;&#x7684;&#x65F6;&#x95F4;&#x624D;&#x80FD;&#x5230;&#x8FBE;&#x5E95;&#x90E8;&#x3002;</p>
<p>&#x56DE;&#x60F3;&#x4E00;&#x4E0B;&#xFF0C;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x53EA;&#x662F;&#x901A;&#x8FC7;&#x76F4;&#x63A5;&#x51CF;&#x53BB;&#x635F;&#x5931;&#x51FD;&#x6570;<code>J(&#x3B8;)</code>&#x76F8;&#x5BF9;&#x4E8E;&#x6743;&#x91CD;<code>&#x3B8;</code>&#x7684;&#x68AF;&#x5EA6;&#xFF0C;&#x4E58;&#x4EE5;&#x5B66;&#x4E60;&#x7387;<code>&#x3B7;</code>&#x6765;&#x66F4;&#x65B0;&#x6743;&#x91CD;<code>&#x3B8;</code>&#x3002; &#x65B9;&#x7A0B;&#x662F;&#xFF1A;<img src="../images/tex-fcaa6f9572165f196fb7fb6e22931557.gif" alt="\theta := \theta - \eta \nabla_\theta J(\theta)">&#x3002;&#x5B83;&#x4E0D;&#x5173;&#x5FC3;&#x65E9;&#x671F;&#x7684;&#x68AF;&#x5EA6;&#x662F;&#x4EC0;&#x4E48;&#x3002; &#x5982;&#x679C;&#x5C40;&#x90E8;&#x68AF;&#x5EA6;&#x5F88;&#x5C0F;&#xFF0C;&#x5219;&#x4F1A;&#x975E;&#x5E38;&#x7F13;&#x6162;&#x3002;</p>
<p><img src="../images/chapter_11/e-11-4.png" alt=""></p>
<p>&#x52A8;&#x91CF;&#x4F18;&#x5316;&#x5F88;&#x5173;&#x5FC3;&#x4EE5;&#x524D;&#x7684;&#x68AF;&#x5EA6;&#xFF1A;&#x5728;&#x6BCF;&#x6B21;&#x8FED;&#x4EE3;&#x65F6;&#xFF0C;&#x5B83;&#x5C06;&#x52A8;&#x91CF;&#x77E2;&#x91CF;<code>m</code>&#xFF08;&#x4E58;&#x4EE5;&#x5B66;&#x4E60;&#x7387;<code>&#x3B7;</code>&#xFF09;&#x4E0E;&#x5C40;&#x90E8;&#x68AF;&#x5EA6;&#x76F8;&#x52A0;&#xFF0C;&#x5E76;&#x4E14;&#x901A;&#x8FC7;&#x7B80;&#x5355;&#x5730;&#x51CF;&#x53BB;&#x8BE5;&#x52A8;&#x91CF;&#x77E2;&#x91CF;&#x6765;&#x66F4;&#x65B0;&#x6743;&#x91CD;&#xFF08;&#x53C2;&#x89C1;&#x516C;&#x5F0F; 11-4&#xFF09;&#x3002; &#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x68AF;&#x5EA6;&#x7528;&#x4F5C;&#x52A0;&#x901F;&#x5EA6;&#xFF0C;&#x4E0D;&#x7528;&#x4F5C;&#x901F;&#x5EA6;&#x3002; &#x4E3A;&#x4E86;&#x6A21;&#x62DF;&#x67D0;&#x79CD;&#x6469;&#x64E6;&#x673A;&#x5236;&#xFF0C;&#x907F;&#x514D;&#x52A8;&#x91CF;&#x8FC7;&#x5927;&#xFF0C;&#x8BE5;&#x7B97;&#x6CD5;&#x5F15;&#x5165;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x8D85;&#x53C2;&#x6570;<code>&#x3B2;</code>&#xFF0C;&#x7B80;&#x79F0;&#x4E3A;&#x52A8;&#x91CF;&#xFF0C;&#x5B83;&#x5FC5;&#x987B;&#x8BBE;&#x7F6E;&#x5728; 0&#xFF08;&#x9AD8;&#x6469;&#x64E6;&#xFF09;&#x548C; 1&#xFF08;&#x65E0;&#x6469;&#x64E6;&#xFF09;&#x4E4B;&#x95F4;&#x3002; &#x5178;&#x578B;&#x7684;&#x52A8;&#x91CF;&#x503C;&#x662F; 0.9&#x3002;</p>
<p>&#x60A8;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x9A8C;&#x8BC1;&#xFF0C;&#x5982;&#x679C;&#x68AF;&#x5EA6;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#xFF0C;&#x5219;&#x6700;&#x7EC8;&#x901F;&#x5EA6;&#xFF08;&#x5373;&#xFF0C;&#x6743;&#x91CD;&#x66F4;&#x65B0;&#x7684;&#x6700;&#x5927;&#x5927;&#x5C0F;&#xFF09;&#x7B49;&#x4E8E;&#x8BE5;&#x68AF;&#x5EA6;&#x4E58;&#x4EE5;&#x5B66;&#x4E60;&#x7387;<code>&#x3B7;</code>&#x4E58;&#x4EE5;<code>1/(1-&#x3B2;)</code>&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;<code>&#x3B2; = 0.9</code>&#xFF0C;&#x5219;&#x6700;&#x7EC8;&#x901F;&#x5EA6;&#x7B49;&#x4E8E;&#x5B66;&#x4E60;&#x7387;&#x7684;&#x68AF;&#x5EA6;&#x4E58;&#x4EE5; 10 &#x500D;&#xFF0C;&#x56E0;&#x6B64;&#x52A8;&#x91CF;&#x4F18;&#x5316;&#x6BD4;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x5FEB; 10 &#x500D;&#xFF01; &#x8FD9;&#x4F7F;&#x52A8;&#x91CF;&#x4F18;&#x5316;&#x6BD4;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x5FEB;&#x5F97;&#x591A;&#x3002; &#x7279;&#x522B;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x7B2C;&#x56DB;&#x7AE0;&#x4E2D;&#x770B;&#x5230;&#xFF0C;&#x5F53;&#x8F93;&#x5165;&#x91CF;&#x5177;&#x6709;&#x975E;&#x5E38;&#x4E0D;&#x540C;&#x7684;&#x5C3A;&#x5EA6;&#x65F6;&#xFF0C;&#x635F;&#x5931;&#x51FD;&#x6570;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x4E00;&#x4E2A;&#x7EC6;&#x957F;&#x7684;&#x7897;&#xFF08;&#x89C1;&#x56FE; 4-7&#xFF09;&#x3002; &#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x901F;&#x5EA6;&#x5F88;&#x5FEB;&#xFF0C;&#x4F46;&#x8981;&#x82B1;&#x5F88;&#x957F;&#x7684;&#x65F6;&#x95F4;&#x624D;&#x80FD;&#x5230;&#x8FBE;&#x5E95;&#x90E8;&#x3002; &#x76F8;&#x53CD;&#xFF0C;&#x52A8;&#x91CF;&#x4F18;&#x5316;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x5FEB;&#x5730;&#x6EDA;&#x4E0B;&#x5C71;&#x8C37;&#x5E95;&#x90E8;&#xFF0C;&#x76F4;&#x5230;&#x8FBE;&#x5230;&#x5E95;&#x90E8;&#xFF08;&#x6700;&#x4F73;&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_11/4-7.png" alt=""></p>
<p>&#x5728;&#x4E0D;&#x4F7F;&#x7528;&#x6279;&#x6807;&#x51C6;&#x5316;&#x7684;&#x6DF1;&#x5C42;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#xFF0C;&#x8F83;&#x9AD8;&#x5C42;&#x5F80;&#x5F80;&#x4F1A;&#x5F97;&#x5230;&#x5177;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x5C3A;&#x5EA6;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x6240;&#x4EE5;&#x4F7F;&#x7528;&#x52A8;&#x91CF;&#x4F18;&#x5316;&#x4F1A;&#x6709;&#x5F88;&#x5927;&#x7684;&#x5E2E;&#x52A9;&#x3002; &#x5B83;&#x4E5F;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x6EDA;&#x8FC7;&#x5C40;&#x90E8;&#x6700;&#x4F18;&#x503C;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x52A8;&#x91CF;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x4F18;&#x5316;&#x5668;&#x53EF;&#x80FD;&#x4F1A;&#x8D85;&#x8C03;&#x4E00;&#x4E9B;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x56DE;&#x6765;&#xFF0C;&#x518D;&#x6B21;&#x8D85;&#x8C03;&#xFF0C;&#x5E76;&#x5728;&#x7A33;&#x5B9A;&#x5728;&#x6700;&#x5C0F;&#x503C;&#x4E4B;&#x524D;&#x591A;&#x6B21;&#x632F;&#x8361;&#x3002; &#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x5728;&#x7CFB;&#x7EDF;&#x4E2D;&#x6709;&#x4E00;&#x70B9;&#x6469;&#x64E6;&#x7684;&#x539F;&#x56E0;&#x4E4B;&#x4E00;&#xFF1A;&#x5B83;&#x6D88;&#x9664;&#x4E86;&#x8FD9;&#x4E9B;&#x632F;&#x8361;&#xFF0C;&#x4ECE;&#x800C;&#x52A0;&#x901F;&#x4E86;&#x6536;&#x655B;&#x3002;</p>
<p>&#x5728; TensorFlow &#x4E2D;&#x5B9E;&#x73B0;&#x52A8;&#x91CF;&#x4F18;&#x5316;&#x662F;&#x4E00;&#x4EF6;&#x7B80;&#x5355;&#x7684;&#x4E8B;&#x60C5;&#xFF1A;&#x53EA;&#x9700;&#x7528;<code>MomentumOptimizer</code>&#x66FF;&#x6362;<code>GradientDescentOptimizer</code>&#xFF0C;&#x7136;&#x540E;&#x8EBA;&#x4E0B;&#x6765;&#x8D5A;&#x94B1;&#xFF01;</p>
<p><img src="../images/chapter_11/o-11-6.png" alt=""></p>
<p>&#x52A8;&#x91CF;&#x4F18;&#x5316;&#x7684;&#x4E00;&#x4E2A;&#x7F3A;&#x70B9;&#x662F;&#x5B83;&#x589E;&#x52A0;&#x4E86;&#x53E6;&#x4E00;&#x4E2A;&#x8D85;&#x53C2;&#x6570;&#x6765;&#x8C03;&#x6574;&#x3002; &#x7136;&#x800C;&#xFF0C;0.9 &#x7684;&#x52A8;&#x91CF;&#x503C;&#x901A;&#x5E38;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x8FD0;&#x884C;&#x826F;&#x597D;&#xFF0C;&#x51E0;&#x4E4E;&#x603B;&#x662F;&#x6BD4;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x5FEB;&#x3002;</p>
<h2 id="nesterov-&#x52A0;&#x901F;&#x68AF;&#x5EA6;">Nesterov &#x52A0;&#x901F;&#x68AF;&#x5EA6;</h2>
<p>Yurii Nesterov &#x5728; 1983 &#x5E74;&#x63D0;&#x51FA;&#x7684;&#x52A8;&#x91CF;&#x4F18;&#x5316;&#x7684;&#x4E00;&#x4E2A;&#x5C0F;&#x53D8;&#x4F53;&#x51E0;&#x4E4E;&#x603B;&#x662F;&#x6BD4;&#x666E;&#x901A;&#x7684;&#x52A8;&#x91CF;&#x4F18;&#x5316;&#x66F4;&#x5FEB;&#x3002; Nesterov &#x52A8;&#x91CF;&#x4F18;&#x5316;&#x6216; Nesterov &#x52A0;&#x901F;&#x68AF;&#x5EA6;&#xFF08;Nesterov Accelerated Gradient&#xFF0C;NAG&#xFF09;&#x7684;&#x601D;&#x60F3;&#x662F;&#x6D4B;&#x91CF;&#x635F;&#x5931;&#x51FD;&#x6570;&#x7684;&#x68AF;&#x5EA6;&#x4E0D;&#x662F;&#x5728;&#x5C40;&#x90E8;&#x4F4D;&#x7F6E;&#xFF0C;&#x800C;&#x662F;&#x5728;&#x52A8;&#x91CF;&#x65B9;&#x5411;&#x7A0D;&#x5FAE;&#x9760;&#x524D;&#xFF08;&#x89C1;&#x516C;&#x5F0F; 11-5&#xFF09;&#x3002; &#x4E0E;&#x666E;&#x901A;&#x7684;&#x52A8;&#x91CF;&#x4F18;&#x5316;&#x7684;&#x552F;&#x4E00;&#x533A;&#x522B;&#x5728;&#x4E8E;&#x68AF;&#x5EA6;&#x662F;&#x5728;<code>&#x3B8;+&#x3B2;m</code>&#x800C;&#x4E0D;&#x662F;&#x5728;<code>&#x3B8;</code>&#x5904;&#x6D4B;&#x91CF;&#x7684;&#x3002;</p>
<p><img src="../images/chapter_11/e-11-5.png" alt=""></p>
<p>&#x8FD9;&#x4E2A;&#x5C0F;&#x5C0F;&#x7684;&#x8C03;&#x6574;&#x662F;&#x53EF;&#x884C;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x52A8;&#x91CF;&#x77E2;&#x91CF;&#x5C06;&#x6307;&#x5411;&#x6B63;&#x786E;&#x7684;&#x65B9;&#x5411;&#xFF08;&#x5373;&#x671D;&#x5411;&#x6700;&#x4F18;&#x65B9;&#x5411;&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#x4F7F;&#x7528;&#x5728;&#x8BE5;&#x65B9;&#x5411;&#x4E0A;&#x6D4B;&#x5F97;&#x7684;&#x68AF;&#x5EA6;&#x7A0D;&#x5FAE;&#x66F4;&#x7CBE;&#x786E;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4F7F;&#x7528; &#x539F;&#x59CB;&#x4F4D;&#x7F6E;&#x7684;&#x68AF;&#x5EA6;&#xFF0C;&#x5982;&#x56FE;11-6&#x6240;&#x793A;&#xFF08;&#x5176;&#x4E2D;<code>&#x2207;1</code>&#x4EE3;&#x8868;&#x5728;&#x8D77;&#x70B9;<code>&#x3B8;</code>&#x5904;&#x6D4B;&#x91CF;&#x7684;&#x635F;&#x5931;&#x51FD;&#x6570;&#x7684;&#x68AF;&#x5EA6;&#xFF0C;<code>&#x2207;2</code>&#x4EE3;&#x8868;&#x4F4D;&#x4E8E;<code>&#x3B8;+&#x3B2;m</code>&#x7684;&#x70B9;&#x5904;&#x7684;&#x68AF;&#x5EA6;&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_11/11-6.png" alt=""></p>
<p>&#x6B63;&#x5982;&#x4F60;&#x6240;&#x770B;&#x5230;&#x7684;&#xFF0C;Nesterov &#x66F4;&#x65B0;&#x7A0D;&#x5FAE;&#x9760;&#x8FD1;&#x6700;&#x4F73;&#x503C;&#x3002; &#x8FC7;&#x4E86;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x8FD9;&#x4E9B;&#x5C0F;&#x7684;&#x6539;&#x8FDB;&#x52A0;&#x8D77;&#x6765;&#xFF0C;NAG &#x6700;&#x7EC8;&#x6BD4;&#x5E38;&#x89C4;&#x7684;&#x52A8;&#x91CF;&#x4F18;&#x5316;&#x5FEB;&#x5F97;&#x591A;&#x3002; &#x6B64;&#x5916;&#xFF0C;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x5F53;&#x52A8;&#x91CF;&#x63A8;&#x52A8;&#x6743;&#x91CD;&#x6A2A;&#x8DE8;&#x5C71;&#x8C37;&#x65F6;&#xFF0C;&#x25BD;1&#x7EE7;&#x7EED;&#x63A8;&#x8FDB;&#x8D8A;&#x8FC7;&#x5C71;&#x8C37;&#xFF0C;&#x800C;&#x25BD;2&#x63A8;&#x56DE;&#x5C71;&#x8C37;&#x7684;&#x5E95;&#x90E8;&#x3002; &#x8FD9;&#x6709;&#x52A9;&#x4E8E;&#x51CF;&#x5C11;&#x632F;&#x8361;&#xFF0C;&#x4ECE;&#x800C;&#x66F4;&#x5FEB;&#x5730;&#x6536;&#x655B;&#x3002;</p>
<p>&#x4E0E;&#x5E38;&#x89C4;&#x7684;&#x52A8;&#x91CF;&#x4F18;&#x5316;&#x76F8;&#x6BD4;&#xFF0C;NAG &#x51E0;&#x4E4E;&#x603B;&#x80FD;&#x52A0;&#x901F;&#x8BAD;&#x7EC3;&#x3002; &#x8981;&#x4F7F;&#x7528;&#x5B83;&#xFF0C;&#x53EA;&#x9700;&#x5728;&#x521B;&#x5EFA;<code>MomentumOptimizer</code>&#x65F6;&#x8BBE;&#x7F6E;<code>use_nesterov = True</code>&#xFF1A;</p>
<p><img src="../images/chapter_11/o-11-7.png" alt=""></p>
<h2 id="adagrad">AdaGrad</h2>
<p>&#x518D;&#x6B21;&#x8003;&#x8651;&#x7EC6;&#x957F;&#x7897;&#x7684;&#x95EE;&#x9898;&#xFF1A;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x4ECE;&#x6700;&#x9661;&#x5CED;&#x7684;&#x659C;&#x5761;&#x5FEB;&#x901F;&#x4E0B;&#x964D;&#xFF0C;&#x7136;&#x540E;&#x7F13;&#x6162;&#x5730;&#x4E0B;&#x5230;&#x8C37;&#x5E95;&#x3002; &#x5982;&#x679C;&#x7B97;&#x6CD5;&#x80FD;&#x591F;&#x65E9;&#x671F;&#x68C0;&#x6D4B;&#x5230;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5E76;&#x4E14;&#x7EA0;&#x6B63;&#x5B83;&#x7684;&#x65B9;&#x5411;&#x6765;&#x6307;&#x5411;&#x5168;&#x5C40;&#x6700;&#x4F18;&#x70B9;&#xFF0C;&#x90A3;&#x5C06;&#x662F;&#x975E;&#x5E38;&#x597D;&#x7684;&#x3002;</p>
<p>AdaGrad &#x7B97;&#x6CD5;&#x901A;&#x8FC7;&#x6CBF;&#x7740;&#x6700;&#x9661;&#x7684;&#x7EF4;&#x5EA6;&#x7F29;&#x5C0F;&#x68AF;&#x5EA6;&#x5411;&#x91CF;&#x6765;&#x5B9E;&#x73B0;&#x8FD9;&#x4E00;&#x70B9;&#xFF08;&#x89C1;&#x516C;&#x5F0F; 11-6&#xFF09;&#xFF1A;</p>
<p><img src="../images/chapter_11/e-11-6.png" alt=""></p>
<p>&#x7B2C;&#x4E00;&#x6B65;&#x5C06;&#x68AF;&#x5EA6;&#x7684;&#x5E73;&#x65B9;&#x7D2F;&#x52A0;&#x5230;&#x77E2;&#x91CF;<code>s</code>&#x4E2D;&#xFF08;<code>&#x2297;</code>&#x7B26;&#x53F7;&#x8868;&#x793A;&#x5355;&#x5143;&#x4E58;&#x6CD5;&#xFF09;&#x3002; &#x8FD9;&#x4E2A;&#x5411;&#x91CF;&#x5316;&#x5F62;&#x5F0F;&#x76F8;&#x5F53;&#x4E8E;&#x5411;&#x91CF;<code>s</code>&#x7684;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;<code>si</code>&#x8BA1;&#x7B97; <img src="../images/tex-4bd72e5d0ad65c82e878dfcf2d29815b.gif" alt="s_i := s_i + (\partial J(\theta) / \partial \theta_i)^2">&#x3002;&#x6362;&#x4E00;&#x79CD;&#x8BF4;&#x6CD5;&#xFF0C;&#x6BCF;&#x4E2A; <img src="../images/tex-e406ac4d7c470823a8619c13dd7101be.gif" alt="s_i"> &#x7D2F;&#x52A0;&#x635F;&#x5931;&#x51FD;&#x6570;&#x5BF9;&#x53C2;&#x6570; <img src="../images/tex-9fe4f6a929e86b5c5a7d19d4a18fc304.gif" alt="\theta_i"> &#x7684;&#x504F;&#x5BFC;&#x6570;&#x7684;&#x5E73;&#x65B9;&#x3002; &#x5982;&#x679C;&#x635F;&#x5931;&#x51FD;&#x6570;&#x6CBF;&#x7740;&#x7B2C;<code>i</code>&#x7EF4;&#x9661;&#x5CED;&#xFF0C;&#x5219;&#x5728;&#x6BCF;&#x6B21;&#x8FED;&#x4EE3;&#x65F6;&#xFF0C;<img src="../images/tex-e406ac4d7c470823a8619c13dd7101be.gif" alt="s_i"> &#x5C06;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x5927;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x6B65;&#x51E0;&#x4E4E;&#x4E0E;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x76F8;&#x540C;&#xFF0C;&#x4F46;&#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x5927;&#x7684;&#x4E0D;&#x540C;&#xFF1A;&#x68AF;&#x5EA6;&#x77E2;&#x91CF;&#x6309;&#x6BD4;&#x4F8B;&#x7F29;&#x5C0F; <img src="../images/chapter_11/o-11-8.png" alt="">&#xFF08;<code>&#x2298;</code>&#x7B26;&#x53F7;&#x8868;&#x793A;&#x5143;&#x7D20;&#x5206;&#x5272;&#xFF0C;<code>&#x3B5;</code>&#x662F;&#x907F;&#x514D;&#x88AB;&#x96F6;&#x9664;&#x7684;&#x5E73;&#x6ED1;&#x9879;&#xFF0C;&#x901A;&#x5E38;&#x8BBE;&#x7F6E;&#x4E3A; <img src="../images/chapter_11/o-11-9.png" alt="">&#x3002; &#x8FD9;&#x4E2A;&#x77E2;&#x91CF;&#x5316;&#x7684;&#x5F62;&#x5F0F;&#x76F8;&#x5F53;&#x4E8E;&#x8BA1;&#x7B97; <img src="../images/chapter_11/o-11-10.png" alt=""> &#x5BF9;&#x4E8E;&#x6240;&#x6709;&#x53C2;&#x6570; <img src="../images/tex-9fe4f6a929e86b5c5a7d19d4a18fc304.gif" alt="\theta_i">&#xFF08;&#x540C;&#x65F6;&#xFF09;&#x3002;</p>
<p>&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x8FD9;&#x79CD;&#x7B97;&#x6CD5;&#x4F1A;&#x964D;&#x4F4E;&#x5B66;&#x4E60;&#x901F;&#x5EA6;&#xFF0C;&#x4F46;&#x5BF9;&#x4E8E;&#x9661;&#x5CED;&#x7684;&#x5C3A;&#x5BF8;&#xFF0C;&#x5176;&#x901F;&#x5EA6;&#x8981;&#x5FEB;&#x4E8E;&#x5177;&#x6709;&#x6E29;&#x548C;&#x7684;&#x659C;&#x7387;&#x7684;&#x5C3A;&#x5BF8;&#x3002; &#x8FD9;&#x88AB;&#x79F0;&#x4E3A;&#x81EA;&#x9002;&#x5E94;&#x5B66;&#x4E60;&#x7387;&#x3002; &#x5B83;&#x6709;&#x52A9;&#x4E8E;&#x5C06;&#x66F4;&#x65B0;&#x7684;&#x7ED3;&#x679C;&#x66F4;&#x76F4;&#x63A5;&#x5730;&#x6307;&#x5411;&#x5168;&#x5C40;&#x6700;&#x4F18;&#xFF08;&#x89C1;&#x56FE; 11-7&#xFF09;&#x3002; &#x53E6;&#x4E00;&#x4E2A;&#x597D;&#x5904;&#x662F;&#x5B83;&#x4E0D;&#x9700;&#x8981;&#x90A3;&#x4E48;&#x591A;&#x7684;&#x53BB;&#x8C03;&#x6574;&#x5B66;&#x4E60;&#x7387;&#x8D85;&#x53C2;&#x6570;<code>&#x3B7;</code>&#x3002;</p>
<p><img src="../images/chapter_11/11-7.png" alt=""></p>
<p>&#x5BF9;&#x4E8E;&#x7B80;&#x5355;&#x7684;&#x4E8C;&#x6B21;&#x95EE;&#x9898;&#xFF0C;AdaGrad &#x7ECF;&#x5E38;&#x8868;&#x73B0;&#x826F;&#x597D;&#xFF0C;&#x4F46;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x8BAD;&#x7EC3;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x65F6;&#xFF0C;&#x5B83;&#x7ECF;&#x5E38;&#x505C;&#x6B62;&#x5F97;&#x592A;&#x65E9;&#x3002; &#x5B66;&#x4E60;&#x7387;&#x88AB;&#x7F29;&#x51CF;&#x5F97;&#x592A;&#x591A;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x5728;&#x8FBE;&#x5230;&#x5168;&#x5C40;&#x6700;&#x4F18;&#x4E4B;&#x524D;&#xFF0C;&#x7B97;&#x6CD5;&#x5B8C;&#x5168;&#x505C;&#x6B62;&#x3002; &#x6240;&#x4EE5;&#xFF0C;&#x5373;&#x4F7F; TensorFlow &#x6709;&#x4E00;&#x4E2A;<code>AdagradOptimizer</code>&#xFF0C;&#x4F60;&#x4E5F;&#x4E0D;&#x5E94;&#x8BE5;&#x7528;&#x5B83;&#x6765;&#x8BAD;&#x7EC3;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF08;&#x867D;&#x7136;&#x5BF9;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x8FD9;&#x6837;&#x7B80;&#x5355;&#x7684;&#x4EFB;&#x52A1;&#x53EF;&#x80FD;&#x662F;&#x6709;&#x6548;&#x7684;&#xFF09;&#x3002;</p>
<h2 id="rmsprop">RMSProp</h2>
<p>&#x5C3D;&#x7BA1; AdaGrad &#x7684;&#x901F;&#x5EA6;&#x53D8;&#x6162;&#x4E86;&#x4E00;&#x70B9;&#xFF0C;&#x5E76;&#x4E14;&#x4ECE;&#x672A;&#x6536;&#x655B;&#x5230;&#x5168;&#x5C40;&#x6700;&#x4F18;&#xFF0C;&#x4F46;&#x662F; RMSProp &#x7B97;&#x6CD5;&#x901A;&#x8FC7;&#x4EC5;&#x7D2F;&#x79EF;&#x6700;&#x8FD1;&#x8FED;&#x4EE3;&#xFF08;&#x800C;&#x4E0D;&#x662F;&#x4ECE;&#x8BAD;&#x7EC3;&#x5F00;&#x59CB;&#x4EE5;&#x6765;&#x7684;&#x6240;&#x6709;&#x68AF;&#x5EA6;&#xFF09;&#x7684;&#x68AF;&#x5EA6;&#x6765;&#x4FEE;&#x6B63;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002; &#x5B83;&#x901A;&#x8FC7;&#x5728;&#x7B2C;&#x4E00;&#x6B65;&#x4E2D;&#x4F7F;&#x7528;&#x6307;&#x6570;&#x8870;&#x51CF;&#x6765;&#x5B9E;&#x73B0;&#xFF08;&#x89C1;&#x516C;&#x5F0F; 11-7&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_11/e-11-7.png" alt=""></p>
<p>&#x4ED6;&#x7684;&#x8870;&#x53D8;&#x7387;<code>&#x3B2;</code>&#x901A;&#x5E38;&#x8BBE;&#x5B9A;&#x4E3A; 0.9&#x3002; &#x662F;&#x7684;&#xFF0C;&#x5B83;&#x53C8;&#x662F;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x8D85;&#x53C2;&#x6570;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E2A;&#x9ED8;&#x8BA4;&#x503C;&#x901A;&#x5E38;&#x8FD0;&#x884C;&#x826F;&#x597D;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x53EF;&#x80FD;&#x6839;&#x672C;&#x4E0D;&#x9700;&#x8981;&#x8C03;&#x6574;&#x5B83;&#x3002;</p>
<p>&#x6B63;&#x5982;&#x60A8;&#x6240;&#x6599;&#xFF0C;TensorFlow &#x62E5;&#x6709;&#x4E00;&#x4E2A;<code>RMSPropOptimizer</code>&#x7C7B;&#xFF1A;</p>
<p><img src="../images/chapter_11/o-11-11.png" alt=""></p>
<p>&#x9664;&#x4E86;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x4E2A;&#x4F18;&#x5316;&#x5668;&#x51E0;&#x4E4E;&#x603B;&#x662F;&#x6BD4; AdaGrad &#x6267;&#x884C;&#x5F97;&#x66F4;&#x597D;&#x3002; &#x5B83;&#x901A;&#x5E38;&#x4E5F;&#x6BD4;&#x52A8;&#x91CF;&#x4F18;&#x5316;&#x548C; Nesterov &#x52A0;&#x901F;&#x68AF;&#x5EA6;&#x8868;&#x73B0;&#x66F4;&#x597D;&#x3002; &#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x8FD9;&#x662F;&#x8BB8;&#x591A;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x9996;&#x9009;&#x7684;&#x4F18;&#x5316;&#x7B97;&#x6CD5;&#xFF0C;&#x76F4;&#x5230; Adam &#x4F18;&#x5316;&#x51FA;&#x73B0;&#x3002;</p>
<h2 id="adam-&#x4F18;&#x5316;">Adam &#x4F18;&#x5316;</h2>
<p>Adam&#xFF0C;&#x4EE3;&#x8868;&#x81EA;&#x9002;&#x5E94;&#x77E9;&#x4F30;&#x8BA1;&#xFF0C;&#x7ED3;&#x5408;&#x4E86;&#x52A8;&#x91CF;&#x4F18;&#x5316;&#x548C; RMSProp &#x7684;&#x601D;&#x60F3;&#xFF1A;&#x5C31;&#x50CF;&#x52A8;&#x91CF;&#x4F18;&#x5316;&#x4E00;&#x6837;&#xFF0C;&#x5B83;&#x8FFD;&#x8E2A;&#x8FC7;&#x53BB;&#x68AF;&#x5EA6;&#x7684;&#x6307;&#x6570;&#x8870;&#x51CF;&#x5E73;&#x5747;&#x503C;&#xFF0C;&#x5C31;&#x50CF; RMSProp &#x4E00;&#x6837;&#xFF0C;&#x5B83;&#x8DDF;&#x8E2A;&#x8FC7;&#x53BB;&#x5E73;&#x65B9;&#x68AF;&#x5EA6;&#x7684;&#x6307;&#x6570;&#x8870;&#x51CF;&#x5E73;&#x5747;&#x503C; &#xFF08;&#x89C1;&#x65B9;&#x7A0B;&#x5F0F; 11-8&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_11/e-11-8.png" alt=""></p>
<p>T &#x4EE3;&#x8868;&#x8FED;&#x4EE3;&#x6B21;&#x6570;&#xFF08;&#x4ECE; 1 &#x5F00;&#x59CB;&#xFF09;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x53EA;&#x770B;&#x6B65;&#x9AA4; 1, 2 &#x548C; 5&#xFF0C;&#x4F60;&#x4F1A;&#x6CE8;&#x610F;&#x5230; Adam &#x4E0E;&#x52A8;&#x91CF;&#x4F18;&#x5316;&#x548C; RMSProp &#x7684;&#x76F8;&#x4F3C;&#x6027;&#x3002; &#x552F;&#x4E00;&#x7684;&#x533A;&#x522B;&#x662F;&#x7B2C; 1 &#x6B65;&#x8BA1;&#x7B97;&#x6307;&#x6570;&#x8870;&#x51CF;&#x7684;&#x5E73;&#x5747;&#x503C;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6307;&#x6570;&#x8870;&#x51CF;&#x7684;&#x548C;&#xFF0C;&#x4F46;&#x9664;&#x4E86;&#x4E00;&#x4E2A;&#x5E38;&#x6570;&#x56E0;&#x5B50;&#xFF08;&#x8870;&#x51CF;&#x5E73;&#x5747;&#x503C;&#x53EA;&#x662F;&#x8870;&#x51CF;&#x548C;&#x7684;<code>1 - &#x3B2;1</code>&#x500D;&#xFF09;&#x4E4B;&#x5916;&#xFF0C;&#x5B83;&#x4EEC;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x7B49;&#x6548;&#x7684;&#x3002; &#x6B65;&#x9AA4; 3 &#x548C;&#x6B65;&#x9AA4; 4 &#x662F;&#x4E00;&#x4E2A;&#x6280;&#x672F;&#x7EC6;&#x8282;&#xFF1A;&#x7531;&#x4E8E;<code>m</code>&#x548C;<code>s</code>&#x521D;&#x59CB;&#x5316;&#x4E3A; 0&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x8BAD;&#x7EC3;&#x5F00;&#x59CB;&#x65F6;&#x5B83;&#x4EEC;&#x4F1A;&#x504F;&#x5411;0&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E24;&#x6B65;&#x5C06;&#x5728;&#x8BAD;&#x7EC3;&#x5F00;&#x59CB;&#x65F6;&#x5E2E;&#x52A9;&#x63D0;&#x9AD8;<code>m</code>&#x548C;<code>s</code>&#x3002;</p>
<p>&#x52A8;&#x91CF;&#x8870;&#x51CF;&#x8D85;&#x53C2;&#x6570;<code>&#x3B2;1</code>&#x901A;&#x5E38;&#x521D;&#x59CB;&#x5316;&#x4E3A; 0.9&#xFF0C;&#x800C;&#x7F29;&#x653E;&#x8870;&#x51CF;&#x8D85;&#x53C2;&#x6570;<code>&#x3B2;2</code>&#x901A;&#x5E38;&#x521D;&#x59CB;&#x5316;&#x4E3A; 0.999&#x3002; &#x5982;&#x524D;&#x6240;&#x8FF0;&#xFF0C;&#x5E73;&#x6ED1;&#x9879;<code>&#x3B5;</code>&#x901A;&#x5E38;&#x88AB;&#x521D;&#x59CB;&#x5316;&#x4E3A;&#x4E00;&#x4E2A;&#x5F88;&#x5C0F;&#x7684;&#x6570;&#xFF0C;&#x4F8B;&#x5982; <img src="../images/chapter_11/o-11-12.png" alt="">&#x3002;&#x8FD9;&#x4E9B;&#x662F; TensorFlow &#x7684;<code>AdamOptimizer</code>&#x7C7B;&#x7684;&#x9ED8;&#x8BA4;&#x503C;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x5730;&#x4F7F;&#x7528;&#xFF1A;</p>
<p><img src="../images/chapter_11/o-11-13.png" alt=""></p>
<p>&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x7531;&#x4E8E; Adam &#x662F;&#x4E00;&#x79CD;&#x81EA;&#x9002;&#x5E94;&#x5B66;&#x4E60;&#x7387;&#x7B97;&#x6CD5;&#xFF08;&#x5982; AdaGrad &#x548C; RMSProp&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#x5BF9;&#x5B66;&#x4E60;&#x7387;&#x8D85;&#x53C2;&#x6570;<code>&#x3B7;</code>&#x7684;&#x8C03;&#x6574;&#x8F83;&#x5C11;&#x3002; &#x60A8;&#x7ECF;&#x5E38;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x9ED8;&#x8BA4;&#x503C;<code>&#x3B7;= 0.001</code>&#xFF0C;&#x4F7F; Adam &#x66F4;&#x5BB9;&#x6613;&#x4F7F;&#x7528;&#x76F8;&#x5BF9;&#x4E8E;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x3002;</p>
<p>&#x8FC4;&#x4ECA;&#x4E3A;&#x6B62;&#x6240;&#x8BA8;&#x8BBA;&#x7684;&#x6240;&#x6709;&#x4F18;&#x5316;&#x6280;&#x672F;&#x90FD;&#x53EA;&#x4F9D;&#x8D56;&#x4E8E;&#x4E00;&#x9636;&#x504F;&#x5BFC;&#x6570;&#xFF08;&#x96C5;&#x53EF;&#x6BD4;&#x77E9;&#x9635;&#xFF09;&#x3002; &#x4F18;&#x5316;&#x6587;&#x732E;&#x5305;&#x542B;&#x57FA;&#x4E8E;&#x4E8C;&#x9636;&#x504F;&#x5BFC;&#x6570;&#xFF08;&#x6D77;&#x68EE;&#x77E9;&#x9635;&#xFF09;&#x7684;&#x60CA;&#x4EBA;&#x7B97;&#x6CD5;&#x3002; &#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x4E9B;&#x7B97;&#x6CD5;&#x5F88;&#x96BE;&#x5E94;&#x7528;&#x4E8E;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x4E2A;&#x8F93;&#x51FA;&#x6709;<code>n ^ 2</code>&#x4E2A;&#x6D77;&#x68EE;&#x503C;&#xFF08;&#x5176;&#x4E2D;<code>n</code>&#x662F;&#x53C2;&#x6570;&#x7684;&#x6570;&#x91CF;&#xFF09;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6BCF;&#x4E2A;&#x8F93;&#x51FA;&#x53EA;&#x6709;<code>n</code>&#x4E2A;&#x96C5;&#x514B;&#x6BD4;&#x503C;&#x3002; &#x7531;&#x4E8E; DNN &#x901A;&#x5E38;&#x5177;&#x6709;&#x6570;&#x4EE5;&#x4E07;&#x8BA1;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x4E8C;&#x9636;&#x4F18;&#x5316;&#x7B97;&#x6CD5;&#x901A;&#x5E38;&#x751A;&#x81F3;&#x4E0D;&#x9002;&#x5408;&#x5185;&#x5B58;&#xFF0C;&#x751A;&#x81F3;&#x5728;&#x4ED6;&#x4EEC;&#x8FD9;&#x6837;&#x505A;&#x65F6;&#xFF0C;&#x8BA1;&#x7B97;&#x6D77;&#x68EE;&#x77E9;&#x9635;&#x4E5F;&#x662F;&#x592A;&#x6162;&#x4E86;&#x3002;</p>
<h2 id="&#x8BAD;&#x7EC3;&#x7A00;&#x758F;&#x6A21;&#x578B;">&#x8BAD;&#x7EC3;&#x7A00;&#x758F;&#x6A21;&#x578B;</h2>
<p>&#x6240;&#x6709;&#x521A;&#x521A;&#x63D0;&#x51FA;&#x7684;&#x4F18;&#x5316;&#x7B97;&#x6CD5;&#x90FD;&#x4F1A;&#x4EA7;&#x751F;&#x5BC6;&#x96C6;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5927;&#x591A;&#x6570;&#x53C2;&#x6570;&#x90FD;&#x662F;&#x975E;&#x96F6;&#x7684;&#x3002; &#x5982;&#x679C;&#x4F60;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x5FEB;&#x901F;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x6216;&#x8005;&#x5982;&#x679C;&#x4F60;&#x9700;&#x8981;&#x5B83;&#x5360;&#x7528;&#x8F83;&#x5C11;&#x7684;&#x5185;&#x5B58;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x66F4;&#x559C;&#x6B22;&#x7528;&#x4E00;&#x4E2A;&#x7A00;&#x758F;&#x6A21;&#x578B;&#x6765;&#x4EE3;&#x66FF;&#x3002;</p>
<p>&#x5B9E;&#x73B0;&#x8FD9;&#x4E00;&#x70B9;&#x7684;&#x4E00;&#x4E2A;&#x5FAE;&#x4E0D;&#x8DB3;&#x9053;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x50CF;&#x5E73;&#x5E38;&#x4E00;&#x6837;&#x8BAD;&#x7EC3;&#x6A21;&#x578B;&#xFF0C;&#x7136;&#x540E;&#x6446;&#x8131;&#x5FAE;&#x5C0F;&#x7684;&#x6743;&#x91CD;&#xFF08;&#x5C06;&#x5B83;&#x4EEC;&#x8BBE;&#x7F6E;&#x4E3A; 0&#xFF09;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x4E2A;&#x9009;&#x62E9;&#x662F;&#x5728;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#x4E2D;&#x5E94;&#x7528;&#x5F3A; l1 &#x6B63;&#x5219;&#x5316;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4F1A;&#x63A8;&#x52A8;&#x4F18;&#x5316;&#x5668;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x5730;&#x6D88;&#x9664;&#x6743;&#x91CD;&#xFF08;&#x5982;&#x7B2C; 4 &#x7AE0;&#x5173;&#x4E8E; Lasso &#x56DE;&#x5F52;&#x7684;&#x8BA8;&#x8BBA;&#xFF09;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x53EF;&#x80FD;&#x4ECD;&#x7136;&#x4E0D;&#x8DB3;&#x3002; &#x6700;&#x540E;&#x4E00;&#x4E2A;&#x9009;&#x62E9;&#x662F;&#x5E94;&#x7528;&#x53CC;&#x91CD;&#x5E73;&#x5747;&#xFF0C;&#x901A;&#x5E38;&#x79F0;&#x4E3A;&#x9075;&#x5FAA;&#x6B63;&#x5219;&#x5316;&#x9886;&#x5BFC;&#x8005;&#xFF08;FTRL&#xFF09;&#xFF0C;&#x4E00;&#x79CD;&#x7531;&#x5C24;&#x91CC;&#xB7;&#x6D85;&#x65AF;&#x6377;&#x7F57;&#x592B;&#xFF08;Yurii Nesterov&#xFF09;&#x63D0;&#x51FA;&#x7684;&#x6280;&#x672F;&#x3002; &#x5F53;&#x4E0E; l1 &#x6B63;&#x5219;&#x5316;&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#x65F6;&#xFF0C;&#x8FD9;&#x79CD;&#x6280;&#x672F;&#x901A;&#x5E38;&#x5BFC;&#x81F4;&#x975E;&#x5E38;&#x7A00;&#x758F;&#x7684;&#x6A21;&#x578B;&#x3002; TensorFlow &#x5728;<code>FTRLOptimizer</code>&#x7C7B;&#x4E2D;&#x5B9E;&#x73B0;&#x79F0;&#x4E3A; FTRL-Proximal &#x7684; FTRL &#x53D8;&#x4F53;&#x3002;</p>
<h2 id="&#x5B66;&#x4E60;&#x7387;&#x8C03;&#x6574;">&#x5B66;&#x4E60;&#x7387;&#x8C03;&#x6574;</h2>
<p>&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x5B66;&#x4E60;&#x901F;&#x5EA6;&#x53EF;&#x80FD;&#x4F1A;&#x975E;&#x5E38;&#x68D8;&#x624B;&#x3002; &#x5982;&#x679C;&#x8BBE;&#x7F6E;&#x592A;&#x9AD8;&#xFF0C;&#x8BAD;&#x7EC3;&#x5B9E;&#x9645;&#x4E0A;&#x53EF;&#x80FD;&#x504F;&#x79BB;&#xFF08;&#x5982;&#x6211;&#x4EEC;&#x5728;&#x7B2C; 4 &#x7AE0;&#xFF09;&#x3002; &#x5982;&#x679C;&#x8BBE;&#x7F6E;&#x5F97;&#x592A;&#x4F4E;&#xFF0C;&#x8BAD;&#x7EC3;&#x6700;&#x7EC8;&#x4F1A;&#x6536;&#x655B;&#x5230;&#x6700;&#x4F73;&#x72B6;&#x6001;&#xFF0C;&#x4F46;&#x8FD9;&#x9700;&#x8981;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#x3002; &#x5982;&#x679C;&#x5C06;&#x5176;&#x8BBE;&#x7F6E;&#x5F97;&#x592A;&#x9AD8;&#xFF0C;&#x5F00;&#x59CB;&#x7684;&#x8FDB;&#x5EA6;&#x4F1A;&#x975E;&#x5E38;&#x5FEB;&#xFF0C;&#x4F46;&#x6700;&#x7EC8;&#x4F1A;&#x5728;&#x6700;&#x4F18;&#x89E3;&#x5468;&#x56F4;&#x8DF3;&#x52A8;&#xFF0C;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x5B89;&#x987F;&#x4E0B;&#x6765;&#xFF08;&#x9664;&#x975E;&#x60A8;&#x4F7F;&#x7528;&#x81EA;&#x9002;&#x5E94;&#x5B66;&#x4E60;&#x7387;&#x4F18;&#x5316;&#x7B97;&#x6CD5;&#xFF0C;&#x5982; AdaGrad&#xFF0C;RMSProp &#x6216; Adam&#xFF0C;&#x4F46;&#x662F; &#x5373;&#x4F7F;&#x8FD9;&#x6837;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x65F6;&#x95F4;&#x6765;&#x89E3;&#x51B3;&#xFF09;&#x3002; &#x5982;&#x679C;&#x60A8;&#x7684;&#x8BA1;&#x7B97;&#x9884;&#x7B97;&#x6709;&#x9650;&#xFF0C;&#x90A3;&#x4E48;&#x60A8;&#x53EF;&#x80FD;&#x5FC5;&#x987B;&#x5728;&#x6B63;&#x786E;&#x6536;&#x655B;&#x4E4B;&#x524D;&#x4E2D;&#x65AD;&#x8BAD;&#x7EC3;&#xFF0C;&#x4EA7;&#x751F;&#x6B21;&#x4F18;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF08;&#x53C2;&#x89C1;&#x56FE; 11-8&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_11/11-8.png" alt=""></p>
<p>&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x5404;&#x79CD;&#x5B66;&#x4E60;&#x7387;&#x548C;&#x6BD4;&#x8F83;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;&#xFF0C;&#x5728;&#x51E0;&#x4E2A;&#x8FED;&#x4EE3;&#x5185;&#x5BF9;&#x60A8;&#x7684;&#x7F51;&#x7EDC;&#x8FDB;&#x884C;&#x591A;&#x6B21;&#x8BAD;&#x7EC3;&#xFF0C;&#x60A8;&#x4E5F;&#x8BB8;&#x80FD;&#x591F;&#x627E;&#x5230;&#x76F8;&#x5F53;&#x597D;&#x7684;&#x5B66;&#x4E60;&#x7387;&#x3002; &#x7406;&#x60F3;&#x7684;&#x5B66;&#x4E60;&#x7387;&#x5C06;&#x4F1A;&#x5FEB;&#x901F;&#x5B66;&#x4E60;&#x5E76;&#x6536;&#x655B;&#x5230;&#x826F;&#x597D;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p>
<p>&#x7136;&#x800C;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x505A;&#x5F97;&#x6BD4;&#x4E0D;&#x65AD;&#x7684;&#x5B66;&#x4E60;&#x7387;&#x66F4;&#x597D;&#xFF1A;&#x5982;&#x679C;&#x4F60;&#x4ECE;&#x4E00;&#x4E2A;&#x9AD8;&#x7684;&#x5B66;&#x4E60;&#x7387;&#x5F00;&#x59CB;&#xFF0C;&#x7136;&#x540E;&#x4E00;&#x65E6;&#x5B83;&#x505C;&#x6B62;&#x5FEB;&#x901F;&#x7684;&#x8FDB;&#x6B65;&#x5C31;&#x51CF;&#x5C11;&#x5B83;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x6BD4;&#x6700;&#x4F73;&#x7684;&#x6052;&#x5B9A;&#x5B66;&#x4E60;&#x7387;&#x66F4;&#x5FEB;&#x5730;&#x8FBE;&#x5230;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002; &#x6709;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x7B56;&#x7565;&#xFF0C;&#x4EE5;&#x51CF;&#x5C11;&#x8BAD;&#x7EC3;&#x671F;&#x95F4;&#x7684;&#x5B66;&#x4E60;&#x7387;&#x3002; &#x8FD9;&#x4E9B;&#x7B56;&#x7565;&#x88AB;&#x79F0;&#x4E3A;&#x5B66;&#x4E60;&#x7387;&#x8C03;&#x6574;&#xFF08;&#x6211;&#x4EEC;&#x5728;&#x7B2C; 4 &#x7AE0;&#x4E2D;&#x7B80;&#x8981;&#x4ECB;&#x7ECD;&#x4E86;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#xFF09;&#xFF0C;&#x5176;&#x4E2D;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x662F;&#xFF1A;</p>
<p>&#x9884;&#x5B9A;&#x7684;&#x5206;&#x6BB5;&#x6052;&#x5B9A;&#x5B66;&#x4E60;&#x7387;:</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x9996;&#x5148;&#x5C06;&#x5B66;&#x4E60;&#x7387;&#x8BBE;&#x7F6E;&#x4E3A; <img src="../images/tex-8b0fd6769659759917bb45dd06f63083.gif" alt="&#x3B7;_0 = 0.1">&#xFF0C;&#x7136;&#x540E;&#x5728; 50 &#x4E2A;&#x8FED;&#x4EE3;&#x4E4B;&#x540E;&#x5C06;&#x5B66;&#x4E60;&#x7387;&#x8BBE;&#x7F6E;&#x4E3A; <img src="../images/tex-0a6ec28a2cbecd4689769c2944b222e8.gif" alt="&#x3B7;_1= 0.001">&#x3002;&#x867D;&#x7136;&#x8FD9;&#x4E2A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x53EF;&#x4EE5;&#x5F88;&#x597D;&#x5730;&#x5DE5;&#x4F5C;&#xFF0C;&#x4F46;&#x662F;&#x901A;&#x5E38;&#x9700;&#x8981;&#x5F04;&#x6E05;&#x695A;&#x6B63;&#x786E;&#x7684;&#x5B66;&#x4E60;&#x901F;&#x5EA6;&#x4EE5;&#x53CA;&#x4F55;&#x65F6;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x3002;</p>
<p>&#x6027;&#x80FD;&#x8C03;&#x5EA6;:</p>
<p>&#x6BCF; N &#x6B65;&#x6D4B;&#x91CF;&#x9A8C;&#x8BC1;&#x8BEF;&#x5DEE;&#xFF08;&#x5C31;&#x50CF;&#x63D0;&#x524D;&#x505C;&#x6B62;&#x4E00;&#x6837;&#xFF09;&#xFF0C;&#x5F53;&#x8BEF;&#x5DEE;&#x4E0B;&#x964D;&#x65F6;&#xFF0C;&#x5C06;&#x5B66;&#x4E60;&#x7387;&#x964D;&#x4F4E;&#x4E00;&#x4E2A;&#x56E0;&#x5B50;<code>&#x3BB;</code>&#x3002;</p>
<p>&#x6307;&#x6570;&#x8C03;&#x5EA6;:</p>
<p>&#x5C06;&#x5B66;&#x4E60;&#x7387;&#x8BBE;&#x7F6E;&#x4E3A;&#x8FED;&#x4EE3;&#x6B21;&#x6570;<code>t</code>&#x7684;&#x51FD;&#x6570;&#xFF1A;<img src="../images/chapter_11/o-11-14.png" alt="">&#x3002; &#x8FD9;&#x5F88;&#x597D;&#xFF0C;&#x4F46;&#x5B83;&#x9700;&#x8981;&#x8C03;&#x6574;<code>&#x3B7;0</code>&#x548C;<code>r</code>&#x3002; &#x5B66;&#x4E60;&#x7387;&#x5C06;&#x7531;&#x6BCF;<code>r</code>&#x6B65;&#x4E0B;&#x964D; 10 &#x500D;&#x3002;</p>
<p>&#x5E42;&#x8C03;&#x5EA6;:</p>
<p>&#x8BBE;&#x5B66;&#x4E60;&#x7387;&#x4E3A; <img src="../images/chapter_11/o-11-15.png" alt="">&#x3002; &#x8D85;&#x53C2;&#x6570;<code>c</code>&#x901A;&#x5E38;&#x88AB;&#x8BBE;&#x7F6E;&#x4E3A; 1&#x3002;&#x8FD9;&#x4E0E;&#x6307;&#x6570;&#x8C03;&#x5EA6;&#x7C7B;&#x4F3C;&#xFF0C;&#x4F46;&#x662F;&#x5B66;&#x4E60;&#x7387;&#x4E0B;&#x964D;&#x8981;&#x6162;&#x5F97;&#x591A;&#x3002;</p>
<p>Andrew Senior &#x7B49;2013&#x5E74;&#x7684;&#x8BBA;&#x6587;&#x3002; &#x6BD4;&#x8F83;&#x4E86;&#x4F7F;&#x7528;&#x52A8;&#x91CF;&#x4F18;&#x5316;&#x8BAD;&#x7EC3;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8FDB;&#x884C;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#x65F6;&#x4E00;&#x4E9B;&#x6700;&#x6D41;&#x884C;&#x7684;&#x5B66;&#x4E60;&#x7387;&#x8C03;&#x6574;&#x7684;&#x6027;&#x80FD;&#x3002; &#x4F5C;&#x8005;&#x5F97;&#x51FA;&#x7ED3;&#x8BBA;&#xFF1A;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6027;&#x80FD;&#x8C03;&#x5EA6;&#x548C;&#x6307;&#x6570;&#x8C03;&#x5EA6;&#x90FD;&#x8868;&#x73B0;&#x826F;&#x597D;&#xFF0C;&#x4F46;&#x4ED6;&#x4EEC;&#x66F4;&#x559C;&#x6B22;&#x6307;&#x6570;&#x8C03;&#x5EA6;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5B9E;&#x73B0;&#x8D77;&#x6765;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#xFF0C;&#x5BB9;&#x6613;&#x8C03;&#x6574;&#xFF0C;&#x6536;&#x655B;&#x901F;&#x5EA6;&#x7565;&#x5FEB;&#x4E8E;&#x6700;&#x4F73;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p>
<p>&#x4F7F;&#x7528; TensorFlow &#x5B9E;&#x73B0;&#x5B66;&#x4E60;&#x7387;&#x8C03;&#x6574;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF1A;</p>
<pre><code class="lang-py">    initial_learning_rate = <span class="hljs-number">0.1</span>
    decay_steps = <span class="hljs-number">10000</span>
    decay_rate = <span class="hljs-number">1</span>/<span class="hljs-number">10</span>
    global_step = tf.Variable(<span class="hljs-number">0</span>, trainable=<span class="hljs-keyword">False</span>, name=<span class="hljs-string">&quot;global_step&quot;</span>)
    learning_rate = tf.train.exponential_decay(initial_learning_rate, global_step,
                                               decay_steps, decay_rate)
    optimizer = tf.train.MomentumOptimizer(learning_rate, momentum=<span class="hljs-number">0.9</span>)
    training_op = optimizer.minimize(loss, global_step=global_step)
</code></pre>
<p>&#x8BBE;&#x7F6E;&#x8D85;&#x53C2;&#x6570;&#x503C;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x4E0D;&#x53EF;&#x8BAD;&#x7EC3;&#x7684;&#x53D8;&#x91CF;<code>global_step</code>&#xFF08;&#x521D;&#x59CB;&#x5316;&#x4E3A; 0&#xFF09;&#x4EE5;&#x8DDF;&#x8E2A;&#x5F53;&#x524D;&#x7684;&#x8BAD;&#x7EC3;&#x8FED;&#x4EE3;&#x6B21;&#x6570;&#x3002; &#x7136;&#x540E;&#x6211;&#x4EEC;&#x4F7F;&#x7528; TensorFlow &#x7684;<code>exponential_decay()</code>&#x51FD;&#x6570;&#x6765;&#x5B9A;&#x4E49;&#x6307;&#x6570;&#x8870;&#x51CF;&#x7684;&#x5B66;&#x4E60;&#x7387;&#xFF08;<code>&#x3B7;0= 0.1</code>&#x548C;<code>r = 10,000</code>&#xFF09;&#x3002; &#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x8870;&#x51CF;&#x7684;&#x5B66;&#x4E60;&#x7387;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x4F18;&#x5316;&#x5668;&#xFF08;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x662F;&#x4E00;&#x4E2A;<code>MomentumOptimizer</code>&#xFF09;&#x3002; &#x6700;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x8C03;&#x7528;&#x4F18;&#x5316;&#x5668;&#x7684;<code>minimize()</code>&#x65B9;&#x6CD5;&#x6765;&#x521B;&#x5EFA;&#x8BAD;&#x7EC3;&#x64CD;&#x4F5C;&#xFF1B;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5C06;<code>global_step</code>&#x53D8;&#x91CF;&#x4F20;&#x9012;&#x7ED9;&#x5B83;&#xFF0C;&#x6240;&#x4EE5;&#x8BF7;&#x6CE8;&#x610F;&#x589E;&#x52A0;&#x5B83;&#x3002; &#x5C31;&#x662F;&#x8FD9;&#x6837;&#xFF01;</p>
<p>&#x7531;&#x4E8E; AdaGrad&#xFF0C;RMSProp &#x548C; Adam &#x4F18;&#x5316;&#x81EA;&#x52A8;&#x964D;&#x4F4E;&#x4E86;&#x8BAD;&#x7EC3;&#x671F;&#x95F4;&#x7684;&#x5B66;&#x4E60;&#x7387;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x9700;&#x8981;&#x6DFB;&#x52A0;&#x989D;&#x5916;&#x7684;&#x5B66;&#x4E60;&#x7387;&#x8C03;&#x6574;&#x3002; &#x5BF9;&#x4E8E;&#x5176;&#x4ED6;&#x4F18;&#x5316;&#x7B97;&#x6CD5;&#xFF0C;&#x4F7F;&#x7528;&#x6307;&#x6570;&#x8870;&#x51CF;&#x6216;&#x6027;&#x80FD;&#x8C03;&#x5EA6;&#x53EF;&#x663E;&#x8457;&#x52A0;&#x901F;&#x6536;&#x655B;&#x3002;</p>
<p>&#x5B8C;&#x6574;&#x4EE3;&#x7801;:</p>
<pre><code class="lang-py">n_inputs = <span class="hljs-number">28</span> * <span class="hljs-number">28</span>  <span class="hljs-comment"># MNIST</span>
n_hidden1 = <span class="hljs-number">300</span>
n_hidden2 = <span class="hljs-number">50</span>
n_outputs = <span class="hljs-number">10</span>

X = tf.placeholder(tf.float32, shape=(<span class="hljs-keyword">None</span>, n_inputs), name=<span class="hljs-string">&quot;X&quot;</span>)
y = tf.placeholder(tf.int64, shape=(<span class="hljs-keyword">None</span>), name=<span class="hljs-string">&quot;y&quot;</span>)

<span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&quot;dnn&quot;</span>):
    hidden1 = tf.layers.dense(X, n_hidden1, activation=tf.nn.relu, name=<span class="hljs-string">&quot;hidden1&quot;</span>)
    hidden2 = tf.layers.dense(hidden1, n_hidden2, activation=tf.nn.relu, name=<span class="hljs-string">&quot;hidden2&quot;</span>)
    logits = tf.layers.dense(hidden2, n_outputs, name=<span class="hljs-string">&quot;outputs&quot;</span>)

<span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&quot;loss&quot;</span>):
    xentropy = tf.nn.sparse_softmax_cross_entropy_with_logits(labels=y, logits=logits)
    loss = tf.reduce_mean(xentropy, name=<span class="hljs-string">&quot;loss&quot;</span>)

<span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&quot;eval&quot;</span>):
    correct = tf.nn.in_top_k(logits, y, <span class="hljs-number">1</span>)
    accuracy = tf.reduce_mean(tf.cast(correct, tf.float32), name=<span class="hljs-string">&quot;accuracy&quot;</span>)
</code></pre>
<pre><code class="lang-py"><span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&quot;train&quot;</span>):       <span class="hljs-comment"># not shown in the book</span>
    initial_learning_rate = <span class="hljs-number">0.1</span>
    decay_steps = <span class="hljs-number">10000</span>
    decay_rate = <span class="hljs-number">1</span>/<span class="hljs-number">10</span>
    global_step = tf.Variable(<span class="hljs-number">0</span>, trainable=<span class="hljs-keyword">False</span>, name=<span class="hljs-string">&quot;global_step&quot;</span>)
    learning_rate = tf.train.exponential_decay(initial_learning_rate, global_step,
                                               decay_steps, decay_rate)
    optimizer = tf.train.MomentumOptimizer(learning_rate, momentum=<span class="hljs-number">0.9</span>)
    training_op = optimizer.minimize(loss, global_step=global_step)
</code></pre>
<pre><code class="lang-py">init = tf.global_variables_initializer()
saver = tf.train.Saver()
</code></pre>
<pre><code class="lang-py">n_epochs = <span class="hljs-number">5</span>
batch_size = <span class="hljs-number">50</span>

<span class="hljs-keyword">with</span> tf.Session() <span class="hljs-keyword">as</span> sess:
    init.run()
    <span class="hljs-keyword">for</span> epoch <span class="hljs-keyword">in</span> range(n_epochs):
        <span class="hljs-keyword">for</span> iteration <span class="hljs-keyword">in</span> range(mnist.train.num_examples // batch_size):
            X_batch, y_batch = mnist.train.next_batch(batch_size)
            sess.run(training_op, feed_dict={X: X_batch, y: y_batch})
        accuracy_val = accuracy.eval(feed_dict={X: mnist.test.images,
                                                y: mnist.test.labels})
        print(epoch, <span class="hljs-string">&quot;Test accuracy:&quot;</span>, accuracy_val)

    save_path = saver.save(sess, <span class="hljs-string">&quot;./my_model_final.ckpt&quot;</span>)
</code></pre>
<h2 id="&#x901A;&#x8FC7;&#x6B63;&#x5219;&#x5316;&#x907F;&#x514D;&#x8FC7;&#x62DF;&#x5408;">&#x901A;&#x8FC7;&#x6B63;&#x5219;&#x5316;&#x907F;&#x514D;&#x8FC7;&#x62DF;&#x5408;</h2>
<p>&#x6709;&#x56DB;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x6211;&#x53EF;&#x4EE5;&#x62DF;&#x5408;&#x4E00;&#x4E2A;&#x5927;&#x8C61;&#xFF0C;&#x4E94;&#x4E2A;&#x6211;&#x53EF;&#x4EE5;&#x8BA9;&#x4ED6;&#x6446;&#x52A8;&#x4ED6;&#x7684;&#x8C61;&#x9F3B;&#x3002;</p>
<p>&#x2014;&#x2014; John von Neumann,cited by Enrico Fermi in Nature 427</p>
<p>&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x901A;&#x5E38;&#x5177;&#x6709;&#x6570;&#x4EE5;&#x4E07;&#x8BA1;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x6709;&#x65F6;&#x751A;&#x81F3;&#x662F;&#x6570;&#x767E;&#x4E07;&#x3002; &#x6709;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x7F51;&#x7EDC;&#x62E5;&#x6709;&#x96BE;&#x4EE5;&#x7F6E;&#x4FE1;&#x7684;&#x81EA;&#x7531;&#x5EA6;&#xFF0C;&#x53EF;&#x4EE5;&#x9002;&#x5E94;&#x5404;&#x79CD;&#x590D;&#x6742;&#x7684;&#x6570;&#x636E;&#x96C6;&#x3002; &#x4F46;&#x662F;&#x8FD9;&#x4E2A;&#x5F88;&#x5927;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x4E5F;&#x610F;&#x5473;&#x7740;&#x5B83;&#x5F88;&#x5BB9;&#x6613;&#x8FC7;&#x62DF;&#x5408;&#x8BAD;&#x7EC3;&#x96C6;&#x3002;</p>
<p>&#x6709;&#x4E86;&#x6570;&#x4EE5;&#x767E;&#x4E07;&#x8BA1;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x9002;&#x5E94;&#x6574;&#x4E2A;&#x52A8;&#x7269;&#x56ED;&#x3002; &#x5728;&#x672C;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4ECB;&#x7ECD;&#x4E00;&#x4E9B;&#x6700;&#x6D41;&#x884C;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6B63;&#x5219;&#x5316;&#x6280;&#x672F;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x7528; TensorFlow &#x5B9E;&#x73B0;&#x5B83;&#x4EEC;&#xFF1A;&#x65E9;&#x671F;&#x505C;&#x6B62;&#xFF0C;l1 &#x548C; l2 &#x6B63;&#x5219;&#x5316;&#xFF0C;drop out&#xFF0C;&#x6700;&#x5927;&#x8303;&#x6570;&#x6B63;&#x5219;&#x5316;&#x548C;&#x6570;&#x636E;&#x589E;&#x5F3A;&#x3002;</p>
<h2 id="&#x65E9;&#x671F;&#x505C;&#x6B62;">&#x65E9;&#x671F;&#x505C;&#x6B62;</h2>
<p>&#x4E3A;&#x907F;&#x514D;&#x8FC7;&#x5EA6;&#x62DF;&#x5408;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x5C31;&#x662F;&#x5C3D;&#x65E9;&#x505C;&#x6B62;&#x8BAD;&#x7EC3;&#xFF08;&#x5728;&#x7B2C; 4 &#x7AE0;&#x4E2D;&#x4ECB;&#x7ECD;&#xFF09;&#xFF1A;&#x53EA;&#x8981;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x6027;&#x80FD;&#x5F00;&#x59CB;&#x4E0B;&#x964D;&#x65F6;&#x4E2D;&#x65AD;&#x8BAD;&#x7EC3;&#x3002;</p>
<p>&#x4E0E; TensorFlow &#x5B9E;&#x73B0;&#x65B9;&#x6CD5;&#x4E4B;&#x4E00;&#x662F;&#x8BC4;&#x4F30;&#x5176;&#x5BF9;&#x8BBE;&#x7F6E;&#x5B9A;&#x671F;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x6BCF; 50 &#x6B65;&#xFF09;&#x9A8C;&#x8BC1;&#x6A21;&#x578B;&#xFF0C;&#x5E76;&#x4FDD;&#x5B58;&#x4E00;&#x4E2A;&#x201C;winner&#x201D;&#x7684;&#x5FEB;&#x7167;&#xFF0C;&#x5982;&#x679C;&#x5B83;&#x4F18;&#x4E8E;&#x4EE5;&#x524D;&#x201C;winner&#x201D;&#x7684;&#x5FEB;&#x7167;&#x3002; &#x8BA1;&#x7B97;&#x81EA;&#x4E0A;&#x6B21;&#x201C;winner&#x201D;&#x5FEB;&#x7167;&#x4FDD;&#x5B58;&#x4EE5;&#x6765;&#x7684;&#x6B65;&#x6570;&#xFF0C;&#x5E76;&#x5728;&#x8FBE;&#x5230;&#x67D0;&#x4E2A;&#x9650;&#x5236;&#x65F6;&#xFF08;&#x4F8B;&#x5982; 2000 &#x6B65;&#xFF09;&#x4E2D;&#x65AD;&#x8BAD;&#x7EC3;&#x3002; &#x7136;&#x540E;&#x6062;&#x590D;&#x6700;&#x540E;&#x7684;&#x201C;winner&#x201D;&#x5FEB;&#x7167;&#x3002;</p>
<p>&#x867D;&#x7136;&#x65E9;&#x671F;&#x505C;&#x6B62;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x8FD0;&#x884C;&#x826F;&#x597D;&#xFF0C;&#x4F46;&#x662F;&#x901A;&#x8FC7;&#x5C06;&#x5176;&#x4E0E;&#x5176;&#x4ED6;&#x6B63;&#x5219;&#x5316;&#x6280;&#x672F;&#x76F8;&#x7ED3;&#x5408;&#xFF0C;&#x60A8;&#x901A;&#x5E38;&#x53EF;&#x4EE5;&#x5728;&#x7F51;&#x7EDC;&#x4E2D;&#x83B7;&#x5F97;&#x66F4;&#x9AD8;&#x7684;&#x6027;&#x80FD;&#x3002;</p>
<h2 id="l1-&#x548C;-l2-&#x6B63;&#x5219;&#x5316;">L1 &#x548C; L2 &#x6B63;&#x5219;&#x5316;</h2>
<p>&#x5C31;&#x50CF;&#x4F60;&#x5728;&#x7B2C; 4 &#x7AE0;&#x4E2D;&#x5BF9;&#x7B80;&#x5355;&#x7EBF;&#x6027;&#x6A21;&#x578B;&#x6240;&#x505A;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; l1 &#x548C; l2 &#x6B63;&#x5219;&#x5316;&#x7EA6;&#x675F;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x8FDE;&#x63A5;&#x6743;&#x91CD;&#xFF08;&#x4F46;&#x901A;&#x5E38;&#x4E0D;&#x662F;&#x5B83;&#x7684;&#x504F;&#x7F6E;&#xFF09;&#x3002;</p>
<p>&#x4F7F;&#x7528; TensorFlow &#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x7B80;&#x5355;&#x5730;&#x5C06;&#x9002;&#x5F53;&#x7684;&#x6B63;&#x5219;&#x5316;&#x9879;&#x6DFB;&#x52A0;&#x5230;&#x60A8;&#x7684;&#x635F;&#x5931;&#x51FD;&#x6570;&#x4E2D;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x5047;&#x8BBE;&#x60A8;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x6743;&#x91CD;&#x4E3A;<code>weights1</code>&#x7684;&#x9690;&#x85CF;&#x5C42;&#x548C;&#x4E00;&#x4E2A;&#x6743;&#x91CD;&#x4E3A;<code>weight2</code>&#x7684;&#x8F93;&#x51FA;&#x5C42;&#xFF0C;&#x90A3;&#x4E48;&#x60A8;&#x53EF;&#x4EE5;&#x50CF;&#x8FD9;&#x6837;&#x5E94;&#x7528; l1 &#x6B63;&#x5219;&#x5316;&#xFF1A;</p>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x6B63;&#x5219;&#x5316;&#x51FD;&#x6570;&#x4F20;&#x9012;&#x7ED9;<code>tf.layers.dense()</code>&#x51FD;&#x6570;&#xFF0C;&#x8BE5;&#x51FD;&#x6570;&#x5C06;&#x4F7F;&#x7528;&#x5B83;&#x6765;&#x521B;&#x5EFA;&#x8BA1;&#x7B97;&#x6B63;&#x5219;&#x5316;&#x635F;&#x5931;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x5E76;&#x5C06;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#x6DFB;&#x52A0;&#x5230;&#x6B63;&#x5219;&#x5316;&#x635F;&#x5931;&#x96C6;&#x5408;&#x4E2D;&#x3002; &#x5F00;&#x59CB;&#x548C;&#x4E0A;&#x9762;&#x4E00;&#x6837;&#xFF1A;</p>
<pre><code class="lang-py">n_inputs = <span class="hljs-number">28</span> * <span class="hljs-number">28</span>  <span class="hljs-comment"># MNIST</span>
n_hidden1 = <span class="hljs-number">300</span>
n_hidden2 = <span class="hljs-number">50</span>
n_outputs = <span class="hljs-number">10</span>

X = tf.placeholder(tf.float32, shape=(<span class="hljs-keyword">None</span>, n_inputs), name=<span class="hljs-string">&quot;X&quot;</span>)
y = tf.placeholder(tf.int64, shape=(<span class="hljs-keyword">None</span>), name=<span class="hljs-string">&quot;y&quot;</span>)
</code></pre>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F7F;&#x7528; Python <code>partial()</code>&#x51FD;&#x6570;&#x6765;&#x907F;&#x514D;&#x4E00;&#x904D;&#x53C8;&#x4E00;&#x904D;&#x5730;&#x91CD;&#x590D;&#x76F8;&#x540C;&#x7684;&#x53C2;&#x6570;&#x3002; &#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x6211;&#x4EEC;&#x8BBE;&#x7F6E;&#x4E86;&#x5185;&#x6838;&#x6B63;&#x5219;&#x5316;&#x53C2;&#x6570;&#xFF08;&#x6B63;&#x5219;&#x5316;&#x51FD;&#x6570;&#x6709;<code>l1_regularizer()</code>&#xFF0C;<code>l2_regularizer()</code>&#xFF0C;<code>l1_l2_regularizer()</code>&#xFF09;&#xFF1A;</p>
<pre><code class="lang-py">scale = <span class="hljs-number">0.001</span>
</code></pre>
<pre><code class="lang-py">my_dense_layer = partial(
    tf.layers.dense, activation=tf.nn.relu,
    kernel_regularizer=tf.contrib.layers.l1_regularizer(scale))

<span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&quot;dnn&quot;</span>):
    hidden1 = my_dense_layer(X, n_hidden1, name=<span class="hljs-string">&quot;hidden1&quot;</span>)
    hidden2 = my_dense_layer(hidden1, n_hidden2, name=<span class="hljs-string">&quot;hidden2&quot;</span>)
    logits = my_dense_layer(hidden2, n_outputs, activation=<span class="hljs-keyword">None</span>,
                            name=<span class="hljs-string">&quot;outputs&quot;</span>)
</code></pre>
<p>&#x8BE5;&#x4EE3;&#x7801;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x5177;&#x6709;&#x4E24;&#x4E2A;&#x9690;&#x85CF;&#x5C42;&#x548C;&#x4E00;&#x4E2A;&#x8F93;&#x51FA;&#x5C42;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x5E76;&#x4E14;&#x8FD8;&#x5728;&#x56FE;&#x4E2D;&#x521B;&#x5EFA;&#x8282;&#x70B9;&#x4EE5;&#x8BA1;&#x7B97;&#x4E0E;&#x6BCF;&#x4E2A;&#x5C42;&#x7684;&#x6743;&#x91CD;&#x76F8;&#x5BF9;&#x5E94;&#x7684; l1 &#x6B63;&#x5219;&#x5316;&#x635F;&#x5931;&#x3002;TensorFlow &#x4F1A;&#x81EA;&#x52A8;&#x5C06;&#x8FD9;&#x4E9B;&#x8282;&#x70B9;&#x6DFB;&#x52A0;&#x5230;&#x5305;&#x542B;&#x6240;&#x6709;&#x6B63;&#x5219;&#x5316;&#x635F;&#x5931;&#x7684;&#x7279;&#x6B8A;&#x96C6;&#x5408;&#x4E2D;&#x3002; &#x60A8;&#x53EA;&#x9700;&#x8981;&#x5C06;&#x8FD9;&#x4E9B;&#x6B63;&#x5219;&#x5316;&#x635F;&#x5931;&#x6DFB;&#x52A0;&#x5230;&#x60A8;&#x7684;&#x6574;&#x4F53;&#x635F;&#x5931;&#x4E2D;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x5C06;&#x6B63;&#x5219;&#x5316;&#x635F;&#x5931;&#x52A0;&#x5230;&#x57FA;&#x672C;&#x635F;&#x5931;&#x4E0A;&#xFF1A;</p>
<pre><code class="lang-py"><span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&quot;loss&quot;</span>):                                     <span class="hljs-comment"># not shown in the book</span>
    xentropy = tf.nn.sparse_softmax_cross_entropy_with_logits(  <span class="hljs-comment"># not shown</span>
        labels=y, logits=logits)                                <span class="hljs-comment"># not shown</span>
    base_loss = tf.reduce_mean(xentropy, name=<span class="hljs-string">&quot;avg_xentropy&quot;</span>)   <span class="hljs-comment"># not shown</span>
    reg_losses = tf.get_collection(tf.GraphKeys.REGULARIZATION_LOSSES)
    loss = tf.add_n([base_loss] + reg_losses, name=<span class="hljs-string">&quot;loss&quot;</span>)
</code></pre>
<p>&#x5176;&#x4F59;&#x7684;&#x548C;&#x5F80;&#x5E38;&#x4E00;&#x6837;&#xFF1A;</p>
<pre><code class="lang-py"><span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&quot;eval&quot;</span>):
    correct = tf.nn.in_top_k(logits, y, <span class="hljs-number">1</span>)
    accuracy = tf.reduce_mean(tf.cast(correct, tf.float32), name=<span class="hljs-string">&quot;accuracy&quot;</span>)

learning_rate = <span class="hljs-number">0.01</span>

<span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&quot;train&quot;</span>):
    optimizer = tf.train.GradientDescentOptimizer(learning_rate)
    training_op = optimizer.minimize(loss)

init = tf.global_variables_initializer()
saver = tf.train.Saver()
</code></pre>
<pre><code class="lang-py">n_epochs = <span class="hljs-number">20</span>
batch_size = <span class="hljs-number">200</span>

<span class="hljs-keyword">with</span> tf.Session() <span class="hljs-keyword">as</span> sess:
    init.run()
    <span class="hljs-keyword">for</span> epoch <span class="hljs-keyword">in</span> range(n_epochs):
        <span class="hljs-keyword">for</span> iteration <span class="hljs-keyword">in</span> range(mnist.train.num_examples // batch_size):
            X_batch, y_batch = mnist.train.next_batch(batch_size)
            sess.run(training_op, feed_dict={X: X_batch, y: y_batch})
        accuracy_val = accuracy.eval(feed_dict={X: mnist.test.images,
                                                y: mnist.test.labels})
        print(epoch, <span class="hljs-string">&quot;Test accuracy:&quot;</span>, accuracy_val)

    save_path = saver.save(sess, <span class="hljs-string">&quot;./my_model_final.ckpt&quot;</span>)
</code></pre>
<p>&#x4E0D;&#x8981;&#x5FD8;&#x8BB0;&#x628A;&#x6B63;&#x5219;&#x5316;&#x7684;&#x635F;&#x5931;&#x52A0;&#x5728;&#x4F60;&#x7684;&#x6574;&#x4F53;&#x635F;&#x5931;&#x4E0A;&#xFF0C;&#x5426;&#x5219;&#x5C31;&#x4F1A;&#x88AB;&#x5FFD;&#x7565;&#x3002;</p>
<h2 id="dropout">Dropout</h2>
<p>&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6700;&#x6D41;&#x884C;&#x7684;&#x6B63;&#x5219;&#x5316;&#x6280;&#x672F;&#x53EF;&#x4EE5;&#x8BF4;&#x662F; dropout&#x3002; &#x5B83;&#x7531; GE Hinton &#x4E8E; 2012 &#x5E74;&#x63D0;&#x51FA;&#xFF0C;&#x5E76;&#x5728; Nitish Srivastava &#x7B49;&#x4EBA;&#x7684;&#x8BBA;&#x6587;&#x4E2D;&#x8FDB;&#x4E00;&#x6B65;&#x8BE6;&#x7EC6;&#x63CF;&#x8FF0;&#xFF0C;&#x5E76;&#x4E14;&#x5DF2;&#x88AB;&#x8BC1;&#x660E;&#x662F;&#x975E;&#x5E38;&#x6210;&#x529F;&#x7684;&#xFF1A;&#x5373;&#x4F7F;&#x662F;&#x6700;&#x5148;&#x8FDB;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x4EC5;&#x4EC5;&#x901A;&#x8FC7;&#x589E;&#x52A0;&#x4E22;&#x5931;&#x5C31;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;1-2&#xFF05;&#x7684;&#x51C6;&#x786E;&#x5EA6;&#x3002; &#x8FD9;&#x542C;&#x8D77;&#x6765;&#x53EF;&#x80FD;&#x4E0D;&#x662F;&#x5F88;&#x591A;&#xFF0C;&#x4F46;&#x662F;&#x5F53;&#x4E00;&#x4E2A;&#x6A21;&#x578B;&#x5DF2;&#x7ECF;&#x5177;&#x6709; 95% &#x7684;&#x51C6;&#x786E;&#x7387;&#x65F6;&#xFF0C;&#x83B7;&#x5F97; 2% &#x7684;&#x51C6;&#x786E;&#x5EA6;&#x63D0;&#x5347;&#x610F;&#x5473;&#x7740;&#x5C06;&#x8BEF;&#x5DEE;&#x7387;&#x964D;&#x4F4E;&#x8FD1; 40%&#xFF08;&#x4ECE; 5% &#x8BEF;&#x5DEE;&#x964D;&#x81F3;&#x5927;&#x7EA6; 3%&#xFF09;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x76F8;&#x5F53;&#x7B80;&#x5355;&#x7684;&#x7B97;&#x6CD5;&#xFF1A;&#x5728;&#x6BCF;&#x4E2A;&#x8BAD;&#x7EC3;&#x6B65;&#x9AA4;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#xFF08;&#x5305;&#x62EC;&#x8F93;&#x5165;&#x795E;&#x7ECF;&#x5143;&#xFF0C;&#x4F46;&#x4E0D;&#x5305;&#x62EC;&#x8F93;&#x51FA;&#x795E;&#x7ECF;&#x5143;&#xFF09;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x6682;&#x65F6;&#x201C;&#x4E22;&#x5F03;&#x201D;&#x7684;&#x6982;&#x7387;<code>p</code>&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5728;&#x8FD9;&#x4E2A;&#x8BAD;&#x7EC3;&#x6B65;&#x9AA4;&#x4E2D;&#x5B83;&#x5C06;&#x88AB;&#x5B8C;&#x5168;&#x5FFD;&#x7565;&#xFF0C; &#x5728;&#x4E0B;&#x4E00;&#x6B65;&#x53EF;&#x80FD;&#x4F1A;&#x6FC0;&#x6D3B;&#xFF08;&#x89C1;&#x56FE; 11-9&#xFF09;&#x3002; &#x8D85;&#x53C2;&#x6570;<code>p</code>&#x79F0;&#x4E3A;&#x4E22;&#x5931;&#x7387;&#xFF0C;&#x901A;&#x5E38;&#x8BBE;&#x4E3A; 50%&#x3002; &#x8BAD;&#x7EC3;&#x540E;&#xFF0C;&#x795E;&#x7ECF;&#x5143;&#x4E0D;&#x4F1A;&#x518D;&#x4E0B;&#x964D;&#x3002; &#x8FD9;&#x5C31;&#x662F;&#x5168;&#x90E8;&#xFF08;&#x9664;&#x4E86;&#x6211;&#x4EEC;&#x5C06;&#x8981;&#x8BA8;&#x8BBA;&#x7684;&#x6280;&#x672F;&#x7EC6;&#x8282;&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_11/11-9.png" alt=""></p>
<p>&#x4E00;&#x5F00;&#x59CB;&#x8FD9;&#x4E2A;&#x6280;&#x672F;&#x662F;&#x76F8;&#x5F53;&#x7C97;&#x9C81;&#xFF0C;&#x8FD9;&#x662F;&#x76F8;&#x5F53;&#x4EE4;&#x4EBA;&#x60CA;&#x8BB6;&#x7684;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x516C;&#x53F8;&#x7684;&#x5458;&#x5DE5;&#x6BCF;&#x5929;&#x65E9;&#x4E0A;&#x88AB;&#x544A;&#x77E5;&#x8981;&#x63B7;&#x786C;&#x5E01;&#x6765;&#x51B3;&#x5B9A;&#x662F;&#x5426;&#x4E0A;&#x73ED;&#xFF0C;&#x516C;&#x53F8;&#x7684;&#x8868;&#x73B0;&#x4F1A;&#x4E0D;&#x4F1A;&#x66F4;&#x597D;&#x5462;&#xFF1F;&#x90A3;&#x4E48;&#xFF0C;&#x8C01;&#x77E5;&#x9053;&#xFF1B;&#x4E5F;&#x8BB8;&#x4F1A;&#xFF01;&#x516C;&#x53F8;&#x663E;&#x7136;&#x5C06;&#x88AB;&#x8FEB;&#x9002;&#x5E94;&#x8FD9;&#x6837;&#x7684;&#x7EC4;&#x7EC7;&#x6784;&#x67B6;&#xFF1B;&#x5B83;&#x4E0D;&#x80FD;&#x4F9D;&#x9760;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x4EBA;&#x586B;&#x5199;&#x5496;&#x5561;&#x673A;&#x6216;&#x6267;&#x884C;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x5173;&#x952E;&#x4EFB;&#x52A1;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x4E13;&#x4E1A;&#x77E5;&#x8BC6;&#x5C06;&#x4E0D;&#x5F97;&#x4E0D;&#x5206;&#x6563;&#x5728;&#x51E0;&#x4E2A;&#x4EBA;&#x8EAB;&#x4E0A;&#x3002;&#x5458;&#x5DE5;&#x5FC5;&#x987B;&#x5B66;&#x4F1A;&#x4E0E;&#x5176;&#x4ED6;&#x7684;&#x8BB8;&#x591A;&#x540C;&#x4E8B;&#x5408;&#x4F5C;&#xFF0C;&#x800C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#x3002;&#x8BE5;&#x516C;&#x53F8;&#x5C06;&#x53D8;&#x5F97;&#x66F4;&#x6709;&#x5F39;&#x6027;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x4EBA;&#x79BB;&#x5F00;&#x4E86;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#x3002;&#x76EE;&#x524D;&#x8FD8;&#x4E0D;&#x6E05;&#x695A;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x662F;&#x5426;&#x771F;&#x7684;&#x53EF;&#x4EE5;&#x5728;&#x516C;&#x53F8;&#x5B9E;&#x884C;&#xFF0C;&#x4F46;&#x5B83;&#x786E;&#x5B9E;&#x5BF9;&#x4E8E;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#x3002;&#x795E;&#x7ECF;&#x5143;&#x88AB;dropout&#x8BAD;&#x7EC3;&#x4E0D;&#x80FD;&#x4E0E;&#x5176;&#x76F8;&#x90BB;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x5171;&#x9002;&#x5E94;&#xFF1B;&#x4ED6;&#x4EEC;&#x5FC5;&#x987B;&#x5C3D;&#x53EF;&#x80FD;&#x8BA9;&#x81EA;&#x5DF1;&#x53D8;&#x5F97;&#x6709;&#x7528;&#x3002;&#x4ED6;&#x4EEC;&#x4E5F;&#x4E0D;&#x80FD;&#x8FC7;&#x5206;&#x4F9D;&#x8D56;&#x4E00;&#x4E9B;&#x8F93;&#x5165;&#x795E;&#x7ECF;&#x5143;;&#x4ED6;&#x4EEC;&#x5FC5;&#x987B;&#x6CE8;&#x610F;&#x4ED6;&#x4EEC;&#x7684;&#x6BCF;&#x4E2A;&#x8F93;&#x5165;&#x795E;&#x7ECF;&#x5143;&#x3002;&#x4ED6;&#x4EEC;&#x6700;&#x7EC8;&#x5BF9;&#x8F93;&#x5165;&#x7684;&#x5FAE;&#x5C0F;&#x53D8;&#x5316;&#x4F1A;&#x4E0D;&#x592A;&#x654F;&#x611F;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x4F60;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x66F4;&#x5F3A;&#x5927;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x66F4;&#x597D;&#x5730;&#x63A8;&#x5E7F;&#x3002;</p>
<p>&#x4E86;&#x89E3; dropout &#x7684;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x8BA4;&#x8BC6;&#x5230;&#x6BCF;&#x4E2A;&#x8BAD;&#x7EC3;&#x6B65;&#x9AA4;&#x90FD;&#x4F1A;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x72EC;&#x7279;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002; &#x7531;&#x4E8E;&#x6BCF;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x53EF;&#x4EE5;&#x5B58;&#x5728;&#x6216;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x603B;&#x5171;&#x6709;<code>2 ^ N</code>&#x4E2A;&#x53EF;&#x80FD;&#x7684;&#x7F51;&#x7EDC;&#xFF08;&#x5176;&#x4E2D; N &#x662F;&#x53EF;&#x4E22;&#x5F03;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x603B;&#x6570;&#xFF09;&#x3002; &#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5DE8;&#x5927;&#x7684;&#x6570;&#x5B57;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x4E0D;&#x53EF;&#x80FD;&#x5BF9;&#x540C;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8FDB;&#x884C;&#x4E24;&#x6B21;&#x91C7;&#x6837;&#x3002; &#x4E00;&#x65E6;&#x4F60;&#x8FD0;&#x884C;&#x4E86; 10,000 &#x4E2A;&#x8BAD;&#x7EC3;&#x6B65;&#x9AA4;&#xFF0C;&#x4F60;&#x57FA;&#x672C;&#x4E0A;&#x5DF2;&#x7ECF;&#x8BAD;&#x7EC3;&#x4E86; 10,000 &#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF08;&#x6BCF;&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#xFF09;&#x3002; &#x8FD9;&#x4E9B;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x663E;&#x7136;&#x4E0D;&#x662F;&#x72EC;&#x7ACB;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x5171;&#x4EAB;&#x8BB8;&#x591A;&#x6743;&#x91CD;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x90FD;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x3002; &#x7531;&#x6B64;&#x4EA7;&#x751F;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x53EF;&#x4EE5;&#x770B;&#x4F5C;&#x662F;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x8F83;&#x5C0F;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x5E73;&#x5747;&#x96C6;&#x6210;&#x3002;</p>
<p>&#x6709;&#x4E00;&#x4E2A;&#x5C0F;&#x800C;&#x91CD;&#x8981;&#x7684;&#x6280;&#x672F;&#x7EC6;&#x8282;&#x3002; &#x5047;&#x8BBE;<code>p = 50%</code>&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5728;&#x6D4B;&#x8BD5;&#x671F;&#x95F4;&#xFF0C;&#x5728;&#x8BAD;&#x7EC3;&#x671F;&#x95F4;&#x795E;&#x7ECF;&#x5143;&#x5C06;&#x88AB;&#x8FDE;&#x63A5;&#x5230;&#x4E24;&#x500D;&#x4E8E;&#xFF08;&#x5E73;&#x5747;&#xFF09;&#x7684;&#x8F93;&#x5165;&#x795E;&#x7ECF;&#x5143;&#x3002; &#x4E3A;&#x4E86;&#x5F25;&#x8865;&#x8FD9;&#x4E2A;&#x4E8B;&#x5B9E;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5728;&#x8BAD;&#x7EC3;&#x4E4B;&#x540E;&#x5C06;&#x6BCF;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x8F93;&#x5165;&#x8FDE;&#x63A5;&#x6743;&#x91CD;&#x4E58;&#x4EE5; 0.5&#x3002; &#x5982;&#x679C;&#x6211;&#x4EEC;&#x4E0D;&#x8FD9;&#x6837;&#x505A;&#xFF0C;&#x6BCF;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x603B;&#x8F93;&#x5165;&#x4FE1;&#x53F7;&#x5927;&#x6982;&#x662F;&#x7F51;&#x7EDC;&#x8BAD;&#x7EC3;&#x7684;&#x4E24;&#x500D;&#xFF0C;&#x8FD9;&#x4E0D;&#x592A;&#x53EF;&#x80FD;&#x8868;&#x73B0;&#x826F;&#x597D;&#x3002; &#x66F4;&#x4E00;&#x822C;&#x5730;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5C06;&#x6BCF;&#x4E2A;&#x8F93;&#x5165;&#x8FDE;&#x63A5;&#x6743;&#x91CD;&#x4E58;&#x4EE5;&#x8BAD;&#x7EC3;&#x540E;&#x7684;&#x4FDD;&#x6301;&#x6982;&#x7387;&#xFF08;<code>1-p</code>&#xFF09;&#x3002; &#x6216;&#x8005;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#x4E2D;&#x5C06;&#x6BCF;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x8F93;&#x51FA;&#x9664;&#x4EE5;&#x4FDD;&#x6301;&#x6982;&#x7387;&#xFF08;&#x8FD9;&#x4E9B;&#x66FF;&#x4EE3;&#x65B9;&#x6848;&#x5E76;&#x4E0D;&#x5B8C;&#x5168;&#x7B49;&#x4EF7;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x5DE5;&#x4F5C;&#x5F97;&#x540C;&#x6837;&#x597D;&#xFF09;&#x3002;</p>
<p>&#x8981;&#x4F7F;&#x7528; TensorFlow &#x5B9E;&#x73B0;dropout&#xFF0C;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x5730;&#x5C06;<code>dropout()</code>&#x51FD;&#x6570;&#x5E94;&#x7528;&#x4E8E;&#x8F93;&#x5165;&#x5C42;&#x548C;&#x6BCF;&#x4E2A;&#x9690;&#x85CF;&#x5C42;&#x7684;&#x8F93;&#x51FA;&#x3002; &#x5728;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x968F;&#x673A;&#x4E22;&#x5F03;&#x4E00;&#x4E9B;&#x8282;&#x70B9;&#xFF08;&#x5C06;&#x5B83;&#x4EEC;&#x8BBE;&#x7F6E;&#x4E3A; 0&#xFF09;&#xFF0C;&#x5E76;&#x7528;&#x4FDD;&#x7559;&#x6982;&#x7387;&#x6765;&#x5212;&#x5206;&#x5269;&#x4F59;&#x9879;&#x76EE;&#x3002; &#x8BAD;&#x7EC3;&#x7ED3;&#x675F;&#x540E;&#xFF0C;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x4EC0;&#x4E48;&#x90FD;&#x4E0D;&#x505A;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x5C06;dropout&#x6B63;&#x5219;&#x5316;&#x5E94;&#x7528;&#x4E8E;&#x6211;&#x4EEC;&#x7684;&#x4E09;&#x5C42;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF1A;</p>
<p>&#x6CE8;&#x610F;&#xFF1A;&#x672C;&#x4E66;&#x4F7F;&#x7528;<code>tf.contrib.layers.dropout()</code>&#x800C;&#x4E0D;&#x662F;<code>tf.layers.dropout()</code>&#xFF08;&#x672C;&#x7AE0;&#x5199;&#x4F5C;&#x65F6;&#x4E0D;&#x5B58;&#x5728;&#xFF09;&#x3002; &#x73B0;&#x5728;&#x6700;&#x597D;&#x4F7F;&#x7528;<code>tf.layers.dropout()</code>&#xFF0C;&#x56E0;&#x4E3A;<code>contrib</code>&#x6A21;&#x5757;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x5185;&#x5BB9;&#x90FD;&#x53EF;&#x80FD;&#x4F1A;&#x6539;&#x53D8;&#x6216;&#x88AB;&#x5220;&#x9664;&#xFF0C;&#x6055;&#x4E0D;&#x53E6;&#x884C;&#x901A;&#x77E5;&#x3002;<code>tf.layers.dropout()</code>&#x51FD;&#x6570;&#x51E0;&#x4E4E;&#x4E0E;<code>tf.contrib.layers.dropout()</code>&#x51FD;&#x6570;&#x76F8;&#x540C;&#xFF0C;&#x53EA;&#x662F;&#x6709;&#x4E00;&#x4E9B;&#x7EC6;&#x5FAE;&#x5DEE;&#x522B;&#x3002; &#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF1A;</p>
<ul>
<li>&#x60A8;&#x5FC5;&#x987B;&#x6307;&#x5B9A;&#x4E22;&#x5931;&#x7387;&#xFF08;&#x7387;&#xFF09;&#x800C;&#x4E0D;&#x662F;&#x4FDD;&#x6301;&#x6982;&#x7387;&#xFF08;<code>keep_prob</code>&#xFF09;&#xFF0C;&#x5176;&#x4E2D;<code>rate</code>&#x7B80;&#x5355;&#x5730;&#x7B49;&#x4E8E;<code>1 - keep_prob</code></li>
<li><code>is_training</code>&#x53C2;&#x6570;&#x88AB;&#x91CD;&#x547D;&#x540D;&#x4E3A;<code>training</code>&#x3002;</li>
</ul>
<pre><code class="lang-py">X = tf.placeholder(tf.float32, shape=(<span class="hljs-keyword">None</span>, n_inputs), name=<span class="hljs-string">&quot;X&quot;</span>)
y = tf.placeholder(tf.int64, shape=(<span class="hljs-keyword">None</span>), name=<span class="hljs-string">&quot;y&quot;</span>)
</code></pre>
<pre><code class="lang-py">training = tf.placeholder_with_default(<span class="hljs-keyword">False</span>, shape=(), name=<span class="hljs-string">&apos;training&apos;</span>)

dropout_rate = <span class="hljs-number">0.5</span>  <span class="hljs-comment"># == 1 - keep_prob</span>
X_drop = tf.layers.dropout(X, dropout_rate, training=training)

<span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&quot;dnn&quot;</span>):
    hidden1 = tf.layers.dense(X_drop, n_hidden1, activation=tf.nn.relu,
                              name=<span class="hljs-string">&quot;hidden1&quot;</span>)
    hidden1_drop = tf.layers.dropout(hidden1, dropout_rate, training=training)
    hidden2 = tf.layers.dense(hidden1_drop, n_hidden2, activation=tf.nn.relu,
                              name=<span class="hljs-string">&quot;hidden2&quot;</span>)
    hidden2_drop = tf.layers.dropout(hidden2, dropout_rate, training=training)
    logits = tf.layers.dense(hidden2_drop, n_outputs, name=<span class="hljs-string">&quot;outputs&quot;</span>)
</code></pre>
<pre><code class="lang-py"><span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&quot;loss&quot;</span>):
    xentropy = tf.nn.sparse_softmax_cross_entropy_with_logits(labels=y, logits=logits)
    loss = tf.reduce_mean(xentropy, name=<span class="hljs-string">&quot;loss&quot;</span>)

<span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&quot;train&quot;</span>):
    optimizer = tf.train.MomentumOptimizer(learning_rate, momentum=<span class="hljs-number">0.9</span>)
    training_op = optimizer.minimize(loss)    

<span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&quot;eval&quot;</span>):
    correct = tf.nn.in_top_k(logits, y, <span class="hljs-number">1</span>)
    accuracy = tf.reduce_mean(tf.cast(correct, tf.float32))

init = tf.global_variables_initializer()
saver = tf.train.Saver()
</code></pre>
<pre><code class="lang-py">n_epochs = <span class="hljs-number">20</span>
batch_size = <span class="hljs-number">50</span>

<span class="hljs-keyword">with</span> tf.Session() <span class="hljs-keyword">as</span> sess:
    init.run()
    <span class="hljs-keyword">for</span> epoch <span class="hljs-keyword">in</span> range(n_epochs):
        <span class="hljs-keyword">for</span> iteration <span class="hljs-keyword">in</span> range(mnist.train.num_examples // batch_size):
            X_batch, y_batch = mnist.train.next_batch(batch_size)
            sess.run(training_op, feed_dict={training: <span class="hljs-keyword">True</span>, X: X_batch, y: y_batch})
        acc_test = accuracy.eval(feed_dict={X: mnist.test.images, y: mnist.test.labels})
        print(epoch, <span class="hljs-string">&quot;Test accuracy:&quot;</span>, acc_test)

    save_path = saver.save(sess, <span class="hljs-string">&quot;./my_model_final.ckpt&quot;</span>)
</code></pre>
<p>&#x4F60;&#x60F3;&#x5728;<code>tensorflow.contrib.layers</code>&#x4E2D;&#x4F7F;&#x7528;<code>dropout()</code>&#x51FD;&#x6570;&#xFF0C;&#x800C;&#x4E0D;&#x662F;<code>tensorflow.nn</code>&#x4E2D;&#x7684;&#x90A3;&#x4E2A;&#x3002; &#x7B2C;&#x4E00;&#x4E2A;&#x5728;&#x4E0D;&#x8BAD;&#x7EC3;&#x7684;&#x65F6;&#x5019;&#x5173;&#x6389;&#xFF08;&#x6CA1;&#x6709;&#x64CD;&#x4F5C;&#xFF09;&#xFF0C;&#x8FD9;&#x662F;&#x4F60;&#x60F3;&#x8981;&#x7684;&#xFF0C;&#x800C;&#x7B2C;&#x4E8C;&#x4E2A;&#x4E0D;&#x662F;&#x3002;</p>
<p>&#x5982;&#x679C;&#x89C2;&#x5BDF;&#x5230;&#x6A21;&#x578B;&#x8FC7;&#x62DF;&#x5408;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x589E;&#x52A0; dropout &#x7387;&#xFF08;&#x5373;&#xFF0C;&#x51CF;&#x5C11;<code>keep_prob</code>&#x8D85;&#x53C2;&#x6570;&#xFF09;&#x3002; &#x76F8;&#x53CD;&#xFF0C;&#x5982;&#x679C;&#x6A21;&#x578B;&#x6B20;&#x62DF;&#x5408;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x5219;&#x5E94;&#x5C1D;&#x8BD5;&#x964D;&#x4F4E; dropout &#x7387;&#xFF08;&#x5373;&#x589E;&#x52A0;<code>keep_prob</code>&#xFF09;&#x3002; &#x5B83;&#x4E5F;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x589E;&#x52A0;&#x5927;&#x5C42;&#x7684; dropout &#x7387;&#xFF0C;&#x5E76;&#x51CF;&#x5C11;&#x5C0F;&#x5C42;&#x7684; dropout &#x7387;&#x3002;</p>
<p>dropout &#x4F3C;&#x4E4E;&#x51CF;&#x7F13;&#x4E86;&#x6536;&#x655B;&#x901F;&#x5EA6;&#xFF0C;&#x4F46;&#x901A;&#x5E38;&#x4F1A;&#x5728;&#x8C03;&#x6574;&#x5F97;&#x5F53;&#x65F6;&#x4F7F;&#x6A21;&#x578B;&#x66F4;&#x597D;&#x3002; &#x6240;&#x4EE5;&#xFF0C;&#x8FD9;&#x901A;&#x5E38;&#x503C;&#x5F97;&#x82B1;&#x8D39;&#x989D;&#x5916;&#x7684;&#x65F6;&#x95F4;&#x548C;&#x7CBE;&#x529B;&#x3002;</p>
<p>Dropconnect&#x662F;dropout&#x7684;&#x53D8;&#x4F53;&#xFF0C;&#x5176;&#x4E2D;&#x5355;&#x4E2A;&#x8FDE;&#x63A5;&#x968F;&#x673A;&#x4E22;&#x5F03;&#x800C;&#x4E0D;&#x662F;&#x6574;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x3002; &#x4E00;&#x822C;&#x800C;&#x8A00;&#xFF0C;dropout&#x8868;&#x73B0;&#x4F1A;&#x66F4;&#x597D;&#x3002;</p>
<h2 id="&#x6700;&#x5927;&#x8303;&#x6570;&#x6B63;&#x5219;&#x5316;">&#x6700;&#x5927;&#x8303;&#x6570;&#x6B63;&#x5219;&#x5316;</h2>
<p>&#x53E6;&#x4E00;&#x79CD;&#x5728;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x975E;&#x5E38;&#x6D41;&#x884C;&#x7684;&#x6B63;&#x5219;&#x5316;&#x6280;&#x672F;&#x88AB;&#x79F0;&#x4E3A;&#x6700;&#x5927;&#x8303;&#x6570;&#x6B63;&#x5219;&#x5316;&#xFF1A;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#xFF0C;&#x5B83;&#x7EA6;&#x675F;&#x8F93;&#x5165;&#x8FDE;&#x63A5;&#x7684;&#x6743;&#x91CD;<code>w</code>&#xFF0C;&#x4F7F;&#x5F97; <img src="../images/chapter_11/o-11-16.png" alt="">&#xFF0C;&#x5176;&#x4E2D;<code>r</code>&#x662F;&#x6700;&#x5927;&#x8303;&#x6570;&#x8D85;&#x53C2;&#x6570;&#xFF0C;<img src="../images/chapter_11/o-11-17.png" alt=""> &#x662F; l2 &#x8303;&#x6570;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x901A;&#x8FC7;&#x5728;&#x6BCF;&#x4E2A;&#x8BAD;&#x7EC3;&#x6B65;&#x9AA4;&#x4E4B;&#x540E;&#x8BA1;&#x7B97; <img src="../images/chapter_11/o-11-18.png" alt=""> &#x6765;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x7EA6;&#x675F;&#xFF0C;&#x5E76;&#x4E14;&#x5982;&#x679C;&#x9700;&#x8981;&#x7684;&#x8BDD;&#x53EF;&#x4EE5;&#x526A;&#x5207;<code>W</code> <img src="../images/chapter_11/o-11-19.png" alt="">&#x3002;</p>
<p>&#x51CF;&#x5C11;<code>r</code>&#x589E;&#x52A0;&#x4E86;&#x6B63;&#x5219;&#x5316;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x5E76;&#x6709;&#x52A9;&#x4E8E;&#x51CF;&#x5C11;&#x8FC7;&#x62DF;&#x5408;&#x3002; &#x6700;&#x5927;&#x8303;&#x6570;&#x6B63;&#x5219;&#x5316;&#x8FD8;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x51CF;&#x8F7B;&#x68AF;&#x5EA6;&#x6D88;&#x5931;/&#x7206;&#x70B8;&#x95EE;&#x9898;&#xFF08;&#x5982;&#x679C;&#x60A8;&#x4E0D;&#x4F7F;&#x7528;&#x6279;&#x91CF;&#x6807;&#x51C6;&#x5316;&#xFF09;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x56DE;&#x5230; MNIST &#x7684;&#x7B80;&#x5355;&#x800C;&#x7B80;&#x5355;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x53EA;&#x6709;&#x4E24;&#x4E2A;&#x9690;&#x85CF;&#x5C42;&#xFF1A;</p>
<pre><code class="lang-py">n_inputs = <span class="hljs-number">28</span> * <span class="hljs-number">28</span>
n_hidden1 = <span class="hljs-number">300</span>
n_hidden2 = <span class="hljs-number">50</span>
n_outputs = <span class="hljs-number">10</span>

learning_rate = <span class="hljs-number">0.01</span>
momentum = <span class="hljs-number">0.9</span>

X = tf.placeholder(tf.float32, shape=(<span class="hljs-keyword">None</span>, n_inputs), name=<span class="hljs-string">&quot;X&quot;</span>)
y = tf.placeholder(tf.int64, shape=(<span class="hljs-keyword">None</span>), name=<span class="hljs-string">&quot;y&quot;</span>)

<span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&quot;dnn&quot;</span>):
    hidden1 = tf.layers.dense(X, n_hidden1, activation=tf.nn.relu, name=<span class="hljs-string">&quot;hidden1&quot;</span>)
    hidden2 = tf.layers.dense(hidden1, n_hidden2, activation=tf.nn.relu, name=<span class="hljs-string">&quot;hidden2&quot;</span>)
    logits = tf.layers.dense(hidden2, n_outputs, name=<span class="hljs-string">&quot;outputs&quot;</span>)

<span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&quot;loss&quot;</span>):
    xentropy = tf.nn.sparse_softmax_cross_entropy_with_logits(labels=y, logits=logits)
    loss = tf.reduce_mean(xentropy, name=<span class="hljs-string">&quot;loss&quot;</span>)

<span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&quot;train&quot;</span>):
    optimizer = tf.train.MomentumOptimizer(learning_rate, momentum)
    training_op = optimizer.minimize(loss)    

<span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&quot;eval&quot;</span>):
    correct = tf.nn.in_top_k(logits, y, <span class="hljs-number">1</span>)
    accuracy = tf.reduce_mean(tf.cast(correct, tf.float32))
</code></pre>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x5904;&#x7406;&#x7B2C;&#x4E00;&#x4E2A;&#x9690;&#x85CF;&#x5C42;&#x7684;&#x6743;&#x91CD;&#xFF0C;&#x5E76;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#xFF0C;&#x4F7F;&#x7528;<code>clip_by_norm()</code>&#x51FD;&#x6570;&#x8BA1;&#x7B97;&#x526A;&#x5207;&#x540E;&#x7684;&#x6743;&#x91CD;&#x3002; &#x7136;&#x540E;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x8D4B;&#x503C;&#x64CD;&#x4F5C;&#x6765;&#x5C06;&#x6743;&#x503C;&#x8D4B;&#x7ED9;&#x6743;&#x503C;&#x53D8;&#x91CF;&#xFF1A;</p>
<pre><code class="lang-py">threshold = <span class="hljs-number">1.0</span>
weights = tf.get_default_graph().get_tensor_by_name(<span class="hljs-string">&quot;hidden1/kernel:0&quot;</span>)
clipped_weights = tf.clip_by_norm(weights, clip_norm=threshold, axes=<span class="hljs-number">1</span>)
clip_weights = tf.assign(weights, clipped_weights)
</code></pre>
<p>&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x4E3A;&#x7B2C;&#x4E8C;&#x4E2A;&#x9690;&#x85CF;&#x5C42;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#xFF1A;</p>
<pre><code class="lang-py">weights2 = tf.get_default_graph().get_tensor_by_name(<span class="hljs-string">&quot;hidden2/kernel:0&quot;</span>)
clipped_weights2 = tf.clip_by_norm(weights2, clip_norm=threshold, axes=<span class="hljs-number">1</span>)
clip_weights2 = tf.assign(weights2, clipped_weights2)
</code></pre>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x521D;&#x59CB;&#x5316;&#x5668;&#x548C;&#x4E00;&#x4E2A;&#x4FDD;&#x5B58;&#x5668;&#xFF1A;</p>
<pre><code class="lang-py">init = tf.global_variables_initializer()
saver = tf.train.Saver()
</code></pre>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8BAD;&#x7EC3;&#x6A21;&#x578B;&#x3002; &#x4E0E;&#x5F80;&#x5E38;&#x4E00;&#x6837;&#xFF0C;&#x9664;&#x4E86;&#x5728;&#x8FD0;&#x884C;<code>training_op</code>&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x8FD0;&#x884C;<code>clip_weights</code>&#x548C;<code>clip_weights2</code>&#x64CD;&#x4F5C;&#xFF1A;</p>
<pre><code class="lang-py">n_epochs = <span class="hljs-number">20</span>
batch_size = <span class="hljs-number">50</span>
</code></pre>
<pre><code class="lang-py"><span class="hljs-keyword">with</span> tf.Session() <span class="hljs-keyword">as</span> sess:                                              <span class="hljs-comment"># not shown in the book</span>
    init.run()                                                          <span class="hljs-comment"># not shown</span>
    <span class="hljs-keyword">for</span> epoch <span class="hljs-keyword">in</span> range(n_epochs):                                       <span class="hljs-comment"># not shown</span>
        <span class="hljs-keyword">for</span> iteration <span class="hljs-keyword">in</span> range(mnist.train.num_examples // batch_size):  <span class="hljs-comment"># not shown</span>
            X_batch, y_batch = mnist.train.next_batch(batch_size)       <span class="hljs-comment"># not shown</span>
            sess.run(training_op, feed_dict={X: X_batch, y: y_batch})
            clip_weights.eval()
            clip_weights2.eval()                                        <span class="hljs-comment"># not shown</span>
        acc_test = accuracy.eval(feed_dict={X: mnist.test.images,       <span class="hljs-comment"># not shown</span>
                                            y: mnist.test.labels})      <span class="hljs-comment"># not shown</span>
        print(epoch, <span class="hljs-string">&quot;Test accuracy:&quot;</span>, acc_test)                        <span class="hljs-comment"># not shown</span>

    save_path = saver.save(sess, <span class="hljs-string">&quot;./my_model_final.ckpt&quot;</span>)               <span class="hljs-comment"># not shown</span>
</code></pre>
<p>&#x4E0A;&#x9762;&#x7684;&#x5B9E;&#x73B0;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x5DE5;&#x4F5C;&#x6B63;&#x5E38;&#xFF0C;&#x4F46;&#x6709;&#x70B9;&#x9EBB;&#x70E6;&#x3002; &#x66F4;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;<code>max_norm_regularizer()</code>&#x51FD;&#x6570;&#xFF1A;</p>
<pre><code class="lang-py"><span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">max_norm_regularizer</span><span class="hljs-params">(threshold, axes=<span class="hljs-number">1</span>, name=<span class="hljs-string">&quot;max_norm&quot;</span>,
                         collection=<span class="hljs-string">&quot;max_norm&quot;</span>)</span>:</span>
    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">max_norm</span><span class="hljs-params">(weights)</span>:</span>
        clipped = tf.clip_by_norm(weights, clip_norm=threshold, axes=axes)
        clip_weights = tf.assign(weights, clipped, name=name)
        tf.add_to_collection(collection, clip_weights)
        <span class="hljs-keyword">return</span> <span class="hljs-keyword">None</span> <span class="hljs-comment"># there is no regularization loss term</span>
    <span class="hljs-keyword">return</span> max_norm
</code></pre>
<p>&#x7136;&#x540E;&#x4F60;&#x53EF;&#x4EE5;&#x8C03;&#x7528;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x6765;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x6700;&#x5927;&#x8303;&#x6570;&#x8C03;&#x8282;&#x5668;&#xFF08;&#x4E0E;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x9608;&#x503C;&#xFF09;&#x3002; &#x5F53;&#x4F60;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x9690;&#x85CF;&#x5C42;&#x65F6;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x8FD9;&#x4E2A;&#x6B63;&#x5219;&#x5316;&#x5668;&#x4F20;&#x9012;&#x7ED9;<code>kernel_regularizer</code>&#x53C2;&#x6570;&#xFF1A;</p>
<pre><code class="lang-py">n_inputs = <span class="hljs-number">28</span> * <span class="hljs-number">28</span>
n_hidden1 = <span class="hljs-number">300</span>
n_hidden2 = <span class="hljs-number">50</span>
n_outputs = <span class="hljs-number">10</span>

learning_rate = <span class="hljs-number">0.01</span>
momentum = <span class="hljs-number">0.9</span>

X = tf.placeholder(tf.float32, shape=(<span class="hljs-keyword">None</span>, n_inputs), name=<span class="hljs-string">&quot;X&quot;</span>)
y = tf.placeholder(tf.int64, shape=(<span class="hljs-keyword">None</span>), name=<span class="hljs-string">&quot;y&quot;</span>)
</code></pre>
<pre><code class="lang-py">max_norm_reg = max_norm_regularizer(threshold=<span class="hljs-number">1.0</span>)
<span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&quot;dnn&quot;</span>):
    hidden1 = tf.layers.dense(X, n_hidden1, activation=tf.nn.relu,
                              kernel_regularizer=max_norm_reg, name=<span class="hljs-string">&quot;hidden1&quot;</span>)
    hidden2 = tf.layers.dense(hidden1, n_hidden2, activation=tf.nn.relu,
                              kernel_regularizer=max_norm_reg, name=<span class="hljs-string">&quot;hidden2&quot;</span>)
    logits = tf.layers.dense(hidden2, n_outputs, name=<span class="hljs-string">&quot;outputs&quot;</span>)
</code></pre>
<pre><code class="lang-py"><span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&quot;loss&quot;</span>):
    xentropy = tf.nn.sparse_softmax_cross_entropy_with_logits(labels=y, logits=logits)
    loss = tf.reduce_mean(xentropy, name=<span class="hljs-string">&quot;loss&quot;</span>)

<span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&quot;train&quot;</span>):
    optimizer = tf.train.MomentumOptimizer(learning_rate, momentum)
    training_op = optimizer.minimize(loss)    

<span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&quot;eval&quot;</span>):
    correct = tf.nn.in_top_k(logits, y, <span class="hljs-number">1</span>)
    accuracy = tf.reduce_mean(tf.cast(correct, tf.float32))

init = tf.global_variables_initializer()
saver = tf.train.Saver()
</code></pre>
<p>&#x8BAD;&#x7EC3;&#x4E0E;&#x5F80;&#x5E38;&#x4E00;&#x6837;&#xFF0C;&#x9664;&#x4E86;&#x6BCF;&#x6B21;&#x8BAD;&#x7EC3;&#x540E;&#x5FC5;&#x987B;&#x8FD0;&#x884C;&#x91CD;&#x91CF;&#x88C1;&#x526A;&#x64CD;&#x4F5C;&#xFF1A;</p>
<p>&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x6700;&#x5927;&#x8303;&#x6570;&#x6B63;&#x5219;&#x5316;&#x4E0D;&#x9700;&#x8981;&#x5728;&#x6574;&#x4F53;&#x635F;&#x5931;&#x51FD;&#x6570;&#x4E2D;&#x6DFB;&#x52A0;&#x6B63;&#x5219;&#x5316;&#x635F;&#x5931;&#x9879;&#xFF0C;&#x6240;&#x4EE5;<code>max_norm()</code>&#x51FD;&#x6570;&#x8FD4;&#x56DE;<code>None</code>&#x3002; &#x4F46;&#x662F;&#xFF0C;&#x5728;&#x6BCF;&#x4E2A;&#x8BAD;&#x7EC3;&#x6B65;&#x9AA4;&#x4E4B;&#x540E;&#xFF0C;&#x4ECD;&#x9700;&#x8981;&#x8FD0;&#x884C;<code>clip_weights</code>&#x64CD;&#x4F5C;&#xFF0C;&#x56E0;&#x6B64;&#x60A8;&#x9700;&#x8981;&#x80FD;&#x591F;&#x638C;&#x63E1;&#x5B83;&#x3002; &#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;<code>max_norm()</code>&#x51FD;&#x6570;&#x5C06;<code>clip_weights</code>&#x8282;&#x70B9;&#x6DFB;&#x52A0;&#x5230;&#x6700;&#x5927;&#x8303;&#x6570;&#x526A;&#x88C1;&#x64CD;&#x4F5C;&#x7684;&#x96C6;&#x5408;&#x4E2D;&#x7684;&#x539F;&#x56E0;&#x3002;&#x60A8;&#x9700;&#x8981;&#x83B7;&#x53D6;&#x8FD9;&#x4E9B;&#x88C1;&#x526A;&#x64CD;&#x4F5C;&#x5E76;&#x5728;&#x6BCF;&#x4E2A;&#x8BAD;&#x7EC3;&#x6B65;&#x9AA4;&#x540E;&#x8FD0;&#x884C;&#x5B83;&#x4EEC;&#xFF1A;</p>
<pre><code class="lang-py">n_epochs = <span class="hljs-number">20</span>
batch_size = <span class="hljs-number">50</span>
</code></pre>
<pre><code class="lang-py">clip_all_weights = tf.get_collection(<span class="hljs-string">&quot;max_norm&quot;</span>)

<span class="hljs-keyword">with</span> tf.Session() <span class="hljs-keyword">as</span> sess:
    init.run()
    <span class="hljs-keyword">for</span> epoch <span class="hljs-keyword">in</span> range(n_epochs):
        <span class="hljs-keyword">for</span> iteration <span class="hljs-keyword">in</span> range(mnist.train.num_examples // batch_size):
            X_batch, y_batch = mnist.train.next_batch(batch_size)
            sess.run(training_op, feed_dict={X: X_batch, y: y_batch})
            sess.run(clip_all_weights)
        acc_test = accuracy.eval(feed_dict={X: mnist.test.images,     <span class="hljs-comment"># not shown in the book</span>
                                            y: mnist.test.labels})    <span class="hljs-comment"># not shown</span>
        print(epoch, <span class="hljs-string">&quot;Test accuracy:&quot;</span>, acc_test)                      <span class="hljs-comment"># not shown</span>

    save_path = saver.save(sess, <span class="hljs-string">&quot;./my_model_final.ckpt&quot;</span>)             <span class="hljs-comment"># not shown</span>
</code></pre>
<h2 id="&#x6570;&#x636E;&#x589E;&#x5F3A;">&#x6570;&#x636E;&#x589E;&#x5F3A;</h2>
<p>&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x6B63;&#x5219;&#x5316;&#x6280;&#x672F;&#xFF0C;&#x6570;&#x636E;&#x589E;&#x5F3A;&#xFF0C;&#x5305;&#x62EC;&#x4ECE;&#x73B0;&#x6709;&#x7684;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#x4E2D;&#x4EA7;&#x751F;&#x65B0;&#x7684;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#xFF0C;&#x4EBA;&#x4E3A;&#x5730;&#x589E;&#x52A0;&#x4E86;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x5927;&#x5C0F;&#x3002; &#x8FD9;&#x5C06;&#x51CF;&#x5C11;&#x8FC7;&#x62DF;&#x5408;&#xFF0C;&#x4F7F;&#x4E4B;&#x6210;&#x4E3A;&#x6B63;&#x5219;&#x5316;&#x6280;&#x672F;&#x3002; &#x8BC0;&#x7A8D;&#x662F;&#x751F;&#x6210;&#x903C;&#x771F;&#x7684;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;; &#x7406;&#x60F3;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x4E0D;&#x5E94;&#x8BE5;&#x80FD;&#x591F;&#x5206;&#x8FA8;&#x51FA;&#x54EA;&#x4E9B;&#x662F;&#x751F;&#x6210;&#x7684;&#xFF0C;&#x54EA;&#x4E9B;&#x4E0D;&#x662F;&#x751F;&#x6210;&#x7684;&#x3002; &#x800C;&#x4E14;&#xFF0C;&#x7B80;&#x5355;&#x5730;&#x52A0;&#x767D;&#x566A;&#x58F0;&#x4E5F;&#x65E0;&#x6D4E;&#x4E8E;&#x4E8B;&#x3002; &#x4F60;&#x5E94;&#x7528;&#x7684;&#x4FEE;&#x6539;&#x5E94;&#x8BE5;&#x662F;&#x53EF;&#x4EE5;&#x5B66;&#x4E60;&#x7684;&#xFF08;&#x767D;&#x566A;&#x58F0;&#x4E0D;&#x662F;&#xFF09;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x7684;&#x6A21;&#x578B;&#x662F;&#x4E3A;&#x4E86;&#x5206;&#x7C7B;&#x8611;&#x83C7;&#x56FE;&#x7247;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x7A0D;&#x5FAE;&#x79FB;&#x52A8;&#xFF0C;&#x65CB;&#x8F6C;&#x548C;&#x8C03;&#x6574;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x56FE;&#x7247;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x5E76;&#x5C06;&#x7ED3;&#x679C;&#x56FE;&#x7247;&#x6DFB;&#x52A0;&#x5230;&#x8BAD;&#x7EC3;&#x96C6;&#xFF08;&#x89C1;&#x56FE; 11-10&#xFF09;&#x3002; &#x8FD9;&#x8FEB;&#x4F7F;&#x6A21;&#x578B;&#x66F4;&#x80FD;&#x5BB9;&#x5FCD;&#x56FE;&#x7247;&#x4E2D;&#x8611;&#x83C7;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x65B9;&#x5411;&#x548C;&#x5927;&#x5C0F;&#x3002; &#x5982;&#x679C;&#x60A8;&#x5E0C;&#x671B;&#x6A21;&#x578B;&#x5BF9;&#x5149;&#x7167;&#x6761;&#x4EF6;&#x66F4;&#x52A0;&#x5BBD;&#x5BB9;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x7C7B;&#x4F3C;&#x5730;&#x751F;&#x6210;&#x5177;&#x6709;&#x5404;&#x79CD;&#x5BF9;&#x6BD4;&#x5EA6;&#x7684;&#x8BB8;&#x591A;&#x56FE;&#x50CF;&#x3002; &#x5047;&#x8BBE;&#x8611;&#x83C7;&#x662F;&#x5BF9;&#x79F0;&#x7684;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x6C34;&#x5E73;&#x7FFB;&#x8F6C;&#x56FE;&#x7247;&#x3002; &#x901A;&#x8FC7;&#x7ED3;&#x5408;&#x8FD9;&#x4E9B;&#x8F6C;&#x6362;&#xFF0C;&#x53EF;&#x4EE5;&#x5927;&#x5927;&#x589E;&#x52A0;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x5927;&#x5C0F;&#x3002;</p>
<p><img src="../images/chapter_11/11-10.png" alt=""></p>
<p>&#x901A;&#x5E38;&#x6700;&#x597D;&#x5728;&#x8BAD;&#x7EC3;&#x671F;&#x95F4;&#x751F;&#x6210;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6D6A;&#x8D39;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x548C;&#x7F51;&#x7EDC;&#x5E26;&#x5BBD;&#x3002;TensorFlow &#x63D0;&#x4F9B;&#x4E86;&#x591A;&#x79CD;&#x56FE;&#x50CF;&#x5904;&#x7406;&#x64CD;&#x4F5C;&#xFF0C;&#x4F8B;&#x5982;&#x8F6C;&#x7F6E;&#xFF08;&#x79FB;&#x4F4D;&#xFF09;&#xFF0C;&#x65CB;&#x8F6C;&#xFF0C;&#x8C03;&#x6574;&#x5927;&#x5C0F;&#xFF0C;&#x7FFB;&#x8F6C;&#x548C;&#x88C1;&#x526A;&#xFF0C;&#x4EE5;&#x53CA;&#x8C03;&#x6574;&#x4EAE;&#x5EA6;&#xFF0C;&#x5BF9;&#x6BD4;&#x5EA6;&#xFF0C;&#x9971;&#x548C;&#x5EA6;&#x548C;&#x8272;&#x8C03;&#xFF08;&#x8BF7;&#x53C2;&#x9605; API &#x6587;&#x6863;&#x4EE5;&#x83B7;&#x53D6;&#x66F4;&#x591A;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#xFF09;&#x3002; &#x8FD9;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x4E3A;&#x56FE;&#x50CF;&#x6570;&#x636E;&#x96C6;&#x5B9E;&#x73B0;&#x6570;&#x636E;&#x589E;&#x5F3A;&#x3002;</p>
<p>&#x8BAD;&#x7EC3;&#x975E;&#x5E38;&#x6DF1;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x5F3A;&#x5927;&#x7684;&#x6280;&#x672F;&#x662F;&#x6DFB;&#x52A0;&#x8DF3;&#x8FC7;&#x8FDE;&#x63A5;&#xFF08;&#x8DF3;&#x8FC7;&#x8FDE;&#x63A5;&#x662F;&#x5C06;&#x5C42;&#x7684;&#x8F93;&#x5165;&#x6DFB;&#x52A0;&#x5230;&#x66F4;&#x9AD8;&#x5C42;&#x7684;&#x8F93;&#x51FA;&#x65F6;&#xFF09;&#x3002; &#x6211;&#x4EEC;&#x5C06;&#x5728;&#x7B2C; 13 &#x7AE0;&#x4E2D;&#x8C08;&#x8BBA;&#x6DF1;&#x5EA6;&#x6B8B;&#x5DEE;&#x7F51;&#x7EDC;&#x65F6;&#x63A2;&#x8BA8;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x3002;</p>
<h2 id="&#x5B9E;&#x8DF5;&#x6307;&#x5357;">&#x5B9E;&#x8DF5;&#x6307;&#x5357;</h2>
<p>&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x6DB5;&#x76D6;&#x4E86;&#x5F88;&#x591A;&#x6280;&#x672F;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x60F3;&#x77E5;&#x9053;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x54EA;&#x4E9B;&#x6280;&#x672F;&#x3002; &#x8868; 11-2 &#x4E2D;&#x7684;&#x914D;&#x7F6E;&#x5728;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x90FD;&#x80FD;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x3002;</p>
<p><img src="../images/chapter_11/t-11-2.png" alt=""></p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x80FD;&#x627E;&#x5230;&#x89E3;&#x51B3;&#x7C7B;&#x4F3C;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x5C1D;&#x8BD5;&#x91CD;&#x7528;&#x9884;&#x8BAD;&#x7EC3;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x9ED8;&#x8BA4;&#x914D;&#x7F6E;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x8C03;&#x6574;&#xFF1A;</p>
<ul>
<li>&#x5982;&#x679C;&#x4F60;&#x627E;&#x4E0D;&#x5230;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x5B66;&#x4E60;&#x7387;&#xFF08;&#x6536;&#x655B;&#x901F;&#x5EA6;&#x592A;&#x6162;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x589E;&#x52A0;&#x4E86;&#x8BAD;&#x7EC3;&#x901F;&#x5EA6;&#xFF0C;&#x73B0;&#x5728;&#x6536;&#x655B;&#x901F;&#x5EA6;&#x5F88;&#x5FEB;&#xFF0C;&#x4F46;&#x662F;&#x7F51;&#x7EDC;&#x7684;&#x51C6;&#x786E;&#x6027;&#x4E0D;&#x662F;&#x6700;&#x7406;&#x60F3;&#x7684;&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x5B66;&#x4E60;&#x7387;&#x8C03;&#x6574;&#xFF0C;&#x5982;&#x6307;&#x6570;&#x8870;&#x51CF;&#x3002;</li>
<li>&#x5982;&#x679C;&#x4F60;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#x592A;&#x5C0F;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x6570;&#x636E;&#x589E;&#x5F3A;&#x3002;</li>
<li>&#x5982;&#x679C;&#x4F60;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x7A00;&#x758F;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x6DFB;&#x52A0; l1 &#x6B63;&#x5219;&#x5316;&#x6DF7;&#x5408;&#xFF08;&#x5E76;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x5728;&#x8BAD;&#x7EC3;&#x540E;&#x5C06;&#x5FAE;&#x5C0F;&#x7684;&#x6743;&#x91CD;&#x5F52;&#x96F6;&#xFF09;&#x3002; &#x5982;&#x679C;&#x60A8;&#x9700;&#x8981;&#x66F4;&#x7A00;&#x758F;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x4F7F;&#x7528; FTRL &#x800C;&#x4E0D;&#x662F; Adam &#x4F18;&#x5316;&#x4EE5;&#x53CA; l1 &#x6B63;&#x5219;&#x5316;&#x3002;</li>
<li>&#x5982;&#x679C;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x9700;&#x8981;&#x5FEB;&#x901F;&#x6A21;&#x578B;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5220;&#x9664;&#x6279;&#x91CF;&#x6807;&#x51C6;&#x5316;&#xFF0C;&#x5E76;&#x53EF;&#x80FD;&#x7528; leakyReLU &#x66FF;&#x6362; ELU &#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x3002; &#x6709;&#x4E00;&#x4E2A;&#x7A00;&#x758F;&#x7684;&#x6A21;&#x578B;&#x4E5F;&#x5C06;&#x6709;&#x6240;&#x5E2E;&#x52A9;&#x3002;</li>
</ul>
<p>&#x6709;&#x4E86;&#x8FD9;&#x4E9B;&#x6307;&#x5BFC;&#x65B9;&#x9488;&#xFF0C;&#x4F60;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x51C6;&#x5907;&#x597D;&#x8BAD;&#x7EC3;&#x975E;&#x5E38;&#x6DF1;&#x7684;&#x7F51;&#x7EDC; - &#x597D;&#x5427;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x975E;&#x5E38;&#x6709;&#x8010;&#x5FC3;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#xFF01; &#x5982;&#x679C;&#x4F7F;&#x7528;&#x5355;&#x53F0;&#x673A;&#x5668;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x7B49;&#x5F85;&#x51E0;&#x5929;&#x751A;&#x81F3;&#x51E0;&#x4E2A;&#x6708;&#x624D;&#x80FD;&#x5B8C;&#x6210;&#x8BAD;&#x7EC3;&#x3002; &#x5728;&#x4E0B;&#x4E00;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8BA8;&#x8BBA;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x5206;&#x5E03;&#x5F0F; TensorFlow &#x5728;&#x8BB8;&#x591A;&#x670D;&#x52A1;&#x5668;&#x548C; GPU &#x4E0A;&#x8BAD;&#x7EC3;&#x548C;&#x8FD0;&#x884C;&#x6A21;&#x578B;&#x3002;</p>
<h2 id="&#x7EC3;&#x4E60;">&#x7EC3;&#x4E60;</h2>
<ol>
<li>&#x4F7F;&#x7528; He &#x521D;&#x59CB;&#x5316;&#x968F;&#x673A;&#x9009;&#x62E9;&#x6743;&#x91CD;&#xFF0C;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x5C06;&#x6240;&#x6709;&#x6743;&#x91CD;&#x521D;&#x59CB;&#x5316;&#x4E3A;&#x76F8;&#x540C;&#x7684;&#x503C;&#xFF1F;</li>
<li>&#x53EF;&#x4EE5;&#x5C06;&#x504F;&#x7F6E;&#x521D;&#x59CB;&#x5316;&#x4E3A; 0 &#x5417;&#xFF1F;</li>
<li>&#x8BF4;&#x51FA; ELU &#x6FC0;&#x6D3B;&#x529F;&#x80FD;&#x4E0E; ReLU &#x76F8;&#x6BD4;&#x7684;&#x4E09;&#x4E2A;&#x4F18;&#x70B9;&#x3002;</li>
<li>&#x5728;&#x54EA;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x60A8;&#x60F3;&#x8981;&#x4F7F;&#x7528;&#x4EE5;&#x4E0B;&#x6BCF;&#x4E2A;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF1A;ELU&#xFF0C;leaky ReLU&#xFF08;&#x53CA;&#x5176;&#x53D8;&#x4F53;&#xFF09;&#xFF0C;ReLU&#xFF0C;tanh&#xFF0C;logistic &#x4EE5;&#x53CA; softmax&#xFF1F;</li>
<li>&#x4F7F;&#x7528;<code>MomentumOptimizer</code>&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x5C06;<code>momentum</code>&#x8D85;&#x53C2;&#x6570;&#x8BBE;&#x7F6E;&#x5F97;&#x592A;&#x63A5;&#x8FD1; 1&#xFF08;&#x4F8B;&#x5982;&#xFF0C;0.99999&#xFF09;&#xFF0C;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#xFF1F;</li>
<li>&#x8BF7;&#x5217;&#x4E3E;&#x60A8;&#x53EF;&#x4EE5;&#x751F;&#x6210;&#x7A00;&#x758F;&#x6A21;&#x578B;&#x7684;&#x4E09;&#x79CD;&#x65B9;&#x6CD5;&#x3002;</li>
<li>dropout &#x662F;&#x5426;&#x4F1A;&#x51CF;&#x6162;&#x8BAD;&#x7EC3;&#xFF1F; &#x5B83;&#x662F;&#x5426;&#x4F1A;&#x51CF;&#x6162;&#x63A8;&#x65AD;&#xFF08;&#x5373;&#x9884;&#x6D4B;&#x65B0;&#x7684;&#x5B9E;&#x4F8B;&#xFF09;&#xFF1F;</li>
<li>&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x3002;<ol>
<li>&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A; DNN&#xFF0C;&#x6709;&#x4E94;&#x4E2A;&#x9690;&#x85CF;&#x5C42;&#xFF0C;&#x6BCF;&#x5C42; 100 &#x4E2A;&#x795E;&#x7ECF;&#x5143;&#xFF0C;&#x4F7F;&#x7528; He &#x521D;&#x59CB;&#x5316;&#x548C; ELU &#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x3002;</li>
<li>&#x4F7F;&#x7528; Adam &#x4F18;&#x5316;&#x548C;&#x63D0;&#x524D;&#x505C;&#x6B62;&#xFF0C;&#x8BF7;&#x5C1D;&#x8BD5;&#x5728; MNIST &#x4E0A;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#xFF0C;&#x4F46;&#x53EA;&#x80FD;&#x4F7F;&#x7528;&#x6570;&#x5B57; 0 &#x5230; 4&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x4E0B;&#x4E00;&#x4E2A;&#x7EC3;&#x4E60;&#x4E2D;&#x5728;&#x6570;&#x5B57; 5 &#x5230; 9 &#x4E0A;&#x8FDB;&#x884C;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x3002; &#x60A8;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x4E94;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x7684; softmax &#x8F93;&#x51FA;&#x5C42;&#xFF0C;&#x5E76;&#x4E14;&#x4E00;&#x5982;&#x65E2;&#x5F80;&#x5730;&#x786E;&#x4FDD;&#x5B9A;&#x671F;&#x4FDD;&#x5B58;&#x68C0;&#x67E5;&#x70B9;&#xFF0C;&#x5E76;&#x4FDD;&#x5B58;&#x6700;&#x7EC8;&#x6A21;&#x578B;&#xFF0C;&#x4EE5;&#x4FBF;&#x7A0D;&#x540E;&#x518D;&#x4F7F;&#x7528;&#x5B83;&#x3002;</li>
<li>&#x4F7F;&#x7528;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x8C03;&#x6574;&#x8D85;&#x53C2;&#x6570;&#xFF0C;&#x5E76;&#x67E5;&#x770B;&#x4F60;&#x80FD;&#x8FBE;&#x5230;&#x4EC0;&#x4E48;&#x51C6;&#x786E;&#x5EA6;&#x3002;</li>
<li>&#x73B0;&#x5728;&#x5C1D;&#x8BD5;&#x6DFB;&#x52A0;&#x6279;&#x91CF;&#x6807;&#x51C6;&#x5316;&#x5E76;&#x6BD4;&#x8F83;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;&#xFF1A;&#x5B83;&#x662F;&#x5426;&#x6BD4;&#x4EE5;&#x524D;&#x6536;&#x655B;&#x5F97;&#x66F4;&#x5FEB;&#xFF1F; &#x5B83;&#x662F;&#x5426;&#x4F1A;&#x4EA7;&#x751F;&#x66F4;&#x597D;&#x7684;&#x6A21;&#x578B;&#xFF1F;</li>
<li>&#x6A21;&#x578B;&#x662F;&#x5426;&#x8FC7;&#x62DF;&#x5408;&#x8BAD;&#x7EC3;&#x96C6;&#xFF1F; &#x5C1D;&#x8BD5;&#x5C06; dropout &#x6DFB;&#x52A0;&#x5230;&#x6BCF;&#x4E00;&#x5C42;&#xFF0C;&#x7136;&#x540E;&#x91CD;&#x8BD5;&#x3002; &#x5B83;&#x6709;&#x5E2E;&#x52A9;&#x5417;&#xFF1F;</li>
</ol>
</li>
<li>&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x3002;<ol>
<li>&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684; DNN&#xFF0C;&#x5B83;&#x590D;&#x5236;&#x5148;&#x524D;&#x6A21;&#x578B;&#x7684;&#x6240;&#x6709;&#x9884;&#x8BAD;&#x7EC3;&#x7684;&#x9690;&#x85CF;&#x5C42;&#xFF0C;&#x51BB;&#x7ED3;&#x5B83;&#x4EEC;&#xFF0C;&#x5E76;&#x7528;&#x65B0;&#x7684;&#x4E00;&#x5C42;&#x66FF;&#x6362; softmax &#x8F93;&#x51FA;&#x5C42;&#x3002;</li>
<li>&#x5728;&#x6570;&#x5B57; 5 &#x5230; 9 &#x8BAD;&#x7EC3;&#x8FD9;&#x4E2A;&#x65B0;&#x7684; DNN &#xFF0C;&#x6BCF;&#x4E2A;&#x6570;&#x5B57;&#x53EA;&#x4F7F;&#x7528; 100 &#x4E2A;&#x56FE;&#x50CF;&#xFF0C;&#x9700;&#x8981;&#x591A;&#x957F;&#x65F6;&#x95F4;&#xFF1F; &#x5C3D;&#x7BA1;&#x6837;&#x672C;&#x8FD9;&#x4E48;&#x5C11;&#xFF0C;&#x4F60;&#x80FD;&#x8FBE;&#x5230;&#x9AD8;&#x51C6;&#x786E;&#x5EA6;&#x5417;&#xFF1F;</li>
<li>&#x5C1D;&#x8BD5;&#x7F13;&#x5B58;&#x51BB;&#x7ED3;&#x7684;&#x5C42;&#xFF0C;&#x5E76;&#x518D;&#x6B21;&#x8BAD;&#x7EC3;&#x6A21;&#x578B;&#xFF1A;&#x73B0;&#x5728;&#x901F;&#x5EA6;&#x6709;&#x591A;&#x5FEB;&#xFF1F;</li>
<li>&#x518D;&#x6B21;&#x5C1D;&#x8BD5;&#x590D;&#x7528;&#x56DB;&#x4E2A;&#x9690;&#x85CF;&#x5C42;&#x800C;&#x4E0D;&#x662F;&#x4E94;&#x4E2A;&#x3002; &#x4F60;&#x80FD;&#x8FBE;&#x5230;&#x66F4;&#x9AD8;&#x7684;&#x51C6;&#x786E;&#x5EA6;&#x5417;&#xFF1F;</li>
<li>&#x73B0;&#x5728;&#xFF0C;&#x89E3;&#x51BB;&#x524D;&#x4E24;&#x4E2A;&#x9690;&#x85CF;&#x5C42;&#x5E76;&#x7EE7;&#x7EED;&#x8BAD;&#x7EC3;&#xFF1A;&#x60A8;&#x53EF;&#x4EE5;&#x8BA9;&#x6A21;&#x578B;&#x8868;&#x73B0;&#x5F97;&#x66F4;&#x597D;&#x5417;&#xFF1F;</li>
</ol>
</li>
<li>&#x8F85;&#x52A9;&#x4EFB;&#x52A1;&#x7684;&#x9884;&#x8BAD;&#x7EC3;&#x3002;<ol>
<li>&#x5728;&#x672C;&#x7EC3;&#x4E60;&#x4E2D;&#xFF0C;&#x4F60;&#x5C06;&#x6784;&#x5EFA;&#x4E00;&#x4E2A; DNN&#xFF0C;&#x7528;&#x4E8E;&#x6BD4;&#x8F83;&#x4E24;&#x4E2A; MNIST &#x6570;&#x5B57;&#x56FE;&#x50CF;&#xFF0C;&#x5E76;&#x9884;&#x6D4B;&#x5B83;&#x4EEC;&#x662F;&#x5426;&#x4EE3;&#x8868;&#x76F8;&#x540C;&#x7684;&#x6570;&#x5B57;&#x3002; &#x7136;&#x540E;&#xFF0C;&#x4F60;&#x5C06;&#x590D;&#x7528;&#x8BE5;&#x7F51;&#x7EDC;&#x7684;&#x8F83;&#x4F4E;&#x5C42;&#xFF0C;&#x6765;&#x4F7F;&#x7528;&#x975E;&#x5E38;&#x5C11;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x6765;&#x8BAD;&#x7EC3; MNIST &#x5206;&#x7C7B;&#x5668;&#x3002; &#x9996;&#x5148;&#x6784;&#x5EFA;&#x4E24;&#x4E2A; DNN&#xFF08;&#x6211;&#x4EEC;&#x79F0;&#x4E4B;&#x4E3A; DNN A &#x548C; B&#xFF09;&#xFF0C;&#x5B83;&#x4EEC;&#x4E0E;&#x4E4B;&#x524D;&#x6784;&#x5EFA;&#x7684; DNN &#x7C7B;&#x4F3C;&#xFF0C;&#x4F46;&#x6CA1;&#x6709;&#x8F93;&#x51FA;&#x5C42;&#xFF1A;&#x6BCF;&#x4E2A; DNN &#x5E94;&#x8BE5;&#x6709;&#x4E94;&#x4E2A;&#x9690;&#x85CF;&#x5C42;&#xFF0C;&#x6BCF;&#x4E2A;&#x5C42;&#x5305;&#x542B; 100 &#x4E2A;&#x795E;&#x7ECF;&#x5143;&#xFF0C;&#x4F7F;&#x7528; He &#x521D;&#x59CB;&#x5316;&#x548C; ELU &#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x3002; &#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x5728;&#x4E24;&#x4E2A; DNN &#x4E0A;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x8F93;&#x51FA;&#x5C42;&#x3002; &#x4F60;&#x5E94;&#x8BE5;&#x4F7F;&#x7528; TensorFlow &#x7684;<code>concat()&#x51FD;&#x6570;&#x548C;</code>axis = 1`&#xFF0C;&#x5C06;&#x4E24;&#x4E2A; DNN &#x7684;&#x8F93;&#x51FA;&#x6CBF;&#x7740;&#x6A2A;&#x8F74;&#x8FDE;&#x63A5;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x7ED3;&#x679C;&#x8F93;&#x5165;&#x5230;&#x8F93;&#x51FA;&#x5C42;&#x3002; &#x8F93;&#x51FA;&#x5C42;&#x5E94;&#x8BE5;&#x5305;&#x542B;&#x5355;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#xFF0C;&#x4F7F;&#x7528; logistic &#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x3002;</li>
<li>&#x5C06; MNIST &#x8BAD;&#x7EC3;&#x96C6;&#x5206;&#x4E3A;&#x4E24;&#x7EC4;&#xFF1A;&#x7B2C;&#x4E00;&#x90E8;&#x5206;&#x5E94;&#x5305;&#x542B; 55,000&#x4E2A; &#x56FE;&#x50CF;&#xFF0C;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#x5E94;&#x5305;&#x542B; 5000 &#x4E2A;&#x56FE;&#x50CF;&#x3002; &#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x751F;&#x6210;&#x8BAD;&#x7EC3;&#x6279;&#x6B21;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x5176;&#x4E2D;&#x6BCF;&#x4E2A;&#x5B9E;&#x4F8B;&#x90FD;&#x662F;&#x4ECE;&#x7B2C;&#x4E00;&#x90E8;&#x5206;&#x4E2D;&#x6311;&#x9009;&#x7684;&#x4E00;&#x5BF9; MNIST &#x56FE;&#x50CF;&#x3002; &#x4E00;&#x534A;&#x7684;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#x5E94;&#x8BE5;&#x662F;&#x5C5E;&#x4E8E;&#x540C;&#x4E00;&#x7C7B;&#x7684;&#x56FE;&#x50CF;&#x5BF9;&#xFF0C;&#x800C;&#x53E6;&#x4E00;&#x534A;&#x5E94;&#x8BE5;&#x662F;&#x6765;&#x81EA;&#x4E0D;&#x540C;&#x7C7B;&#x522B;&#x7684;&#x56FE;&#x50CF;&#x3002; &#x5BF9;&#x4E8E;&#x6BCF;&#x4E00;&#x5BF9;&#xFF0C;&#x5982;&#x679C;&#x56FE;&#x50CF;&#x6765;&#x81EA;&#x540C;&#x4E00;&#x7C7B;&#xFF0C;&#x8BAD;&#x7EC3;&#x6807;&#x7B7E;&#x5E94;&#x8BE5;&#x4E3A; 0&#xFF1B;&#x5982;&#x679C;&#x6765;&#x81EA;&#x4E0D;&#x540C;&#x7C7B;&#xFF0C;&#x5219;&#x6807;&#x7B7E;&#x5E94;&#x4E3A; 1&#x3002;</li>
<li>&#x5728;&#x8FD9;&#x4E2A;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x8BAD;&#x7EC3; DNN&#x3002; &#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x56FE;&#x50CF;&#x5BF9;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x5C06;&#x7B2C;&#x4E00;&#x5F20;&#x56FE;&#x50CF;&#x9001;&#x5165; DNN A&#xFF0C;&#x5C06;&#x7B2C;&#x4E8C;&#x5F20;&#x56FE;&#x50CF;&#x9001;&#x5165; DNN B&#x3002;&#x6574;&#x4E2A;&#x7F51;&#x7EDC;&#x5C06;&#x9010;&#x6E10;&#x5B66;&#x4F1A;&#x5224;&#x65AD;&#x4E24;&#x5F20;&#x56FE;&#x50CF;&#x662F;&#x5426;&#x5C5E;&#x4E8E;&#x540C;&#x4E00;&#x7C7B;&#x522B;&#x3002;</li>
<li>&#x73B0;&#x5728;&#x901A;&#x8FC7;&#x590D;&#x7528;&#x548C;&#x51BB;&#x7ED3; DNN A &#x7684;&#x9690;&#x85CF;&#x5C42;&#xFF0C;&#x5E76;&#x6DFB;&#x52A0; 1 0&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x7684; softmax &#x8F93;&#x51FA;&#x5C42;&#x6765;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684; DNN&#x3002; &#x5728;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#x4E0A;&#x8BAD;&#x7EC3;&#x8FD9;&#x4E2A;&#x7F51;&#x7EDC;&#xFF0C;&#x770B;&#x770B;&#x4F60;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x8F83;&#x597D;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x5C3D;&#x7BA1;&#x6BCF;&#x7C7B;&#x53EA;&#x6709; 500 &#x4E2A;&#x56FE;&#x50CF;&#x3002;</li>
</ol>
</li>
</ol>
<p>&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x7684;&#x7B54;&#x6848;&#x5728;&#x9644;&#x5F55; A &#x4E2D;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="10.人工神经网络介绍.html" class="navigation navigation-prev " aria-label="Previous page: 十、人工神经网络介绍">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="12.设备和服务器上的分布式_TensorFlow.html" class="navigation navigation-next " aria-label="Next page: 十二、设备和服务器上的分布式 TensorFlow">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"十一、训练深层神经网络","level":"1.13","depth":1,"next":{"title":"十二、设备和服务器上的分布式 TensorFlow","level":"1.14","depth":1,"path":"docs/12.设备和服务器上的分布式_TensorFlow.md","ref":"docs/12.设备和服务器上的分布式_TensorFlow.md","articles":[]},"previous":{"title":"十、人工神经网络介绍","level":"1.12","depth":1,"path":"docs/10.人工神经网络介绍.md","ref":"docs/10.人工神经网络介绍.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"docs/11.训练深层神经网络.md","mtime":"2019-04-18T03:01:37.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-05-07T09:41:36.357Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

