
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>十三、卷积神经网络 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="14.循环神经网络.html" />
    
    
    <link rel="prev" href="12.设备和服务器上的分布式_TensorFlow.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Sklearn 与 TensorFlow 机器学习实用指南
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="0.前言.html">
            
                <a href="0.前言.html">
            
                    
                    零、前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="1.机器学习概览.html">
            
                <a href="1.机器学习概览.html">
            
                    
                    一、机器学习概览
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="2.一个完整的机器学习项目.html">
            
                <a href="2.一个完整的机器学习项目.html">
            
                    
                    二、一个完整的机器学习项目
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="3.分类.html">
            
                <a href="3.分类.html">
            
                    
                    三、分类
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="4.训练模型.html">
            
                <a href="4.训练模型.html">
            
                    
                    四、训练模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="5.支持向量机.html">
            
                <a href="5.支持向量机.html">
            
                    
                    五、支持向量机
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="6.决策树.html">
            
                <a href="6.决策树.html">
            
                    
                    六、决策树
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="7.集成学习和随机森林.html">
            
                <a href="7.集成学习和随机森林.html">
            
                    
                    七、集成学习和随机森林
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="8.降维.html">
            
                <a href="8.降维.html">
            
                    
                    八、降维
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="9.启动并运行_TensorFlow.html">
            
                <a href="9.启动并运行_TensorFlow.html">
            
                    
                    九、启动并运行 TensorFlow
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="10.人工神经网络介绍.html">
            
                <a href="10.人工神经网络介绍.html">
            
                    
                    十、人工神经网络介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="11.训练深层神经网络.html">
            
                <a href="11.训练深层神经网络.html">
            
                    
                    十一、训练深层神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="12.设备和服务器上的分布式_TensorFlow.html">
            
                <a href="12.设备和服务器上的分布式_TensorFlow.html">
            
                    
                    十二、设备和服务器上的分布式 TensorFlow
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.15" data-path="13.卷积神经网络.html">
            
                <a href="13.卷积神经网络.html">
            
                    
                    十三、卷积神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="14.循环神经网络.html">
            
                <a href="14.循环神经网络.html">
            
                    
                    十四、循环神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="15.自编码器.html">
            
                <a href="15.自编码器.html">
            
                    
                    十五、自编码器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="16.强化学习.html">
            
                <a href="16.强化学习.html">
            
                    
                    十六、强化学习
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="B.机器学习项目清单.html">
            
                <a href="B.机器学习项目清单.html">
            
                    
                    附录 B、机器学习项目清单
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="C.SVM_对偶问题.html">
            
                <a href="C.SVM_对偶问题.html">
            
                    
                    附录 C、SVM 对偶问题
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="D.自动微分.html">
            
                <a href="D.自动微分.html">
            
                    
                    附录 D、自动微分
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >十三、卷积神经网络</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x5341;&#x4E09;&#x3001;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;">&#x5341;&#x4E09;&#x3001;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;</h1>
<blockquote>
<p>&#x8BD1;&#x8005;&#xFF1A;<a href="https://github.com/wangxupeng" target="_blank">@akonwang</a>&#x3001;<a href="https://github.com/WilsonQu" target="_blank">@WilsonQu</a></p>
<p>&#x6821;&#x5BF9;&#x8005;&#xFF1A;<a href="https://github.com/wizardforcel" target="_blank">@&#x98DE;&#x9F99;</a>&#x3001;<a href="https://github.com/yanmengk" target="_blank">@yanmengk</a></p>
</blockquote>
<p>&#x200B;&#x5C3D;&#x7BA1; IBM &#x7684;&#x6DF1;&#x84DD;&#x8D85;&#x7EA7;&#x8BA1;&#x7B97;&#x673A;&#x5728;1996&#x5E74;&#x51FB;&#x8D25;&#x4E86;&#x56FD;&#x9645;&#x8C61;&#x68CB;&#x4E16;&#x754C;&#x51A0;&#x519B; Garry Kasparvo&#xFF0C;&#x76F4;&#x5230;&#x8FD1;&#x51E0;&#x5E74;&#x8BA1;&#x7B97;&#x673A;&#x90FD;&#x4E0D;&#x80FD;&#x53EF;&#x9760;&#x5730;&#x5B8C;&#x6210;&#x4E00;&#x4E9B;&#x770B;&#x8D77;&#x6765;&#x8F83;&#x4E3A;&#x590D;&#x6742;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x6BD4;&#x5982;&#x5224;&#x522B;&#x7167;&#x7247;&#x4E2D;&#x662F;&#x5426;&#x6709;&#x72D7;&#x4EE5;&#x53CA;&#x8BC6;&#x522B;&#x8BED;&#x97F3;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4E9B;&#x4EFB;&#x52A1;&#x5BF9;&#x4E8E;&#x4EBA;&#x7C7B;&#x800C;&#x8A00;&#x5982;&#x6B64;&#x7B80;&#x5355;&#xFF1F;&#x7B54;&#x6848;&#x5728;&#x4E8E;&#x611F;&#x77E5;&#x4E3B;&#x8981;&#x53D1;&#x751F;&#x5728;&#x6211;&#x4EEC;&#x610F;&#x8BC6;&#x9886;&#x57DF;&#x4E4B;&#x5916;&#xFF0C;&#x5728;&#x6211;&#x4EEC;&#x5927;&#x8111;&#x4E2D;&#x7684;&#x4E13;&#x95E8;&#x89C6;&#x89C9;&#xFF0C;&#x542C;&#x89C9;&#x548C;&#x5176;&#x4ED6;&#x611F;&#x5B98;&#x6A21;&#x5757;&#x5185;&#x3002;&#x5F53;&#x611F;&#x5B98;&#x4FE1;&#x606F;&#x8FBE;&#x5230;&#x6211;&#x4EEC;&#x7684;&#x610F;&#x8BC6;&#x65F6;&#xFF0C;&#x5B83;&#x5DF2;&#x7ECF;&#x88AB;&#x88C5;&#x9970;&#x4E86;&#x9AD8;&#x7EA7;&#x7279;&#x5F81;;&#x4F8B;&#x5982;&#xFF0C;&#x5F53;&#x4F60;&#x770B;&#x7740;&#x4E00;&#x53EA;&#x53EF;&#x7231;&#x7684;&#x5C0F;&#x72D7;&#x7684;&#x7167;&#x7247;&#x65F6;&#xFF0C;&#x4F60;&#x4E0D;&#x80FD;&#x9009;&#x62E9;&#x4E0D;&#x770B;&#x8FD9;&#x53EA;&#x5C0F;&#x72D7;&#xFF0C;&#x6216;&#x4E0D;&#x6CE8;&#x610F;&#x5B83;&#x7684;&#x53EF;&#x7231;&#x3002;&#x4F60;&#x4E5F;&#x4E0D;&#x80FD;&#x89E3;&#x91CA;&#x4F60;&#x5982;&#x4F55;&#x8BA4;&#x51FA;&#x8FD9;&#x662F;&#x4E00;&#x53EA;&#x53EF;&#x7231;&#x7684;&#x5C0F;&#x72D7;&#xFF0C;&#x8FD9;&#x5BF9;&#x4F60;&#x6765;&#x8BF4;&#x5F88;&#x660E;&#x663E;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x76F8;&#x4FE1;&#x6211;&#x4EEC;&#x7684;&#x4E3B;&#x89C2;&#x7ECF;&#x9A8C;&#xFF1A;&#x611F;&#x77E5;&#x5E76;&#x4E0D;&#x662F;&#x5FAE;&#x4E0D;&#x8DB3;&#x9053;&#x7684;&#xFF0C;&#x7406;&#x89E3;&#x5B83;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x770B;&#x770B;&#x611F;&#x5B98;&#x6A21;&#x5757;&#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#x3002;</p>
<p>&#x200B;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF08;CNN&#xFF09;&#x662F;&#x4ECE;&#x5927;&#x8111;&#x89C6;&#x89C9;&#x76AE;&#x5C42;&#x7684;&#x7814;&#x7A76;&#x4E2D;&#x51FA;&#x73B0;&#x7684;&#xFF0C;&#x81EA; 20 &#x4E16;&#x7EAA; 80 &#x5E74;&#x4EE3;&#x4EE5;&#x6765;&#x5B83;&#x4EEC;&#x4E00;&#x76F4;&#x7528;&#x4E8E;&#x56FE;&#x50CF;&#x8BC6;&#x522B;&#x3002;&#x5728;&#x8FC7;&#x53BB;&#x7684;&#x51E0;&#x5E74;&#x91CC;&#xFF0C;&#x7531;&#x4E8E;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#x7684;&#x589E;&#x52A0;&#xFF0C;&#x53EF;&#x7528;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x7684;&#x6570;&#x91CF;&#x4EE5;&#x53CA;&#x7B2C; 11 &#x7AE0;&#x4ECB;&#x7ECD;&#x7684;&#x8BAD;&#x7EC3;&#x6DF1;&#x5EA6;&#x7F51;&#x7EDC;&#x7684;&#x6280;&#x5DE7;&#xFF0C;CNN &#x81F4;&#x529B;&#x4E8E;&#x5728;&#x67D0;&#x4E9B;&#x590D;&#x6742;&#x7684;&#x89C6;&#x89C9;&#x4EFB;&#x52A1;&#x4E2D;&#x505A;&#x51FA;&#x8D85;&#x51FA;&#x4EBA;&#x7C7B;&#x7684;&#x8868;&#x73B0;&#x3002;&#x4ED6;&#x4EEC;&#x4F7F;&#x56FE;&#x50CF;&#x641C;&#x7D22;&#x670D;&#x52A1;&#xFF0C;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x6C7D;&#x8F66;&#xFF0C;&#x89C6;&#x9891;&#x81EA;&#x52A8;&#x5206;&#x7C7B;&#x7CFB;&#x7EDF;&#x7B49;&#x53D8;&#x5F97;&#x5F3A;&#x5927;&#x3002;&#x6B64;&#x5916;&#xFF0C;CNN &#x5E76;&#x4E0D;&#x5C40;&#x9650;&#x4E8E;&#x89C6;&#x89C9;&#x611F;&#x77E5;&#xFF1A;&#x5B83;&#x4EEC;&#x5728;&#x5176;&#x4ED6;&#x4EFB;&#x52A1;&#x4E2D;&#x4E5F;&#x5F88;&#x6210;&#x529F;&#xFF0C;&#x5982;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#x6216;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x5904;&#x7406;&#xFF08;NLP&#xFF09;; &#x7136;&#x800C;&#xFF0C;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x5C06;&#x4E13;&#x6CE8;&#x4E8E;&#x89C6;&#x89C9;&#x5E94;&#x7528;&#x3002;</p>
<p>&#x200B;&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4ECB;&#x7ECD; CNN &#x7684;&#x6765;&#x6E90;&#xFF0C;&#x6784;&#x5EFA;&#x5B83;&#x4EEC;&#x6A21;&#x5757;&#x7684;&#x5916;&#x89C2;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x4F7F;&#x7528; TensorFlow &#x5B9E;&#x73B0;&#x5B83;&#x4EEC;&#x3002;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x5C06;&#x4ECB;&#x7ECD;&#x4E00;&#x4E9B;&#x6700;&#x597D;&#x7684; CNN &#x67B6;&#x6784;&#x3002;</p>
<p>&#x200B;</p>
<h2 id="&#x89C6;&#x89C9;&#x76AE;&#x5C42;&#x7684;&#x7ED3;&#x6784;">&#x89C6;&#x89C9;&#x76AE;&#x5C42;&#x7684;&#x7ED3;&#x6784;</h2>
<p>&#x200B;David H.Hubel &#x548C; Torsten Wiesel &#x5728; 1958 &#x5E74;&#x548C; 1959 &#x5E74;&#x5BF9;&#x732B;&#x8FDB;&#x884C;&#x4E86;&#x4E00;&#x7CFB;&#x5217;&#x5B9E;&#x9A8C;&#xFF08;&#x4EE5;&#x53CA;&#x51E0;&#x5E74;&#x540E;&#x5728;&#x7334;&#x5B50;&#x4E0A;&#x7684;&#x5B9E;&#x9A8C;&#xFF09;&#xFF0C;&#x5BF9;&#x89C6;&#x89C9;&#x76AE;&#x5C42;&#x7684;&#x7ED3;&#x6784;&#x63D0;&#x4F9B;&#x4E86;&#x91CD;&#x8981;&#x7684;&#x89C1;&#x89E3;&#xFF08;1981 &#x5E74;&#x4F5C;&#x8005;&#x56E0;&#x6B64;&#x83B7;&#x5F97;&#x4E86;&#x8BFA;&#x8D1D;&#x5C14;&#x751F;&#x7406;&#x548C;&#x533B;&#x5B66;&#x5956;&#xFF09;&#x3002;&#x5177;&#x4F53;&#x6765;&#x8BF4;&#xFF0C;&#x4ED6;&#x4EEC;&#x53D1;&#x73B0;&#x89C6;&#x76AE;&#x5C42;&#x4E2D;&#x7684;&#x8BB8;&#x591A;&#x795E;&#x7ECF;&#x5143;&#x6709;&#x4E00;&#x4E2A;&#x5C0F;&#x7684;&#x5C40;&#x90E8;&#x611F;&#x53D7;&#x91CE;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5B83;&#x4EEC;&#x53EA;&#x5BF9;&#x4F4D;&#x4E8E;&#x89C6;&#x91CE;&#x4E2D;&#x6709;&#x9650;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x533A;&#x57DF;&#x7684;&#x89C6;&#x89C9;&#x523A;&#x6FC0;&#x8D77;&#x4F5C;&#x7528;&#xFF08;&#x89C1;&#x56FE; 13-1&#xFF0C;&#x4E94;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x5C40;&#x90E8;&#x611F;&#x53D7;&#x91CE;&#x7531;&#x865A;&#x7EBF;&#x5706;&#x5708;&#x8868;&#x793A;&#xFF09;&#x3002;&#x4E0D;&#x540C;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x611F;&#x53D7;&#x91CE;&#x53EF;&#x80FD;&#x91CD;&#x53E0;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x4EEC;&#x4E00;&#x8D77;&#x5E73;&#x94FA;&#x4E86;&#x6574;&#x4E2A;&#x89C6;&#x91CE;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x4F5C;&#x8005;&#x8868;&#x660E;&#xFF0C;&#x4E00;&#x4E9B;&#x795E;&#x7ECF;&#x5143;&#x53EA;&#x5BF9;&#x6C34;&#x5E73;&#x7EBF;&#x65B9;&#x5411;&#x7684;&#x56FE;&#x50CF;&#x4F5C;&#x51FA;&#x53CD;&#x5E94;&#xFF0C;&#x800C;&#x53E6;&#x4E00;&#x4E9B;&#x795E;&#x7ECF;&#x5143;&#x53EA;&#x5BF9;&#x4E0D;&#x540C;&#x65B9;&#x5411;&#x7684;&#x7EBF;&#x4F5C;&#x51FA;&#x53CD;&#x5E94;&#xFF08;&#x4E24;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x53EF;&#x80FD;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7684;&#x611F;&#x53D7;&#x91CE;&#xFF0C;&#x4F46;&#x5BF9;&#x4E0D;&#x540C;&#x65B9;&#x5411;&#x7684;&#x7EBF;&#x4F5C;&#x51FA;&#x53CD;&#x5E94;&#xFF09;&#x3002;&#x4ED6;&#x4EEC;&#x8FD8;&#x6CE8;&#x610F;&#x5230;&#x4E00;&#x4E9B;&#x795E;&#x7ECF;&#x5143;&#x5177;&#x6709;&#x8F83;&#x5927;&#x7684;&#x611F;&#x53D7;&#x91CE;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x4EEC;&#x5BF9;&#x8F83;&#x590D;&#x6742;&#x7684;&#x6A21;&#x5F0F;&#x4F5C;&#x51FA;&#x53CD;&#x5E94;&#xFF0C;&#x8FD9;&#x4E9B;&#x6A21;&#x5F0F;&#x662F;&#x8F83;&#x4F4E;&#x5C42;&#x6A21;&#x5F0F;&#x7684;&#x7EC4;&#x5408;&#x3002;&#x8FD9;&#x4E9B;&#x89C2;&#x5BDF;&#x7ED3;&#x679C;&#x8BA9;&#x6211;&#x4EEC;&#x60F3;&#x5230;&#xFF1A;&#x66F4;&#x9AD8;&#x7EA7;&#x522B;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x662F;&#x57FA;&#x4E8E;&#x76F8;&#x90BB;&#x4F4E;&#x7EA7;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x8F93;&#x51FA;&#xFF08;&#x5728;&#x56FE; 13-1 &#x4E2D;&#xFF0C;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x6BCF;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x53EA;&#x4E0E;&#x6765;&#x81EA;&#x524D;&#x4E00;&#x5C42;&#x7684;&#x5C11;&#x6570;&#x795E;&#x7ECF;&#x5143;&#x76F8;&#x8FDE;&#xFF09;&#x3002;&#x8FD9;&#x4E2A;&#x5F3A;&#x5927;&#x7684;&#x7ED3;&#x6784;&#x80FD;&#x591F;&#x68C0;&#x6D4B;&#x89C6;&#x91CE;&#x4E2D;&#x4EFB;&#x4F55;&#x533A;&#x57DF;&#x7684;&#x5404;&#x79CD;&#x590D;&#x6742;&#x56FE;&#x6848;&#x3002;</p>
<p>&#x200B;&#x8FD9;&#x4E9B;&#x5BF9;&#x89C6;&#x89C9;&#x76AE;&#x5C42;&#x7684;&#x7814;&#x7A76;&#x542F;&#x53D1;&#x4E86; 1980 &#x5E74;&#x63A8;&#x51FA;&#x7684;&#x65B0;&#x8BA4;&#x77E5;&#x673A;&#xFF08;neocognitron&#xFF09;&#xFF0C;&#x540E;&#x8005;&#x9010;&#x6E10;&#x6F14;&#x53D8;&#x4E3A;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x79F0;&#x4E4B;&#x4E3A;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x91CC;&#x7A0B;&#x7891;&#x662F; Yann LeCun&#xFF0C;L&#xE9;onBottou&#xFF0C;Yoshua Bengio &#x548C; Patrick Haffner &#x4E8E; 1998 &#x5E74;&#x53D1;&#x8868;&#x7684;&#x4E00;&#x7BC7;&#x8BBA;&#x6587;&#xFF0C;&#x8BE5;&#x8BBA;&#x6587;&#x5F15;&#x5165;&#x4E86;&#x7740;&#x540D;&#x7684; LeNet-5 &#x67B6;&#x6784;&#xFF0C;&#x5E7F;&#x6CDB;&#x7528;&#x4E8E;&#x8BC6;&#x522B;&#x624B;&#x5199;&#x652F;&#x7968;&#x53F7;&#x7801;&#x3002;&#x8FD9;&#x4E2A;&#x67B6;&#x6784;&#x6709;&#x4E00;&#x4E9B;&#x4F60;&#x5DF2;&#x7ECF;&#x77E5;&#x9053;&#x7684;&#x6784;&#x5EFA;&#x5757;&#xFF0C;&#x6BD4;&#x5982;&#x5B8C;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x548C; Sigmoid &#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x8FD8;&#x5F15;&#x5165;&#x4E86;&#x4E24;&#x4E2A;&#x65B0;&#x7684;&#x6784;&#x5EFA;&#x5757;&#xFF1A;&#x5377;&#x79EF;&#x5C42;&#x548C;&#x6C60;&#x5316;&#x5C42;&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;&#x4ED6;&#x4EEC;&#x3002;</p>
<h2 id="&#x5377;&#x79EF;&#x5C42;">&#x5377;&#x79EF;&#x5C42;</h2>
<p>&#x200B;CNN &#x6700;&#x91CD;&#x8981;&#x7684;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#x662F;&#x5377;&#x79EF;&#x5C42;&#xFF1A;&#x7B2C;&#x4E00;&#x5377;&#x79EF;&#x5C42;&#x4E2D;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x4E0D;&#x662F;&#x8FDE;&#x63A5;&#x5230;&#x8F93;&#x5165;&#x56FE;&#x50CF;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x50CF;&#x7D20;&#xFF08;&#x5C31;&#x50CF;&#x5B83;&#x4EEC;&#x5728;&#x524D;&#x9762;&#x7684;&#x7AE0;&#x8282;&#x4E2D;&#x90A3;&#x6837;&#xFF09;&#xFF0C;&#x800C;&#x662F;&#x4EC5;&#x4EC5;&#x8FDE;&#x63A5;&#x5230;&#x5B83;&#x4EEC;&#x7684;&#x5C40;&#x90E8;&#x611F;&#x53D7;&#x91CE;&#x4E2D;&#x7684;&#x50CF;&#x7D20;&#xFF08;&#x53C2;&#x89C1;&#x56FE; 13-2&#xFF09;&#x3002; &#x8FDB;&#x800C;&#xFF0C;&#x7B2C;&#x4E8C;&#x5377;&#x79EF;&#x5C42;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x53EA;&#x4E0E;&#x4F4D;&#x4E8E;&#x7B2C;&#x4E00;&#x5C42;&#x4E2D;&#x7684;&#x5C0F;&#x77E9;&#x5F62;&#x5185;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x8FDE;&#x63A5;&#x3002; &#x8FD9;&#x79CD;&#x67B6;&#x6784;&#x5141;&#x8BB8;&#x7F51;&#x7EDC;&#x4E13;&#x6CE8;&#x4E8E;&#x7B2C;&#x4E00;&#x9690;&#x85CF;&#x5C42;&#x4E2D;&#x7684;&#x4F4E;&#x7EA7;&#x7279;&#x5F81;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x5176;&#x7EC4;&#x88C5;&#x6210;&#x4E0B;&#x4E00;&#x9690;&#x85CF;&#x5C42;&#x4E2D;&#x7684;&#x9AD8;&#x7EA7;&#x7279;&#x5F81;&#xFF0C;&#x7B49;&#x7B49;&#x3002; &#x8FD9;&#x79CD;&#x5C42;&#x6B21;&#x7ED3;&#x6784;&#x5728;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x7684;&#x56FE;&#x50CF;&#x4E2D;&#x662F;&#x5F88;&#x5E38;&#x89C1;&#x7684;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F; CNN &#x5728;&#x56FE;&#x50CF;&#x8BC6;&#x522B;&#x65B9;&#x9762;&#x6548;&#x679C;&#x5F88;&#x597D;&#x7684;&#x539F;&#x56E0;&#x4E4B;&#x4E00;&#x3002;</p>
<p><img src="../images/chapter_13/13-2.png" alt=""></p>
<p>&#x200B;<strong>&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x6211;&#x4EEC;&#x6240;&#x770B;&#x5230;&#x7684;&#x6240;&#x6709;&#x591A;&#x5C42;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x90FD;&#x6709;&#x7531;&#x4E00;&#x957F;&#x4E32;&#x795E;&#x7ECF;&#x5143;&#x7EC4;&#x6210;&#x7684;&#x5C42;&#xFF0C;&#x5728;&#x8F93;&#x5165;&#x5230;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E4B;&#x524D;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x5C06;&#x8F93;&#x5165;&#x56FE;&#x50CF;&#x538B;&#x7F29;&#x6210; 1D&#x3002; &#x73B0;&#x5728;&#xFF0C;&#x6BCF;&#x4E2A;&#x56FE;&#x5C42;&#x90FD;&#x4EE5; 2D &#x8868;&#x793A;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x795E;&#x7ECF;&#x5143;&#x4E0E;&#x5176;&#x76F8;&#x5E94;&#x7684;&#x8F93;&#x5165;&#x8FDB;&#x884C;&#x5339;&#x914D;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x5BB9;&#x6613;&#x3002;</strong></p>
<p>&#x200B;&#x4F4D;&#x4E8E;&#x7ED9;&#x5B9A;&#x5C42;&#x7684;&#x7B2C;<code>i</code>&#x884C;&#x7B2C;<code>j</code>&#x5217;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x8FDE;&#x63A5;&#x5230;&#x4F4D;&#x4E8E;&#x524D;&#x4E00;&#x5C42;&#x4E2D;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x8F93;&#x51FA;&#x7684;&#x7B2C;i&#x884C;&#x5230;&#x7B2C; <img src="../images/chapter_13/o-13-1.png" alt=""> &#x884C;&#xFF0C;&#x7B2C;<code>j</code>&#x5217;&#x5230;&#x7B2C; <img src="../images/chapter_13/o-13-2.png" alt=""> &#x5217;&#x3002;<code>fh</code>&#x548C;<code>fw</code>&#x662F;&#x5C40;&#x90E8;&#x611F;&#x53D7;&#x91CE;&#x7684;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#xFF08;&#x89C1;&#x56FE; 13-3&#xFF09;&#x3002; &#x4E3A;&#x4E86;&#x4F7F;&#x56FE;&#x5C42;&#x5177;&#x6709;&#x4E0E;&#x524D;&#x4E00;&#x56FE;&#x5C42;&#x76F8;&#x540C;&#x7684;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#xFF0C;&#x901A;&#x5E38;&#x5728;&#x8F93;&#x5165;&#x5468;&#x56F4;&#x6DFB;&#x52A0;&#x96F6;&#xFF0C;&#x5982;&#x56FE;&#x6240;&#x793A;&#x3002; &#x8FD9;&#x88AB;&#x79F0;&#x4E3A;&#x96F6;&#x586B;&#x5145;.</p>
<p><img src="../images/chapter_13/13-3.png" alt=""></p>
<p>&#x200B;&#x5982;&#x56FE; 13-4 &#x6240;&#x793A;&#xFF0C;&#x901A;&#x8FC7;&#x5C06;&#x5C40;&#x90E8;&#x611F;&#x53D7;&#x91CE;&#x9694;&#x5F00;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x5C06;&#x8F83;&#x5927;&#x7684;&#x8F93;&#x5165;&#x5C42;&#x8FDE;&#x63A5;&#x5230;&#x66F4;&#x5C0F;&#x7684;&#x5C42;&#x3002; &#x4E24;&#x4E2A;&#x8FDE;&#x7EED;&#x7684;&#x611F;&#x53D7;&#x91CE;&#x4E4B;&#x95F4;&#x7684;&#x8DDD;&#x79BB;&#x88AB;&#x79F0;&#x4E3A;&#x6B65;&#x5E45;&#x3002; &#x5728;&#x56FE;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;<code>5&#xD7;7</code>&#x7684;&#x8F93;&#x5165;&#x5C42;&#xFF08;&#x52A0;&#x96F6;&#x586B;&#x5145;&#xFF09;&#x8FDE;&#x63A5;&#x5230;&#x4E00;&#x4E2A;<code>3&#xD7;4</code>&#x5C42;&#xFF0C;&#x4F7F;&#x7528;<code>3&#xD7;3</code>&#x7684;&#x5377;&#x79EF;&#x6838;&#x548C;&#x4E00;&#x4E2A;&#x6B65;&#x5E45;&#x4E3A; 2&#xFF08;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6B65;&#x5E45;&#x5728;&#x4E24;&#x4E2A;&#x65B9;&#x5411;&#x662F;&#x76F8;&#x540C;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x603B;&#x662F;&#x5982;&#x6B64;&#xFF09;&#x3002; &#x4F4D;&#x4E8E;&#x4E0A;&#x5C42;&#x7B2C;<code>i</code>&#x884C;&#x7B2C;<code>j</code>&#x5217;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x4E0E;&#x4F4D;&#x4E8E;&#x524D;&#x4E00;&#x5C42;&#x4E2D;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x8F93;&#x51FA;&#x8FDE;&#x63A5;&#x7684;&#x7B2C; <img src="../images/chapter_13/o-13-4.png" alt=""> &#x81F3; <img src="../images/chapter_13/o-13-5.png" alt=""> &#x884C;&#xFF0C;&#x7B2C; <img src="../images/chapter_13/o-13-6.png" alt=""> &#x5217;&#xFF0C; <code>Sh</code>&#x548C;<code>Sw</code>&#x662F;&#x5782;&#x76F4;&#x548C;&#x6C34;&#x5E73;&#x7684;&#x6B65;&#x5E45;&#x3002;</p>
<p><img src="../images/chapter_13/13-4.png" alt=""></p>
<h2 id="&#x5377;&#x79EF;&#x6838;&#x8FC7;&#x6EE4;&#x5668;">&#x5377;&#x79EF;&#x6838;/&#x8FC7;&#x6EE4;&#x5668;</h2>
<p><img src="../images/chapter_13/13-5.png" alt=""></p>
<p>&#x200B;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x6743;&#x91CD;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x4E3A;&#x5C40;&#x90E8;&#x611F;&#x53D7;&#x91CE;&#x5927;&#x5C0F;&#x7684;&#x5C0F;&#x56FE;&#x50CF;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x56FE; 13-5 &#x663E;&#x793A;&#x4E86;&#x4E24;&#x4E2A;&#x53EF;&#x80FD;&#x7684;&#x6743;&#x91CD;&#x96C6;&#xFF0C;&#x79F0;&#x4E3A;&#x8FC7;&#x6EE4;&#x5668;&#xFF08;&#x6216;&#x5377;&#x79EF;&#x6838;&#xFF09;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x8868;&#x793A;&#x4E3A;&#x4E2D;&#x95F4;&#x6709;&#x4E00;&#x6761;&#x5782;&#x76F4;&#x7684;&#x767D;&#x7EBF;&#x7684;&#x9ED1;&#x8272;&#x6B63;&#x65B9;&#x5F62;&#xFF08;&#x9664;&#x4E86;&#x4E2D;&#x95F4;&#x4E00;&#x5217;&#x5916;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5145;&#x6EE1; 0 &#x7684;<code>7&#xD7;7</code>&#x77E9;&#x9635;&#xFF0C;&#x9664;&#x4E86;&#x4E2D;&#x592E;&#x5782;&#x76F4;&#x7EBF;&#x662F; 1&#xFF09;&#x3002; &#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x6743;&#x91CD;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x4F1A;&#x5FFD;&#x7565;&#x9664;&#x4E86;&#x4E2D;&#x592E;&#x5782;&#x76F4;&#x7EBF;&#x4EE5;&#x5916;&#x611F;&#x53D7;&#x91CE;&#x7684;&#x4E00;&#x5207;&#xFF08;&#x56E0;&#x4E3A;&#x9664;&#x4F4D;&#x4E8E;&#x4E2D;&#x592E;&#x5782;&#x76F4;&#x7EBF;&#x4EE5;&#x5916;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x8F93;&#x5165;&#x90FD;&#x5C06;&#x4E58; 0&#xFF09;&#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x5377;&#x79EF;&#x6838;&#x662F;&#x4E00;&#x4E2A;&#x9ED1;&#x8272;&#x7684;&#x6B63;&#x65B9;&#x5F62;&#xFF0C;&#x4E2D;&#x95F4;&#x6709;&#x4E00;&#x6761;&#x6C34;&#x5E73;&#x7684;&#x767D;&#x7EBF;&#x3002; &#x518D;&#x4E00;&#x6B21;&#xFF0C;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x6743;&#x91CD;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x5C06;&#x5FFD;&#x7565;&#x9664;&#x4E86;&#x4E2D;&#x5FC3;&#x6C34;&#x5E73;&#x7EBF;&#x4E4B;&#x5916;&#x7684;&#x5C40;&#x90E8;&#x611F;&#x53D7;&#x91CE;&#x4E2D;&#x7684;&#x4E00;&#x5207;&#x3002;</p>
<p>&#x200B;&#x73B0;&#x5728;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x56FE;&#x5C42;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x795E;&#x7ECF;&#x5143;&#x90FD;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x5782;&#x76F4;&#x7EBF;&#x5377;&#x79EF;&#x6838;&#xFF08;&#x4EE5;&#x53CA;&#x76F8;&#x540C;&#x7684;&#x504F;&#x7F6E;&#x9879;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x5C06;&#x7F51;&#x7EDC;&#x8F93;&#x5165;&#x5230;&#x56FE; 13-5&#xFF08;&#x5E95;&#x90E8;&#x56FE;&#x50CF;&#xFF09;&#x4E2D;&#x6240;&#x793A;&#x7684;&#x8F93;&#x5165;&#x56FE;&#x50CF;&#xFF0C;&#x5219;&#x8BE5;&#x56FE;&#x5C42;&#x5C06;&#x8F93;&#x51FA;&#x5DE6;&#x4E0A;&#x56FE;&#x50CF;&#x3002; &#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x5782;&#x76F4;&#x7684;&#x767D;&#x7EBF;&#x5F97;&#x5230;&#x589E;&#x5F3A;&#xFF0C;&#x5176;&#x4F59;&#x7684;&#x53D8;&#x5F97;&#x6A21;&#x7CCA;&#x3002; &#x7C7B;&#x4F3C;&#x5730;&#xFF0C;&#x5982;&#x679C;&#x6240;&#x6709;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x90FD;&#x4F7F;&#x7528;&#x6C34;&#x5E73;&#x7EBF;&#x5377;&#x79EF;&#x6838;&#xFF0C;&#x53F3;&#x4E0A;&#x89D2;&#x7684;&#x56FE;&#x50CF;&#x5C31;&#x662F;&#x4F60;&#x6240;&#x5F97;&#x5230;&#x7684;&#x3002; &#x6CE8;&#x610F;&#x5230;&#x6C34;&#x5E73;&#x7684;&#x767D;&#x7EBF;&#x5F97;&#x5230;&#x589E;&#x5F3A;&#xFF0C;&#x5176;&#x4F59;&#x7684;&#x5219;&#x88AB;&#x6A21;&#x7CCA;&#x4E86;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x5377;&#x79EF;&#x548C;&#x7684;&#x4E00;&#x4E2A;&#x5145;&#x6EE1;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x56FE;&#x5C42;&#x5C06;&#x4E3A;&#x60A8;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x7279;&#x5F81;&#x6620;&#x5C04;&#xFF0C;&#x8BE5;&#x7279;&#x5F81;&#x6620;&#x5C04;&#x7A81;&#x51FA;&#x663E;&#x793A;&#x56FE;&#x50CF;&#x4E2D;&#x4E0E;&#x5377;&#x79EF;&#x548C;&#x6700;&#x76F8;&#x4F3C;&#x7684;&#x533A;&#x57DF;&#x3002; &#x5728;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;CNN &#x4E3A;&#x5176;&#x4EFB;&#x52A1;&#x627E;&#x5230;&#x6700;&#x6709;&#x7528;&#x7684;&#x5377;&#x79EF;&#x548C;&#xFF0C;&#x5E76;&#x5B66;&#x4E60;&#x5C06;&#x5B83;&#x4EEC;&#x7EC4;&#x5408;&#x6210;&#x66F4;&#x590D;&#x6742;&#x7684;&#x6A21;&#x5F0F;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x4EA4;&#x53C9;&#x662F;&#x56FE;&#x50CF;&#x4E2D;&#x5782;&#x76F4;&#x5377;&#x79EF;&#x548C;&#x548C;&#x6C34;&#x5E73;&#x5377;&#x79EF;&#x548C;&#x90FD;&#x6FC0;&#x6D3B;&#x7684;&#x533A;&#x57DF;&#xFF09;&#x3002;</p>
<h2 id="&#x53E0;&#x52A0;&#x7684;&#x591A;&#x4E2A;&#x7279;&#x5F81;&#x6620;&#x5C04;">&#x53E0;&#x52A0;&#x7684;&#x591A;&#x4E2A;&#x7279;&#x5F81;&#x6620;&#x5C04;</h2>
<p><img src="../images/chapter_13/13-6.png" alt=""></p>
<p>&#x200B;&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x4E3A;&#x4E86;&#x7B80;&#x5355;&#x8D77;&#x89C1;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5C06;&#x6BCF;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x8868;&#x793A;&#x4E3A;&#x4E00;&#x4E2A;&#x8584;&#x7684;&#x4E8C;&#x7EF4;&#x5C42;&#xFF0C;&#x4F46;&#x662F;&#x5B9E;&#x9645;&#x4E0A;&#x5B83;&#x662F;&#x7531;&#x51E0;&#x4E2A;&#x76F8;&#x540C;&#x5927;&#x5C0F;&#x7684;&#x7279;&#x5F81;&#x6620;&#x5C04;&#x7EC4;&#x6210;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x4F7F;&#x7528;3D&#x56FE;&#x8868;&#x793A;&#x5176;&#x4F1A;&#x66F4;&#x52A0;&#x51C6;&#x786E;&#xFF08;&#x89C1;&#x56FE; 13-6&#xFF09;&#x3002; &#x5728;&#x4E00;&#x4E2A;&#x7279;&#x5F81;&#x6620;&#x5C04;&#x4E2D;&#xFF0C;&#x6240;&#x6709;&#x795E;&#x7ECF;&#x5143;&#x5171;&#x4EAB;&#x76F8;&#x540C;&#x7684;&#x53C2;&#x6570;&#xFF08;&#x6743;&#x91CD;&#x548C;&#x504F;&#x7F6E;&#xFF0C;&#x6743;&#x503C;&#x5171;&#x4EAB;&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x7279;&#x5F81;&#x6620;&#x5C04;&#x53EF;&#x80FD;&#x5177;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x53C2;&#x6570;&#x3002; &#x795E;&#x7ECF;&#x5143;&#x7684;&#x611F;&#x53D7;&#x91CE;&#x4E0E;&#x524D;&#x9762;&#x63CF;&#x8FF0;&#x7684;&#x76F8;&#x540C;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x5EF6;&#x4F38;&#x5230;&#x6240;&#x6709;&#x5148;&#x524D;&#x7684;&#x5C42;&#x7684;&#x7279;&#x5F81;&#x6620;&#x5C04;&#x3002; &#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x5377;&#x79EF;&#x5C42;&#x540C;&#x65F6;&#x5BF9;&#x5176;&#x8F93;&#x5165;&#x5E94;&#x7528;&#x591A;&#x4E2A;&#x5377;&#x79EF;&#x6838;&#xFF0C;&#x4F7F;&#x5176;&#x80FD;&#x591F;&#x68C0;&#x6D4B;&#x8F93;&#x5165;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x4F4D;&#x7F6E;&#x7684;&#x591A;&#x4E2A;&#x7279;&#x5F81;&#x3002;</p>
<p>&#x200B;<strong>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x7279;&#x5F81;&#x5730;&#x56FE;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x795E;&#x7ECF;&#x5143;&#x5171;&#x4EAB;&#x76F8;&#x540C;&#x7684;&#x53C2;&#x6570;&#x4F1A;&#x663E;&#x7740;&#x51CF;&#x5C11;&#x6A21;&#x578B;&#x4E2D;&#x7684;&#x53C2;&#x6570;&#x6570;&#x91CF;&#xFF0C;&#x4F46;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x4E00;&#x65E6; CNN &#x5B66;&#x4F1A;&#x8BC6;&#x522B;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x4F4D;&#x7F6E;&#x8BC6;&#x522B;&#x5B83;&#x3002; &#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x4E00;&#x65E6;&#x4E00;&#x4E2A;&#x5E38;&#x89C4; DNN &#x5B66;&#x4F1A;&#x8BC6;&#x522B;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x5B83;&#x53EA;&#x80FD;&#x5728;&#x8BE5;&#x7279;&#x5B9A;&#x4F4D;&#x7F6E;&#x8BC6;&#x522B;&#x5B83;&#x3002;</strong></p>
<p>&#x200B;&#x800C;&#x4E14;&#xFF0C;&#x8F93;&#x5165;&#x56FE;&#x50CF;&#x4E5F;&#x7531;&#x591A;&#x4E2A;&#x5B50;&#x56FE;&#x5C42;&#x7EC4;&#x6210;&#xFF1A;&#x6BCF;&#x4E2A;&#x989C;&#x8272;&#x901A;&#x9053;&#x4E00;&#x4E2A;&#x3002; &#x901A;&#x5E38;&#x6709;&#x4E09;&#x79CD;&#xFF1A;&#x7EA2;&#x8272;&#xFF0C;&#x7EFF;&#x8272;&#x548C;&#x84DD;&#x8272;&#xFF08;RGB&#xFF09;&#x3002; &#x7070;&#x5EA6;&#x56FE;&#x50CF;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x901A;&#x9053;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x4E9B;&#x56FE;&#x50CF;&#x53EF;&#x80FD;&#x66F4;&#x591A; - &#x4F8B;&#x5982;&#x6355;&#x6349;&#x989D;&#x5916;&#x5149;&#x9891;&#xFF08;&#x5982;&#x7EA2;&#x5916;&#x7EBF;&#xFF09;&#x7684;&#x536B;&#x661F;&#x56FE;&#x50CF;&#x3002;</p>
<p>&#x200B;&#x5177;&#x4F53;&#x5730;&#xFF0C;&#x4F4D;&#x4E8E;&#x7ED9;&#x5B9A;&#x5377;&#x79EF;&#x5C42;L&#x4E2D;&#x7684;&#x7279;&#x5F81;&#x6620;&#x5C04;k&#x7684;i&#x884C;&#xFF0C;j&#x5217;&#x4E2D;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x8FDE;&#x63A5;&#x5230;&#x524D;&#x4E00;&#x5C42;&#xFF08;L-1&#xFF09;&#x4F4D;&#x4E8E; <img src="../images/chapter_13/o-13-7.png" alt=""> &#x884C;&#xFF0C;<img src="../images/chapter_13/o-13-8.png" alt=""> &#x5217;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x8F93;&#x51FA;&#x3002;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x4F4D;&#x4E8E;&#x540C;&#x4E00;&#x884C;&#x7B2C;<code>i</code>&#x5217;&#x548C;&#x7B2C;<code>j</code>&#x5217;&#x4F46;&#x4F4D;&#x4E8E;&#x4E0D;&#x540C;&#x7279;&#x5F81;&#x6620;&#x5C04;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x795E;&#x7ECF;&#x5143;&#x90FD;&#x8FDE;&#x63A5;&#x5230;&#x4E0A;&#x4E00;&#x5C42;&#x4E2D;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x8F93;&#x51FA;&#x3002;</p>
<p>&#x200B;&#x516C;&#x5F0F; 13-1 &#x5728;&#x4E00;&#x4E2A;&#x603B;&#x7ED3;&#x524D;&#x9762;&#x89E3;&#x91CA;&#x7684;&#x5927;&#x7684;&#x6570;&#x5B66;&#x516C;&#x5F0F;&#xFF1A;&#x5B83;&#x5C55;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x8BA1;&#x7B97;&#x5377;&#x79EF;&#x5C42;&#x4E2D;&#x7ED9;&#x5B9A;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x8F93;&#x51FA;&#x3002;&#x5B83;&#x662F;&#x8BA1;&#x7B97;&#x6240;&#x6709;&#x6295;&#x5165;&#x7684;&#x52A0;&#x6743;&#x603B;&#x5E76;&#x4E14;&#x52A0;&#x4E0A;&#x504F;&#x7F6E;&#x3002;</p>
<p><img src="../images/chapter_13/e-13-1.png" alt=""></p>
<ul>
<li><p><img src="../images/chapter_13/o-13-9.png" alt=""> &#x662F;&#x5377;&#x79EF;&#x5C42;&#xFF08;L&#x5C42;&#xFF09;&#x7279;&#x5F81;&#x6620;&#x5C04;k&#x4E2D;&#x4F4D;&#x4E8E;&#x7B2C;<code>i</code>&#x884C;&#x7B2C;<code>j</code>&#x5217;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x8F93;&#x51FA;.</p>
</li>
<li><p>&#x5982;&#x524D;&#x6240;&#x8FF0;&#xFF0C;<img src="../images/chapter_13/o-13-10.png" alt=""> &#x548C; <img src="../images/chapter_13/o-13-11.png" alt=""> &#x662F;&#x5782;&#x76F4;&#x548C;&#x6C34;&#x5E73;&#x7684;&#x6B65;&#x5E45;&#xFF0C;<img src="../images/chapter_13/o-13-12.png" alt=""> &#x548C; <img src="../images/chapter_13/o-13-13.png" alt=""> &#x662F;&#x611F;&#x53D7;&#x91CE;&#x7684;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#xFF0C;<img src="../images/chapter_13/o-13-14.png" alt=""> &#x662F;&#x524D;&#x4E00;&#x5C42;&#xFF08;&#x7B2C;<code>l - 1</code>&#x5C42;&#xFF09;&#x7684;&#x7279;&#x5F81;&#x6620;&#x5C04;&#x7684;&#x6570;&#x91CF;&#x3002;</p>
</li>
<li><p><img src="../images/chapter_13/o-13-15.png" alt=""> &#x662F;&#x4F4D;&#x4E8E;&#x5C42;<code>L-1</code>&#xFF0C;<code>i&apos;</code>&#x884C;&#xFF0C;<code>j&apos;</code>&#x5217;&#xFF0C;&#x7279;&#x5F81;&#x6620;&#x5C04;<code>k&apos;</code>&#xFF08;&#x6216;&#x8005;&#x5982;&#x679C;&#x524D;&#x4E00;&#x5C42;&#x662F;&#x8F93;&#x5165;&#x5C42;&#x7684;&#x901A;&#x9053;<code>k&apos;</code>&#xFF09;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x8F93;&#x51FA;&#x3002;</p>
</li>
<li><p><img src="../images/chapter_13/o-13-16.png" alt=""> &#x662F;&#x7279;&#x5F81;&#x6620;&#x5C04;<code>k</code>&#x7684;&#x504F;&#x7F6E;&#x9879;&#xFF08;&#x5728;<code>L</code>&#x5C42;&#x4E2D;&#xFF09;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x89C6;&#x4E3A;&#x8C03;&#x6574;&#x7279;&#x5F81;&#x6620;&#x5C04;<code>k</code>&#x7684;&#x6574;&#x4F53;&#x4EAE;&#x5EA6;&#x7684;&#x65CB;&#x94AE;&#x3002;</p>
</li>
<li><p><img src="../images/chapter_13/o-13-17.png" alt=""> &#x662F;&#x5C42;<code>L</code>&#x7684;&#x7279;&#x5F81;&#x6620;&#x5C04;<code>k</code>&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x795E;&#x7ECF;&#x5143;&#x4E0E;&#x4F4D;&#x4E8E;&#x884C;<code>u</code>&#xFF0C;&#x5217;<code>v</code>&#xFF08;&#x76F8;&#x5BF9;&#x4E8E;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x611F;&#x53D7;&#x91CE;&#xFF09;&#x7684;&#x8F93;&#x5165;&#x4E4B;&#x95F4;&#x7684;&#x8FDE;&#x63A5;&#x6743;&#x91CD;&#xFF0C;&#x4EE5;&#x53CA;&#x7279;&#x5F81;&#x6620;&#x5C04;k&apos;&#x3002;</p>
</li>
</ul>
<h2 id="tensorflow-&#x5B9E;&#x73B0;">TensorFlow &#x5B9E;&#x73B0;</h2>
<p>&#x200B;&#x5728; Tensorflow &#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x8F93;&#x5165;&#x56FE;&#x50CF;&#x7684;&#x901A;&#x5E38;&#x88AB;&#x8868;&#x793A;&#x4E3A;&#x4E09;&#x7EF4;&#x5F20;&#x91CF; <img src="../images/chapter_13/o-13-18.png" alt="">&#x3002; &#x4E00;&#x4E2A;&#x5C0F;&#x6279;&#x6B21;&#x88AB;&#x8868;&#x793A;&#x4E3A;&#x56DB;&#x7EF4;&#x5F20;&#x91CF; <img src="../images/chapter_13/o-13-19.png" alt="">&#x3002; &#x5377;&#x79EF;&#x5C42;&#x7684;&#x6743;&#x91CD;&#x88AB;&#x8868;&#x793A;&#x4E3A;&#x56DB;&#x7EF4;&#x5F20;&#x91CF; <img src="../images/chapter_13/o-13-20.png" alt="">&#x3002; &#x5377;&#x79EF;&#x5C42;&#x7684;&#x504F;&#x5DEE;&#x9879;&#x7B80;&#x5355;&#x5730;&#x8868;&#x793A;&#x4E3A;&#x4E00;&#x7EF4;&#x5F62;&#x72B6;&#x7684;&#x5F20;&#x91CF; <img src="../images/chapter_13/o-13-21.png" alt="">&#x3002;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#x3002; &#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x4F7F;&#x7528; <strong>Scikit-Learn</strong> &#x7684;<code>load_sample_images()</code>&#xFF08;&#x52A0;&#x8F7D;&#x4E24;&#x4E2A;&#x5F69;&#x8272;&#x56FE;&#x50CF;&#xFF0C;&#x4E00;&#x4E2A;&#x4E2D;&#x56FD;&#x5E99;&#x5B87;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x662F;&#x4E00;&#x6735;&#x82B1;&#xFF09;&#x52A0;&#x8F7D;&#x4E24;&#x4E2A;&#x6837;&#x672C;&#x56FE;&#x50CF;&#x3002; &#x7136;&#x540E;&#x521B;&#x5EFA;&#x4E24;&#x4E2A;<code>7&#xD7;7</code>&#x7684;&#x5377;&#x79EF;&#x6838;&#xFF08;&#x4E00;&#x4E2A;&#x4E2D;&#x95F4;&#x662F;&#x5782;&#x76F4;&#x7684;&#x767D;&#x7EBF;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x662F;&#x6C34;&#x5E73;&#x7684;&#x767D;&#x7EBF;&#xFF09;&#xFF0C;&#x5E76;&#x5C06;&#x4ED6;&#x4EEC;&#x5E94;&#x7528;&#x5230;&#x4E24;&#x5F20;&#x56FE;&#x5F62;&#x4E2D;,&#x4F7F;&#x7528; TensorFlow &#x7684;<code>conv2d()</code>&#x51FD;&#x6570;&#x6784;&#x5EFA;&#x7684;&#x5377;&#x79EF;&#x56FE;&#x5C42;&#xFF08;&#x4F7F;&#x7528;&#x96F6;&#x586B;&#x5145;&#x4E14;&#x6B65;&#x5E45;&#x4E3A; 2&#xFF09;&#x3002; &#x6700;&#x540E;&#xFF0C;&#x7ED8;&#x5236;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x7ED3;&#x679C;&#x7279;&#x5F81;&#x6620;&#x5C04;&#xFF08;&#x7C7B;&#x4F3C;&#x4E8E;&#x56FE; 13-5 &#x4E2D;&#x7684;&#x53F3;&#x4E0A;&#x56FE;&#xFF09;&#x3002;</p>
<pre><code class="lang-python"><span class="hljs-keyword">from</span> sklearn.datasets <span class="hljs-keyword">import</span> load_sample_image
<span class="hljs-keyword">import</span> matplotlib.pyplot <span class="hljs-keyword">as</span> plt
<span class="hljs-keyword">import</span> numpy <span class="hljs-keyword">as</span> np
<span class="hljs-keyword">import</span> tensorflow <span class="hljs-keyword">as</span> tf

<span class="hljs-keyword">if</span> __name__ == <span class="hljs-string">&apos;__main__&apos;</span>:

    <span class="hljs-comment"># Load sample images</span>
    china = load_sample_image(<span class="hljs-string">&quot;china.jpg&quot;</span>)
    flower = load_sample_image(<span class="hljs-string">&quot;flower.jpg&quot;</span>)
    dataset = np.array([china, flower], dtype=np.float32)
    batch_size, height, width, channels = dataset.shape

    <span class="hljs-comment"># Create 2 filters</span>
    filters = np.zeros(shape=(<span class="hljs-number">7</span>, <span class="hljs-number">7</span>, channels, <span class="hljs-number">2</span>), dtype=np.float32)
    filters[:, <span class="hljs-number">3</span>, :, <span class="hljs-number">0</span>] = <span class="hljs-number">1</span>  <span class="hljs-comment"># vertical line</span>
    filters[<span class="hljs-number">3</span>, :, :, <span class="hljs-number">1</span>] = <span class="hljs-number">1</span>  <span class="hljs-comment"># horizontal line</span>

    <span class="hljs-comment"># Create a graph with input X plus a convolutional layer applying the 2 filters</span>
    X = tf.placeholder(tf.float32, shape=(<span class="hljs-keyword">None</span>, height, width, channels))
    convolution = tf.nn.conv2d(X, filters, strides=[<span class="hljs-number">1</span>,<span class="hljs-number">2</span>,<span class="hljs-number">2</span>,<span class="hljs-number">1</span>], padding=<span class="hljs-string">&quot;SAME&quot;</span>)

    <span class="hljs-keyword">with</span> tf.Session() <span class="hljs-keyword">as</span> sess:
        output = sess.run(convolution, feed_dict={X: dataset})

    plt.imshow(output[<span class="hljs-number">0</span>, :, :, <span class="hljs-number">1</span>], cmap=<span class="hljs-string">&quot;gray&quot;</span>) <span class="hljs-comment"># plot 1st image&apos;s 2nd feature map</span>
    plt.show()
</code></pre>
<p>&#x5927;&#x90E8;&#x5206;&#x4EE3;&#x7801;&#x662F;&#x4E0D;&#x8A00;&#x800C;&#x55BB;&#x7684;&#xFF0C;&#x4F46;<code>conv2d()</code>&#x8FD9;&#x4E00;&#x884C;&#x503C;&#x5F97;&#x89E3;&#x91CA;&#x4E00;&#x4E0B;&#xFF1A;</p>
<ul>
<li><code>X</code>&#x662F;&#x8F93;&#x5165;&#x5C0F;&#x6279;&#x6B21;&#xFF08;4D &#x5F20;&#x91CF;&#xFF0C;&#x5982;&#x524D;&#x6240;&#x8FF0;&#xFF09;</li>
<li>&#x5377;&#x79EF;&#x6838;&#x662F;&#x5E94;&#x7528;&#x7684;&#x4E00;&#x7EC4;&#x5377;&#x79EF;&#x6838;&#xFF08;&#x4E5F;&#x662F;&#x4E00;&#x4E2A; 4D &#x5F20;&#x91CF;&#xFF0C;&#x5982;&#x524D;&#x6240;&#x8FF0;&#xFF09;&#x3002;</li>
<li>&#x6B65;&#x5E45;&#x662F;&#x4E00;&#x4E2A;&#x56DB;&#x5143;&#x7D20;&#x7684;&#x4E00;&#x7EF4;&#x6570;&#x7EC4;&#xFF0C;&#x5176;&#x4E2D;&#x4E24;&#x4E2A;&#x4E2D;&#x95F4;&#x7684;&#x503C;&#x662F;&#x5782;&#x76F4;&#x548C;&#x6C34;&#x5E73;&#x7684;&#x6B65;&#x5E45;&#xFF08;<code>sh</code>&#x548C;<code>sw</code>&#xFF09;&#x3002; &#x7B2C;&#x4E00;&#x4E2A;&#x548C;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x73B0;&#x5728;&#x5FC5;&#x987B;&#x7B49;&#x4E8E; 1&#x3002;&#x4ED6;&#x4EEC;&#x53EF;&#x80FD;&#x6709;&#x4E00;&#x5929;&#x4F1A;&#x88AB;&#x7528;&#x6765;&#x6307;&#x5B9A;&#x6279;&#x91CF;&#x6B65;&#x957F;&#xFF08;&#x8DF3;&#x8FC7;&#x4E00;&#x4E9B;&#x5B9E;&#x4F8B;&#xFF09;&#x548C;&#x9891;&#x9053;&#x6B65;&#x5E45;&#xFF08;&#x8DF3;&#x8FC7;&#x4E0A;&#x4E00;&#x5C42;&#x7684;&#x7279;&#x5F81;&#x6620;&#x5C04;&#x6216;&#x901A;&#x9053;&#xFF09;&#x3002;</li>
<li><p><code>padding</code>&#x5FC5;&#x987B;&#x662F;<code>&quot;VALID&quot;</code>&#x6216;<code>&quot;SAME&quot;</code>&#xFF1A;</p>
<ul>
<li>&#x5982;&#x679C;&#x8BBE;&#x7F6E;&#x4E3A;<code>&quot;VALID&quot;</code>&#xFF0C;&#x5377;&#x79EF;&#x5C42;&#x4E0D;&#x4F7F;&#x7528;&#x96F6;&#x586B;&#x5145;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x80FD;&#x4F1A;&#x5FFD;&#x7565;&#x8F93;&#x5165;&#x56FE;&#x50CF;&#x5E95;&#x90E8;&#x548C;&#x53F3;&#x4FA7;&#x7684;&#x67D0;&#x4E9B;&#x884C;&#x548C;&#x5217;&#xFF0C;&#x5177;&#x4F53;&#x53D6;&#x51B3;&#x4E8E;&#x6B65;&#x5E45;&#xFF0C;&#x5982;&#x56FE; 13-7 &#x6240;&#x793A;&#xFF08;&#x4E3A;&#x7B80;&#x5355;&#x8D77;&#x89C1;&#xFF0C; &#x8FD9;&#x91CC;&#x53EA;&#x663E;&#x793A;&#x6C34;&#x5E73;&#x5C3A;&#x5BF8;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x5782;&#x76F4;&#x5C3A;&#x5BF8;&#x4E5F;&#x9002;&#x7528;&#x76F8;&#x540C;&#x7684;&#x903B;&#x8F91;&#xFF09;</li>
<li>&#x5982;&#x679C;&#x8BBE;&#x7F6E;&#x4E3A;<code>&quot;SAME&quot;</code>&#xFF0C;&#x5219;&#x5377;&#x79EF;&#x5C42;&#x5728;&#x5FC5;&#x8981;&#x65F6;&#x4F7F;&#x7528;&#x96F6;&#x586B;&#x5145;&#x3002; &#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8F93;&#x51FA;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x6570;&#x91CF;&#x7B49;&#x4E8E;&#x8F93;&#x5165;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x6570;&#x91CF;&#x9664;&#x4EE5;&#x8BE5;&#x6B65;&#x5E45;&#xFF0C;&#x5411;&#x4E0A;&#x820D;&#x5165;&#xFF08;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;<code>ceil(13/5)= 3</code>&#xFF09;&#x3002; &#x7136;&#x540E;&#x5728;&#x8F93;&#x5165;&#x5468;&#x56F4;&#x5C3D;&#x53EF;&#x80FD;&#x5747;&#x5300;&#x5730;&#x6DFB;&#x52A0;&#x96F6;&#x3002;</li>
</ul>
</li>
</ul>
<p><img src="../images/chapter_13/13-7.png" alt=""></p>
<p>&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x5377;&#x79EF;&#x56FE;&#x5C42;&#x6709;&#x5F88;&#x591A;&#x8D85;&#x53C2;&#x6570;&#xFF1A;&#x4F60;&#x5FC5;&#x987B;&#x9009;&#x62E9;&#x5377;&#x79EF;&#x6838;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#xFF0C;&#x6B65;&#x5E45;&#x548C;&#x586B;&#x5145;&#x7C7B;&#x578B;&#x3002; &#x4E0E;&#x5F80;&#x5E38;&#x4E00;&#x6837;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x6765;&#x67E5;&#x627E;&#x6B63;&#x786E;&#x7684;&#x8D85;&#x53C2;&#x6570;&#x503C;&#xFF0C;&#x4F46;&#x8FD9;&#x975E;&#x5E38;&#x8017;&#x65F6;&#x3002; &#x7A0D;&#x540E;&#x6211;&#x4EEC;&#x5C06;&#x8BA8;&#x8BBA;&#x5E38;&#x89C1;&#x7684; CNN &#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#xFF0C;&#x4EE5;&#x4FBF;&#x8BA9;&#x60A8;&#x4E86;&#x89E3;&#x8D85;&#x53C2;&#x6570;&#x503C;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x7684;&#x6700;&#x4F73;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#x3002;</p>
<h2 id="&#x5185;&#x5B58;&#x9700;&#x6C42;">&#x5185;&#x5B58;&#x9700;&#x6C42;</h2>
<p>&#x200B;CNN &#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#x5377;&#x79EF;&#x5C42;&#x9700;&#x8981;&#x5927;&#x91CF;&#x7684; RAM&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5728;&#x8BAD;&#x7EC3;&#x671F;&#x95F4;&#xFF0C;&#x56E0;&#x4E3A;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x9700;&#x8981;&#x5728;&#x6B63;&#x5411;&#x4F20;&#x9012;&#x671F;&#x95F4;&#x8BA1;&#x7B97;&#x7684;&#x6240;&#x6709;&#x4E2D;&#x95F4;&#x503C;&#x3002;</p>
<p>&#x200B;&#x4F8B;&#x5982;&#xFF0C;&#x8003;&#x8651;&#x5177;&#x6709;<code>5&#xD7;5</code>&#x5377;&#x79EF;&#x6838;&#x7684;&#x5377;&#x79EF;&#x5C42;&#xFF0C;&#x8F93;&#x51FA; 200 &#x4E2A;&#x5C3A;&#x5BF8;&#x4E3A;<code>150&#xD7;100</code>&#x7684;&#x7279;&#x5F81;&#x6620;&#x5C04;&#xFF0C;&#x6B65;&#x957F;&#x4E3A; 1&#xFF0C;&#x4F7F;&#x7528;<code>SAME</code>&#x586B;&#x5145;&#x3002; &#x5982;&#x679C;&#x8F93;&#x5165;&#x662F;<code>150&#xD7;100</code>RGB &#x56FE;&#x50CF;&#xFF08;&#x4E09;&#x4E2A;&#x901A;&#x9053;&#xFF09;&#xFF0C;&#x5219;&#x53C2;&#x6570;&#x7684;&#x6570;&#x91CF;&#x662F;<code>(5&#xD7;5&#xD7;3 + 1)&#xD7;200 = 15,200</code>&#xFF08;<code>+1</code>&#x5BF9;&#x5E94;&#x4E8E;&#x504F;&#x7F6E;&#x9879;&#xFF09;&#xFF0C;&#x8FD9;&#x8DDF;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x6BD4;&#x8F83;&#x662F;&#x76F8;&#x5F53;&#x5C0F;&#x7684;&#x3002;&#xFF08;&#x5177;&#x6709;<code>150&#xD7;100</code>&#x795E;&#x7ECF;&#x5143;&#x7684;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#xFF0C;&#x6BCF;&#x4E2A;&#x8FDE;&#x63A5;&#x5230;&#x6240;&#x6709;<code>150&#xD7;100&#xD7;3</code>&#x8F93;&#x5165;&#xFF0C;&#x5C06;&#x5177;&#x6709;<code>150 ^ 2&#xD7;100 ^ 2&#xD7;3 = 675,000,000</code>&#x4E2A;&#x53C2;&#x6570;&#xFF01;&#xFF09;&#x7136;&#x800C;&#xFF0C;200 &#x4E2A;&#x7279;&#x5F81;&#x6620;&#x5C04;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x5305;&#x542B;<code>150&#xD7;100</code>&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#xFF0C;&#x5E76;&#x4E14;&#x8FD9;&#x4E9B;&#x795E;&#x7ECF;&#x5143;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x90FD;&#x9700;&#x8981;&#x8BA1;&#x7B97;&#x5176;<code>5&#xD7;5&#xD7;3 = 75</code>&#x4E2A;&#x8F93;&#x5165;&#x7684;&#x6743;&#x91CD;&#x548C;&#xFF1A;&#x603B;&#x5171; 2.25 &#x4EBF;&#x6B21;&#x6D6E;&#x70B9;&#x4E58;&#x6CD5;&#x3002;&#x4E0D;&#x50CF;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x90A3;&#x4E48;&#x7CDF;&#x7CD5;&#xFF0C;&#x4F46;&#x4ECD;&#x7136;&#x662F;&#x8BA1;&#x7B97;&#x5BC6;&#x96C6;&#x578B;&#x7684;&#x3002; &#x800C;&#x4E14;&#xFF0C;&#x5982;&#x679C;&#x4F7F;&#x7528; 32 &#x4F4D;&#x6D6E;&#x70B9;&#x6570;&#x6765;&#x8868;&#x793A;&#x7279;&#x5F81;&#x6620;&#x5C04;&#xFF0C;&#x5219;&#x5377;&#x79EF;&#x5C42;&#x7684;&#x8F93;&#x51FA;&#x5C06;&#x5360;&#x7528; RAM &#x7684;<code>200&#xD7;150&#xD7;100&#xD7;32 = 9600&#x4E07;</code>&#x4F4D;&#xFF08;&#x5927;&#x7EA6; 11.4MB&#xFF09;&#x3002; &#x8FD9;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF01; &#x5982;&#x679C;&#x8BAD;&#x7EC3;&#x6279;&#x6B21;&#x5305;&#x542B; 100 &#x4E2A;&#x5B9E;&#x4F8B;&#xFF0C;&#x5219;&#x8BE5;&#x5C42;&#x5C06;&#x5360;&#x7528;&#x8D85;&#x8FC7; 1 GB &#x7684; RAM&#xFF01;</p>
<p>&#x200B;&#x5728;&#x63A8;&#x7406;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF08;&#x5373;&#x5BF9;&#x65B0;&#x5B9E;&#x4F8B;&#x8FDB;&#x884C;&#x9884;&#x6D4B;&#x65F6;&#xFF09;&#xFF0C;&#x4E00;&#x65E6;&#x4E0B;&#x4E00;&#x5C42;&#x8BA1;&#x7B97;&#x5B8C;&#x6BD5;&#xFF0C;&#x4E00;&#x5C42;&#x6240;&#x5360;&#x7528;&#x7684; RAM &#x5C31;&#x53EF;&#x4EE5;&#x88AB;&#x91CA;&#x653E;&#xFF0C;&#x56E0;&#x6B64;&#x53EA;&#x9700;&#x8981;&#x4E24;&#x4E2A;&#x8FDE;&#x7EED;&#x5C42;&#x6240;&#x9700;&#x7684; RAM &#x6570;&#x91CF;&#x3002; &#x4F46;&#x662F;&#x5728;&#x8BAD;&#x7EC3;&#x671F;&#x95F4;&#xFF0C;&#x5728;&#x6B63;&#x5411;&#x4F20;&#x9012;&#x671F;&#x95F4;&#x8BA1;&#x7B97;&#x7684;&#x6240;&#x6709;&#x5185;&#x5BB9;&#x90FD;&#x9700;&#x8981;&#x88AB;&#x4FDD;&#x7559;&#x7528;&#x4E8E;&#x53CD;&#x5411;&#x4F20;&#x9012;&#xFF0C;&#x6240;&#x4EE5;&#x6240;&#x9700;&#x7684; RAM &#x91CF;&#xFF08;&#x81F3;&#x5C11;&#xFF09;&#x662F;&#x6240;&#x6709;&#x5C42;&#x6240;&#x9700;&#x7684; RAM &#x603B;&#x91CF;&#x3002;</p>
<p>&#x200B;<strong>&#x5982;&#x679C;&#x7531;&#x4E8E;&#x5185;&#x5B58;&#x4E0D;&#x8DB3;&#x9519;&#x8BEF;&#x5BFC;&#x81F4;&#x8BAD;&#x7EC3;&#x5D29;&#x6E83;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x51CF;&#x5C11;&#x5C0F;&#x6279;&#x91CF;&#x5927;&#x5C0F;&#x3002; &#x6216;&#x8005;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x4F7F;&#x7528;&#x6B65;&#x5E45;&#x964D;&#x4F4E;&#x7EF4;&#x5EA6;&#xFF0C;&#x6216;&#x8005;&#x5220;&#x9664;&#x51E0;&#x4E2A;&#x56FE;&#x5C42;&#x3002; &#x6216;&#x8005;&#x4F60;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x4F7F;&#x7528; 16 &#x4F4D;&#x6D6E;&#x70B9;&#x6570;&#x800C;&#x4E0D;&#x662F; 32 &#x4F4D;&#x6D6E;&#x70B9;&#x6570;&#x3002; &#x6216;&#x8005;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x591A;&#x4E2A;&#x8BBE;&#x5907;&#x4E0A;&#x5206;&#x53D1; CNN&#x3002;</strong></p>
<h2 id="&#x6C60;&#x5316;&#x5C42;">&#x6C60;&#x5316;&#x5C42;</h2>
<p>&#x200B;&#x4E00;&#x65E6;&#x4F60;&#x7406;&#x89E3;&#x4E86;&#x5377;&#x79EF;&#x5C42;&#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#xFF0C;&#x6C60;&#x5316;&#x5C42;&#x5F88;&#x5BB9;&#x6613;&#x638C;&#x63E1;&#x3002; &#x4ED6;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#x662F;&#x5BF9;&#x8F93;&#x5165;&#x56FE;&#x50CF;&#x8FDB;&#x884C;&#x4E8C;&#x6B21;&#x62BD;&#x6837;&#xFF08;&#x5373;&#x6536;&#x7F29;&#xFF09;&#x4EE5;&#x51CF;&#x5C11;&#x8BA1;&#x7B97;&#x8D1F;&#x62C5;&#xFF0C;&#x5185;&#x5B58;&#x4F7F;&#x7528;&#x91CF;&#x548C;&#x53C2;&#x6570;&#x6570;&#x91CF;&#xFF08;&#x4ECE;&#x800C;&#x9650;&#x5236;&#x8FC7;&#x5EA6;&#x62DF;&#x5408;&#x7684;&#x98CE;&#x9669;&#xFF09;&#x3002; &#x51CF;&#x5C11;&#x8F93;&#x5165;&#x56FE;&#x50CF;&#x7684;&#x5927;&#x5C0F;&#x4E5F;&#x4F7F;&#x5F97;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5BB9;&#x5FCD;&#x4E00;&#x70B9;&#x70B9;&#x7684;&#x56FE;&#x50CF;&#x53D8;&#x6362;&#xFF08;&#x4F4D;&#x7F6E;&#x4E0D;&#x53D8;&#xFF09;&#x3002;</p>
<p>&#x200B;&#x5C31;&#x50CF;&#x5728;&#x5377;&#x79EF;&#x56FE;&#x5C42;&#x4E2D;&#x4E00;&#x6837;&#xFF0C;&#x6C60;&#x5316;&#x5C42;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x90FD;&#x8FDE;&#x63A5;&#x5230;&#x524D;&#x4E00;&#x5C42;&#x4E2D;&#x6709;&#x9650;&#x6570;&#x91CF;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x4F4D;&#x4E8E;&#x4E00;&#x4E2A;&#x5C0F;&#x7684;&#x77E9;&#x5F62;&#x611F;&#x53D7;&#x91CE;&#x5185;&#x3002; &#x60A8;&#x5FC5;&#x987B;&#x50CF;&#x4EE5;&#x524D;&#x4E00;&#x6837;&#x5B9A;&#x4E49;&#x5176;&#x5927;&#x5C0F;&#xFF0C;&#x8DE8;&#x5EA6;&#x548C;&#x586B;&#x5145;&#x7C7B;&#x578B;&#x3002; &#x4F46;&#x662F;&#xFF0C;&#x6C47;&#x96C6;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x6CA1;&#x6709;&#x6743;&#x91CD;; &#x5B83;&#x6240;&#x505A;&#x7684;&#x53EA;&#x662F;&#x4F7F;&#x7528;&#x805A;&#x5408;&#x51FD;&#x6570;&#xFF08;&#x5982;&#x6700;&#x5927;&#x503C;&#x6216;&#x5E73;&#x5747;&#x503C;&#xFF09;&#x6765;&#x805A;&#x5408;&#x8F93;&#x5165;&#x3002; &#x56FE; 13-8 &#x663E;&#x793A;&#x4E86;&#x6700;&#x5927;&#x6C60;&#x5C42;&#xFF0C;&#x8FD9;&#x662F;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x6C60;&#x5316;&#x7C7B;&#x578B;&#x3002; &#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;2&#xD7;2&#x7684;&#x6838;&#xFF0C;&#x6B65;&#x5E45;&#x4E3A; 2&#xFF0C;&#x6CA1;&#x6709;&#x586B;&#x5145;&#x3002; &#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x53EA;&#x6709;&#x6BCF;&#x4E2A;&#x6838;&#x4E2D;&#x7684;&#x6700;&#x5927;&#x8F93;&#x5165;&#x503C;&#x624D;&#x4F1A;&#x8FDB;&#x5165;&#x4E0B;&#x4E00;&#x5C42;&#x3002; &#x5176;&#x4ED6;&#x8F93;&#x5165;&#x88AB;&#x4E22;&#x5F03;&#x3002;</p>
<p><img src="../images/chapter_13/13-8.png" alt="">       </p>
<p>&#x200B;&#x8FD9;&#x663E;&#x7136;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x5177;&#x6709;&#x7834;&#x574F;&#x6027;&#x7684;&#x5C42;&#xFF1A;&#x5373;&#x4F7F;&#x53EA;&#x6709;&#x4E00;&#x4E2A;<code>2&#xD7;2</code>&#x7684;&#x6838;&#x548C; 2 &#x7684;&#x6B65;&#x5E45;&#xFF0C;&#x8F93;&#x51FA;&#x5728;&#x4E24;&#x4E2A;&#x65B9;&#x5411;&#x4E0A;&#x90FD;&#x4F1A;&#x51CF;&#x5C0F;&#x4E24;&#x500D;&#xFF08;&#x6240;&#x4EE5;&#x5B83;&#x7684;&#x9762;&#x79EF;&#x5C06;&#x51CF;&#x5C11;&#x56DB;&#x500D;&#xFF09;&#xFF0C;&#x4E00;&#x4E0B;&#x51CF;&#x5C11;&#x4E86; 75% &#x7684;&#x8F93;&#x5165;&#x503C;</p>
<p>&#x200B;&#x6C60;&#x5316;&#x5C42;&#x901A;&#x5E38;&#x72EC;&#x7ACB;&#x4E8E;&#x6BCF;&#x4E2A;&#x8F93;&#x5165;&#x901A;&#x9053;&#x5DE5;&#x4F5C;&#xFF0C;&#x56E0;&#x6B64;&#x8F93;&#x51FA;&#x6DF1;&#x5EA6;&#x4E0E;&#x8F93;&#x5165;&#x6DF1;&#x5EA6;&#x76F8;&#x540C;&#x3002; &#x63A5;&#x4E0B;&#x6765;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x56FE;&#x50CF;&#x7684;&#x7A7A;&#x95F4;&#x7EF4;&#x5EA6;&#xFF08;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#xFF09;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#xFF0C;&#x4F46;&#x662F;&#x901A;&#x9053;&#x6570;&#x76EE;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x3002;</p>
<p>&#x200B;&#x5728; TensorFlow &#x4E2D;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x6700;&#x5927;&#x6C60;&#x5C42;&#x662F;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x7684;&#x3002; &#x4EE5;&#x4E0B;&#x4EE3;&#x7801;&#x4F7F;&#x7528;<code>2&#xD7;2</code>&#x6838;&#x521B;&#x5EFA;&#x6700;&#x5927;&#x6C60;&#x5316;&#x5C42;&#xFF0C;&#x6B65;&#x5E45;&#x4E3A;2&#xFF0C;&#x6CA1;&#x6709;&#x586B;&#x5145;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x5176;&#x5E94;&#x7528;&#x4E8E;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x56FE;&#x50CF;&#xFF1A;</p>
<pre><code class="lang-python"><span class="hljs-keyword">import</span> numpy <span class="hljs-keyword">as</span> np
<span class="hljs-keyword">from</span> sklearn.datasets <span class="hljs-keyword">import</span> load_sample_image
<span class="hljs-keyword">import</span> tensorflow <span class="hljs-keyword">as</span> tf
<span class="hljs-keyword">import</span> matplotlib.pyplot <span class="hljs-keyword">as</span> plt

china = load_sample_image(<span class="hljs-string">&quot;china.jpg&quot;</span>)
flower = load_sample_image(<span class="hljs-string">&quot;flower.jpg&quot;</span>)

dataset = np.array([china, flower], dtype=np.float32)
batch_size, height, width, channels = dataset.shape

<span class="hljs-comment"># Create 2 filters</span>
filters = np.zeros(shape=(<span class="hljs-number">7</span>, <span class="hljs-number">7</span>, channels, <span class="hljs-number">2</span>), dtype=np.float32)
filters[:, <span class="hljs-number">3</span>, :, <span class="hljs-number">0</span>] = <span class="hljs-number">1</span>  <span class="hljs-comment"># vertical line</span>
filters[<span class="hljs-number">3</span>, :, :, <span class="hljs-number">1</span>] = <span class="hljs-number">1</span>  <span class="hljs-comment"># horizontal line</span>

X = tf.placeholder(tf.float32, shape=(<span class="hljs-keyword">None</span>, height, width, channels))
max_pool = tf.nn.max_pool(X, ksize=[<span class="hljs-number">1</span>,<span class="hljs-number">2</span>,<span class="hljs-number">2</span>,<span class="hljs-number">1</span>], strides=[<span class="hljs-number">1</span>,<span class="hljs-number">2</span>,<span class="hljs-number">2</span>,<span class="hljs-number">1</span>],padding=<span class="hljs-string">&quot;VALID&quot;</span>)

<span class="hljs-keyword">with</span> tf.Session() <span class="hljs-keyword">as</span> sess:
    output = sess.run(max_pool, feed_dict={X: dataset})

plt.imshow(output[<span class="hljs-number">0</span>].astype(np.uint8))  <span class="hljs-comment"># plot the output for the 1st image</span>
plt.show()
</code></pre>
<p>&#x200B;<code>ksize</code>&#x53C2;&#x6570;&#x5305;&#x542B;&#x6CBF;&#x8F93;&#x5165;&#x5F20;&#x91CF;&#x7684;&#x6240;&#x6709;&#x56DB;&#x7EF4;&#x7684;&#x6838;&#x5F62;&#x72B6;&#xFF1A;<code>[min-batch, height, width, channels]</code>&#x3002; TensorFlow &#x76EE;&#x524D;&#x4E0D;&#x652F;&#x6301;&#x5728;&#x591A;&#x4E2A;&#x5B9E;&#x4F8B;&#x4E0A;&#x5408;&#x5E76;&#xFF0C;&#x56E0;&#x6B64;<code>ksize</code>&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x5FC5;&#x987B;&#x7B49;&#x4E8E; 1&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x5B83;&#x4E0D;&#x652F;&#x6301;&#x5728;&#x7A7A;&#x95F4;&#x7EF4;&#x5EA6;&#xFF08;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#xFF09;&#x548C;&#x6DF1;&#x5EA6;&#x7EF4;&#x5EA6;&#x4E0A;&#x5408;&#x5E76;&#xFF0C;&#x56E0;&#x6B64;<code>ksize[1]</code>&#x548C;<code>ksize[2]</code>&#x90FD;&#x5FC5;&#x987B;&#x7B49;&#x4E8E; 1&#xFF0C;&#x5426;&#x5219;<code>ksize[3]</code>&#x5FC5;&#x987B;&#x7B49;&#x4E8E; 1&#x3002;</p>
<p>&#x200B;&#x8981;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5E73;&#x5747;&#x6C60;&#x5316;&#x5C42;&#xFF0C;&#x53EA;&#x9700;&#x4F7F;&#x7528;<code>avg_pool()</code>&#x51FD;&#x6570;&#x800C;&#x4E0D;&#x662F;<code>max_pool()</code>&#x3002;</p>
<p>&#x200B;&#x73B0;&#x5728;&#x4F60;&#x77E5;&#x9053;&#x6240;&#x6709;&#x7684;&#x6784;&#x5EFA;&#x6A21;&#x5757;&#x6765;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002; &#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;&#x5982;&#x4F55;&#x7EC4;&#x88C5;&#x5B83;&#x4EEC;&#x3002;</p>
<h2 id="cnn-&#x67B6;&#x6784;">CNN &#x67B6;&#x6784;</h2>
<p>&#x200B;&#x5178;&#x578B;&#x7684; CNN &#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x6709;&#x4E00;&#x4E9B;&#x5377;&#x79EF;&#x5C42;&#xFF08;&#x6BCF;&#x4E00;&#x4E2A;&#x901A;&#x5E38;&#x8DDF;&#x7740;&#x4E00;&#x4E2A; ReLU &#x5C42;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x662F;&#x4E00;&#x4E2A;&#x6C60;&#x5316;&#x5C42;&#xFF0C;&#x7136;&#x540E;&#x662F;&#x53E6;&#x5916;&#x51E0;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#xFF08;+ ReLU&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x662F;&#x53E6;&#x4E00;&#x4E2A;&#x6C60;&#x5316;&#x5C42;&#xFF0C;&#x7B49;&#x7B49;&#x3002; &#x968F;&#x7740;&#x7F51;&#x7EDC;&#x7684;&#x8FDB;&#x5C55;&#xFF0C;&#x56FE;&#x50CF;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x5C0F;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x5377;&#x79EF;&#x5C42;&#x7684;&#x7F18;&#x6545;&#xFF0C;&#x56FE;&#x50CF;&#x901A;&#x5E38;&#x4E5F;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x6DF1;&#xFF08;&#x5373;&#x66F4;&#x591A;&#x7684;&#x7279;&#x5F81;&#x6620;&#x5C04;&#xFF09;&#xFF08;&#x89C1;&#x56FE; 13-9&#xFF09;&#x3002; &#x5728;&#x5806;&#x6808;&#x7684;&#x9876;&#x90E8;&#xFF0C;&#x6DFB;&#x52A0;&#x7531;&#x51E0;&#x4E2A;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#xFF08;+ ReLU&#xFF09;&#x7EC4;&#x6210;&#x7684;&#x5E38;&#x89C4;&#x524D;&#x9988;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x5E76;&#x4E14;&#x6700;&#x7EC8;&#x5C42;&#x8F93;&#x51FA;&#x9884;&#x6D4B;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x8F93;&#x51FA;&#x4F30;&#x8BA1;&#x7C7B;&#x522B;&#x6982;&#x7387;&#x7684; softmax &#x5C42;&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_13/13-9.png" alt=""></p>
<p>&#x200B;<strong>&#x4E00;&#x4E2A;&#x5E38;&#x89C1;&#x7684;&#x9519;&#x8BEF;&#x662F;&#x4F7F;&#x7528;&#x592A;&#x5927;&#x7684;&#x5377;&#x79EF;&#x6838;&#x3002; &#x901A;&#x5E38;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5C06;&#x4E24;&#x4E2A;<code>3&#xD7;3</code>&#x5185;&#x6838;&#x5806;&#x53E0;&#x5728;&#x4E00;&#x8D77;&#x6765;&#x83B7;&#x5F97;&#x4E0E;<code>9&#xD7;9</code>&#x5185;&#x6838;&#x76F8;&#x540C;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x8BA1;&#x7B97;&#x91CF;&#x66F4;&#x5C11;&#x3002;</strong></p>
<p>&#x200B;&#x591A;&#x5E74;&#x6765;&#xFF0C;&#x8FD9;&#x79CD;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x7684;&#x53D8;&#x4F53;&#x5DF2;&#x7ECF;&#x88AB;&#x5F00;&#x53D1;&#x51FA;&#x6765;&#xFF0C;&#x5BFC;&#x81F4;&#x4E86;&#x8BE5;&#x9886;&#x57DF;&#x7684;&#x60CA;&#x4EBA;&#x8FDB;&#x6B65;&#x3002; &#x8FD9;&#x79CD;&#x8FDB;&#x6B65;&#x7684;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x8861;&#x91CF;&#x6807;&#x51C6;&#x662F;&#x6BD4;&#x8D5B;&#x4E2D;&#x7684;&#x9519;&#x8BEF;&#x7387;&#xFF0C;&#x6BD4;&#x5982; ILSVRC ImageNet &#x7684;&#x6311;&#x6218;&#x3002; &#x5728;&#x8FD9;&#x4E2A;&#x6BD4;&#x8D5B;&#x4E2D;&#xFF0C;&#x56FE;&#x50CF;&#x5206;&#x7C7B;&#x7684;&#x4E94;&#x5927;&#x8BEF;&#x5DEE;&#x7387;&#x5728;&#x4E94;&#x5E74;&#x5185;&#x4ECE; 26% &#x4E0B;&#x964D;&#x5230;&#x4EC5;&#x4EC5; 3% &#x5DE6;&#x53F3;&#x3002; &#x524D;&#x4E94;&#x4F4D;&#x9519;&#x8BEF;&#x7387;&#x662F;&#x7CFB;&#x7EDF;&#x524D;5&#x4F4D;&#x9884;&#x6D4B;&#x672A;&#x5305;&#x542B;&#x6B63;&#x786E;&#x7B54;&#x6848;&#x7684;&#x6D4B;&#x8BD5;&#x56FE;&#x50CF;&#x7684;&#x6570;&#x91CF;&#x3002; &#x56FE;&#x50CF;&#x5F88;&#x5927;&#xFF08;256 &#x50CF;&#x7D20;&#xFF09;&#xFF0C;&#x6709; 1000 &#x4E2A;&#x7C7B;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x4E9B;&#x975E;&#x5E38;&#x5FAE;&#x5999;&#xFF08;&#x5C1D;&#x8BD5;&#x533A;&#x5206; 120 &#x4E2A;&#x72D7;&#x7684;&#x54C1;&#x79CD;&#xFF09;&#x3002; &#x67E5;&#x770B;&#x83B7;&#x5956;&#x4F5C;&#x54C1;&#x7684;&#x6F14;&#x53D8;&#x662F;&#x4E86;&#x89E3; CNN &#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#x597D;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x200B;&#x6211;&#x4EEC;&#x5148;&#x6765;&#x770B;&#x770B;&#x7ECF;&#x5178;&#x7684; LeNet-5 &#x67B6;&#x6784;&#xFF08;1998 &#x5E74;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x662F; ILSVRC &#x6311;&#x6218;&#x8D5B;&#x7684;&#x4E09;&#x540D;&#x83B7;&#x80DC;&#x8005; AlexNet&#xFF08;2012&#xFF09;&#xFF0C;GoogLeNet&#xFF08;2014&#xFF09;&#x548C; ResNet&#xFF08;2015&#xFF09;&#x3002;</p>
<p>&#x200B;&#x5176;&#x4ED6;&#x89C6;&#x89C9;&#x4EFB;&#x52A1;&#x5728;&#x5176;&#x4ED6;&#x89C6;&#x89C9;&#x4EFB;&#x52A1;&#x4E2D;&#xFF0C;&#x5982;&#x7269;&#x4F53;&#x68C0;&#x6D4B;&#x548C;&#x5B9A;&#x4F4D;&#x4EE5;&#x53CA;&#x56FE;&#x50CF;&#x5206;&#x5272;&#xFF0C;&#x4E5F;&#x53D6;&#x5F97;&#x4E86;&#x60CA;&#x4EBA;&#x7684;&#x8FDB;&#x5C55;&#x3002; &#x5728;&#x7269;&#x4F53;&#x68C0;&#x6D4B;&#x548C;&#x5B9A;&#x4F4D;&#x4E2D;&#xFF0C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x901A;&#x5E38;&#x8F93;&#x51FA;&#x56FE;&#x50CF;&#x4E2D;&#x5404;&#x79CD;&#x7269;&#x4F53;&#x5468;&#x56F4;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x8FB9;&#x754C;&#x6846;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x53C2; &#x89C1;Maxine Oquab &#x7B49;&#x4EBA;&#x7684; 2015 &#x5E74;&#x8BBA;&#x6587;&#xFF0C;&#x8BE5;&#x8BBA;&#x6587;&#x4E3A;&#x6BCF;&#x4E2A;&#x5BA2;&#x4F53;&#x7C7B;&#x522B;&#x8F93;&#x51FA;&#x70ED;&#x56FE;&#xFF0C;&#x6216;&#x8005; Russell Stewart &#x7B49;&#x4EBA;&#x7684; 2015 &#x5E74;&#x8BBA;&#x6587;&#xFF0C;&#x8BE5;&#x8BBA;&#x6587;&#x7ED3;&#x5408;&#x4F7F;&#x7528; CNN &#x6765;&#x68C0;&#x6D4B;&#x4EBA;&#x8138;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x9012;&#x5F52;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6765;&#x8F93;&#x51FA; &#x56F4;&#x7ED5;&#x5B83;&#x4EEC;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x8FB9;&#x754C;&#x6846;&#x3002; &#x5728;&#x56FE;&#x50CF;&#x5206;&#x5272;&#x4E2D;&#xFF0C;&#x7F51;&#x7EDC;&#x8F93;&#x51FA;&#x56FE;&#x50CF;&#xFF08;&#x901A;&#x5E38;&#x4E0E;&#x8F93;&#x5165;&#x5927;&#x5C0F;&#x76F8;&#x540C;&#xFF09;&#xFF0C;&#x5176;&#x4E2D;&#x6BCF;&#x4E2A;&#x50CF;&#x7D20;&#x6307;&#x793A;&#x76F8;&#x5E94;&#x8F93;&#x5165;&#x50CF;&#x7D20;&#x6240;&#x5C5E;&#x7684;&#x5BF9;&#x8C61;&#x7684;&#x7C7B;&#x522B;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x67E5;&#x770B; Evan Shelhamer &#x7B49;&#x4EBA;&#x7684; 2016 &#x5E74;&#x8BBA;&#x6587;&#x3002;</p>
<h2 id="lenet-5">LeNet-5</h2>
<p>&#x200B;LeNet-5 &#x67B6;&#x6784;&#x4E5F;&#x8BB8;&#x662F;&#x6700;&#x5E7F;&#x4E3A;&#x4EBA;&#x77E5;&#x7684; CNN &#x67B6;&#x6784;&#x3002; &#x5982;&#x524D;&#x6240;&#x8FF0;&#xFF0C;&#x5B83;&#x662F;&#x7531; Yann LeCun &#x4E8E; 1998 &#x5E74;&#x521B;&#x5EFA;&#x7684;&#xFF0C;&#x5E7F;&#x6CDB;&#x7528;&#x4E8E;&#x624B;&#x5199;&#x6570;&#x5B57;&#x8BC6;&#x522B;&#xFF08;MNIST&#xFF09;&#x3002; &#x5B83;&#x7531;&#x8868; 13-1 &#x6240;&#x793A;&#x7684;&#x5C42;&#x7EC4;&#x6210;&#x3002;</p>
<p><img src="../images/chapter_13/t-13-1.png" alt=""></p>
<p>&#x6709;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x7EC6;&#x8282;&#x8981;&#x6CE8;&#x610F;&#xFF1A;</p>
<ul>
<li>MNIST &#x56FE;&#x50CF;&#x662F;<code>28&#xD7;28</code>&#x50CF;&#x7D20;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x88AB;&#x96F6;&#x586B;&#x5145;&#x5230;<code>32&#xD7;32</code>&#x50CF;&#x7D20;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x88AB;&#x8F93;&#x5165;&#x5230;&#x7F51;&#x7EDC;&#x4E4B;&#x524D;&#x88AB;&#x5F52;&#x4E00;&#x5316;&#x3002; &#x7F51;&#x7EDC;&#x7684;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x4E0D;&#x4F7F;&#x7528;&#x4EFB;&#x4F55;&#x586B;&#x5145;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x968F;&#x7740;&#x56FE;&#x50CF;&#x5728;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x8FDB;&#x5C55;&#xFF0C;&#x5927;&#x5C0F;&#x4E0D;&#x65AD;&#x7F29;&#x5C0F;&#x3002;</li>
<li>&#x5E73;&#x5747;&#x6C60;&#x5316;&#x5C42;&#x6BD4;&#x5E73;&#x5E38;&#x7A0D;&#x5FAE;&#x590D;&#x6742;&#x4E00;&#x4E9B;&#xFF1A;&#x6BCF;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x8BA1;&#x7B97;&#x8F93;&#x5165;&#x7684;&#x5E73;&#x5747;&#x503C;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x7ED3;&#x679C;&#x4E58;&#x4EE5;&#x4E00;&#x4E2A;&#x53EF;&#x5B66;&#x4E60;&#x7684;&#x7CFB;&#x6570;&#xFF08;&#x6BCF;&#x4E2A;&#x7279;&#x5F81;&#x6620;&#x5C04;&#x4E00;&#x4E2A;&#xFF09;&#xFF0C;&#x5E76;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x53EF;&#x5B66;&#x4E60;&#x7684;&#x504F;&#x5DEE;&#x9879;&#xFF08;&#x6BCF;&#x4E2A;&#x7279;&#x5F81;&#x6620;&#x5C04;&#x4E00;&#x4E2A;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x6700;&#x540E;&#x5E94;&#x7528;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x3002;</li>
<li>C3 &#x56FE;&#x4E2D;&#x7684;&#x5927;&#x591A;&#x6570;&#x795E;&#x7ECF;&#x5143;&#x4EC5;&#x5728;&#x4E09;&#x4E2A;&#x6216;&#x56DB;&#x4E2A; S2 &#x56FE;&#xFF08;&#x800C;&#x4E0D;&#x662F;&#x5168;&#x90E8;&#x516D;&#x4E2A; S2 &#x56FE;&#xFF09;&#x4E2D;&#x8FDE;&#x63A5;&#x5230;&#x795E;&#x7ECF;&#x5143;&#x3002;&#x6709;&#x5173;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x9605;&#x539F;&#x59CB;&#x8BBA;&#x6587;&#x4E2D;&#x7684;&#x8868; 1&#x3002;</li>
<li>&#x8F93;&#x51FA;&#x5C42;&#x6709;&#x70B9;&#x7279;&#x6B8A;&#xFF1A;&#x6BCF;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x4E0D;&#x662F;&#x8BA1;&#x7B97;&#x8F93;&#x5165;&#x548C;&#x6743;&#x5411;&#x91CF;&#x7684;&#x70B9;&#x79EF;&#xFF0C;&#x800C;&#x662F;&#x8F93;&#x51FA;&#x5176;&#x8F93;&#x5165;&#x5411;&#x91CF;&#x548C;&#x5176;&#x6743;&#x5411;&#x91CF;&#x4E4B;&#x95F4;&#x7684;&#x6B27;&#x51E0;&#x91CC;&#x5FB7;&#x8DDD;&#x79BB;&#x7684;&#x5E73;&#x65B9;&#x3002; &#x6BCF;&#x4E2A;&#x8F93;&#x51FA;&#x6D4B;&#x91CF;&#x56FE;&#x50CF;&#x5C5E;&#x4E8E;&#x7279;&#x5B9A;&#x6570;&#x5B57;&#x7C7B;&#x522B;&#x7684;&#x591A;&#x5C11;&#x3002; &#x4EA4;&#x53C9;&#x71B5;&#x635F;&#x5931;&#x51FD;&#x6570;&#x73B0;&#x5728;&#x662F;&#x9996;&#x9009;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x66F4;&#x591A;&#x5730;&#x60E9;&#x7F5A;&#x4E0D;&#x597D;&#x7684;&#x9884;&#x6D4B;&#xFF0C;&#x4EA7;&#x751F;&#x66F4;&#x5927;&#x7684;&#x68AF;&#x5EA6;&#xFF0C;&#x4ECE;&#x800C;&#x66F4;&#x5FEB;&#x5730;&#x6536;&#x655B;&#x3002;</li>
</ul>
<p>Yann LeCun &#x7684;&#x7F51;&#x7AD9;&#xFF08;&#x201C;LENET&#x201D;&#x90E8;&#x5206;&#xFF09;&#x5C55;&#x793A;&#x4E86; LeNet-5 &#x5206;&#x7C7B;&#x6570;&#x5B57;&#x7684;&#x5F88;&#x597D;&#x7684;&#x6F14;&#x793A;&#x3002;</p>
<h2 id="alexnet">AlexNet</h2>
<p>&#x200B;AlexNet CNN &#x67B6;&#x6784;&#x8D62;&#x5F97;&#x4E86; 2012 &#x5E74;&#x7684; ImageNet ILSVRC &#x6311;&#x6218;&#x8D5B;&#xFF1A;&#x5B83;&#x8FBE;&#x5230;&#x4E86; 17% &#x7684; top-5 &#x7684;&#x9519;&#x8BEF;&#x7387;&#xFF0C;&#x800C;&#x7B2C;&#x4E8C;&#x540D;&#x9519;&#x8BEF;&#x7387;&#x53EA;&#x6709; 26%&#xFF01; &#x5B83;&#x7531; Alex Krizhevsky&#xFF08;&#x56E0;&#x6B64;&#x800C;&#x5F97;&#x540D;&#xFF09;&#xFF0C;Ilya Sutskever &#x548C; Geoffrey Hinton &#x5F00;&#x53D1;&#x3002; &#x5B83;&#x4E0E; LeNet-5 &#x975E;&#x5E38;&#x76F8;&#x4F3C;&#xFF0C;&#x53EA;&#x662F;&#x66F4;&#x5927;&#x66F4;&#x6DF1;&#xFF0C;&#x5B83;&#x662F;&#x7B2C;&#x4E00;&#x4E2A;&#x5C06;&#x5377;&#x79EF;&#x5C42;&#x76F4;&#x63A5;&#x5806;&#x53E0;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5728;&#x6BCF;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x9876;&#x90E8;&#x5806;&#x53E0;&#x4E00;&#x4E2A;&#x6C60;&#x5316;&#x5C42;&#x3002; &#x8868; 13-2 &#x4ECB;&#x7ECD;&#x4E86;&#x8FD9;&#x79CD;&#x67B6;&#x6784;&#x3002;</p>
<p><img src="../images/chapter_13/t-13-2.png" alt=""></p>
<p>&#x200B;&#x4E3A;&#x4E86;&#x51CF;&#x5C11;&#x8FC7;&#x62DF;&#x5408;&#xFF0C;&#x4F5C;&#x8005;&#x4F7F;&#x7528;&#x4E86;&#x524D;&#x9762;&#x7AE0;&#x8282;&#x4E2D;&#x8BA8;&#x8BBA;&#x7684;&#x4E24;&#x79CD;&#x6B63;&#x5219;&#x5316;&#x6280;&#x672F;&#xFF1A;&#x9996;&#x5148;&#x4ED6;&#x4EEC;&#x5728;&#x8BAD;&#x7EC3;&#x671F;&#x95F4;&#x5C06;&#x4E22;&#x5931;&#x7387;&#xFF08;dropout &#x7387;&#x4E3A; 50%&#xFF09;&#x5E94;&#x7528;&#x4E8E;&#x5C42; F8 &#x548C; F9 &#x7684;&#x8F93;&#x51FA;&#x3002;&#x5176;&#x6B21;&#xFF0C;&#x4ED6;&#x4EEC;&#x901A;&#x8FC7;&#x968F;&#x673A;&#x5BF9;&#x8BAD;&#x7EC3;&#x56FE;&#x50CF;&#x8FDB;&#x884C;&#x5404;&#x79CD;&#x504F;&#x79FB;&#xFF0C;&#x6C34;&#x5E73;&#x7FFB;&#x8F6C;&#x548C;&#x6539;&#x53D8;&#x7167;&#x660E;&#x6761;&#x4EF6;&#x6765;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x589E;&#x5F3A;&#x3002;</p>
<p>&#x200B;AlexNet &#x8FD8;&#x5728;&#x5C42; C1 &#x548C; C3 &#x7684; ReLU &#x6B65;&#x9AA4;&#x4E4B;&#x540E;&#x7ACB;&#x5373;&#x4F7F;&#x7528;&#x7ADE;&#x4E89;&#x6807;&#x51C6;&#x5316;&#x6B65;&#x9AA4;&#xFF0C;&#x79F0;&#x4E3A;&#x5C40;&#x90E8;&#x54CD;&#x5E94;&#x6807;&#x51C6;&#x5316;&#xFF08;local response normalization&#xFF09;&#x3002; &#x8FD9;&#x79CD;&#x6807;&#x51C6;&#x5316;&#x5F62;&#x5F0F;&#x4F7F;&#x5F97;&#x5728;&#x76F8;&#x540C;&#x7684;&#x4F4D;&#x7F6E;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x88AB;&#x6700;&#x5F3A;&#x70C8;&#x7684;&#x6FC0;&#x6D3B;&#x4F46;&#x662F;&#x5728;&#x76F8;&#x90BB;&#x7684;&#x7279;&#x5F81;&#x6620;&#x5C04;&#x4E2D;&#x6291;&#x5236;&#x795E;&#x7ECF;&#x5143;&#xFF08;&#x5728;&#x751F;&#x7269;&#x795E;&#x7ECF;&#x5143;&#x4E2D;&#x89C2;&#x5BDF;&#x5230;&#x4E86;&#x8FD9;&#x79CD;&#x7ADE;&#x4E89;&#x6FC0;&#x6D3B;&#xFF09;&#x3002; &#x8FD9;&#x9F13;&#x52B1;&#x4E0D;&#x540C;&#x7684;&#x7279;&#x5F81;&#x6620;&#x5C04;&#x7279;&#x6B8A;&#x5316;&#xFF0C;&#x8FEB;&#x4F7F;&#x5B83;&#x4EEC;&#x5206;&#x5F00;&#xFF0C;&#x5E76;&#x8BA9;&#x4ED6;&#x4EEC;&#x63A2;&#x7D22;&#x66F4;&#x5E7F;&#x6CDB;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x6700;&#x7EC8;&#x63D0;&#x5347;&#x6CDB;&#x5316;&#x80FD;&#x529B;&#x3002; &#x516C;&#x5F0F; 13-2 &#x663E;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x5E94;&#x7528; LRN&#x3002;</p>
<p><img src="../images/chapter_13/e-13-2.png" alt=""></p>
<ul>
<li><img src="../images/chapter_13/o-13-22.png" alt=""> &#x662F;&#x4F4D;&#x4E8E;&#x7279;&#x5F81;&#x6620;&#x5C04;<code>i</code>&#x7684;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x6807;&#x51C6;&#x5316;&#x8F93;&#x51FA;&#xFF0C;&#x5728;&#x67D0;&#x884C;<code>u</code>&#x548C;&#x5217;<code>v</code>&#xFF08;&#x6CE8;&#x610F;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x7B49;&#x5F0F;&#x4E2D;&#x6211;&#x4EEC;&#x53EA;&#x8003;&#x8651;&#x4F4D;&#x4E8E;&#x8FD9;&#x4E2A;&#x884C;&#x548C;&#x5217;&#x7684;&#x795E;&#x7ECF;&#x5143;&#xFF0C;&#x6240;&#x4EE5;<code>u</code>&#x548C;<code>v</code>&#x6CA1;&#x6709;&#x663E;&#x793A;&#xFF09;&#x3002;</li>
<li><img src="../images/chapter_13/o-13-23.png" alt=""> &#x662F;&#x5728; ReLU &#x6B65;&#x9AA4;&#x4E4B;&#x540E;&#xFF0C;&#x4F46;&#x5728;&#x5F52;&#x4E00;&#x5316;&#x4E4B;&#x524D;&#x7684;&#x90A3;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x6FC0;&#x6D3B;&#x3002;</li>
<li><code>k</code>&#xFF0C;<code>&#x3B1;</code>&#xFF0C;<code>&#x3B2;</code>&#x548C;<code>r</code>&#x662F;&#x8D85;&#x53C2;&#x6570;&#x3002; <code>k</code>&#x79F0;&#x4E3A;&#x504F;&#x7F6E;&#xFF0C;<code>r</code>&#x79F0;&#x4E3A;&#x6DF1;&#x5EA6;&#x534A;&#x5F84;&#x3002;</li>
<li><img src="../images/chapter_13/o-13-24.png" alt=""> &#x662F;&#x7279;&#x5F81;&#x6620;&#x5C04;&#x7684;&#x6570;&#x91CF;&#x3002;</li>
</ul>
<p>&#x200B;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;<code>r = 2</code>&#x4E14;&#x795E;&#x7ECF;&#x5143;&#x5177;&#x6709;&#x5F3A;&#x6FC0;&#x6D3B;&#xFF0C;&#x5219;&#x5C06;&#x6291;&#x5236;&#x4F4D;&#x4E8E;&#x5176;&#x4E0A;&#x4E0B;&#x7684;&#x7279;&#x5F81;&#x6620;&#x5C04;&#x4E2D;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x6FC0;&#x6D3B;&#x3002;</p>
<p>&#x200B;&#x5728; AlexNet &#x4E2D;&#xFF0C;&#x8D85;&#x53C2;&#x6570;&#x8BBE;&#x7F6E;&#x5982;&#x4E0B;&#xFF1A;<code>r = 2</code>&#xFF0C;<code>&#x3B1;= 0.00002</code>&#xFF0C;<code>&#x3B2;= 0.75</code>&#xFF0C;<code>k = 1</code>&#x3002;&#x8FD9;&#x4E2A;&#x6B65;&#x9AA4;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; TensorFlow &#x7684;<code>local_response_normalization()</code>&#x64CD;&#x4F5C;&#x6765;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x200B;AlexNet &#x7684;&#x4E00;&#x4E2A;&#x540D;&#x4E3A; ZF Net &#x7684;&#x53D8;&#x4F53;&#x7531; Matthew Zeiler &#x548C; Rob Fergus &#x5F00;&#x53D1;&#xFF0C;&#x8D62;&#x5F97;&#x4E86; 2013 &#x5E74; ILSVRC &#x7684;&#x6311;&#x6218;&#x3002; &#x5B83;&#x57FA;&#x672C;&#x4E0A;&#x662F; AlexNet &#x7684;&#x4E00;&#x4E9B;&#x8C03;&#x6574;&#x7684;&#x8D85;&#x53C2;&#x6570;&#xFF08;&#x7279;&#x5F81;&#x6620;&#x5C04;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x5185;&#x6838;&#x5927;&#x5C0F;&#xFF0C;&#x6B65;&#x5E45;&#x7B49;&#xFF09;&#x3002;</p>
<h2 id="googlenet">GoogLeNet</h2>
<p>&#x200B;GoogLeNet &#x67B6;&#x6784;&#x662F;&#x7531; Christian Szegedy &#x7B49;&#x4EBA;&#x5F00;&#x53D1;&#x7684;&#x3002; &#x6765;&#x81EA; Google Research&#xFF0C;&#x901A;&#x8FC7;&#x4F4E;&#x4E8E; 7% &#x7684; top-5 &#x9519;&#x8BEF;&#x7387;&#xFF0C;&#x8D62;&#x5F97;&#x4E86; ILSVRC 2014 &#x7684;&#x6311;&#x6218;&#x8D5B;&#x3002; &#x8FD9;&#x4E2A;&#x4F1F;&#x5927;&#x7684;&#x8868;&#x73B0;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x56E0;&#x4E3A;&#x5B83;&#x6BD4;&#x4EE5;&#x524D;&#x7684; CNN &#x7F51;&#x7EDC;&#x66F4;&#x6DF1;&#xFF08;&#x89C1;&#x56FE; 13-11&#xFF09;&#x3002; &#x8FD9;&#x662F;&#x901A;&#x8FC7;&#x79F0;&#x4E3A;&#x521D;&#x59CB;&#x6A21;&#x5757;&#xFF08;inception modules&#xFF09;&#x7684;&#x5B50;&#x7F51;&#x7EDC;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97; GoogLeNet &#x6BD4;&#x4EE5;&#x524D;&#x7684;&#x67B6;&#x6784;&#x66F4;&#x6709;&#x6548;&#x5730;&#x4F7F;&#x7528;&#x53C2;&#x6570;&#xFF1A;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;GoogLeNet &#x7684;&#x53C2;&#x6570;&#x6BD4; AlexNet &#x5C11;&#x4E86; 10 &#x500D;&#xFF08;&#x7EA6; 600 &#x4E07;&#x800C;&#x4E0D;&#x662F; 6000 &#x4E07;&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_13/13-10.png" alt=""></p>
<p>&#x200B;&#x521D;&#x59CB;&#x6A21;&#x5757;&#x7684;&#x67B6;&#x6784;&#x5982;&#x56FE; 13-10 &#x6240;&#x793A;&#x3002; &#x7B26;&#x53F7;<code>3&#xD7;3 + 2(S)</code>&#x8868;&#x793A;&#x8BE5;&#x5C42;&#x4F7F;&#x7528;<code>3&#xD7;3</code>&#x5185;&#x6838;&#xFF0C;&#x6B65;&#x5E45; 2 &#x548C;<code>SAME</code>&#x586B;&#x5145;&#x3002; &#x8F93;&#x5165;&#x4FE1;&#x53F7;&#x9996;&#x5148;&#x88AB;&#x590D;&#x5236;&#x5E76;&#x9988;&#x9001;&#x5230;&#x56DB;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x5C42;&#x3002; &#x6240;&#x6709;&#x5377;&#x79EF;&#x5C42;&#x90FD;&#x4F7F;&#x7528; ReLU &#x6FC0;&#x6D3B;&#x529F;&#x80FD;&#x3002; &#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x7B2C;&#x4E8C;&#x7EC4;&#x5377;&#x79EF;&#x5C42;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x5185;&#x6838;&#x5927;&#x5C0F;&#xFF08;<code>1&#xD7;1</code>&#xFF0C;<code>3&#xD7;3</code>&#x548C;<code>5&#xD7;5</code>&#xFF09;&#xFF0C;&#x5141;&#x8BB8;&#x5B83;&#x4EEC;&#x4EE5;&#x4E0D;&#x540C;&#x7684;&#x6BD4;&#x4F8B;&#x6355;&#x83B7;&#x56FE;&#x6848;&#x3002; &#x8FD8;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x6BCF;&#x4E00;&#x5C42;&#x90FD;&#x4F7F;&#x7528;&#x4E86;&#x8DE8;&#x5EA6;&#x4E3A;1&#x548C;SAME&#x586B;&#x5145;&#x7684;&#xFF08;&#x5373;&#x4F7F;&#x662F;&#x6700;&#x5927;&#x7684;&#x6C60;&#x5316;&#x5C42;&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x4EEC;&#x7684;&#x8F93;&#x51FA;&#x5168;&#x90FD;&#x5177;&#x6709;&#x4E0E;&#x5176;&#x8F93;&#x5165;&#x76F8;&#x540C;&#x7684;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#x3002;&#x8FD9;&#x4F7F;&#x5F97;&#x5C06;&#x6240;&#x6709;&#x8F93;&#x51FA;&#x5728;&#x6700;&#x540E;&#x7684;&#x6DF1;&#x5EA6;&#x8FDE;&#x63A5;&#x5C42;&#xFF08;depth concat layer&#xFF09;&#x4E0A;&#x6CBF;&#x7740;&#x6DF1;&#x5EA6;&#x65B9;&#x5411;&#x5806;&#x53E0;&#x6210;&#x4E3A;&#x53EF;&#x80FD;&#xFF08;&#x5373;&#xFF0C;&#x5806;&#x53E0;&#x6765;&#x81EA;&#x6240;&#x6709;&#x56DB;&#x4E2A;&#x9876;&#x90E8;&#x5377;&#x79EF;&#x5C42;&#x7684;&#x7279;&#x5F81;&#x6620;&#x5C04;&#xFF09;&#x3002; &#x8FD9;&#x4E2A;&#x8FDE;&#x63A5;&#x5C42;&#x53EF;&#x4EE5;&#x5728; TensorFlow &#x4E2D;&#x4F7F;&#x7528;<code>concat()</code>&#x64CD;&#x4F5C;&#x5B9E;&#x73B0;&#xFF0C;&#x5176;&#x4E2D;<code>axis = 3</code>&#xFF08;&#x8F74; 3 &#x662F;&#x6DF1;&#x5EA6;&#xFF09;&#x3002;</p>
<p>&#x200B;&#x60A8;&#x53EF;&#x80FD;&#x60F3;&#x77E5;&#x9053;&#x4E3A;&#x4EC0;&#x4E48;&#x521D;&#x59CB;&#x6A21;&#x5757;&#x5177;&#x6709;<code>1&#xD7;1</code>&#x5185;&#x6838;&#x7684;&#x5377;&#x79EF;&#x5C42;&#x3002; &#x5F53;&#x7136;&#x8FD9;&#x4E9B;&#x56FE;&#x5C42;&#x4E0D;&#x80FD;&#x6355;&#x83B7;&#x4EFB;&#x4F55;&#x529F;&#x80FD;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x4E00;&#x6B21;&#x53EA;&#x80FD;&#x770B;&#x4E00;&#x4E2A;&#x50CF;&#x7D20;&#xFF1F; &#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x8FD9;&#x4E9B;&#x5C42;&#x6B21;&#x6709;&#x4E24;&#x4E2A;&#x76EE;&#x7684;&#xFF1A;</p>
<p>&#x200B;&#x9996;&#x5148;&#xFF0C;&#x5B83;&#x4EEC;&#x88AB;&#x914D;&#x7F6E;&#x4E3A;&#x8F93;&#x51FA;&#x6BD4;&#x8F93;&#x5165;&#x5C11;&#x5F97;&#x591A;&#x7684;&#x7279;&#x5F81;&#x6620;&#x5C04;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x4EEC;&#x4F5C;&#x4E3A;&#x74F6;&#x9888;&#x5C42;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x5B83;&#x4EEC;&#x964D;&#x4F4E;&#x4E86;&#x7EF4;&#x5EA6;&#x3002; &#x5728;<code>3&#xD7;3</code>&#x548C;<code>5&#xD7;5</code>&#x5377;&#x79EF;&#x4E4B;&#x524D;&#xFF0C;&#x8FD9;&#x662F;&#x7279;&#x522B;&#x6709;&#x7528;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x5728;&#x8BA1;&#x7B97;&#x4E0A;&#x662F;&#x975E;&#x5E38;&#x8017;&#x8D39;&#x5185;&#x5B58;&#x7684;&#x5C42;&#x3002;</p>
<p>&#x200B;&#x5176;&#x6B21;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x5BF9;&#xFF08;<code>[1 &#xD7; 1, 3 &#xD7; 3]</code>&#x548C;<code>[1 &#xD7; 1, 5 &#xD7; 5]</code>&#x8868;&#x73B0;&#x5730;&#x50CF;&#x4E00;&#x4E2A;&#x5F3A;&#x5927;&#x7684;&#x5377;&#x79EF;&#x5C42;&#xFF0C;&#x53EF;&#x4EE5;&#x6355;&#x6349;&#x5230;&#x66F4;&#x591A;&#x7684;&#x590D;&#x6742;&#x7684;&#x6A21;&#x5F0F;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x8FD9;&#x4E00;&#x5BF9;&#x5377;&#x79EF;&#x5C42;&#x4E0D;&#x662F;&#x5728;&#x56FE;&#x50CF;&#x4E0A;&#x626B;&#x8FC7;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x7EBF;&#x6027;&#x5206;&#x7C7B;&#x5668;&#xFF08;&#x5C31;&#x50CF;&#x5355;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x4E00;&#x6837;&#xFF09;&#xFF0C;&#x800C;&#x662F;&#x5728;&#x56FE;&#x50CF;&#x4E0A;&#x626B;&#x63CF;&#x4E00;&#x4E2A;&#x53CC;&#x5C42;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;</p>
<p>&#x200B;&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5C06;&#x6574;&#x4E2A;&#x521D;&#x59CB;&#x6A21;&#x5757;&#x89C6;&#x4E3A;&#x7C7B;&#x56FA;&#x9187;&#x5377;&#x79EF;&#x5C42;&#xFF0C;&#x80FD;&#x591F;&#x8F93;&#x51FA;&#x6355;&#x6349;&#x5404;&#x79CD;&#x5C3A;&#x5EA6;&#x590D;&#x6742;&#x6A21;&#x5F0F;&#x7684;&#x7279;&#x5F81;&#x6620;&#x5C04;&#x3002;</p>
<p>&#x200B;<strong>&#x6BCF;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x7684;&#x5377;&#x79EF;&#x6838;&#x7684;&#x6570;&#x91CF;&#x662F;&#x4E00;&#x4E2A;&#x8D85;&#x53C2;&#x6570;&#x3002; &#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4F60;&#x6709;&#x516D;&#x4E2A;&#x8D85;&#x53C2;&#x6570;&#x6765;&#x8C03;&#x6574;&#x4F60;&#x6DFB;&#x52A0;&#x7684;&#x6BCF;&#x4E2A;&#x521D;&#x59CB;&#x5C42;&#x3002;</strong></p>
<p><img src="../images/chapter_13/13-11.png" alt=""></p>
<p>&#x200B;&#x73B0;&#x5728;&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B; GoogLeNet CNN &#x7684;&#x67B6;&#x6784;&#xFF08;&#x89C1;&#x56FE; 13-11&#xFF09;&#x3002; &#x5B83;&#x975E;&#x5E38;&#x6DF1;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x5F97;&#x4E0D;&#x5C06;&#x5B83;&#x5206;&#x6210;&#x4E09;&#x5217;&#xFF0C;&#x4F46;&#x662F; GoogLeNet &#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x4E00;&#x5217;&#xFF0C;&#x5305;&#x62EC;&#x4E5D;&#x4E2A;&#x521D;&#x59CB;&#x6A21;&#x5757;&#xFF08;&#x5E26;&#x6709;&#x65CB;&#x8F6C;&#x9876;&#x7AEF;&#x7684;&#x6846;&#xFF09;&#xFF0C;&#x6BCF;&#x4E2A;&#x6A21;&#x5757;&#x5B9E;&#x9645;&#x4E0A;&#x5305;&#x542B;&#x4E09;&#x5C42;&#x3002;&#x6BCF;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x548C;&#x6C60;&#x5316;&#x5C42;&#x8F93;&#x51FA;&#x7684;&#x7279;&#x5F81;&#x6620;&#x5C04;&#x7684;&#x6570;&#x91CF;&#x663E;&#x793A;&#x5728;&#x5185;&#x6838;&#x5927;&#x5C0F;&#x524D;&#x3002; &#x521D;&#x59CB;&#x6A21;&#x5757;&#x4E2D;&#x7684;&#x516D;&#x4E2A;&#x6570;&#x5B57;&#x8868;&#x793A;&#x6A21;&#x5757;&#x4E2D;&#x6BCF;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x8F93;&#x51FA;&#x7684;&#x7279;&#x5F81;&#x6620;&#x5C04;&#x7684;&#x6570;&#x91CF;&#xFF08;&#x4E0E;&#x56FE; 13-10 &#x4E2D;&#x7684;&#x987A;&#x5E8F;&#x76F8;&#x540C;&#xFF09;&#x3002; &#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x5377;&#x79EF;&#x5C42;&#x90FD;&#x4F7F;&#x7528; ReLU &#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x8FC7;&#x4E00;&#x904D;&#x8FD9;&#x4E2A;&#x7F51;&#x7EDC;&#xFF1A;</p>
<ul>
<li>&#x524D;&#x4E24;&#x5C42;&#x5C06;&#x56FE;&#x50CF;&#x7684;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#x9664;&#x4EE5; 4&#xFF08;&#x4F7F;&#x5176;&#x9762;&#x79EF;&#x9664;&#x4EE5; 16&#xFF09;&#xFF0C;&#x4EE5;&#x51CF;&#x5C11;&#x8BA1;&#x7B97;&#x8D1F;&#x62C5;&#x3002;</li>
<li>&#x7136;&#x540E;&#xFF0C;&#x5C40;&#x90E8;&#x54CD;&#x5E94;&#x6807;&#x51C6;&#x5316;&#x5C42;&#x786E;&#x4FDD;&#x524D;&#x9762;&#x7684;&#x5C42;&#x5B66;&#x4E60;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x529F;&#x80FD;&#xFF08;&#x5982;&#x524D;&#x6240;&#x8FF0;&#xFF09;</li>
<li>&#x63A5;&#x4E0B;&#x6765;&#x662F;&#x4E24;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#xFF0C;&#x5176;&#x4E2D;&#x7B2C;&#x4E00;&#x4E2A;&#x50CF;&#x74F6;&#x9888;&#x5C42;&#x4E00;&#x6837;&#x3002; &#x6B63;&#x5982;&#x524D;&#x9762;&#x6240;&#x89E3;&#x91CA;&#x7684;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x8FD9;&#x4E00;&#x5BF9;&#x770B;&#x4F5C;&#x662F;&#x4E00;&#x4E2A;&#x5355;&#x4E00;&#x7684;&#x66F4;&#x667A;&#x80FD;&#x7684;&#x5377;&#x79EF;&#x5C42;&#x3002;</li>
<li>&#x518D;&#x6B21;&#xFF0C;&#x5C40;&#x90E8;&#x54CD;&#x5E94;&#x6807;&#x51C6;&#x5316;&#x5C42;&#x786E;&#x4FDD;&#x4E86;&#x5148;&#x524D;&#x7684;&#x5C42;&#x6355;&#x6349;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x6A21;&#x5F0F;&#x3002;</li>
<li>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6700;&#x5927;&#x6C60;&#x5316;&#x5C42;&#x5C06;&#x56FE;&#x50CF;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#x51CF;&#x5C11; 2&#xFF0C;&#x518D;&#x6B21;&#x52A0;&#x5FEB;&#x8BA1;&#x7B97;&#x901F;&#x5EA6;&#x3002;</li>
<li>&#x7136;&#x540E;&#x662F;&#x4E5D;&#x4E2A;&#x521D;&#x59CB;&#x6A21;&#x5757;&#x7684;&#x5806;&#x53E0;&#xFF0C;&#x4E0E;&#x51E0;&#x4E2A;&#x6700;&#x5927;&#x6C60;&#x5C42;&#x4EA4;&#x7EC7;&#xFF0C;&#x4EE5;&#x964D;&#x4F4E;&#x7EF4;&#x5EA6;&#x5E76;&#x52A0;&#x901F;&#x7F51;&#x7EDC;&#x3002;</li>
<li>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x5E73;&#x5747;&#x6C60;&#x5316;&#x5C42;&#x4F7F;&#x7528;&#x5177;&#x6709;<code>VALID</code>&#x586B;&#x5145;&#x7684;&#x7279;&#x5F81;&#x6620;&#x5C04;&#x7684;&#x5927;&#x5C0F;&#x7684;&#x5185;&#x6838;&#xFF0C;&#x8F93;&#x51FA;<code>1&#xD7;1</code>&#x7279;&#x5F81;&#x6620;&#x5C04;&#xFF1A;&#x8FD9;&#x79CD;&#x4EE4;&#x4EBA;&#x60CA;&#x8BB6;&#x7684;&#x7B56;&#x7565;&#x88AB;&#x79F0;&#x4E3A;&#x5168;&#x5C40;&#x5E73;&#x5747;&#x6C60;&#x5316;&#x3002; &#x5B83;&#x6709;&#x6548;&#x5730;&#x5F3A;&#x5236;&#x4EE5;&#x524D;&#x7684;&#x56FE;&#x5C42;&#x4EA7;&#x751F;&#x7279;&#x5F81;&#x6620;&#x5C04;&#xFF0C;&#x8FD9;&#x4E9B;&#x7279;&#x5F81;&#x6620;&#x5C04;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x6BCF;&#x4E2A;&#x76EE;&#x6807;&#x7C7B;&#x7684;&#x7F6E;&#x4FE1;&#x56FE;&#xFF08;&#x56E0;&#x4E3A;&#x5176;&#x4ED6;&#x7C7B;&#x578B;&#x7684;&#x529F;&#x80FD;&#x5C06;&#x88AB;&#x5E73;&#x5747;&#x6B65;&#x9AA4;&#x7834;&#x574F;&#xFF09;&#x3002; &#x8FD9;&#x6837;&#x5728; CNN &#x7684;&#x9876;&#x90E8;&#x5C31;&#x4E0D;&#x5FC5;&#x6709;&#x6709;&#x51E0;&#x4E2A;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#xFF08;&#x5982; AlexNet&#xFF09;&#xFF0C;&#x5927;&#x5927;&#x51CF;&#x5C11;&#x4E86;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x53C2;&#x6570;&#x6570;&#x91CF;&#xFF0C;&#x5E76;&#x51CF;&#x5C11;&#x4E86;&#x4E86;&#x8FC7;&#x5EA6;&#x62DF;&#x5408;&#x7684;&#x98CE;&#x9669;&#x3002;</li>
<li>&#x6700;&#x540E;&#x4E00;&#x5C42;&#x662F;&#x4E0D;&#x8A00;&#x81EA;&#x660E;&#x7684;&#xFF1A;&#x6B63;&#x5219;&#x5316; drop out&#xFF0C;&#x7136;&#x540E;&#x662F;&#x5177;&#x6709; softmax &#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x7684;&#x5B8C;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x6765;&#x8F93;&#x51FA;&#x4F30;&#x8BA1;&#x7C7B;&#x7684;&#x6982;&#x7387;&#x3002;</li>
</ul>
<p>&#x200B;&#x8FD9;&#x4E2A;&#x56FE;&#x7565;&#x6709;&#x7B80;&#x5316;&#xFF1A;&#x539F;&#x6765;&#x7684; GoogLeNet &#x67B6;&#x6784;&#x8FD8;&#x5305;&#x62EC;&#x4E24;&#x4E2A;&#x63D2;&#x5728;&#x7B2C;&#x4E09;&#x548C;&#x7B2C;&#x516D;&#x4E2A;&#x521D;&#x59CB;&#x6A21;&#x5757;&#x4E4B;&#x4E0A;&#x7684;&#x8F85;&#x52A9;&#x5206;&#x7C7B;&#x5668;&#x3002; &#x5B83;&#x4EEC;&#x90FD;&#x7531;&#x4E00;&#x4E2A;&#x5E73;&#x5747;&#x6C60;&#x5C42;&#xFF0C;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#xFF0C;&#x4E24;&#x4E2A;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x548C;&#x4E00;&#x4E2A; softmax &#x6FC0;&#x6D3B;&#x5C42;&#x7EC4;&#x6210;&#x3002; &#x5728;&#x8BAD;&#x7EC3;&#x671F;&#x95F4;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x635F;&#x5931;&#xFF08;&#x7F29;&#x5C0F;&#x4E86; 70%&#xFF09;&#x52A0;&#x5728;&#x4E86;&#x6574;&#x4F53;&#x635F;&#x5931;&#x4E0A;&#x3002; &#x76EE;&#x6807;&#x662F;&#x89E3;&#x51B3;&#x6D88;&#x5931;&#x68AF;&#x5EA6;&#x95EE;&#x9898;&#xFF0C;&#x6B63;&#x5219;&#x5316;&#x7F51;&#x7EDC;&#x3002; &#x4F46;&#x662F;&#xFF0C;&#x7ED3;&#x679C;&#x663E;&#x793A;&#x5176;&#x6548;&#x679C;&#x76F8;&#x5BF9;&#x5C0F;&#x3002;</p>
<h2 id="resnet"><strong>ResNet</strong></h2>
<p>&#x200B;&#x6700;&#x540E;&#x662F;&#xFF0C;2015 &#x5E74; ILSVRC &#x6311;&#x6218;&#x8D5B;&#x7684;&#x8D62;&#x5BB6; Kaiming He &#x7B49;&#x4EBA;&#x5F00;&#x53D1;&#x7684; Residual Network&#xFF08;&#x6216; ResNet&#xFF09;&#xFF0C;&#x8BE5;&#x7F51;&#x7EDC;&#x7684; top-5 &#x8BEF;&#x7387;&#x4F4E;&#x5230;&#x60CA;&#x4EBA;&#x7684; 3.6%&#xFF0C;&#x5B83;&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x6DF1;&#x7684; CNN&#xFF0C;&#x7531; 152 &#x5C42;&#x7EC4;&#x6210;&#x3002; &#x80FD;&#x591F;&#x8BAD;&#x7EC3;&#x5982;&#x6B64;&#x6DF1;&#x7684;&#x7F51;&#x7EDC;&#x7684;&#x5173;&#x952E;&#x662F;&#x4F7F;&#x7528;&#x8DF3;&#x8FC7;&#x8FDE;&#x63A5;&#xFF08;skip connection&#xFF0C;&#x4E5F;&#x79F0;&#x4E3A;&#x5FEB;&#x6377;&#x8FDE;&#x63A5;&#xFF09;&#xFF1A;&#x4E00;&#x4E2A;&#x5C42;&#x7684;&#x8F93;&#x5165;&#x4FE1;&#x53F7;&#x4E5F;&#x88AB;&#x6DFB;&#x52A0;&#x5230;&#x4F4D;&#x4E8E;&#x4E0B;&#x4E00;&#x5C42;&#x7684;&#x8F93;&#x51FA;&#x3002; &#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x662F;&#x6709;&#x7528;&#x7684;&#x3002;</p>
<p>&#x200B;&#x5F53;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x65F6;&#xFF0C;&#x76EE;&#x6807;&#x662F;&#x4F7F;&#x5176;&#x6A21;&#x62DF;&#x4E00;&#x4E2A;&#x76EE;&#x6807;&#x51FD;&#x6570;<code>h(x)</code>&#x3002; &#x5982;&#x679C;&#x5C06;&#x8F93;&#x5165;x&#x6DFB;&#x52A0;&#x5230;&#x7F51;&#x7EDC;&#x7684;&#x8F93;&#x51FA;&#x4E2D;&#xFF08;&#x5373;&#x6DFB;&#x52A0;&#x8DF3;&#x8FC7;&#x8FDE;&#x63A5;&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x7F51;&#x7EDC;&#x5C06;&#x88AB;&#x8FEB;&#x6A21;&#x62DF;<code>f(x)= h(x) - x</code>&#x800C;&#x4E0D;&#x662F;<code>h(x)</code>&#x3002; &#x8FD9;&#x88AB;&#x79F0;&#x4E3A;&#x6B8B;&#x7559;&#x5B66;&#x4E60;&#xFF08;&#x89C1;&#x56FE; 13-12&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_13/13-12.png" alt=""></p>
<p>&#x200B;&#x5F53;&#x4F60;&#x521D;&#x59CB;&#x5316;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x65F6;&#xFF0C;&#x5B83;&#x7684;&#x6743;&#x91CD;&#x63A5;&#x8FD1;&#x4E8E;&#x96F6;&#xFF0C;&#x6240;&#x4EE5;&#x7F51;&#x7EDC;&#x53EA;&#x8F93;&#x51FA;&#x63A5;&#x8FD1;&#x96F6;&#x7684;&#x503C;&#x3002; &#x5982;&#x679C;&#x6DFB;&#x52A0;&#x8DF3;&#x8FC7;&#x8FDE;&#x63A5;&#xFF0C;&#x5219;&#x751F;&#x6210;&#x7684;&#x7F51;&#x7EDC;&#x53EA;&#x8F93;&#x51FA;&#x5176;&#x8F93;&#x5165;&#x7684;&#x526F;&#x672C;; &#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5B83;&#x6700;&#x521D;&#x5BF9;&#x8EAB;&#x4EFD;&#x51FD;&#x6570;&#x8FDB;&#x884C;&#x5EFA;&#x6A21;&#x3002; &#x5982;&#x679C;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x4E0E;&#x8EAB;&#x4EFD;&#x51FD;&#x6570;&#x975E;&#x5E38;&#x63A5;&#x8FD1;&#xFF08;&#x5E38;&#x5E38;&#x662F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF09;&#xFF0C;&#x8FD9;&#x5C06;&#x5927;&#x5927;&#x52A0;&#x5FEB;&#x8BAD;&#x7EC3;&#x901F;&#x5EA6;&#x3002;</p>
<p>&#x200B;&#x800C;&#x4E14;&#xFF0C;&#x5982;&#x679C;&#x6DFB;&#x52A0;&#x4E86;&#x8BB8;&#x591A;&#x8DF3;&#x8F6C;&#x8FDE;&#x63A5;&#xFF0C;&#x5373;&#x4F7F;&#x51E0;&#x4E2A;&#x5C42;&#x8FD8;&#x6CA1;&#x6709;&#x5F00;&#x59CB;&#x5B66;&#x4E60;&#xFF0C;&#x7F51;&#x7EDC;&#x4E5F;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x8FDB;&#x884C;&#xFF08;&#x89C1;&#x56FE; 13-13&#xFF09;&#x3002; &#x7531;&#x4E8E;&#x8DF3;&#x8FC7;&#x8FDE;&#x63A5;&#xFF0C;&#x4FE1;&#x53F7;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x901A;&#x8FC7;&#x6574;&#x4E2A;&#x7F51;&#x7EDC;&#x3002; &#x6DF1;&#x5EA6;&#x5269;&#x4F59;&#x7F51;&#x7EDC;&#x53EF;&#x4EE5;&#x770B;&#x4F5C;&#x662F;&#x4E00;&#x5806;&#x5269;&#x4F59;&#x5355;&#x4F4D;&#xFF0C;&#x5176;&#x4E2D;&#x6BCF;&#x4E2A;&#x5269;&#x4F59;&#x5355;&#x4F4D;&#x662F;&#x4E00;&#x4E2A;&#x6709;&#x8DF3;&#x8FC7;&#x8FDE;&#x63A5;&#x7684;&#x5C0F;&#x578B;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;</p>
<p><img src="../images/chapter_13/13-13.png" alt=""></p>
<p>&#x200B;&#x73B0;&#x5728;&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x770B; ResNet &#x7684;&#x67B6;&#x6784;&#xFF08;&#x89C1;&#x56FE; 13-14&#xFF09;&#x3002; &#x8FD9;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x4EE4;&#x4EBA;&#x60CA;&#x8BB6;&#x7684;&#x7B80;&#x5355;&#x3002; &#x5B83;&#x7684;&#x5F00;&#x59CB;&#x548C;&#x7ED3;&#x675F;&#x4E0E;GoogLeNet&#x5B8C;&#x5168;&#x4E00;&#x6837;&#xFF08;&#x9664;&#x4E86;&#x6CA1;&#x6709; dropout &#x5C42;&#xFF09;&#xFF0C;&#x800C;&#x5728;&#x4E24;&#x8005;&#x4E4B;&#x95F4;&#x53EA;&#x662F;&#x4E00;&#x5806;&#x5F88;&#x7B80;&#x5355;&#x7684;&#x6B8B;&#x4F59;&#x5355;&#x4F4D;&#x3002; &#x6BCF;&#x4E2A;&#x6B8B;&#x5DEE;&#x5355;&#x5143;&#x7531;&#x4E24;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x7EC4;&#x6210;&#xFF0C;&#x4F7F;&#x7528;<code>3&#xD7;3</code>&#x7684;&#x5185;&#x6838;&#x548C;&#x4FDD;&#x5B58;&#x7A7A;&#x95F4;&#x7EF4;&#x5EA6;&#xFF08;&#x6B65;&#x5E45; 1&#xFF0C;<code>SAME</code>&#x586B;&#x5145;&#xFF09;&#xFF0C;&#x6279;&#x91CF;&#x5F52;&#x4E00;&#x5316;&#xFF08;BN&#xFF09;&#x548C; ReLU &#x6FC0;&#x6D3B;&#x3002;</p>
<p><img src="../images/chapter_13/13-14.png" alt=""></p>
<p>&#x200B;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#x7279;&#x5F81;&#x6620;&#x5C04;&#x7684;&#x6570;&#x91CF;&#x6BCF;&#x9694;&#x51E0;&#x4E2A;&#x6B8B;&#x5DEE;&#x5355;&#x4F4D;&#x4F1A;&#x52A0;&#x500D;&#xFF0C;&#x540C;&#x65F6;&#x5B83;&#x4EEC;&#x7684;&#x9AD8;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#x51CF;&#x534A;&#xFF08;&#x4F7F;&#x7528;&#x6B65;&#x5E45; 2 &#x5377;&#x79EF;&#x5C42;&#xFF09;&#x3002; &#x53D1;&#x751F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x65F6;&#xFF0C;&#x8F93;&#x5165;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x6DFB;&#x52A0;&#x5230;&#x5269;&#x4F59;&#x5355;&#x5143;&#x7684;&#x8F93;&#x51FA;&#x4E2D;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x4E0D;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7684;&#x5F62;&#x72B6;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x6B64;&#x95EE;&#x9898;&#x5F71;&#x54CD;&#x56FE; 13-14 &#x4E2D;&#x7684;&#x865A;&#x7EBF;&#x7BAD;&#x5934;&#x8868;&#x793A;&#x7684;&#x8DF3;&#x8FC7;&#x8FDE;&#x63A5;&#xFF09;&#x3002; &#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x8F93;&#x5165;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;<code>1&#xD7;1</code>&#x5377;&#x79EF;&#x5C42;&#xFF0C;&#x6B65;&#x957F;2&#x548C;&#x6B63;&#x786E;&#x6570;&#x91CF;&#x7684;&#x8F93;&#x51FA;&#x7279;&#x5F81;&#x6620;&#x5C04;&#xFF08;&#x89C1;&#x56FE; 13-15&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_13/13-15.png" alt=""></p>
<p>&#x200B;ResNet-34 &#x662F;&#x5177;&#x6709; 34 &#x4E2A;&#x5C42;&#xFF08;&#x4EC5;&#x8BA1;&#x7B97;&#x5377;&#x79EF;&#x5C42;&#x548C;&#x5B8C;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#xFF09;&#x7684; ResNet&#xFF0C;&#x5305;&#x542B; 3 &#x4E2A;&#x5269;&#x4F59;&#x5355;&#x5143;&#x8F93;&#x51FA; 64 &#x4E2A;&#x7279;&#x5F81;&#x6620;&#x5C04;&#xFF0C;4 &#x4E2A;&#x5269;&#x4F59;&#x5355;&#x5143;&#x8F93;&#x51FA; 128 &#x4E2A;&#x7279;&#x5F81;&#x6620;&#x5C04;&#xFF0C;6 &#x4E2A;&#x5269;&#x4F59;&#x5355;&#x5143;&#x8F93;&#x51FA; 256 &#x4E2A;&#x7279;&#x5F81;&#x6620;&#x5C04;&#xFF0C;3 &#x4E2A;&#x5269;&#x4F59;&#x5355;&#x5143;&#x8F93;&#x51FA; 512 &#x4E2A;&#x7279;&#x5F81;&#x6620;&#x5C04;&#x3002;</p>
<p>&#x200B;ResNet-152 &#x66F4;&#x6DF1;&#xFF0C;&#x4F7F;&#x7528;&#x7A0D;&#x5FAE;&#x4E0D;&#x540C;&#x7684;&#x5269;&#x4F59;&#x5355;&#x4F4D;&#x3002; &#x4ED6;&#x4EEC;&#x4F7F;&#x7528;&#x4E09;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E24;&#x4E2A; 256 &#x4E2A;&#x7279;&#x5F81;&#x6620;&#x5C04;&#x7684;<code>3&#xD7;3</code>&#x7684;&#x5377;&#x79EF;&#x5C42;&#xFF0C;&#x5B83;&#x4EEC;&#x4F7F;&#x7528;&#x4E09;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#xFF1A;&#x7B2C;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x53EA;&#x6709; 64 &#x4E2A;&#x7279;&#x5F81;&#x6620;&#x5C04;&#xFF08;&#x5C11; 4 &#x500D;&#xFF09;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x74F6;&#x9888;&#x5C42;&#xFF08;&#x5DF2;&#x7ECF;&#x8BA8;&#x8BBA;&#x8FC7;&#xFF09; &#xFF0C;&#x7136;&#x540E;&#x662F;&#x5177;&#x6709; 64 &#x4E2A;&#x7279;&#x5F81;&#x6620;&#x5C04;&#x7684;<code>3&#xD7;3</code>&#x5C42;&#xFF0C;&#x6700;&#x540E;&#x662F;&#x5177;&#x6709; 256 &#x4E2A;&#x7279;&#x5F81;&#x6620;&#x5C04;&#xFF08;<code>4&#xD7;64</code>&#xFF09;&#x7684;&#x53E6;&#x4E00;&#x4E2A;<code>1&#xD7;1</code>&#x5377;&#x79EF;&#x5C42;&#xFF0C;&#x4EE5;&#x6062;&#x590D;&#x539F;&#x59CB;&#x6DF1;&#x5EA6;&#x3002;ResNet-152 &#x5305;&#x542B;&#x4E09;&#x4E2A;&#x8FD9;&#x6837;&#x7684;&#x5269;&#x4F59;&#x5355;&#x4F4D;&#xFF0C;&#x8F93;&#x51FA; 256 &#x4E2A;&#x7279;&#x5F81;&#x6620;&#x5C04;&#xFF0C;&#x7136;&#x540E;&#x662F; 8 &#x4E2A;&#x5269;&#x4F59;&#x5355;&#x4F4D;&#xFF0C;&#x8F93;&#x51FA; 512 &#x4E2A;&#x7279;&#x5F81;&#x6620;&#x5C04;&#xFF0C;&#x9AD8;&#x8FBE; 36 &#x4E2A;&#x5269;&#x4F59;&#x5355;&#x4F4D;&#xFF0C;&#x8F93;&#x51FA; 1024 &#x4E2A;&#x7279;&#x5F81;&#x6620;&#x5C04;&#xFF0C;&#x6700;&#x540E;&#x662F; 3 &#x4E2A;&#x5269;&#x4F59;&#x5355;&#x4F4D;&#xFF0C;&#x8F93;&#x51FA; 2048 &#x4E2A;&#x7279;&#x5F81;&#x6620;&#x5C04;&#x3002;</p>
<p>&#x200B;&#x6B63;&#x5982;&#x4F60;&#x6240;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x8FD9;&#x4E2A;&#x9886;&#x57DF;&#x6B63;&#x5728;&#x8FC5;&#x901F;&#x53D1;&#x5C55;&#xFF0C;&#x6BCF;&#x5E74;&#x90FD;&#x4F1A;&#x6709;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x67B6;&#x6784;&#x51FA;&#x73B0;&#x3002; &#x4E00;&#x4E2A;&#x660E;&#x663E;&#x7684;&#x8D8B;&#x52BF;&#x662F; CNN &#x8D8A;&#x6765;&#x8D8A;&#x6DF1;&#x5165;&#x3002; &#x4ED6;&#x4EEC;&#x4E5F;&#x8D8A;&#x6765;&#x8D8A;&#x8F7B;&#x91CF;&#xFF0C;&#x9700;&#x8981;&#x8D8A;&#x6765;&#x8D8A;&#x5C11;&#x7684;&#x53C2;&#x6570;&#x3002; &#x76EE;&#x524D;&#xFF0C;ResNet &#x67B6;&#x6784;&#x65E2;&#x662F;&#x6700;&#x5F3A;&#x5927;&#x7684;&#xFF0C;&#x4E5F;&#x662F;&#x6700;&#x7B80;&#x5355;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x73B0;&#x5728;&#x5E94;&#x8BE5;&#x662F;&#x4F60;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x6BCF;&#x5E74;&#x90FD;&#x8981;&#x7EE7;&#x7EED;&#x5173;&#x6CE8; ILSVRC &#x7684;&#x6311;&#x6218;&#x3002; 2016 &#x5E74;&#x83B7;&#x5956;&#x8005;&#x662F;&#x6765;&#x81EA;&#x4E2D;&#x56FD;&#x7684; Trimps-Soushen &#x56E2;&#x961F;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x51FA;&#x9519;&#x7387;&#x60CA;&#x4EBA;&#x7684;&#x7F29;&#x51CF;&#x5230; 2.99%&#x3002; &#x4E3A;&#x4E86;&#x8FBE;&#x5230;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#xFF0C;&#x4ED6;&#x4EEC;&#x8BAD;&#x7EC3;&#x4E86;&#x4EE5;&#x524D;&#x6A21;&#x578B;&#x7684;&#x7EC4;&#x5408;&#xFF0C;&#x5E76;&#x5C06;&#x5B83;&#x4EEC;&#x5408;&#x5E76;&#x4E3A;&#x4E00;&#x4E2A;&#x6574;&#x4F53;&#x3002; &#x6839;&#x636E;&#x4EFB;&#x52A1;&#x7684;&#x4E0D;&#x540C;&#xFF0C;&#x964D;&#x4F4E;&#x7684;&#x9519;&#x8BEF;&#x7387;&#x53EF;&#x80FD;&#x4F1A;&#x6216;&#x53EF;&#x80FD;&#x4E0D;&#x503C;&#x5F97;&#x989D;&#x5916;&#x7684;&#x590D;&#x6742;&#x6027;&#x3002;</p>
<p>&#x200B;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x4E00;&#x4E9B;&#x67B6;&#x6784;&#x53EF;&#x4F9B;&#x60A8;&#x53C2;&#x8003;&#xFF0C;&#x7279;&#x522B;&#x662F; VGGNet&#xFF08;2014 &#x5E74; ILSVRC &#x6311;&#x6218;&#x8D5B;&#x7684;&#x4E9A;&#x519B;&#xFF09;&#x548C; Inception-v4&#xFF08;&#x5C06; GooLeNet &#x548C; ResNet &#x7684;&#x601D;&#x60F3;&#x878D;&#x5408;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x5B9E;&#x73B0;&#x4E86;&#x63A5;&#x8FD1; 3% &#x7684; top-5 &#x8BEF;&#x5DEE; ImageNet &#x5206;&#x7C7B;&#x7387;&#xFF09;&#x3002;</p>
<p>&#x200B;&#x5B9E;&#x65BD;&#x6211;&#x4EEC;&#x521A;&#x521A;&#x8BA8;&#x8BBA;&#x7684;&#x5404;&#x79CD;CNN&#x67B6;&#x6784;&#x771F;&#x7684;&#x6CA1;&#x4EC0;&#x4E48;&#x7279;&#x522B;&#x7684;&#x3002; &#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x770B;&#x5230;&#x5982;&#x4F55;&#x6784;&#x5EFA;&#x6240;&#x6709;&#x7684;&#x72EC;&#x7ACB;&#x6784;&#x5EFA;&#x6A21;&#x5757;&#xFF0C;&#x6240;&#x4EE5;&#x73B0;&#x5728;&#x60A8;&#x53EA;&#x9700;&#x8981;&#x7EC4;&#x88C5;&#x5B83;&#x4EEC;&#x6765;&#x521B;&#x5EFA;&#x6240;&#x9700;&#x7684;&#x6784;&#x67B6;&#x3002; &#x6211;&#x4EEC;&#x5C06;&#x5728;&#x5373;&#x5C06;&#x5F00;&#x59CB;&#x7684;&#x7EC3;&#x4E60;&#x4E2D;&#x6784;&#x5EFA; ResNet-34&#xFF0C;&#x60A8;&#x5C06;&#x5728; Jupyter &#x7B14;&#x8BB0;&#x672C;&#x4E2D;&#x627E;&#x5230;&#x5B8C;&#x6574;&#x7684;&#x5DE5;&#x4F5C;&#x4EE3;&#x7801;&#x3002;</p>
<h2 id="tensorflow-&#x5377;&#x79EF;&#x64CD;&#x4F5C;">TensorFlow &#x5377;&#x79EF;&#x64CD;&#x4F5C;</h2>
<p>TensorFlow &#x8FD8;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E9B;&#x5176;&#x4ED6;&#x7C7B;&#x578B;&#x7684;&#x5377;&#x79EF;&#x5C42;&#xFF1A;</p>
<ul>
<li><code>conv1d()</code>&#x4E3A; 1D &#x8F93;&#x5165;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x5904;&#x7406;&#x4E2D;&#x8FD9;&#x662F;&#x6709;&#x7528;&#x7684;&#xFF0C;&#x5176;&#x4E2D;&#x53E5;&#x5B50;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x4E3A;&#x4E00;&#x7EF4;&#x5355;&#x8BCD;&#x9635;&#x5217;&#xFF0C;&#x5E76;&#x4E14;&#x63A5;&#x53D7;&#x573A;&#x8986;&#x76D6;&#x4E00;&#x4E9B;&#x90BB;&#x8FD1;&#x5355;&#x8BCD;&#x3002;</li>
<li><code>conv3d()</code>&#x521B;&#x5EFA;&#x4E00;&#x4E2A; 3D &#x8F93;&#x5165;&#x7684;&#x5377;&#x79EF;&#x5C42;&#xFF0C;&#x5982; 3D PET &#x626B;&#x63CF;&#x3002;</li>
<li><code>atrous_conv2d()</code>&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A; atrous &#x5377;&#x79EF;&#x5C42;&#xFF08;&#x201C;&#xE0;trous&#x201D;&#x662F;&#x6CD5;&#x8BED;&#x201C;with holes&#x201D;&#xFF09;&#x3002; &#x8FD9;&#x76F8;&#x5F53;&#x4E8E;&#x4F7F;&#x7528;&#x5177;&#x6709;&#x901A;&#x8FC7;&#x63D2;&#x5165;&#x884C;&#x548C;&#x5217;&#xFF08;&#x5373;&#xFF0C;&#x5B54;&#xFF09;&#x800C;&#x6269;&#x5927;&#x7684;&#x5377;&#x79EF;&#x6838;&#x7684;&#x666E;&#x901A;&#x5377;&#x79EF;&#x5C42;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x7B49;&#x4E8E;<code>[[1,2,3]]</code>&#x7684;<code>1&#xD7;3</code>&#x5377;&#x79EF;&#x6838;&#x53EF;&#x4EE5;&#x4EE5;4&#x7684;&#x6269;&#x5F20;&#x7387;&#x6269;&#x5F20;&#xFF0C;&#x5BFC;&#x81F4;&#x6269;&#x5F20;&#x7684;&#x5377;&#x79EF;&#x6838;<code>[[1,0,0,0,2,0,0,0,3]]</code>&#x3002; &#x8FD9;&#x4F7F;&#x5F97;&#x5377;&#x79EF;&#x5C42;&#x5728;&#x6CA1;&#x6709;&#x8BA1;&#x7B97;&#x4EF7;&#x683C;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5177;&#x6709;&#x66F4;&#x5927;&#x7684;&#x5C40;&#x90E8;&#x611F;&#x53D7;&#x91CE;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x4F7F;&#x7528;&#x989D;&#x5916;&#x7684;&#x53C2;&#x6570;&#x3002;</li>
<li><code>conv2d_transpose()</code>&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x8F6C;&#x7F6E;&#x5377;&#x79EF;&#x5C42;&#xFF0C;&#x6709;&#x65F6;&#x79F0;&#x4E3A;&#x53BB;&#x5377;&#x79EF;&#x5C42;&#xFF0C;&#x5B83;&#x5BF9;&#x56FE;&#x50CF;&#x8FDB;&#x884C;&#x4E0A;&#x91C7;&#x6837;&#xFF08;&#x8FD9;&#x4E2A;&#x540D;&#x79F0;&#x662F;&#x975E;&#x5E38;&#x5177;&#x6709;&#x8BEF;&#x5BFC;&#x6027;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x5C42;&#x5E76;&#x4E0D;&#x6267;&#x884C;&#x53BB;&#x5377;&#x79EF;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5B9A;&#x4E49;&#x826F;&#x597D;&#x7684;&#x6570;&#x5B66;&#x8FD0;&#x7B97;&#xFF08;&#x5377;&#x79EF;&#x7684;&#x9006;&#xFF09;&#xFF09; &#x3002;&#x8FD9;&#x662F;&#x901A;&#x8FC7;&#x5728;&#x8F93;&#x5165;&#x4E4B;&#x95F4;&#x63D2;&#x5165;&#x96F6;&#x6765;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x5B83;&#x770B;&#x4F5C;&#x662F;&#x4E00;&#x4E2A;&#x4F7F;&#x7528;&#x5206;&#x6570;&#x6B65;&#x957F;&#x7684;&#x666E;&#x901A;&#x5377;&#x79EF;&#x5C42;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x56FE;&#x50CF;&#x5206;&#x5272;&#x4E2D;&#xFF0C;&#x4E0A;&#x91C7;&#x6837;&#x662F;&#x6709;&#x7528;&#x7684;&#xFF1A;&#x5728;&#x5178;&#x578B;&#x7684;CNN&#x4E2D;&#xFF0C;&#x7279;&#x5F81;&#x6620;&#x5C04;&#x8D8A;&#x6765;&#x8D8A;&#x5C0F;&#x5F53;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x65F6;&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8F93;&#x51FA;&#x4E00;&#x4E2A;&#x4E0E;&#x8F93;&#x5165;&#x5927;&#x5C0F;&#x76F8;&#x540C;&#x7684;&#x56FE;&#x50CF;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x4E0A;&#x91C7;&#x6837;&#x5C42;&#x3002;</li>
<li><code>depthwise_conv2d()</code>&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6DF1;&#x5EA6;&#x5377;&#x79EF;&#x5C42;&#xFF0C;&#x5C06;&#x6BCF;&#x4E2A;&#x5377;&#x79EF;&#x6838;&#x72EC;&#x7ACB;&#x5E94;&#x7528;&#x4E8E;&#x6BCF;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x8F93;&#x5165;&#x901A;&#x9053;&#x3002; &#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x6709;<code>fn</code>&#x5377;&#x79EF;&#x6838;&#x548C;<code>fn&apos;</code>&#x8F93;&#x5165;&#x901A;&#x9053;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x5C06;&#x8F93;&#x51FA;<code>fn&#xD7;fn&apos;</code>&#x7279;&#x5F81;&#x6620;&#x5C04;&#x3002;</li>
<li><code>separable_conv2d()</code>&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x53EF;&#x5206;&#x79BB;&#x7684;&#x5377;&#x79EF;&#x5C42;&#xFF0C;&#x9996;&#x5148;&#x50CF;&#x6DF1;&#x5EA6;&#x5377;&#x79EF;&#x5C42;&#x4E00;&#x6837;&#x5DE5;&#x4F5C;&#xFF0C;&#x7136;&#x540E;&#x5C06;<code>1&#xD7;1</code>&#x5377;&#x79EF;&#x5C42;&#x5E94;&#x7528;&#x4E8E;&#x7ED3;&#x679C;&#x7279;&#x5F81;&#x6620;&#x5C04;&#x3002; &#x8FD9;&#x4F7F;&#x5F97;&#x53EF;&#x4EE5;&#x5C06;&#x5377;&#x79EF;&#x6838;&#x5E94;&#x7528;&#x4E8E;&#x4EFB;&#x610F;&#x7684;&#x8F93;&#x5165;&#x901A;&#x9053;&#x7EC4;&#x3002;</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="12.设备和服务器上的分布式_TensorFlow.html" class="navigation navigation-prev " aria-label="Previous page: 十二、设备和服务器上的分布式 TensorFlow">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="14.循环神经网络.html" class="navigation navigation-next " aria-label="Next page: 十四、循环神经网络">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"十三、卷积神经网络","level":"1.15","depth":1,"next":{"title":"十四、循环神经网络","level":"1.16","depth":1,"path":"docs/14.循环神经网络.md","ref":"docs/14.循环神经网络.md","articles":[]},"previous":{"title":"十二、设备和服务器上的分布式 TensorFlow","level":"1.14","depth":1,"path":"docs/12.设备和服务器上的分布式_TensorFlow.md","ref":"docs/12.设备和服务器上的分布式_TensorFlow.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"docs/13.卷积神经网络.md","mtime":"2019-04-18T03:01:37.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-05-07T09:41:36.357Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

