
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>十四、循环神经网络 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="15.自编码器.html" />
    
    
    <link rel="prev" href="13.卷积神经网络.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Sklearn 与 TensorFlow 机器学习实用指南
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="0.前言.html">
            
                <a href="0.前言.html">
            
                    
                    零、前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="1.机器学习概览.html">
            
                <a href="1.机器学习概览.html">
            
                    
                    一、机器学习概览
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="2.一个完整的机器学习项目.html">
            
                <a href="2.一个完整的机器学习项目.html">
            
                    
                    二、一个完整的机器学习项目
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="3.分类.html">
            
                <a href="3.分类.html">
            
                    
                    三、分类
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="4.训练模型.html">
            
                <a href="4.训练模型.html">
            
                    
                    四、训练模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="5.支持向量机.html">
            
                <a href="5.支持向量机.html">
            
                    
                    五、支持向量机
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="6.决策树.html">
            
                <a href="6.决策树.html">
            
                    
                    六、决策树
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="7.集成学习和随机森林.html">
            
                <a href="7.集成学习和随机森林.html">
            
                    
                    七、集成学习和随机森林
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="8.降维.html">
            
                <a href="8.降维.html">
            
                    
                    八、降维
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="9.启动并运行_TensorFlow.html">
            
                <a href="9.启动并运行_TensorFlow.html">
            
                    
                    九、启动并运行 TensorFlow
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="10.人工神经网络介绍.html">
            
                <a href="10.人工神经网络介绍.html">
            
                    
                    十、人工神经网络介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="11.训练深层神经网络.html">
            
                <a href="11.训练深层神经网络.html">
            
                    
                    十一、训练深层神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="12.设备和服务器上的分布式_TensorFlow.html">
            
                <a href="12.设备和服务器上的分布式_TensorFlow.html">
            
                    
                    十二、设备和服务器上的分布式 TensorFlow
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="13.卷积神经网络.html">
            
                <a href="13.卷积神经网络.html">
            
                    
                    十三、卷积神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.16" data-path="14.循环神经网络.html">
            
                <a href="14.循环神经网络.html">
            
                    
                    十四、循环神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="15.自编码器.html">
            
                <a href="15.自编码器.html">
            
                    
                    十五、自编码器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="16.强化学习.html">
            
                <a href="16.强化学习.html">
            
                    
                    十六、强化学习
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="B.机器学习项目清单.html">
            
                <a href="B.机器学习项目清单.html">
            
                    
                    附录 B、机器学习项目清单
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="C.SVM_对偶问题.html">
            
                <a href="C.SVM_对偶问题.html">
            
                    
                    附录 C、SVM 对偶问题
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="D.自动微分.html">
            
                <a href="D.自动微分.html">
            
                    
                    附录 D、自动微分
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >十四、循环神经网络</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x5341;&#x56DB;&#x3001;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;">&#x5341;&#x56DB;&#x3001;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;</h1>
<blockquote>
<p>&#x8BD1;&#x8005;&#xFF1A;<a href="https://github.com/wangxupeng" target="_blank">@akonwang</a>&#x3001;<a href="https://github.com/alexcheen" target="_blank">@alexcheen</a>&#x3001;<a href="https://github.com/wizardforcel" target="_blank">@&#x98DE;&#x9F99;</a></p>
<p>&#x6821;&#x5BF9;&#x8005;&#xFF1A;<a href="https://github.com/wizardforcel" target="_blank">@&#x98DE;&#x9F99;</a></p>
</blockquote>
<p>&#x51FB;&#x7403;&#x624B;&#x51FB;&#x51FA;&#x5792;&#x7403;&#xFF0C;&#x4F60;&#x4F1A;&#x5F00;&#x59CB;&#x9884;&#x6D4B;&#x7403;&#x7684;&#x8F68;&#x8FF9;&#x5E76;&#x7ACB;&#x5373;&#x5F00;&#x59CB;&#x5954;&#x8DD1;&#x3002;&#x4F60;&#x8FFD;&#x8E2A;&#x7740;&#x5B83;&#xFF0C;&#x4E0D;&#x65AD;&#x8C03;&#x6574;&#x4F60;&#x7684;&#x79FB;&#x52A8;&#x6B65;&#x4F10;&#xFF0C;&#x6700;&#x7EC8;&#x5728;&#x89C2;&#x4F17;&#x7684;&#x4E00;&#x7247;&#x96F7;&#x9E23;&#x58F0;&#x4E2D;&#x6293;&#x5230;&#x5B83;&#x3002;&#x65E0;&#x8BBA;&#x662F;&#x5728;&#x542C;&#x5B8C;&#x670B;&#x53CB;&#x7684;&#x8BDD;&#x8BED;&#x8FD8;&#x662F;&#x65E9;&#x9910;&#x65F6;&#x9884;&#x6D4B;&#x5496;&#x5561;&#x7684;&#x5473;&#x9053;&#xFF0C;&#x4F60;&#x65F6;&#x523B;&#x5728;&#x505A;&#x7684;&#x4E8B;&#x5C31;&#x662F;&#x5728;&#x9884;&#x6D4B;&#x672A;&#x6765;&#x3002;&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8BA8;&#x8BBA;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC; -- &#x4E00;&#x7C7B;&#x9884;&#x6D4B;&#x672A;&#x6765;&#x7684;&#x7F51;&#x7EDC;&#xFF08;&#x5F53;&#x7136;&#xFF0C;&#x662F;&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF09;&#x3002;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x5206;&#x6790;&#x65F6;&#x95F4;&#x5E8F;&#x5217;&#x6570;&#x636E;&#xFF0C;&#x8BF8;&#x5982;&#x80A1;&#x7968;&#x4EF7;&#x683C;&#xFF0C;&#x5E76;&#x544A;&#x8BC9;&#x4F60;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x4E70;&#x5165;&#x548C;&#x5356;&#x51FA;&#x3002;&#x5728;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x9884;&#x6D4B;&#x884C;&#x8F66;&#x8F68;&#x8FF9;&#xFF0C;&#x907F;&#x514D;&#x53D1;&#x751F;&#x4EA4;&#x901A;&#x610F;&#x5916;&#x3002;&#x66F4;&#x4E00;&#x822C;&#x5730;&#x8BF4;&#xFF0C;&#x5B83;&#x4EEC;&#x53EF;&#x5728;&#x4EFB;&#x610F;&#x957F;&#x5EA6;&#x7684;&#x5E8F;&#x5217;&#x4E0A;&#x5DE5;&#x4F5C;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x622A;&#x6B62;&#x76EE;&#x524D;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x7684;&#x53EA;&#x80FD;&#x5728;&#x56FA;&#x5B9A;&#x957F;&#x5EA6;&#x7684;&#x8F93;&#x5165;&#x4E0A;&#x5DE5;&#x4F5C;&#x7684;&#x7F51;&#x7EDC;&#x3002;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x628A;&#x8BED;&#x53E5;&#xFF0C;&#x6587;&#x4EF6;&#xFF0C;&#x4EE5;&#x53CA;&#x8BED;&#x97F3;&#x8303;&#x672C;&#x4F5C;&#x4E3A;&#x8F93;&#x5165;&#xFF0C;&#x4F7F;&#x5F97;&#x5B83;&#x4EEC;&#x5728;&#x8BF8;&#x5982;&#x81EA;&#x52A8;&#x7FFB;&#x8BD1;&#xFF0C;&#x8BED;&#x97F3;&#x5230;&#x6587;&#x672C;&#x6216;&#x8005;&#x60C5;&#x611F;&#x5206;&#x6790;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x8BFB;&#x53D6;&#x7535;&#x5F71;&#x8BC4;&#x8BBA;&#x5E76;&#x63D0;&#x53D6;&#x8BC4;&#x8BBA;&#x8005;&#x5173;&#x4E8E;&#x8BE5;&#x7535;&#x5F71;&#x7684;&#x611F;&#x89C9;&#xFF09;&#x7684;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x5904;&#x7406;&#x7CFB;&#x7EDF;&#x4E2D;&#x6781;&#x4E3A;&#x6709;&#x7528;&#x3002;</p>
<p>&#x66F4;&#x8FD1;&#x4E00;&#x6B65;&#xFF0C;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x9884;&#x6D4B;&#x80FD;&#x529B;&#x4F7F;&#x5F97;&#x5B83;&#x4EEC;&#x5177;&#x5907;&#x4EE4;&#x4EBA;&#x60CA;&#x8BB6;&#x7684;&#x521B;&#x9020;&#x529B;&#x3002;&#x4F60;&#x540C;&#x6837;&#x53EF;&#x4EE5;&#x8981;&#x6C42;&#x5B83;&#x4EEC;&#x53BB;&#x9884;&#x6D4B;&#x4E00;&#x6BB5;&#x65CB;&#x5F8B;&#x7684;&#x4E0B;&#x51E0;&#x4E2A;&#x97F3;&#x7B26;&#xFF0C;&#x7136;&#x540E;&#x968F;&#x673A;&#x9009;&#x53D6;&#x8FD9;&#x4E9B;&#x97F3;&#x7B26;&#x7684;&#x5176;&#x4E2D;&#x4E4B;&#x4E00;&#x5E76;&#x6F14;&#x594F;&#x5B83;&#x3002;&#x7136;&#x540E;&#x8981;&#x6C42;&#x7F51;&#x7EDC;&#x7ED9;&#x51FA;&#x63A5;&#x4E0B;&#x6765;&#x6700;&#x53EF;&#x80FD;&#x7684;&#x97F3;&#x7B26;&#xFF0C;&#x6F14;&#x594F;&#x5B83;&#xFF0C;&#x5982;&#x6B64;&#x5468;&#x800C;&#x590D;&#x59CB;&#x3002;&#x5728;&#x4F60;&#x77E5;&#x9053;&#x5B83;&#x4E4B;&#x524D;&#xFF0C;&#x4F60;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5C06;&#x521B;&#x4F5C;&#x4E00;&#x9996;&#x8BF8;&#x5982;&#x7531;&#x8C37;&#x6B4C; Magenta &#x5DE5;&#x7A0B;&#x6240;&#x521B;&#x9020;&#x7684;&#x300A;The one&#x300B;&#x7684;&#x6B4C;&#x66F2;&#x3002;&#x7C7B;&#x4F3C;&#x7684;&#xFF0C;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x53EF;&#x4EE5;&#x751F;&#x6210;&#x8BED;&#x53E5;&#xFF0C;&#x56FE;&#x50CF;&#x6807;&#x6CE8;&#x4EE5;&#x53CA;&#x66F4;&#x591A;&#x3002;&#x76EE;&#x524D;&#x7ED3;&#x679C;&#x8FD8;&#x4E0D;&#x80FD;&#x51C6;&#x786E;&#x5F97;&#x5230;&#x838E;&#x58EB;&#x6BD4;&#x4E9A;&#x6216;&#x8005;&#x83AB;&#x624E;&#x7279;&#x7684;&#x4F5C;&#x54C1;&#xFF0C;&#x4F46;&#x8C01;&#x77E5;&#x9053;&#x51E0;&#x5E74;&#x540E;&#x4ED6;&#x4EEC;&#x80FD;&#x751F;&#x6210;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;</p>
<p>&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x5230;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x80CC;&#x540E;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#xFF0C;&#x4ED6;&#x4EEC;&#x6240;&#x9762;&#x4E34;&#x7684;&#x4E3B;&#x8981;&#x95EE;&#x9898;&#xFF08;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5728;&#x7B2C;11&#x7AE0;&#x4E2D;&#x8BA8;&#x8BBA;&#x7684;&#x6D88;&#x5931;&#xFF0F;&#x7206;&#x70B8;&#x7684;&#x68AF;&#x5EA6;&#xFF09;&#xFF0C;&#x4EE5;&#x53CA;&#x5E7F;&#x6CDB;&#x7528;&#x4E8E;&#x53CD;&#x6297;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x6CD5;&#xFF1A;LSTM &#x548C; GRU cell&#xFF08;&#x5355;&#x5143;&#xFF09;&#x3002;&#x5982;&#x540C;&#x4EE5;&#x5F80;&#xFF0C;&#x6CBF;&#x7740;&#x8FD9;&#x4E2A;&#x65B9;&#x5F0F;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5C55;&#x793A;&#x5982;&#x4F55;&#x7528; TensorFlow &#x5B9E;&#x73B0;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;&#x6700;&#x7EC8;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x770B;&#x53CA;&#x5176;&#x7FFB;&#x8BD1;&#x7CFB;&#x7EDF;&#x7684;&#x67B6;&#x6784;&#x3002;</p>
<h2 id="&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x5143;">&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x5143;</h2>
<p>&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x6211;&#x4EEC;&#x4E3B;&#x8981;&#x5173;&#x6CE8;&#x7684;&#x662F;&#x524D;&#x9988;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x5176;&#x4E2D;&#x6FC0;&#x6D3B;&#x4EC5;&#x4ECE;&#x8F93;&#x5165;&#x5C42;&#x5230;&#x8F93;&#x51FA;&#x5C42;&#x7684;&#x4E00;&#x4E2A;&#x65B9;&#x5411;&#x6D41;&#x52A8;&#xFF08;&#x9644;&#x5F55; E &#x4E2D;&#x7684;&#x51E0;&#x4E2A;&#x7F51;&#x7EDC;&#x9664;&#x5916;&#xFF09;&#x3002; &#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x770B;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x50CF;&#x4E00;&#x4E2A;&#x524D;&#x9988;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x9664;&#x4E86;&#x5B83;&#x4E5F;&#x6709;&#x8FDE;&#x63A5;&#x6307;&#x5411;&#x540E;&#x65B9;&#x3002; &#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x4E00;&#x4E0B;&#x6700;&#x7B80;&#x5355;&#x7684; RNN&#xFF0C;&#x5B83;&#x7531;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x63A5;&#x6536;&#x8F93;&#x5165;&#xFF0C;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x8F93;&#x51FA;&#xFF0C;&#x5E76;&#x5C06;&#x8F93;&#x51FA;&#x53D1;&#x9001;&#x56DE;&#x81EA;&#x5DF1;&#xFF0C;&#x5982;&#x56FE; 14-1&#xFF08;&#x5DE6;&#xFF09;&#x6240;&#x793A;&#x3002; &#x5728;&#x6BCF;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;<code>t</code>&#xFF08;&#x4E5F;&#x79F0;&#x4E3A;&#x4E00;&#x4E2A;&#x5E27;&#xFF09;&#xFF0C;&#x8FD9;&#x4E2A;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x5143;&#x63A5;&#x6536;&#x8F93;&#x5165; <img src="../images/tex-df9ed87e836e463cd086106035aef441.gif" alt="x^{(t)}"> &#x4EE5;&#x53CA;&#x5B83;&#x81EA;&#x5DF1;&#x7684;&#x524D;&#x4E00;&#x65F6;&#x95F4;&#x6B65;&#x957F; <img src="../images/tex-9d51d9238bb54c1c9448b87d61b7503e.gif" alt="y^{(t-1)}"> &#x7684;&#x8F93;&#x51FA;&#x3002; &#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;&#x65F6;&#x95F4;&#x8F74;&#x6765;&#x8868;&#x793A;&#x8FD9;&#x4E2A;&#x5FAE;&#x5C0F;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x5982;&#x56FE; 14-1&#xFF08;&#x53F3;&#xFF09;&#x6240;&#x793A;&#x3002; &#x8FD9;&#x88AB;&#x79F0;&#x4E3A;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#x5C55;&#x5F00;&#x7F51;&#x7EDC;&#x3002;</p>
<p><img src="../images/chapter_14/14-1.png" alt=""></p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x5143;&#x5C42;&#x3002; &#x5728;&#x6BCF;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;t&#xFF0C;&#x6BCF;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x90FD;&#x63A5;&#x6536;&#x8F93;&#x5165;&#x5411;&#x91CF; <img src="../images/tex-df9ed87e836e463cd086106035aef441.gif" alt="x^{(t)}"> &#x548C;&#x524D;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6B65; <img src="../images/tex-9d51d9238bb54c1c9448b87d61b7503e.gif" alt="y^{(t-1)}"> &#x7684;&#x8F93;&#x51FA;&#x5411;&#x91CF;&#xFF0C;&#x5982;&#x56FE; 14-2 &#x6240;&#x793A;&#x3002; &#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x90FD;&#x662F;&#x5411;&#x91CF;&#xFF08;&#x5F53;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x65F6;&#xFF0C;&#x8F93;&#x51FA;&#x662F;&#x4E00;&#x4E2A;&#x6807;&#x91CF;&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_14/14-2.png" alt=""></p>
<p>&#x6BCF;&#x4E2A;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x5143;&#x6709;&#x4E24;&#x7EC4;&#x6743;&#x91CD;&#xFF1A;&#x4E00;&#x7EC4;&#x7528;&#x4E8E;&#x8F93;&#x5165; <img src="../images/tex-df9ed87e836e463cd086106035aef441.gif" alt="x^{(t)}">&#xFF0C;&#x53E6;&#x4E00;&#x7EC4;&#x7528;&#x4E8E;&#x524D;&#x4E00;&#x65F6;&#x95F4;&#x6B65;&#x957F; <img src="../images/tex-9d51d9238bb54c1c9448b87d61b7503e.gif" alt="y^{(t-1)}"> &#x7684;&#x8F93;&#x51FA;&#x3002; &#x6211;&#x4EEC;&#x79F0;&#x8FD9;&#x4E9B;&#x6743;&#x91CD;&#x5411;&#x91CF;&#x4E3A; <img src="../images/tex-4a5d1969fe1ef947082a32d547c247d7.gif" alt="w_x"> &#x548C; <img src="../images/tex-e939f0323d8d49a8482b30a5284c8374.gif" alt="w_y">&#x3002;&#x5982;&#x516C;&#x5F0F; 14-1 &#x6240;&#x793A;&#xFF08;<code>b</code>&#x662F;&#x504F;&#x5DEE;&#x9879;&#xFF0C;<code>&#x3C6;(&#xB7;)</code>&#x662F;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF0C;&#x4F8B;&#x5982; ReLU&#xFF09;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA1;&#x7B97;&#x5355;&#x4E2A;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x8F93;&#x51FA;&#x3002;</p>
<p><img src="../images/chapter_14/e-14-1.png" alt=""></p>
<p>&#x5C31;&#x50CF;&#x524D;&#x9988;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E00;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E0A;&#x4E00;&#x4E2A;&#x516C;&#x5F0F;&#x7684;&#x5411;&#x91CF;&#x5316;&#x5F62;&#x5F0F;&#xFF0C;&#x5BF9;&#x6574;&#x4E2A;&#x5C0F;&#x6279;&#x91CF;&#x8BA1;&#x7B97;&#x6574;&#x4E2A;&#x5C42;&#x7684;&#x8F93;&#x51FA;&#xFF08;&#x89C1;&#x516C;&#x5F0F; 14-2&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_14/e-14-2.png" alt=""></p>
<ul>
<li><img src="../images/tex-626343cb96bdf9ee8429b7d5d8f4607a.gif" alt="Y^{(t)}"> &#x662F; <img src="../images/tex-5034ed18fa4c81ee7bc176f0a4cbab80.gif" alt="m \times n_{neurons}"> &#x77E9;&#x9635;&#xFF0C;&#x5305;&#x542B;&#x5728;&#x6700;&#x5C0F;&#x6279;&#x6B21;&#x4E2D;&#x6BCF;&#x4E2A;&#x5B9E;&#x4F8B;&#x5728;&#x65F6;&#x95F4;&#x6B65;<code>t</code>&#x5904;&#x7684;&#x5C42;&#x8F93;&#x51FA;&#xFF08;<code>m</code>&#x662F;&#x5C0F;&#x6279;&#x6B21;&#x4E2D;&#x7684;&#x5B9E;&#x4F8B;&#x6570;&#xFF0C;<img src="../images/tex-e57673e94f4eeddd53be04f2167db8d2.gif" alt="n_{neurons}"> &#x662F;&#x795E;&#x7ECF;&#x5143;&#x6570;&#xFF09;&#x3002;</li>
<li><img src="../images/tex-56662b2579440b8c9f02e9c09b8b021d.gif" alt="X^{(t)}"> &#x662F; <img src="../images/tex-3550fe5e2cae185a9af7235e7f7fb05d.gif" alt="m \times n_{inputs}"> &#x77E9;&#x9635;&#xFF0C;&#x5305;&#x542B;&#x6240;&#x6709;&#x5B9E;&#x4F8B;&#x7684;&#x8F93;&#x5165;&#x7684; &#xFF08;<img src="../images/tex-53e90522ca559971bb2d9d6009b82a44.gif" alt="n_{inputs}"> &#x662F;&#x8F93;&#x5165;&#x7279;&#x5F81;&#x7684;&#x6570;&#x91CF;&#xFF09;&#x3002;</li>
<li><img src="../images/tex-6984549d7be7b4c4021c370c9411cef3.gif" alt="W_x"> &#x662F; <img src="../images/tex-7d4bb14b3b5f5073d69bb75df6665017.gif" alt="n_{inputs} \times n_{neurons}"> &#x77E9;&#x9635;&#xFF0C;&#x5305;&#x542B;&#x5F53;&#x524D;&#x65F6;&#x95F4;&#x6B65;&#x7684;&#x8F93;&#x5165;&#x7684;&#x8FDE;&#x63A5;&#x6743;&#x91CD;&#x7684;&#x3002;</li>
<li><img src="../images/tex-a1c5ef84a61f97159520c00e49a728a0.gif" alt="W_y"> &#x662F; <img src="../images/tex-66696a3ef544ca4201af088feb0b911b.gif" alt="n_{neurons} \times n_{neurons}"> &#x77E9;&#x9635;&#xFF0C;&#x5305;&#x542B;&#x4E0A;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#x7684;&#x8F93;&#x51FA;&#x7684;&#x8FDE;&#x63A5;&#x6743;&#x91CD;&#x3002;</li>
<li>&#x6743;&#x91CD;&#x77E9;&#x9635; <img src="../images/tex-6984549d7be7b4c4021c370c9411cef3.gif" alt="W_x"> &#x548C; <img src="../images/tex-a1c5ef84a61f97159520c00e49a728a0.gif" alt="W_y"> &#x901A;&#x5E38;&#x8FDE;&#x63A5;&#x6210;&#x5355;&#x4E2A;&#x6743;&#x91CD;&#x77E9;&#x9635;<code>W</code>&#xFF0C;&#x5F62;&#x72B6;&#x4E3A; <img src="../images/tex-92c270042098f9151bcc3e90407cf028.gif" alt="(n_{inputs}+n_{neurons}) \times n_{neurons}">&#xFF08;&#x89C1;&#x516C;&#x5F0F; 14-2 &#x7684;&#x7B2C;&#x4E8C;&#x884C;&#xFF09;</li>
<li><code>b</code>&#x662F;&#x5927;&#x5C0F;&#x4E3A; <img src="../images/tex-e57673e94f4eeddd53be04f2167db8d2.gif" alt="n_{neurons}"> &#x7684;&#x5411;&#x91CF;&#xFF0C;&#x5305;&#x542B;&#x6BCF;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x504F;&#x7F6E;&#x9879;&#x3002;</li>
</ul>
<p>&#x6CE8;&#x610F;&#xFF0C;<img src="../images/tex-626343cb96bdf9ee8429b7d5d8f4607a.gif" alt="Y^{(t)}"> &#x662F; <img src="../images/tex-56662b2579440b8c9f02e9c09b8b021d.gif" alt="X^{(t)}"> &#x548C; <img src="../images/tex-224150d7a099d199fc7bbb324fee9d18.gif" alt="Y^{(t-1)}"> &#x7684;&#x51FD;&#x6570;&#xFF0C;&#x5B83;&#x662F; <img src="../images/tex-f9a82354ca58947238d9ae8ae8cf1ec6.gif" alt="X^{(t-1)}"> &#x548C; <img src="../images/tex-fb0f62e49ab81bcdf5d79d2bf9542446.gif" alt="Y^{(t-2)}"> &#x7684;&#x51FD;&#x6570;&#xFF0C;&#x5B83;&#x662F; <img src="../images/tex-c4f2bbec4ec0a31260b87fef04ffb9fc.gif" alt="X^{(t-2)}"> &#x548C; <img src="../images/tex-4f717d5e747701b3301e39c21191ae17.gif" alt="Y^{(t-3)}"> &#x7684;&#x51FD;&#x6570;&#xFF0C;&#x7B49;&#x7B49;&#x3002; &#x8FD9;&#x4F7F;&#x5F97; <img src="../images/tex-626343cb96bdf9ee8429b7d5d8f4607a.gif" alt="Y^{(t)}"> &#x662F;&#x4ECE;&#x65F6;&#x95F4;<code>t = 0</code>&#x5F00;&#x59CB;&#x7684;&#x6240;&#x6709;&#x8F93;&#x5165;&#xFF08;&#x5373; <img src="../images/tex-091a36c336b9f86ac488b9e8ac0e0ffa.gif" alt="X^{(0)}">&#xFF0C;<img src="../images/tex-588e5b81fdcbbd6dd55e2195663fab41.gif" alt="X^{(1)}">&#xFF0C;...&#xFF0C;<img src="../images/tex-56662b2579440b8c9f02e9c09b8b021d.gif" alt="X^{(t)}">&#xFF09;&#x7684;&#x51FD;&#x6570;&#x3002; &#x5728;&#x7B2C;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#xFF0C;<code>t = 0</code>&#xFF0C;&#x6CA1;&#x6709;&#x4EE5;&#x524D;&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x4EEC;&#x901A;&#x5E38;&#x88AB;&#x5047;&#x5B9A;&#x4E3A;&#x5168;&#x96F6;&#x3002;</p>
<h2 id="&#x8BB0;&#x5FC6;&#x5355;&#x5143;">&#x8BB0;&#x5FC6;&#x5355;&#x5143;</h2>
<p>&#x7531;&#x4E8E;&#x65F6;&#x95F4;<code>t</code>&#x7684;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x662F;&#x7531;&#x6240;&#x6709;&#x5148;&#x524D;&#x65F6;&#x95F4;&#x6B65;&#x9AA4;&#x8BA1;&#x7B97;&#x51FA;&#x6765;&#x7684;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8BF4;&#x5B83;&#x6709;&#x4E00;&#x79CD;&#x8BB0;&#x5FC6;&#x5F62;&#x5F0F;&#x3002;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x8DE8;&#x8D8A;&#x65F6;&#x95F4;&#x6B65;&#x957F;&#x4FDD;&#x7559;&#x4E00;&#x4E9B;&#x72B6;&#x6001;&#xFF0C;&#x79F0;&#x4E3A;&#x5B58;&#x50A8;&#x5355;&#x5143;&#xFF08;&#x6216;&#x7B80;&#x79F0;&#x4E3A;&#x5355;&#x5143;&#xFF09;&#x3002;&#x5355;&#x4E2A;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x5143;&#x6216;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x5143;&#x5C42;&#x662F;&#x975E;&#x5E38;&#x57FA;&#x672C;&#x7684;&#x5355;&#x5143;&#xFF0C;&#x4F46;&#x672C;&#x7AE0;&#x540E;&#x9762;&#x6211;&#x4EEC;&#x5C06;&#x4ECB;&#x7ECD;&#x4E00;&#x4E9B;&#x66F4;&#x4E3A;&#x590D;&#x6742;&#x548C;&#x5F3A;&#x5927;&#x7684;&#x5355;&#x5143;&#x7C7B;&#x578B;&#x3002;</p>
<p>&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x65F6;&#x95F4;&#x6B65;<code>t</code>&#x5904;&#x7684;&#x5355;&#x5143;&#x72B6;&#x6001;&#xFF0C;&#x8BB0;&#x4E3A; <img src="../images/tex-7ddb4d2d45df22e2e98e6cc504f84787.gif" alt="h^{(t)}">&#xFF08;<code>h</code>&#x4EE3;&#x8868;&#x201C;&#x9690;&#x85CF;&#x201D;&#xFF09;&#xFF0C;&#x662F;&#x8BE5;&#x65F6;&#x95F4;&#x6B65;&#x7684;&#x67D0;&#x4E9B;&#x8F93;&#x5165;&#x548C;&#x524D;&#x4E00;&#x65F6;&#x95F4;&#x6B65;&#x7684;&#x72B6;&#x6001;&#x7684;&#x51FD;&#x6570;&#xFF1A;<img src="../images/tex-07be34d7c17f39052675948cb5b75838.gif" alt="h^{(t)} = f(h^{(t-1)}, x^{(t)})">&#x3002; &#x5176;&#x5728;&#x65F6;&#x95F4;&#x6B65;<code>t</code>&#x5904;&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x8868;&#x793A;&#x4E3A; <img src="../images/tex-cc685401bcf131ce4e9f980be319daac.gif" alt="y^{(t)}">&#xFF0C;&#x4E5F;&#x548C;&#x524D;&#x4E00;&#x72B6;&#x6001;&#x548C;&#x5F53;&#x524D;&#x8F93;&#x5165;&#x7684;&#x51FD;&#x6570;&#x6709;&#x5173;&#x3002; &#x5728;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x8BA8;&#x8BBA;&#x8FC7;&#x7684;&#x57FA;&#x672C;&#x5355;&#x5143;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8F93;&#x51FA;&#x7B49;&#x4E8E;&#x5355;&#x5143;&#x72B6;&#x6001;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x66F4;&#x590D;&#x6742;&#x7684;&#x5355;&#x5143;&#x4E2D;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x5982;&#x6B64;&#xFF0C;&#x5982;&#x56FE; 14-3 &#x6240;&#x793A;&#x3002;</p>
<p><img src="../images/chapter_14/14-3.png" alt=""></p>
<h2 id="&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x5E8F;&#x5217;">&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x5E8F;&#x5217;</h2>
<p><img src="../images/chapter_14/14-4.png" alt=""></p>
<p>RNN &#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x8FDB;&#x884C;&#x4E00;&#x7CFB;&#x5217;&#x8F93;&#x5165;&#x5E76;&#x4EA7;&#x751F;&#x4E00;&#x7CFB;&#x5217;&#x8F93;&#x51FA;&#xFF08;&#x89C1;&#x56FE; 14-4&#xFF0C;&#x5DE6;&#x4E0A;&#x89D2;&#x7684;&#x7F51;&#x7EDC;&#xFF09;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x8FD9;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x7F51;&#x7EDC;&#x5BF9;&#x4E8E;&#x9884;&#x6D4B;&#x65F6;&#x95F4;&#x5E8F;&#x5217;&#xFF08;&#x5982;&#x80A1;&#x7968;&#x4EF7;&#x683C;&#xFF09;&#x975E;&#x5E38;&#x6709;&#x7528;&#xFF1A;&#x4F60;&#x5728;&#x8FC7;&#x53BB;&#x7684;<code>N</code>&#x5929;&#x5185;&#x7ED9;&#x51FA;&#x4EF7;&#x683C;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x5FC5;&#x987B;&#x8F93;&#x51FA;&#x5411;&#x672A;&#x6765;&#x4E00;&#x5929;&#x79FB;&#x52A8;&#x7684;&#x4EF7;&#x683C;&#xFF08;&#x5373;&#x4ECE;<code>N - 1</code>&#x5929;&#x524D;&#x5230;&#x660E;&#x5929;&#xFF09;&#x3002;</p>
<p>&#x6216;&#x8005;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5411;&#x7F51;&#x7EDC;&#x8F93;&#x5165;&#x4E00;&#x7CFB;&#x5217;&#x8F93;&#x5165;&#xFF0C;&#x5E76;&#x5FFD;&#x7565;&#x9664;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x4E4B;&#x5916;&#x7684;&#x6240;&#x6709;&#x8F93;&#x51FA;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x53F3;&#x4E0A;&#x89D2;&#x7684;&#x7F51;&#x7EDC;&#xFF09;&#x3002; &#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5411;&#x91CF;&#x7F51;&#x7EDC;&#x7684;&#x5E8F;&#x5217;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5411;&#x7F51;&#x7EDC;&#x63D0;&#x4F9B;&#x4E0E;&#x7535;&#x5F71;&#x8BC4;&#x8BBA;&#x76F8;&#x5BF9;&#x5E94;&#x7684;&#x5355;&#x8BCD;&#x5E8F;&#x5217;&#xFF0C;&#x5E76;&#x4E14;&#x7F51;&#x7EDC;&#x5C06;&#x8F93;&#x51FA;&#x60C5;&#x611F;&#x8BC4;&#x5206;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x4ECE;<code>-1 [&#x6068;]</code>&#x5230;<code>+1 [&#x7231;]</code>&#xFF09;&#x3002;</p>
<p>&#x76F8;&#x53CD;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x7B2C;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#x4E2D;&#x4E3A;&#x7F51;&#x7EDC;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#xFF08;&#x800C;&#x5728;&#x5176;&#x4ED6;&#x6240;&#x6709;&#x65F6;&#x95F4;&#x6B65;&#x4E2D;&#x4E3A;&#x96F6;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x8BA9;&#x5B83;&#x8F93;&#x51FA;&#x4E00;&#x4E2A;&#x5E8F;&#x5217;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x5DE6;&#x4E0B;&#x89D2;&#x7684;&#x7F51;&#x7EDC;&#xFF09;&#x3002; &#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5411;&#x91CF;&#x5230;&#x5E8F;&#x5217;&#x7684;&#x7F51;&#x7EDC;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x8F93;&#x5165;&#x53EF;&#x4EE5;&#x662F;&#x56FE;&#x50CF;&#xFF0C;&#x8F93;&#x51FA;&#x53EF;&#x4EE5;&#x662F;&#x8BE5;&#x56FE;&#x50CF;&#x7684;&#x6807;&#x9898;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x6709;&#x4E00;&#x4E2A;&#x5E8F;&#x5217;&#x5230;&#x5411;&#x91CF;&#x7F51;&#x7EDC;&#xFF0C;&#x79F0;&#x4E3A;&#x7F16;&#x7801;&#x5668;&#xFF0C;&#x540E;&#x9762;&#x8DDF;&#x7740;&#x4E00;&#x4E2A;&#x79F0;&#x4E3A;&#x89E3;&#x7801;&#x5668;&#x7684;&#x5411;&#x91CF;&#x5230;&#x5E8F;&#x5217;&#x7F51;&#x7EDC;&#xFF08;&#x53C2;&#x89C1;&#x53F3;&#x4E0B;&#x89D2;&#x7684;&#x7F51;&#x7EDC;&#xFF09;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x8FD9;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x5C06;&#x53E5;&#x5B50;&#x4ECE;&#x4E00;&#x79CD;&#x8BED;&#x8A00;&#x7FFB;&#x8BD1;&#x6210;&#x53E6;&#x4E00;&#x79CD;&#x8BED;&#x8A00;&#x3002; &#x4F60;&#x4F1A;&#x7528;&#x4E00;&#x79CD;&#x8BED;&#x8A00;&#x7ED9;&#x7F51;&#x7EDC;&#x5582;&#x4E00;&#x4E2A;&#x53E5;&#x5B50;&#xFF0C;&#x7F16;&#x7801;&#x5668;&#x4F1A;&#x628A;&#x8FD9;&#x4E2A;&#x53E5;&#x5B50;&#x8F6C;&#x6362;&#x6210;&#x5355;&#x4E00;&#x7684;&#x5411;&#x91CF;&#x8868;&#x793A;&#xFF0C;&#x7136;&#x540E;&#x89E3;&#x7801;&#x5668;&#x5C06;&#x8FD9;&#x4E2A;&#x5411;&#x91CF;&#x89E3;&#x7801;&#x6210;&#x53E6;&#x4E00;&#x79CD;&#x8BED;&#x8A00;&#x7684;&#x53E5;&#x5B50;&#x3002; &#x8FD9;&#x79CD;&#x79F0;&#x4E3A;&#x7F16;&#x7801;&#x5668; - &#x89E3;&#x7801;&#x5668;&#x7684;&#x4E24;&#x6B65;&#x6A21;&#x578B;&#xFF0C;&#x6BD4;&#x7528;&#x5355;&#x4E2A;&#x5E8F;&#x5217;&#x5230;&#x5E8F;&#x5217;&#x7684; RNN&#xFF08;&#x5982;&#x5DE6;&#x4E0A;&#x65B9;&#x6240;&#x793A;&#x7684;&#x90A3;&#x4E2A;&#xFF09;&#x5FEB;&#x901F;&#x5730;&#x8FDB;&#x884C;&#x7FFB;&#x8BD1;&#x8981;&#x597D;&#x5F97;&#x591A;&#xFF0C;&#x56E0;&#x4E3A;&#x53E5;&#x5B50;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5355;&#x8BCD;&#x53EF;&#x4EE5; &#x5F71;&#x54CD;&#x7FFB;&#x8BD1;&#x7684;&#x7B2C;&#x4E00;&#x53E5;&#x8BDD;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x9700;&#x8981;&#x7B49;&#x5230;&#x542C;&#x5B8C;&#x6574;&#x4E2A;&#x53E5;&#x5B50;&#x624D;&#x80FD;&#x7FFB;&#x8BD1;&#x3002;</p>
<h2 id="tensorflow-&#x4E2D;&#x7684;&#x57FA;&#x672C;-rnn">TensorFlow &#x4E2D;&#x7684;&#x57FA;&#x672C; RNN</h2>
<p>&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684; RNN &#x6A21;&#x578B;&#xFF0C;&#x800C;&#x4E0D;&#x4F7F;&#x7528;&#x4EFB;&#x4F55; TensorFlow &#x7684; RNN &#x64CD;&#x4F5C;&#xFF0C;&#x4EE5;&#x66F4;&#x597D;&#x5730;&#x7406;&#x89E3;&#x53D1;&#x751F;&#x4E86;&#x4EC0;&#x4E48;&#x3002; &#x6211;&#x4EEC;&#x5C06;&#x4F7F;&#x7528; tanh &#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x521B;&#x5EFA;&#x7531; 5 &#x4E2A;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x5FAA;&#x73AF;&#x5C42;&#x7EC4;&#x6210;&#x7684; RNN&#xFF08;&#x5982;&#x56FE; 14-2 &#x6240;&#x793A;&#x7684; RNN&#xFF09;&#x3002; &#x6211;&#x4EEC;&#x5C06;&#x5047;&#x8BBE; RNN &#x53EA;&#x8FD0;&#x884C;&#x4E24;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#xFF0C;&#x6BCF;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#x8F93;&#x5165;&#x5927;&#x5C0F;&#x4E3A; 3 &#x7684;&#x5411;&#x91CF;&#x3002; &#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x6784;&#x5EFA;&#x4E86;&#x8FD9;&#x4E2A; RNN&#xFF0C;&#x5C55;&#x5F00;&#x4E86;&#x4E24;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#x9AA4;&#xFF1A;</p>
<pre><code class="lang-py">n_inputs = <span class="hljs-number">3</span>
n_neurons = <span class="hljs-number">5</span>
X0 = tf.placeholder(tf.float32, [<span class="hljs-keyword">None</span>, n_inputs])
X1 = tf.placeholder(tf.float32, [<span class="hljs-keyword">None</span>, n_inputs])
Wx = tf.Variable(tf.random_normal(shape=[n_inputs, n_neurons], dtype=tf.float32))
Wy = tf.Variable(tf.random_normal(shape=[n_neurons, n_neurons], dtype=tf.float32))
b = tf.Variable(tf.zeros([<span class="hljs-number">1</span>, n_neurons], dtype=tf.float32))
Y0 = tf.tanh(tf.matmul(X0, Wx) + b)
Y1 = tf.tanh(tf.matmul(Y0, Wy) + tf.matmul(X1, Wx) + b)
init = tf.global_variables_initializer()
</code></pre>
<p>&#x8FD9;&#x4E2A;&#x7F51;&#x7EDC;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x50CF;&#x4E00;&#x4E2A;&#x53CC;&#x5C42;&#x524D;&#x9988;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x6709;&#x4E00;&#x4E9B;&#x6539;&#x52A8;&#xFF1A;&#x9996;&#x5148;&#xFF0C;&#x4E24;&#x4E2A;&#x5C42;&#x5171;&#x4EAB;&#x76F8;&#x540C;&#x7684;&#x6743;&#x91CD;&#x548C;&#x504F;&#x5DEE;&#x9879;&#xFF0C;&#x5176;&#x6B21;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x6BCF;&#x4E00;&#x5C42;&#x90FD;&#x6709;&#x8F93;&#x5165;&#xFF0C;&#x5E76;&#x4ECE;&#x6BCF;&#x4E2A;&#x5C42;&#x83B7;&#x5F97;&#x8F93;&#x51FA;&#x3002; &#x4E3A;&#x4E86;&#x8FD0;&#x884C;&#x6A21;&#x578B;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5728;&#x4E24;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#x4E2D;&#x90FD;&#x6709;&#x8F93;&#x5165;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<pre><code class="lang-py">    <span class="hljs-comment"># Mini-batch: instance 0,instance 1,instance 2,instance 3</span>
    X0_batch = np.array([[<span class="hljs-number">0</span>, <span class="hljs-number">1</span>, <span class="hljs-number">2</span>], [<span class="hljs-number">3</span>, <span class="hljs-number">4</span>, <span class="hljs-number">5</span>], [<span class="hljs-number">6</span>, <span class="hljs-number">7</span>, <span class="hljs-number">8</span>], [<span class="hljs-number">9</span>, <span class="hljs-number">0</span>, <span class="hljs-number">1</span>]])  <span class="hljs-comment"># t = 0</span>
    X1_batch = np.array([[<span class="hljs-number">9</span>, <span class="hljs-number">8</span>, <span class="hljs-number">7</span>], [<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, <span class="hljs-number">0</span>], [<span class="hljs-number">6</span>, <span class="hljs-number">5</span>, <span class="hljs-number">4</span>], [<span class="hljs-number">3</span>, <span class="hljs-number">2</span>, <span class="hljs-number">1</span>]])  <span class="hljs-comment"># t = 1</span>
    <span class="hljs-keyword">with</span> tf.Session() <span class="hljs-keyword">as</span> sess:
        init.run()
    Y0_val, Y1_val = sess.run([Y0, Y1], feed_dict={X0: X0_batch, X1: X1_batch})
</code></pre>
<p>&#x8FD9;&#x4E2A;&#x5C0F;&#x6279;&#x91CF;&#x5305;&#x542B;&#x56DB;&#x4E2A;&#x5B9E;&#x4F8B;&#xFF0C;&#x6BCF;&#x4E2A;&#x5B9E;&#x4F8B;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x7531;&#x4E24;&#x4E2A;&#x8F93;&#x5165;&#x7EC4;&#x6210;&#x7684;&#x8F93;&#x5165;&#x5E8F;&#x5217;&#x3002; &#x6700;&#x540E;&#xFF0C;<code>Y0_val</code>&#x548C;<code>Y1_val</code>&#x5728;&#x6240;&#x6709;&#x795E;&#x7ECF;&#x5143;&#x548C;&#x5C0F;&#x6279;&#x91CF;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x5B9E;&#x4F8B;&#x7684;&#x4E24;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#x4E2D;&#x5305;&#x542B;&#x7F51;&#x7EDC;&#x7684;&#x8F93;&#x51FA;&#xFF1A;</p>
<pre><code class="lang-py"><span class="hljs-meta">&gt;&gt;&gt; </span>print(Y0_val) <span class="hljs-comment"># output at t = 0</span>
[[<span class="hljs-number">-0.2964572</span> <span class="hljs-number">0.82874775</span> <span class="hljs-number">-0.34216955</span> <span class="hljs-number">-0.75720584</span> <span class="hljs-number">0.19011548</span>] <span class="hljs-comment"># instance 0</span>
[<span class="hljs-number">-0.12842922</span> <span class="hljs-number">0.99981797</span> <span class="hljs-number">0.84704727</span> <span class="hljs-number">-0.99570125</span> <span class="hljs-number">0.38665548</span>] <span class="hljs-comment"># instance 1</span>
[ <span class="hljs-number">0.04731077</span> <span class="hljs-number">0.99999976</span> <span class="hljs-number">0.99330056</span> <span class="hljs-number">-0.999933</span> <span class="hljs-number">0.55339795</span>] <span class="hljs-comment"># instance 2</span>
[ <span class="hljs-number">0.70323634</span> <span class="hljs-number">0.99309105</span> <span class="hljs-number">0.99909431</span> <span class="hljs-number">-0.85363263</span> <span class="hljs-number">0.7472108</span> ]] <span class="hljs-comment"># instance 3</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>print(Y1_val) <span class="hljs-comment"># output at t = 1</span>
[[ <span class="hljs-number">0.51955646</span> <span class="hljs-number">1</span>\. <span class="hljs-number">0.99999022</span> <span class="hljs-number">-0.99984968</span> <span class="hljs-number">-0.24616946</span>] <span class="hljs-comment"># instance 0</span>
[<span class="hljs-number">-0.70553327</span> <span class="hljs-number">-0.11918639</span> <span class="hljs-number">0.48885304</span> <span class="hljs-number">0.08917919</span> <span class="hljs-number">-0.26579669</span>] <span class="hljs-comment"># instance 1</span>
[<span class="hljs-number">-0.32477224</span> <span class="hljs-number">0.99996376</span> <span class="hljs-number">0.99933046</span> <span class="hljs-number">-0.99711186</span> <span class="hljs-number">0.10981458</span>] <span class="hljs-comment"># instance 2</span>
[<span class="hljs-number">-0.43738723</span> <span class="hljs-number">0.91517633</span> <span class="hljs-number">0.97817528</span> <span class="hljs-number">-0.91763324</span> <span class="hljs-number">0.11047263</span>]] <span class="hljs-comment"># instance 3</span>
</code></pre>
<p>&#x8FD9;&#x5E76;&#x4E0D;&#x96BE;&#xFF0C;&#x4F46;&#x662F;&#x5F53;&#x7136;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x80FD;&#x591F;&#x8FD0;&#x884C; 100 &#x591A;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#x9AA4;&#x7684; RNN&#xFF0C;&#x8FD9;&#x4E2A;&#x56FE;&#x5F62;&#x5C06;&#x4F1A;&#x975E;&#x5E38;&#x5927;&#x3002; &#x73B0;&#x5728;&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x5982;&#x4F55;&#x4F7F;&#x7528; TensorFlow &#x7684; RNN &#x64CD;&#x4F5C;&#x521B;&#x5EFA;&#x76F8;&#x540C;&#x7684;&#x6A21;&#x578B;&#x3002;</p>
<p>&#x5B8C;&#x6574;&#x4EE3;&#x7801;</p>
<pre><code class="lang-py"><span class="hljs-keyword">import</span> numpy <span class="hljs-keyword">as</span> np
<span class="hljs-keyword">import</span> tensorflow <span class="hljs-keyword">as</span> tf

<span class="hljs-keyword">if</span> __name__ == <span class="hljs-string">&apos;__main__&apos;</span>:
    n_inputs = <span class="hljs-number">3</span>
    n_neurons = <span class="hljs-number">5</span>
    X0 = tf.placeholder(tf.float32, [<span class="hljs-keyword">None</span>, n_inputs])
    X1 = tf.placeholder(tf.float32, [<span class="hljs-keyword">None</span>, n_inputs])
    Wx = tf.Variable(tf.random_normal(shape=[n_inputs, n_neurons], dtype=tf.float32))
    Wy = tf.Variable(tf.random_normal(shape=[n_neurons, n_neurons], dtype=tf.float32))
    b = tf.Variable(tf.zeros([<span class="hljs-number">1</span>, n_neurons], dtype=tf.float32))
    Y0 = tf.tanh(tf.matmul(X0, Wx) + b)
    Y1 = tf.tanh(tf.matmul(Y0, Wy) + tf.matmul(X1, Wx) + b)
    init = tf.global_variables_initializer()

    <span class="hljs-comment"># Mini-batch: instance 0,instance 1,instance 2,instance 3</span>
    X0_batch = np.array([[<span class="hljs-number">0</span>, <span class="hljs-number">1</span>, <span class="hljs-number">2</span>], [<span class="hljs-number">3</span>, <span class="hljs-number">4</span>, <span class="hljs-number">5</span>], [<span class="hljs-number">6</span>, <span class="hljs-number">7</span>, <span class="hljs-number">8</span>], [<span class="hljs-number">9</span>, <span class="hljs-number">0</span>, <span class="hljs-number">1</span>]])  <span class="hljs-comment"># t = 0</span>
    X1_batch = np.array([[<span class="hljs-number">9</span>, <span class="hljs-number">8</span>, <span class="hljs-number">7</span>], [<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, <span class="hljs-number">0</span>], [<span class="hljs-number">6</span>, <span class="hljs-number">5</span>, <span class="hljs-number">4</span>], [<span class="hljs-number">3</span>, <span class="hljs-number">2</span>, <span class="hljs-number">1</span>]])  <span class="hljs-comment"># t = 1</span>
    <span class="hljs-keyword">with</span> tf.Session() <span class="hljs-keyword">as</span> sess:
        init.run()
        Y0_val, Y1_val = sess.run([Y0, Y1], feed_dict={X0: X0_batch, X1: X1_batch})

    print(Y0_val,<span class="hljs-string">&apos;\n&apos;</span>)
    print(Y1_val)
</code></pre>
<h2 id="&#x65F6;&#x95F4;&#x4E0A;&#x7684;&#x9759;&#x6001;&#x5C55;&#x5F00;">&#x65F6;&#x95F4;&#x4E0A;&#x7684;&#x9759;&#x6001;&#x5C55;&#x5F00;</h2>
<p><code>static_rnn()</code>&#x51FD;&#x6570;&#x901A;&#x8FC7;&#x94FE;&#x63A5;&#x5355;&#x5143;&#x6765;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5C55;&#x5F00;&#x7684; RNN &#x7F51;&#x7EDC;&#x3002; &#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x521B;&#x5EFA;&#x4E86;&#x4E0E;&#x4E0A;&#x4E00;&#x4E2A;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x7684;&#x6A21;&#x578B;&#xFF1A;</p>
<pre><code class="lang-py">X0 = tf.placeholder(tf.float32, [<span class="hljs-keyword">None</span>, n_inputs])
X1 = tf.placeholder(tf.float32, [<span class="hljs-keyword">None</span>, n_inputs])

basic_cell = tf.contrib.rnn.BasicRNNCell(num_units=n_neurons)
output_seqs, states = tf.contrib.rnn.static_rnn(basic_cell, [X0, X1],
                                                dtype=tf.float32)
Y0, Y1 = output_seqs
</code></pre>
<p>&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x50CF;&#x4EE5;&#x524D;&#x4E00;&#x6837;&#x521B;&#x5EFA;&#x8F93;&#x5165;&#x5360;&#x4F4D;&#x7B26;&#x3002; &#x7136;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;<code>BasicRNNCell</code>&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x89C6;&#x4E3A;&#x4E00;&#x4E2A;&#x5DE5;&#x5382;&#xFF0C;&#x521B;&#x5EFA;&#x5355;&#x5143;&#x7684;&#x526F;&#x672C;&#x4EE5;&#x6784;&#x5EFA;&#x5C55;&#x5F00;&#x7684; RNN&#xFF08;&#x6BCF;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#x4E00;&#x4E2A;&#xFF09;&#x3002; &#x7136;&#x540E;&#x6211;&#x4EEC;&#x8C03;&#x7528;<code>static_rnn()</code>&#xFF0C;&#x5411;&#x5B83;&#x63D0;&#x4F9B;&#x5355;&#x5143;&#x5DE5;&#x5382;&#x548C;&#x8F93;&#x5165;&#x5F20;&#x91CF;&#xFF0C;&#x5E76;&#x544A;&#x8BC9;&#x5B83;&#x8F93;&#x5165;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF08;&#x7528;&#x6765;&#x521B;&#x5EFA;&#x521D;&#x59CB;&#x72B6;&#x6001;&#x77E9;&#x9635;&#xFF0C;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#x662F;&#x5168;&#x96F6;&#xFF09;&#x3002; <code>static_rnn()</code>&#x51FD;&#x6570;&#x4E3A;&#x6BCF;&#x4E2A;&#x8F93;&#x5165;&#x8C03;&#x7528;&#x5355;&#x5143;&#x5DE5;&#x5382;&#x7684;<code>__call __()</code>&#x51FD;&#x6570;&#xFF0C;&#x521B;&#x5EFA;&#x5355;&#x5143;&#x7684;&#x4E24;&#x4E2A;&#x526F;&#x672C;&#xFF08;&#x6BCF;&#x4E2A;&#x5355;&#x5143;&#x5305;&#x542B; 5 &#x4E2A;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x5FAA;&#x73AF;&#x5C42;&#xFF09;&#xFF0C;&#x5E76;&#x5177;&#x6709;&#x5171;&#x4EAB;&#x7684;&#x6743;&#x91CD;&#x548C;&#x504F;&#x7F6E;&#x9879;&#xFF0C;&#x50CF;&#x524D;&#x9762;&#x4E00;&#x6837;&#x3002;<code>static_rnn()</code>&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x4E24;&#x4E2A;&#x5BF9;&#x8C61;&#x3002; &#x7B2C;&#x4E00;&#x4E2A;&#x662F;&#x5305;&#x542B;&#x6BCF;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#x7684;&#x8F93;&#x51FA;&#x5F20;&#x91CF;&#x7684; Python &#x5217;&#x8868;&#x3002; &#x7B2C;&#x4E8C;&#x4E2A;&#x662F;&#x5305;&#x542B;&#x7F51;&#x7EDC;&#x6700;&#x7EC8;&#x72B6;&#x6001;&#x7684;&#x5F20;&#x91CF;&#x3002; &#x5F53;&#x4F60;&#x4F7F;&#x7528;&#x57FA;&#x672C;&#x7684;&#x5355;&#x5143;&#x65F6;&#xFF0C;&#x6700;&#x540E;&#x7684;&#x72B6;&#x6001;&#x5C31;&#x7B49;&#x4E8E;&#x6700;&#x540E;&#x7684;&#x8F93;&#x51FA;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6709; 50 &#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#x957F;&#xFF0C;&#x5219;&#x4E0D;&#x5F97;&#x4E0D;&#x5B9A;&#x4E49; 50 &#x4E2A;&#x8F93;&#x5165;&#x5360;&#x4F4D;&#x7B26;&#x548C; 50 &#x4E2A;&#x8F93;&#x51FA;&#x5F20;&#x91CF;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x5728;&#x6267;&#x884C;&#x65F6;&#xFF0C;&#x4F60;&#x5C06;&#x4E0D;&#x5F97;&#x4E0D;&#x4E3A; 50 &#x4E2A;&#x5360;&#x4F4D;&#x7B26;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x5360;&#x4F4D;&#x7B26;&#x8F93;&#x5165;&#x6570;&#x636E;&#x5E76;&#x4E14;&#x8FD8;&#x8981;&#x64CD;&#x7EB5; 50 &#x4E2A;&#x8F93;&#x51FA;&#x3002;&#x6211;&#x4EEC;&#x6765;&#x7B80;&#x5316;&#x4E00;&#x4E0B;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x518D;&#x6B21;&#x6784;&#x5EFA;&#x76F8;&#x540C;&#x7684; RNN&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x6B21;&#x5B83;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x5F62;&#x72B6;&#x4E3A;<code>[None&#xFF0C;n_steps&#xFF0C;n_inputs]</code>&#x7684;&#x5355;&#x4E2A;&#x8F93;&#x5165;&#x5360;&#x4F4D;&#x7B26;&#xFF0C;&#x5176;&#x4E2D;&#x7B2C;&#x4E00;&#x4E2A;&#x7EF4;&#x5EA6;&#x662F;&#x6700;&#x5C0F;&#x6279;&#x91CF;&#x5927;&#x5C0F;&#x3002;&#x7136;&#x540E;&#x63D0;&#x53D6;&#x6BCF;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#x7684;&#x8F93;&#x5165;&#x5E8F;&#x5217;&#x5217;&#x8868;&#x3002; <code>X_seqs</code>&#x662F;&#x5F62;&#x72B6;&#x4E3A;<code>n_steps</code>&#x7684; Python &#x5217;&#x8868;&#xFF0C;&#x5305;&#x542B;&#x5F62;&#x72B6;&#x4E3A;<code>[None&#xFF0C;n_inputs]</code>&#x7684;&#x5F20;&#x91CF;&#xFF0C;&#x5176;&#x4E2D;&#x7B2C;&#x4E00;&#x4E2A;&#x7EF4;&#x5EA6;&#x540C;&#x6837;&#x662F;&#x6700;&#x5C0F;&#x6279;&#x91CF;&#x5927;&#x5C0F;&#x3002;&#x4E3A;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x4F7F;&#x7528;<code>transpose()</code>&#x51FD;&#x6570;&#x4EA4;&#x6362;&#x524D;&#x4E24;&#x4E2A;&#x7EF4;&#x5EA6;&#xFF0C;&#x4EE5;&#x4FBF;&#x65F6;&#x95F4;&#x6B65;&#x9AA4;&#x73B0;&#x5728;&#x662F;&#x7B2C;&#x4E00;&#x7EF4;&#x5EA6;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F; <code>unstack()</code>&#x51FD;&#x6570;&#x6CBF;&#x7B2C;&#x4E00;&#x7EF4;&#xFF08;&#x5373;&#x6BCF;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#x7684;&#x4E00;&#x4E2A;&#x5F20;&#x91CF;&#xFF09;&#x63D0;&#x53D6;&#x5F20;&#x91CF;&#x7684; Python &#x5217;&#x8868;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x4E24;&#x884C;&#x548C;&#x4EE5;&#x524D;&#x4E00;&#x6837;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;<code>stack()</code>&#x51FD;&#x6570;&#x5C06;&#x6240;&#x6709;&#x8F93;&#x51FA;&#x5F20;&#x91CF;&#x5408;&#x5E76;&#x6210;&#x4E00;&#x4E2A;&#x5F20;&#x91CF;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x4EA4;&#x6362;&#x524D;&#x4E24;&#x4E2A;&#x7EF4;&#x5EA6;&#x5F97;&#x5230;&#x6700;&#x7EC8;&#x8F93;&#x51FA;&#x5F20;&#x91CF;&#xFF0C;&#x5F62;&#x72B6;&#x4E3A;<code>[None, n_steps&#xFF0C;n_neurons]</code>&#xFF08;&#x7B2C;&#x4E00;&#x4E2A;&#x7EF4;&#x5EA6;&#x662F;&#x5C0F;&#x6279;&#x91CF;&#x5927;&#x5C0F;&#xFF09;&#x3002;</p>
<pre><code class="lang-py">X = tf.placeholder(tf.float32, [<span class="hljs-keyword">None</span>, n_steps, n_inputs])
X_seqs = tf.unstack(tf.transpose(X, perm=[<span class="hljs-number">1</span>, <span class="hljs-number">0</span>, <span class="hljs-number">2</span>]))

basic_cell = tf.contrib.rnn.BasicRNNCell(num_units=n_neurons)
output_seqs, states = tf.contrib.rnn.static_rnn(basic_cell, X_seqs,
                                                dtype=tf.float32)
outputs = tf.transpose(tf.stack(output_seqs), perm=[<span class="hljs-number">1</span>, <span class="hljs-number">0</span>, <span class="hljs-number">2</span>])
</code></pre>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7ED9;&#x5B83;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x6240;&#x6709;&#x5C0F;&#x6279;&#x91CF;&#x5E8F;&#x5217;&#x7684;&#x5F20;&#x91CF;&#x6765;&#x8FD0;&#x884C;&#x7F51;&#x7EDC;&#xFF1A;</p>
<pre><code class="lang-py">X_batch = np.array([
        <span class="hljs-comment"># t = 0      t = 1 </span>
        [[<span class="hljs-number">0</span>, <span class="hljs-number">1</span>, <span class="hljs-number">2</span>], [<span class="hljs-number">9</span>, <span class="hljs-number">8</span>, <span class="hljs-number">7</span>]], <span class="hljs-comment"># instance 1</span>
        [[<span class="hljs-number">3</span>, <span class="hljs-number">4</span>, <span class="hljs-number">5</span>], [<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, <span class="hljs-number">0</span>]], <span class="hljs-comment"># instance 2</span>
        [[<span class="hljs-number">6</span>, <span class="hljs-number">7</span>, <span class="hljs-number">8</span>], [<span class="hljs-number">6</span>, <span class="hljs-number">5</span>, <span class="hljs-number">4</span>]], <span class="hljs-comment"># instance 3</span>
        [[<span class="hljs-number">9</span>, <span class="hljs-number">0</span>, <span class="hljs-number">1</span>], [<span class="hljs-number">3</span>, <span class="hljs-number">2</span>, <span class="hljs-number">1</span>]], <span class="hljs-comment"># instance 4</span>
    ])

<span class="hljs-keyword">with</span> tf.Session() <span class="hljs-keyword">as</span> sess:
    init.run()
    outputs_val = outputs.eval(feed_dict={X: X_batch})
</code></pre>
<p>&#x6211;&#x4EEC;&#x5F97;&#x5230;&#x6240;&#x6709;&#x5B9E;&#x4F8B;&#xFF0C;&#x6240;&#x6709;&#x65F6;&#x95F4;&#x6B65;&#x957F;&#x548C;&#x6240;&#x6709;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x5355;&#x4E00;<code>outputs_val</code>&#x5F20;&#x91CF;&#xFF1A;</p>
<p><img src="../images/chapter_14/o-14-1.png" alt=""></p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x4ECD;&#x7136;&#x4F1A;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x6BCF;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x5355;&#x5143;&#x7684;&#x56FE;&#x3002; &#x5982;&#x679C;&#x6709; 50 &#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#xFF0C;&#x8FD9;&#x4E2A;&#x56FE;&#x770B;&#x8D77;&#x6765;&#x4F1A;&#x975E;&#x5E38;&#x96BE;&#x770B;&#x3002; &#x8FD9;&#x6709;&#x70B9;&#x50CF;&#x5199;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x800C;&#x6CA1;&#x6709;&#x4F7F;&#x7528;&#x5FAA;&#x73AF;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;<code>Y0 = f(0,X0)</code>&#xFF1B;<code>Y1 = f(Y0,X1)</code>&#xFF1B;<code>Y2 = f(Y1,X2)</code>&#xFF1B;...&#xFF1B;<code>Y50 = f(Y49,X50)</code>&#xFF09;&#x3002; &#x5982;&#x679C;&#x4F7F;&#x7528;&#x5927;&#x56FE;&#xFF0C;&#x5728;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x671F;&#x95F4;&#xFF08;&#x7279;&#x522B;&#x662F;&#x5728; GPU &#x5185;&#x5B58;&#x6709;&#x9650;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF09;&#xFF0C;&#x4F60;&#x751A;&#x81F3;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x751F;&#x5185;&#x5B58;&#x4E0D;&#x8DB3;&#xFF08;OOM&#xFF09;&#x9519;&#x8BEF;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5FC5;&#x987B;&#x5728;&#x6B63;&#x5411;&#x4F20;&#x9012;&#x671F;&#x95F4;&#x5B58;&#x50A8;&#x6240;&#x6709;&#x5F20;&#x91CF;&#x503C;&#xFF0C;&#x4EE5;&#x4FBF;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x5728;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x671F;&#x95F4;&#x8BA1;&#x7B97;&#x68AF;&#x5EA6;&#x3002;</p>
<p>&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x66F4;&#x597D;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF1A;<code>dynamic_rnn()</code>&#x51FD;&#x6570;&#x3002;</p>
<h2 id="&#x65F6;&#x95F4;&#x4E0A;&#x7684;&#x52A8;&#x6001;&#x5C55;&#x5F00;">&#x65F6;&#x95F4;&#x4E0A;&#x7684;&#x52A8;&#x6001;&#x5C55;&#x5F00;</h2>
<p><code>dynamic_rnn()</code>&#x51FD;&#x6570;&#x4F7F;&#x7528;<code>while_loop()</code>&#x64CD;&#x4F5C;&#xFF0C;&#x5728;&#x5355;&#x5143;&#x4E0A;&#x8FD0;&#x884C;&#x9002;&#x5F53;&#x7684;&#x6B21;&#x6570;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x5728;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x671F;&#x95F4;&#x5C06; GPU&#x5185; &#x5B58;&#x4EA4;&#x6362;&#x5230; CPU &#x5185;&#x5B58;&#xFF0C;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;<code>swap_memory = True</code>&#xFF0C;&#x4EE5;&#x907F;&#x514D;&#x5185;&#x5B58;&#x4E0D;&#x8DB3;&#x9519;&#x8BEF;&#x3002; &#x65B9;&#x4FBF;&#x7684;&#x662F;&#xFF0C;&#x5B83;&#x8FD8;&#x53EF;&#x4EE5;&#x5728;&#x6BCF;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#xFF08;&#x5F62;&#x72B6;&#x4E3A;<code>[None, n_steps, n_inputs]</code>&#xFF09;&#x63A5;&#x53D7;&#x6240;&#x6709;&#x8F93;&#x5165;&#x7684;&#x5355;&#x4E2A;&#x5F20;&#x91CF;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x6BCF;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#xFF08;&#x5F62;&#x72B6;<code>[None, n_steps, n_neurons]</code>&#xFF09;&#x4E0A;&#x8F93;&#x51FA;&#x6240;&#x6709;&#x8F93;&#x51FA;&#x7684;&#x5355;&#x4E2A;&#x5F20;&#x91CF;&#x3002; &#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x5806;&#x53E0;&#xFF0C;&#x62C6;&#x6563;&#x6216;&#x8F6C;&#x7F6E;&#x3002; &#x4EE5;&#x4E0B;&#x4EE3;&#x7801;&#x4F7F;&#x7528;<code>dynamic_rnn()</code>&#x51FD;&#x6570;&#x521B;&#x5EFA;&#x4E0E;&#x4E4B;&#x524D;&#x76F8;&#x540C;&#x7684; RNN&#x3002; &#x8FD9;&#x592A;&#x597D;&#x4E86;&#xFF01;</p>
<p>&#x5B8C;&#x6574;&#x4EE3;&#x7801;</p>
<pre><code class="lang-py"><span class="hljs-keyword">import</span> numpy <span class="hljs-keyword">as</span> np
<span class="hljs-keyword">import</span> tensorflow <span class="hljs-keyword">as</span> tf
<span class="hljs-keyword">import</span> pandas <span class="hljs-keyword">as</span> pd

<span class="hljs-keyword">if</span> __name__ == <span class="hljs-string">&apos;__main__&apos;</span>:
    n_steps = <span class="hljs-number">2</span>
    n_inputs = <span class="hljs-number">3</span>
    n_neurons = <span class="hljs-number">5</span>

    X = tf.placeholder(tf.float32, [<span class="hljs-keyword">None</span>, n_steps, n_inputs])

    basic_cell = tf.contrib.rnn.BasicRNNCell(num_units=n_neurons)
    outputs, states = tf.nn.dynamic_rnn(basic_cell, X, dtype=tf.float32)

    init = tf.global_variables_initializer()

    X_batch = np.array([
        [[<span class="hljs-number">0</span>, <span class="hljs-number">1</span>, <span class="hljs-number">2</span>], [<span class="hljs-number">9</span>, <span class="hljs-number">8</span>, <span class="hljs-number">7</span>]],  <span class="hljs-comment"># instance 1</span>
        [[<span class="hljs-number">3</span>, <span class="hljs-number">4</span>, <span class="hljs-number">5</span>], [<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, <span class="hljs-number">0</span>]],  <span class="hljs-comment"># instance 2</span>
        [[<span class="hljs-number">6</span>, <span class="hljs-number">7</span>, <span class="hljs-number">8</span>], [<span class="hljs-number">6</span>, <span class="hljs-number">5</span>, <span class="hljs-number">4</span>]],  <span class="hljs-comment"># instance 3</span>
        [[<span class="hljs-number">9</span>, <span class="hljs-number">0</span>, <span class="hljs-number">1</span>], [<span class="hljs-number">3</span>, <span class="hljs-number">2</span>, <span class="hljs-number">1</span>]],  <span class="hljs-comment"># instance 4</span>
    ])

    <span class="hljs-keyword">with</span> tf.Session() <span class="hljs-keyword">as</span> sess:
        init.run()
        outputs_val = outputs.eval(feed_dict={X: X_batch})

    print(outputs_val)
</code></pre>
<p>&#x5728;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x671F;&#x95F4;&#xFF0C;<code>while_loop()</code>&#x64CD;&#x4F5C;&#x4F1A;&#x6267;&#x884C;&#x76F8;&#x5E94;&#x7684;&#x6B65;&#x9AA4;&#xFF1A;&#x5728;&#x6B63;&#x5411;&#x4F20;&#x9012;&#x671F;&#x95F4;&#x5B58;&#x50A8;&#x6BCF;&#x6B21;&#x8FED;&#x4EE3;&#x7684;&#x5F20;&#x91CF;&#x503C;&#xFF0C;&#x4EE5;&#x4FBF;&#x5728;&#x53CD;&#x5411;&#x4F20;&#x9012;&#x671F;&#x95F4;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x6765;&#x8BA1;&#x7B97;&#x68AF;&#x5EA6;&#x3002;</p>
<h2 id="&#x5904;&#x7406;&#x53D8;&#x957F;&#x8F93;&#x5165;&#x5E8F;&#x5217;">&#x5904;&#x7406;&#x53D8;&#x957F;&#x8F93;&#x5165;&#x5E8F;&#x5217;</h2>
<p>&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x4F7F;&#x7528;&#x56FA;&#x5B9A;&#x5927;&#x5C0F;&#x7684;&#x8F93;&#x5165;&#x5E8F;&#x5217;&#xFF08;&#x5168;&#x90E8;&#x6B63;&#x597D;&#x4E24;&#x4E2A;&#x6B65;&#x957F;&#xFF09;&#x3002; &#x5982;&#x679C;&#x8F93;&#x5165;&#x5E8F;&#x5217;&#x5177;&#x6709;&#x53EF;&#x53D8;&#x957F;&#x5EA6;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x50CF;&#x53E5;&#x5B50;&#xFF09;&#x5462;&#xFF1F; &#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x5728;&#x8C03;&#x7528;<code>dynamic_rnn()</code>&#xFF08;&#x6216;<code>static_rnn()</code>&#xFF09;&#x51FD;&#x6570;&#x65F6;&#x8BBE;&#x7F6E;<code>sequence_length</code>&#x53C2;&#x6570;&#xFF1B;&#x5B83;&#x5FC5;&#x987B;&#x662F;&#x4E00;&#x7EF4;&#x5F20;&#x91CF;&#xFF0C;&#x8868;&#x793A;&#x6BCF;&#x4E2A;&#x5B9E;&#x4F8B;&#x7684;&#x8F93;&#x5165;&#x5E8F;&#x5217;&#x7684;&#x957F;&#x5EA6;&#x3002; &#x4F8B;&#x5982;&#xFF1A;</p>
<pre><code class="lang-py">n_steps = <span class="hljs-number">2</span>
n_inputs = <span class="hljs-number">3</span>
n_neurons = <span class="hljs-number">5</span>

reset_graph()

X = tf.placeholder(tf.float32, [<span class="hljs-keyword">None</span>, n_steps, n_inputs])
basic_cell = tf.contrib.rnn.BasicRNNCell(num_units=n_neurons)
</code></pre>
<pre><code class="lang-py">seq_length = tf.placeholder(tf.int32, [<span class="hljs-keyword">None</span>])
outputs, states = tf.nn.dynamic_rnn(basic_cell, X, dtype=tf.float32,
                                    sequence_length=seq_length)
</code></pre>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x5047;&#x8BBE;&#x7B2C;&#x4E8C;&#x4E2A;&#x8F93;&#x5165;&#x5E8F;&#x5217;&#x53EA;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#x800C;&#x4E0D;&#x662F;&#x4E24;&#x4E2A;&#x8F93;&#x5165;&#x3002; &#x4E3A;&#x4E86;&#x9002;&#x5E94;&#x8F93;&#x5165;&#x5F20;&#x91CF;<code>X</code>&#xFF0C;&#x5FC5;&#x987B;&#x586B;&#x5145;&#x96F6;&#x5411;&#x91CF;&#xFF08;&#x56E0;&#x4E3A;&#x8F93;&#x5165;&#x5F20;&#x91CF;&#x7684;&#x7B2C;&#x4E8C;&#x7EF4;&#x662F;&#x6700;&#x957F;&#x5E8F;&#x5217;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x5373; 2&#xFF09;</p>
<pre><code class="lang-py">X_batch = np.array([
        <span class="hljs-comment"># step 0     step 1</span>
        [[<span class="hljs-number">0</span>, <span class="hljs-number">1</span>, <span class="hljs-number">2</span>], [<span class="hljs-number">9</span>, <span class="hljs-number">8</span>, <span class="hljs-number">7</span>]], <span class="hljs-comment"># instance 1</span>
        [[<span class="hljs-number">3</span>, <span class="hljs-number">4</span>, <span class="hljs-number">5</span>], [<span class="hljs-number">0</span>, <span class="hljs-number">0</span>, <span class="hljs-number">0</span>]], <span class="hljs-comment"># instance 2 (padded with zero vectors)</span>
        [[<span class="hljs-number">6</span>, <span class="hljs-number">7</span>, <span class="hljs-number">8</span>], [<span class="hljs-number">6</span>, <span class="hljs-number">5</span>, <span class="hljs-number">4</span>]], <span class="hljs-comment"># instance 3</span>
        [[<span class="hljs-number">9</span>, <span class="hljs-number">0</span>, <span class="hljs-number">1</span>], [<span class="hljs-number">3</span>, <span class="hljs-number">2</span>, <span class="hljs-number">1</span>]], <span class="hljs-comment"># instance 4</span>
    ])
seq_length_batch = np.array([<span class="hljs-number">2</span>, <span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">2</span>])
</code></pre>
<p>&#x5F53;&#x7136;&#xFF0C;&#x4F60;&#x73B0;&#x5728;&#x9700;&#x8981;&#x4E3A;&#x4E24;&#x4E2A;&#x5360;&#x4F4D;&#x7B26;<code>X</code>&#x548C;<code>seq_length</code>&#x63D0;&#x4F9B;&#x503C;&#xFF1A;</p>
<pre><code class="lang-py"><span class="hljs-keyword">with</span> tf.Session() <span class="hljs-keyword">as</span> sess:
    init.run()
    outputs_val, states_val = sess.run(
        [outputs, states], feed_dict={X: X_batch, seq_length: seq_length_batch})
</code></pre>
<p>&#x73B0;&#x5728;&#xFF0C;RNN &#x8F93;&#x51FA;&#x5E8F;&#x5217;&#x957F;&#x5EA6;&#x7684;&#x6BCF;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#x90FD;&#x4F1A;&#x8F93;&#x51FA;&#x96F6;&#x5411;&#x91CF;&#xFF08;&#x67E5;&#x770B;&#x7B2C;&#x4E8C;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x8F93;&#x51FA;&#xFF09;&#xFF1A;</p>
<p><img src="../images/chapter_14/o-14-2.png" alt=""></p>
<p>&#x6B64;&#x5916;&#xFF0C;&#x72B6;&#x6001;&#x5F20;&#x91CF;&#x5305;&#x542B;&#x6BCF;&#x4E2A;&#x5355;&#x5143;&#x7684;&#x6700;&#x7EC8;&#x72B6;&#x6001;&#xFF08;&#x4E0D;&#x5305;&#x62EC;&#x96F6;&#x5411;&#x91CF;&#xFF09;&#xFF1A;</p>
<p><img src="../images/chapter_14/o-14-3.png" alt=""></p>
<h2 id="&#x5904;&#x7406;&#x53D8;&#x957F;&#x8F93;&#x51FA;&#x5E8F;&#x5217;">&#x5904;&#x7406;&#x53D8;&#x957F;&#x8F93;&#x51FA;&#x5E8F;&#x5217;</h2>
<p>&#x5982;&#x679C;&#x8F93;&#x51FA;&#x5E8F;&#x5217;&#x957F;&#x5EA6;&#x4E0D;&#x4E00;&#x6837;&#x5462;&#xFF1F; &#x5982;&#x679C;&#x4E8B;&#x5148;&#x77E5;&#x9053;&#x6BCF;&#x4E2A;&#x5E8F;&#x5217;&#x7684;&#x957F;&#x5EA6;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x77E5;&#x9053;&#x957F;&#x5EA6;&#x4E0E;&#x8F93;&#x5165;&#x5E8F;&#x5217;&#x7684;&#x957F;&#x5EA6;&#x76F8;&#x540C;&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x4EE5;&#x6309;&#x7167;&#x4E0A;&#x9762;&#x6240;&#x8FF0;&#x8BBE;&#x7F6E;<code>sequence_length</code>&#x53C2;&#x6570;&#x3002; &#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x901A;&#x5E38;&#x8FD9;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;&#x7FFB;&#x8BD1;&#x540E;&#x7684;&#x53E5;&#x5B50;&#x7684;&#x957F;&#x5EA6;&#x901A;&#x5E38;&#x4E0E;&#x8F93;&#x5165;&#x53E5;&#x5B50;&#x7684;&#x957F;&#x5EA6;&#x4E0D;&#x540C;&#x3002; &#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x79F0;&#x4E3A;&#x5E8F;&#x5217;&#x7ED3;&#x675F;&#x6807;&#x8BB0;&#xFF08;EOS &#x6807;&#x8BB0;&#xFF09;&#x7684;&#x7279;&#x6B8A;&#x8F93;&#x51FA;&#x3002; &#x4EFB;&#x4F55;&#x5728; EOS &#x540E;&#x9762;&#x7684;&#x8F93;&#x51FA;&#x5E94;&#x8BE5;&#x88AB;&#x5FFD;&#x7565;&#xFF08;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x672C;&#x7AE0;&#x7A0D;&#x540E;&#x8BA8;&#x8BBA;&#xFF09;&#x3002;</p>
<p>&#x597D;&#xFF0C;&#x73B0;&#x5728;&#x4F60;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A; RNN &#x7F51;&#x7EDC;&#xFF08;&#x6216;&#x8005;&#x66F4;&#x51C6;&#x786E;&#x5730;&#x8BF4;&#x662F;&#x4E00;&#x4E2A;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#x800C;&#x5C55;&#x5F00;&#x7684; RNN &#x7F51;&#x7EDC;&#xFF09;&#x3002; &#x4F46;&#x662F;&#x4F60;&#x600E;&#x4E48;&#x8BAD;&#x7EC3;&#x5462;&#xFF1F;</p>
<h2 id="&#x8BAD;&#x7EC3;-rnn">&#x8BAD;&#x7EC3; RNN</h2>
<p>&#x4E3A;&#x4E86;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A; RNN&#xFF0C;&#x8BC0;&#x7A8D;&#x662F;&#x5728;&#x65F6;&#x95F4;&#x4E0A;&#x5C55;&#x5F00;&#xFF08;&#x5C31;&#x50CF;&#x6211;&#x4EEC;&#x521A;&#x521A;&#x505A;&#x7684;&#x90A3;&#x6837;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x7B80;&#x5355;&#x5730;&#x4F7F;&#x7528;&#x5E38;&#x89C4;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#xFF08;&#x89C1;&#x56FE; 14-5&#xFF09;&#x3002; &#x8FD9;&#x4E2A;&#x7B56;&#x7565;&#x88AB;&#x79F0;&#x4E3A;&#x65F6;&#x95F4;&#x4E0A;&#x7684;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#xFF08;BPTT&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_14/14-5.png" alt=""></p>
<p>&#x5C31;&#x50CF;&#x5728;&#x6B63;&#x5E38;&#x7684;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x4E2D;&#x4E00;&#x6837;&#xFF0C;&#x5C55;&#x5F00;&#x7684;&#x7F51;&#x7EDC;&#xFF08;&#x7528;&#x865A;&#x7EBF;&#x7BAD;&#x5934;&#x8868;&#x793A;&#xFF09;&#x6709;&#x7B2C;&#x4E00;&#x4E2A;&#x6B63;&#x5411;&#x4F20;&#x9012;&#x3002;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x635F;&#x5931;&#x51FD;&#x6570;&#x8BC4;&#x4F30;&#x8F93;&#x51FA;&#x5E8F;&#x5217; <img src="../images/chapter_14/o-14-4.png" alt="">&#xFF08;&#x5176;&#x4E2D; <img src="../images/tex-e703e1ba18d3838a4834b8529afbddff.gif" alt="t_{min}"> &#x548C; <img src="../images/tex-afdc190074a7e451cec25ee2fde23fa2.gif" alt="t_{max}"> &#x662F;&#x7B2C;&#x4E00;&#x4E2A;&#x548C;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x8F93;&#x51FA;&#x65F6;&#x95F4;&#x6B65;&#x957F;&#xFF0C;&#x4E0D;&#x8BA1;&#x7B97;&#x5FFD;&#x7565;&#x7684;&#x8F93;&#x51FA;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x8BE5;&#x635F;&#x5931;&#x51FD;&#x6570;&#x7684;&#x68AF;&#x5EA6;&#x901A;&#x8FC7;&#x5C55;&#x5F00;&#x7684;&#x7F51;&#x7EDC;&#x5411;&#x540E;&#x4F20;&#x64AD;&#xFF08;&#x5B9E;&#x7EBF;&#x7BAD;&#x5934;&#xFF09;&#xFF1B;&#x6700;&#x540E;&#x4F7F;&#x7528;&#x5728; BPTT &#x671F;&#x95F4;&#x8BA1;&#x7B97;&#x7684;&#x68AF;&#x5EA6;&#x6765;&#x66F4;&#x65B0;&#x6A21;&#x578B;&#x53C2;&#x6570;&#x3002; &#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x68AF;&#x5EA6;&#x5728;&#x635F;&#x5931;&#x51FD;&#x6570;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x6240;&#x6709;&#x8F93;&#x51FA;&#x4E2D;&#x53CD;&#x5411;&#x6D41;&#x52A8;&#xFF0C;&#x800C;&#x4E0D;&#x4EC5;&#x4EC5;&#x901A;&#x8FC7;&#x6700;&#x7EC8;&#x8F93;&#x51FA;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x56FE; 14-5 &#x4E2D;&#xFF0C;&#x635F;&#x5931;&#x51FD;&#x6570;&#x4F7F;&#x7528;&#x7F51;&#x7EDC;&#x7684;&#x6700;&#x540E;&#x4E09;&#x4E2A;&#x8F93;&#x51FA; <img src="../images/tex-a0b673959034f5d7721eda22ec8f8a59.gif" alt="Y^{(2)}">&#xFF0C;<img src="../images/tex-a9fd2d0f4eafa552b514c6a68092a08c.gif" alt="Y^{(3)}"> &#x548C; <img src="../images/tex-966fcc27b1359fe6160829661f0657cc.gif" alt="Y^{(4)}">&#xFF0C;&#x6240;&#x4EE5;&#x68AF;&#x5EA6;&#x6D41;&#x7ECF;&#x8FD9;&#x4E09;&#x4E2A;&#x8F93;&#x51FA;&#xFF0C;&#x4F46;&#x4E0D;&#x901A;&#x8FC7; <img src="../images/tex-347b979a3eaaf423a7c376ba475f1313.gif" alt="Y^{(0)}"> &#x548C; <img src="../images/tex-44e3acde9f1b11682289b6069b6f2a1f.gif" alt="Y^{(1)}">&#xFF09;&#x3002; &#x800C;&#x4E14;&#xFF0C;&#x7531;&#x4E8E;&#x5728;&#x6BCF;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#x9AA4;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x53C2;&#x6570;<code>W</code>&#x548C;<code>b</code>&#xFF0C;&#x6240;&#x4EE5;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x5C06;&#x505A;&#x6B63;&#x786E;&#x7684;&#x4E8B;&#x60C5;&#x5E76;&#x4E14;&#x603B;&#x7ED3;&#x6240;&#x6709;&#x65F6;&#x95F4;&#x6B65;&#x9AA4;&#x3002;</p>
<h2 id="&#x8BAD;&#x7EC3;&#x5E8F;&#x5217;&#x5206;&#x7C7B;&#x5668;">&#x8BAD;&#x7EC3;&#x5E8F;&#x5217;&#x5206;&#x7C7B;&#x5668;</h2>
<p>&#x6211;&#x4EEC;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A; RNN &#x6765;&#x5206;&#x7C7B; MNIST &#x56FE;&#x50CF;&#x3002; &#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5C06;&#x66F4;&#x9002;&#x5408;&#x4E8E;&#x56FE;&#x50CF;&#x5206;&#x7C7B;&#xFF08;&#x89C1;&#x7B2C; 13 &#x7AE0;&#xFF09;&#xFF0C;&#x4F46;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x4F60;&#x5DF2;&#x7ECF;&#x719F;&#x6089;&#x7684;&#x7B80;&#x5355;&#x4F8B;&#x5B50;&#x3002; &#x6211;&#x4EEC;&#x5C06;&#x628A;&#x6BCF;&#x4E2A;&#x56FE;&#x50CF;&#x89C6;&#x4E3A; 28 &#x884C; 28 &#x50CF;&#x7D20;&#x7684;&#x5E8F;&#x5217;&#xFF08;&#x56E0;&#x4E3A;&#x6BCF;&#x4E2A;MNIST&#x56FE;&#x50CF;&#x662F;<code>28&#xD7;28</code>&#x50CF;&#x7D20;&#xFF09;&#x3002; &#x6211;&#x4EEC;&#x5C06;&#x4F7F;&#x7528; 150 &#x4E2A;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x5355;&#x5143;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x542B;&#x8FDE;&#x63A5;&#x5230;&#x4E0A;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#x7684;&#x8F93;&#x51FA;&#x7684; 10 &#x4E2A;&#x795E;&#x7ECF;&#x5143;&#xFF08;&#x6BCF;&#x4E2A;&#x7C7B;&#x4E00;&#x4E2A;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x662F;&#x4E00;&#x4E2A; softmax &#x5C42;&#xFF08;&#x89C1;&#x56FE; 14-6&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_14/14-6.png" alt=""></p>
<p>&#x5EFA;&#x6A21;&#x9636;&#x6BB5;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C; &#x5B83;&#x548C;&#x6211;&#x4EEC;&#x5728;&#x7B2C; 10 &#x7AE0;&#x4E2D;&#x5EFA;&#x7ACB;&#x7684; MNIST &#x5206;&#x7C7B;&#x5668;&#x51E0;&#x4E4E;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x53EA;&#x662F;&#x5C55;&#x5F00;&#x7684; RNN &#x66FF;&#x6362;&#x4E86;&#x9690;&#x5C42;&#x3002; &#x6CE8;&#x610F;&#xFF0C;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x8FDE;&#x63A5;&#x5230;&#x72B6;&#x6001;&#x5F20;&#x91CF;&#xFF0C;&#x5176;&#x4EC5;&#x5305;&#x542B; RNN &#x7684;&#x6700;&#x7EC8;&#x72B6;&#x6001;&#xFF08;&#x5373;&#xFF0C;&#x7B2C; 28 &#x4E2A;&#x8F93;&#x51FA;&#xFF09;&#x3002; &#x53E6;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;<code>y</code>&#x662F;&#x76EE;&#x6807;&#x7C7B;&#x7684;&#x5360;&#x4F4D;&#x7B26;&#x3002;</p>
<pre><code class="lang-py">n_steps = <span class="hljs-number">28</span>
n_inputs = <span class="hljs-number">28</span>
n_neurons = <span class="hljs-number">150</span>
n_outputs = <span class="hljs-number">10</span>

learning_rate = <span class="hljs-number">0.001</span>

X = tf.placeholder(tf.float32, [<span class="hljs-keyword">None</span>, n_steps, n_inputs])
y = tf.placeholder(tf.int32, [<span class="hljs-keyword">None</span>])

basic_cell = tf.contrib.rnn.BasicRNNCell(num_units=n_neurons)
outputs, states = tf.nn.dynamic_rnn(basic_cell, X, dtype=tf.float32)

logits = tf.layers.dense(states, n_outputs)
xentropy = tf.nn.sparse_softmax_cross_entropy_with_logits(labels=y,
                                                          logits=logits)
loss = tf.reduce_mean(xentropy)
optimizer = tf.train.AdamOptimizer(learning_rate=learning_rate)
training_op = optimizer.minimize(loss)
correct = tf.nn.in_top_k(logits, y, <span class="hljs-number">1</span>)
accuracy = tf.reduce_mean(tf.cast(correct, tf.float32))

init = tf.global_variables_initializer()
</code></pre>
<p>&#x73B0;&#x5728;&#x8BA9;&#x6211;&#x4EEC;&#x52A0;&#x8F7D; MNIST &#x6570;&#x636E;&#xFF0C;&#x5E76;&#x6309;&#x7167;&#x7F51;&#x7EDC;&#x7684;&#x9884;&#x671F;&#x65B9;&#x5F0F;&#x5C06;&#x6D4B;&#x8BD5;&#x6570;&#x636E;&#x91CD;&#x5851;&#x4E3A;<code>[batch_size, n_steps, n_inputs]</code>&#x3002; &#x6211;&#x4EEC;&#x4E4B;&#x540E;&#x4F1A;&#x5173;&#x6CE8;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x7684;&#x91CD;&#x5851;&#x3002;</p>
<pre><code class="lang-py"><span class="hljs-keyword">from</span> tensorflow.examples.tutorials.mnist <span class="hljs-keyword">import</span> input_data
mnist = input_data.read_data_sets(<span class="hljs-string">&quot;/tmp/data/&quot;</span>)
X_test = mnist.test.images.reshape((<span class="hljs-number">-1</span>, n_steps, n_inputs))
y_test = mnist.test.labels
</code></pre>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x51C6;&#x5907;&#x8BAD;&#x7EC3; RNN &#x4E86;&#x3002; &#x6267;&#x884C;&#x9636;&#x6BB5;&#x4E0E;&#x7B2C; 10 &#x7AE0;&#x4E2D; MNIST &#x5206;&#x7C7B;&#x5668;&#x7684;&#x6267;&#x884C;&#x9636;&#x6BB5;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#xFF0C;&#x4E0D;&#x540C;&#x4E4B;&#x5904;&#x5728;&#x4E8E;&#x6211;&#x4EEC;&#x5728;&#x5C06;&#x6BCF;&#x4E2A;&#x8BAD;&#x7EC3;&#x7684;&#x6279;&#x91CF;&#x63D0;&#x4F9B;&#x7ED9;&#x7F51;&#x7EDC;&#x4E4B;&#x524D;&#x8981;&#x91CD;&#x65B0;&#x8C03;&#x6574;&#x3002;</p>
<pre><code class="lang-py">batch_size = <span class="hljs-number">150</span>

<span class="hljs-keyword">with</span> tf.Session() <span class="hljs-keyword">as</span> sess:
    init.run()
    <span class="hljs-keyword">for</span> epoch <span class="hljs-keyword">in</span> range(n_epochs):
        <span class="hljs-keyword">for</span> iteration <span class="hljs-keyword">in</span> range(mnist.train.num_examples // batch_size):
            X_batch, y_batch = mnist.train.next_batch(batch_size)
            X_batch = X_batch.reshape((<span class="hljs-number">-1</span>, n_steps, n_inputs))
            sess.run(training_op, feed_dict={X: X_batch, y: y_batch})
        acc_train = accuracy.eval(feed_dict={X: X_batch, y: y_batch})
        acc_test = accuracy.eval(feed_dict={X: X_test, y: y_test})
        print(epoch, <span class="hljs-string">&quot;Train accuracy:&quot;</span>, acc_train, <span class="hljs-string">&quot;Test accuracy:&quot;</span>, acc_test)
</code></pre>
<p>&#x8F93;&#x51FA;&#x5E94;&#x8BE5;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;</p>
<p><img src="../images/chapter_14/o-14-5.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x83B7;&#x5F97;&#x4E86;&#x8D85;&#x8FC7; 98% &#x7684;&#x51C6;&#x786E;&#x6027; - &#x4E0D;&#x9519;&#xFF01; &#x53E6;&#x5916;&#xFF0C;&#x901A;&#x8FC7;&#x8C03;&#x6574;&#x8D85;&#x53C2;&#x6570;&#xFF0C;&#x4F7F;&#x7528; He &#x521D;&#x59CB;&#x5316;&#x521D;&#x59CB;&#x5316; RNN &#x6743;&#x91CD;&#xFF0C;&#x66F4;&#x957F;&#x65F6;&#x95F4;&#x8BAD;&#x7EC3;&#x6216;&#x6DFB;&#x52A0;&#x4E00;&#x4E9B;&#x6B63;&#x5219;&#x5316;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;droupout&#xFF09;&#xFF0C;&#x4F60;&#x80AF;&#x5B9A;&#x4F1A;&#x83B7;&#x5F97;&#x66F4;&#x597D;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5C06;&#x5176;&#x6784;&#x9020;&#x4EE3;&#x7801;&#x5305;&#x88C5;&#x5728;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x4F5C;&#x7528;&#x57DF;&#x5185;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x4F7F;&#x7528;<code>variable_scope(&quot;rnn&quot;, initializer = variance_scaling_initializer())</code>&#x6765;&#x4F7F;&#x7528; He &#x521D;&#x59CB;&#x5316;&#xFF09;&#x6765;&#x4E3A; RNN &#x6307;&#x5B9A;&#x521D;&#x59CB;&#x5316;&#x5668;&#x3002;</p>
<h2 id="&#x4E3A;&#x9884;&#x6D4B;&#x65F6;&#x95F4;&#x5E8F;&#x5217;&#x800C;&#x8BAD;&#x7EC3;">&#x4E3A;&#x9884;&#x6D4B;&#x65F6;&#x95F4;&#x5E8F;&#x5217;&#x800C;&#x8BAD;&#x7EC3;</h2>
<p>&#x73B0;&#x5728;&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;&#x5982;&#x4F55;&#x5904;&#x7406;&#x65F6;&#x95F4;&#x5E8F;&#x5217;&#xFF0C;&#x5982;&#x80A1;&#x4EF7;&#xFF0C;&#x6C14;&#x6E29;&#xFF0C;&#x8111;&#x7535;&#x6CE2;&#x6A21;&#x5F0F;&#x7B49;&#x7B49;&#x3002; &#x5728;&#x672C;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A; RNN &#x6765;&#x9884;&#x6D4B;&#x751F;&#x6210;&#x7684;&#x65F6;&#x95F4;&#x5E8F;&#x5217;&#x4E2D;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x503C;&#x3002; &#x6BCF;&#x4E2A;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#x662F;&#x4ECE;&#x65F6;&#x95F4;&#x5E8F;&#x5217;&#x4E2D;&#x968F;&#x673A;&#x9009;&#x53D6;&#x7684; 20 &#x4E2A;&#x8FDE;&#x7EED;&#x503C;&#x7684;&#x5E8F;&#x5217;&#xFF0C;&#x76EE;&#x6807;&#x5E8F;&#x5217;&#x4E0E;&#x8F93;&#x5165;&#x5E8F;&#x5217;&#x76F8;&#x540C;&#xFF0C;&#x9664;&#x4E86;&#x5411;&#x540E;&#x79FB;&#x52A8;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#xFF08;&#x53C2;&#x89C1;&#x56FE;14-7&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_14/14-7.png" alt=""></p>
<p>&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x521B;&#x5EFA;&#x4E00;&#x4E2A; RNN&#x3002; &#x5B83;&#x5C06;&#x5305;&#x542B; 100 &#x4E2A;&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x5143;&#xFF0C;&#x5E76;&#x4E14;&#x6211;&#x4EEC;&#x5C06;&#x5728; 20 &#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#x9AA4;&#x4E0A;&#x5C55;&#x5F00;&#x5B83;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x4E2A;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#x5C06;&#x662F; 20 &#x4E2A;&#x8F93;&#x5165;&#x90A3;&#x4E48;&#x957F;&#x3002; &#x6BCF;&#x4E2A;&#x8F93;&#x5165;&#x5C06;&#x4EC5;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x7279;&#x5F81;&#xFF08;&#x5728;&#x8BE5;&#x65F6;&#x95F4;&#x7684;&#x503C;&#xFF09;&#x3002; &#x76EE;&#x6807;&#x4E5F;&#x662F; 20 &#x4E2A;&#x8F93;&#x5165;&#x7684;&#x5E8F;&#x5217;&#xFF0C;&#x6BCF;&#x4E2A;&#x8F93;&#x5165;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x503C;&#x3002; &#x4EE3;&#x7801;&#x4E0E;&#x4E4B;&#x524D;&#x51E0;&#x4E4E;&#x76F8;&#x540C;&#xFF1A;</p>
<p><img src="../images/chapter_14/o-14-6.png" alt=""></p>
<p>&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x4F60;&#x5C06;&#x4E0D;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#x529F;&#x80FD;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8BD5;&#x56FE;&#x9884;&#x6D4B;&#x80A1;&#x7968;&#x4EF7;&#x683C;&#xFF0C;&#x5219;&#x4F60;&#x53EF;&#x80FD;&#x5728;&#x6BCF;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#x9AA4;&#x90FD;&#x4F1A;&#x6709;&#x8BB8;&#x591A;&#x5176;&#x4ED6;&#x8F93;&#x5165;&#x529F;&#x80FD;&#xFF0C;&#x4F8B;&#x5982;&#x7ADE;&#x4E89;&#x80A1;&#x7968;&#x7684;&#x4EF7;&#x683C;&#xFF0C;&#x5206;&#x6790;&#x5E08;&#x7684;&#x8BC4;&#x7EA7;&#x6216;&#x53EF;&#x80FD;&#x5E2E;&#x52A9;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x9884;&#x6D4B;&#x7684;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x529F;&#x80FD;&#x3002;</p>
<p>&#x5728;&#x6BCF;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#xFF0C;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x6709;&#x4E00;&#x4E2A;&#x5927;&#x5C0F;&#x4E3A; 100 &#x7684;&#x8F93;&#x51FA;&#x5411;&#x91CF;&#x3002;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x5B9E;&#x9645;&#x9700;&#x8981;&#x7684;&#x662F;&#x6BCF;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#x7684;&#x5355;&#x4E2A;&#x8F93;&#x51FA;&#x503C;&#x3002; &#x6700;&#x7B80;&#x5355;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#x662F;&#x5C06;&#x5355;&#x5143;&#x5305;&#x88C5;&#x5728;<code>OutputProjectionWrapper</code>&#x4E2D;&#x3002; &#x5355;&#x5143;&#x5305;&#x88C5;&#x5668;&#x5C31;&#x50CF;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x7684;&#x5355;&#x5143;&#xFF0C;&#x4EE3;&#x7406;&#x6BCF;&#x4E2A;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x4E00;&#x4E2A;&#x5E95;&#x5C42;&#x5355;&#x5143;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4E5F;&#x589E;&#x52A0;&#x4E86;&#x4E00;&#x4E9B;&#x529F;&#x80FD;&#x3002;<code>Out putProjectionWrapper</code>&#x5728;&#x6BCF;&#x4E2A;&#x8F93;&#x51FA;&#x4E4B;&#x4E0A;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x5B8C;&#x5168;&#x8FDE;&#x63A5;&#x7684;&#x7EBF;&#x6027;&#x795E;&#x7ECF;&#x5143;&#x5C42;&#xFF08;&#x5373;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF09;&#xFF08;&#x4F46;&#x4E0D;&#x5F71;&#x54CD;&#x5355;&#x5143;&#x72B6;&#x6001;&#xFF09;&#x3002; &#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x5B8C;&#x5168;&#x8FDE;&#x63A5;&#x7684;&#x5C42;&#x5171;&#x4EAB;&#x76F8;&#x540C;&#xFF08;&#x53EF;&#x8BAD;&#x7EC3;&#xFF09;&#x7684;&#x6743;&#x91CD;&#x548C;&#x504F;&#x5DEE;&#x9879;&#x3002; &#x7ED3;&#x679C; RNN &#x5982;&#x56FE; 14-8 &#x6240;&#x793A;&#x3002;</p>
<p><img src="../images/chapter_14/14-8.png" alt=""></p>
<p>&#x5305;&#x88C5;&#x5355;&#x5143;&#x662F;&#x76F8;&#x5F53;&#x5BB9;&#x6613;&#x7684;&#x3002; &#x8BA9;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x5C06;<code>BasicRNNCell</code>&#x5305;&#x88C5;&#x5230;<code>OutputProjectionWrapper</code>&#x4E2D;&#x6765;&#x8C03;&#x6574;&#x524D;&#x9762;&#x7684;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code class="lang-py">cell =tf.contrib.rnn.OutputProjectionWrapper(
    tf.contrib.rnn.BasicRNNCell(num_units=n_neurons,activation=tf.nn.relu),
    output_size=n_outputs)
</code></pre>
<p>&#x5230;&#x73B0;&#x5728;&#x4E3A;&#x6B62;&#x8FD8;&#x633A;&#x597D;&#x3002; &#x73B0;&#x5728;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5B9A;&#x4E49;&#x635F;&#x5931;&#x51FD;&#x6570;&#x3002; &#x6211;&#x4EEC;&#x5C06;&#x4F7F;&#x7528;&#x5747;&#x65B9;&#x8BEF;&#x5DEE;&#xFF08;MSE&#xFF09;&#xFF0C;&#x5C31;&#x50CF;&#x6211;&#x4EEC;&#x5728;&#x4E4B;&#x524D;&#x7684;&#x56DE;&#x5F52;&#x4EFB;&#x52A1;&#x4E2D;&#x6240;&#x505A;&#x7684;&#x90A3;&#x6837;&#x3002; &#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x50CF;&#x5F80;&#x5E38;&#x4E00;&#x6837;&#x521B;&#x5EFA;&#x4E00;&#x4E2A; Adam &#x4F18;&#x5316;&#x5668;&#xFF0C;&#x8BAD;&#x7EC3;&#x64CD;&#x4F5C;&#x548C;&#x53D8;&#x91CF;&#x521D;&#x59CB;&#x5316;&#x64CD;&#x4F5C;&#xFF1A;</p>
<h3 id="&#x751F;&#x6210;-rnn">&#x751F;&#x6210; RNN</h3>
<p>&#x5230;&#x73B0;&#x5728;&#x4E3A;&#x6B62;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x8BAD;&#x7EC3;&#x4E86;&#x4E00;&#x4E2A;&#x80FD;&#x591F;&#x9884;&#x6D4B;&#x672A;&#x6765;&#x65F6;&#x523B;&#x6837;&#x672C;&#x503C;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x6B63;&#x5982;&#x524D;&#x6587;&#x6240;&#x8FF0;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x6A21;&#x578B;&#x6765;&#x751F;&#x6210;&#x65B0;&#x7684;&#x5E8F;&#x5217;&#x3002;</p>
<p>&#x4E3A;&#x6A21;&#x578B;&#x63D0;&#x4F9B; &#x957F;&#x5EA6;&#x4E3A;<code>n_steps</code>&#x7684;&#x79CD;&#x5B50;&#x5E8F;&#x5217;, &#x6BD4;&#x5982;&#x5168;&#x96F6;&#x5E8F;&#x5217;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x6A21;&#x578B;&#x9884;&#x6D4B;&#x4E0B;&#x4E00;&#x65F6;&#x523B;&#x7684;&#x503C;&#xFF1B;&#x628A;&#x8BE5;&#x9884;&#x6D4B;&#x503C;&#x6DFB;&#x52A0;&#x5230;&#x79CD;&#x5B50;&#x5E8F;&#x5217;&#x7684;&#x672B;&#x5C3E;&#xFF0C;&#x7528;&#x6700;&#x540E;&#x9762; &#x957F;&#x5EA6;&#x4E3A;<code>n_steps</code>&#x7684;&#x5E8F;&#x5217;&#x505A;&#x4E3A;&#x65B0;&#x7684;&#x79CD;&#x5B50;&#x5E8F;&#x5217;&#xFF0C;&#x505A;&#x4E0B;&#x4E00;&#x6B21;&#x9884;&#x6D4B;&#xFF0C;&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#x751F;&#x6210;&#x9884;&#x6D4B;&#x5E8F;&#x5217;&#x3002;</p>
<p>&#x5982;&#x56FE; 14-11 &#x6240;&#x793A;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4EA7;&#x751F;&#x7684;&#x5E8F;&#x5217;&#x4F1A;&#x8DDF;&#x539F;&#x59CB;&#x65F6;&#x95F4;&#x5E8F;&#x5217;&#x76F8;&#x4F3C;&#x3002;</p>
<p><img src="../images/chapter_14/14-11.PNG" alt="Figure 14-11"></p>
<pre><code class="lang-python">sequence = [<span class="hljs-number">0.</span>] * n_steps
<span class="hljs-keyword">for</span> iteration <span class="hljs-keyword">in</span> range(<span class="hljs-number">300</span>):
    X_batch = np.array(sequence[-n_steps:].reshape(<span class="hljs-number">1</span>, n_steps, <span class="hljs-number">1</span>)
    y_pred = sess.run(outputs, feed_dict={X: X_batch}
    sequence.append(y_pred[<span class="hljs-number">0</span>, <span class="hljs-number">-1</span>, <span class="hljs-number">0</span>]
</code></pre>
<p>&#x5982;&#x679C;&#x4F60;&#x8BD5;&#x56FE;&#x628A;&#x7EA6;&#x7FF0;&#xB7;&#x5217;&#x4FAC;&#x7684;&#x5531;&#x7247;&#x585E;&#x7ED9;&#x4E00;&#x4E2A; RNN &#x6A21;&#x578B;&#xFF0C;&#x770B;&#x5B83;&#x80FD;&#x4E0D;&#x80FD;&#x751F;&#x6210;&#x4E0B;&#x4E00;&#x5F20;&#x300A;&#x60F3;&#x8C61;&#x300B;&#x4E13;&#x8F91;&#x3002;</p>
<blockquote>
<p>&#x6CE8;</p>
<p>&#x7EA6;&#x7FF0;&#xB7;&#x5217;&#x4FAC; &#x6709;&#x4E00;&#x5F20;&#x4E13;&#x8F91;&#x300A;Imagine&#x300B;&#xFF08;1971&#xFF09;&#xFF0C;&#x8FD9;&#x91CC;&#x53D6;&#x5176;&#x53CC;&#x5173;&#x7684;&#x610F;&#x601D;</p>
</blockquote>
<p>&#x4E5F;&#x8BB8;&#x4F60;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x66F4;&#x5F3A;&#x5927;&#x7684; RNN &#x7F51;&#x7EDC;&#xFF0C;&#x5B83;&#x6709;&#x66F4;&#x591A;&#x7684;&#x795E;&#x7ECF;&#x5143;&#xFF0C;&#x5C42;&#x6570;&#x4E5F;&#x66F4;&#x591A;&#x3002;&#x4E0B;&#x9762;&#x6765;&#x63A2;&#x7A76;&#x4E00;&#x4E0B;&#x6DF1;&#x5EA6; RNN&#x3002;</p>
<h2 id="&#x6DF1;&#x5EA6;-rnn">&#x6DF1;&#x5EA6; RNN</h2>
<p>&#x4E00;&#x4E2A;&#x6734;&#x7D20;&#x7684;&#x60F3;&#x6CD5;&#x5C31;&#x662F;&#x628A;&#x4E00;&#x5C42;&#x5C42;&#x795E;&#x7ECF;&#x5143;&#x5806;&#x53E0;&#x8D77;&#x6765;&#xFF0C;&#x6B63;&#x5982;&#x56FE; 14-12 &#x6240;&#x793A;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x5B83;&#x5448;&#x73B0;&#x4E86;&#x4E00;&#x79CD;&#x6DF1;&#x5EA6; RNN&#x3002;</p>
<p><img src="../images/chapter_14/14-12.PNG" alt="Figure 14-12"></p>
<p>&#x4E3A;&#x4E86;&#x7528; TensorFlow &#x5B9E;&#x73B0;&#x6DF1;&#x5EA6; RNN&#xFF0C;&#x53EF;&#x5148;&#x521B;&#x5EFA;&#x4E00;&#x4E9B;&#x795E;&#x7ECF;&#x5355;&#x5143;&#xFF0C;&#x7136;&#x540E;&#x5806;&#x53E0;&#x8FDB;<code>MultiRNNCell</code>&#x3002;</p>
<p>&#x4EE5;&#x4E0B;&#x4EE3;&#x7801;&#x4E2D;&#x521B;&#x5EFA;&#x4E86; 3 &#x4E2A;&#x76F8;&#x540C;&#x7684;&#x795E;&#x7ECF;&#x5355;&#x5143;&#xFF08;&#x5F53;&#x7136;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x4E0D;&#x540C;&#x7C7B;&#x522B;&#x7684;&#x3001;&#x5305;&#x542B;&#x4E0D;&#x540C;&#x4E0D;&#x540C;&#x6570;&#x91CF;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x5355;&#x5143;&#xFF09;</p>
<pre><code class="lang-python">n_neurons = <span class="hljs-number">100</span>
n_layers = <span class="hljs-number">3</span>

basic_cell = tf.contrib.rnn.BasicRNNCell(num_units=n_neurons)
multi_layer_cell = tf.contrib.rnn.MultiRNNCell([basic_cell] * n_layers)
outputs, states = tf.nn.dynamic_rnn(multi_layer_cell, X, dtype=tf.float32)
</code></pre>
<p>&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#x5C31;&#x5B8C;&#x6210;&#x4E86;&#x8FD9;&#x90E8;&#x5206;&#x5806;&#x53E0;&#x5DE5;&#x4F5C;&#x3002;<code>status</code>&#x53D8;&#x91CF;&#x5305;&#x542B;&#x4E86;&#x6BCF;&#x5C42;&#x7684;&#x4E00;&#x4E2A;&#x5F20;&#x91CF;&#xFF0C;&#x8FD9;&#x4E2A;&#x5F20;&#x91CF;&#x5C31;&#x4EE3;&#x8868;&#x4E86;&#x8BE5;&#x5C42;&#x795E;&#x7ECF;&#x5355;&#x5143;&#x7684;&#x6700;&#x7EC8;&#x72B6;&#x6001;&#xFF08;&#x7EF4;&#x5EA6;&#x4E3A;<code>[batch_size, n_neurons]</code>&#xFF09;&#x3002;</p>
<p>&#x5982;&#x679C;&#x5728;&#x521B;&#x5EFA;<code>MultiRNNCell</code>&#x65F6;&#x8BBE;&#x7F6E;&#x4E86;<code>state_is_tuple=False</code>&#xFF0C;&#x90A3;&#x4E48;<code>status</code>&#x53D8;&#x91CF;&#x5C31;&#x53D8;&#x6210;&#x4E86;&#x5355;&#x4E2A;&#x5F20;&#x91CF;&#xFF0C;&#x5B83;&#x5305;&#x542B;&#x4E86;&#x6BCF;&#x4E00;&#x5C42;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x5176;&#x5728;&#x5217;&#x7684;&#x65B9;&#x5411;&#x4E0A;&#x8FDB;&#x884C;&#x4E86;&#x805A;&#x5408;&#xFF0C;&#x7EF4;&#x5EA6;&#x4E3A;<code>[batch_size, n_layers*n_neurons]</code>&#x3002;</p>
<p>&#x6CE8;&#x610F;&#x5728; TensorFlow &#x7248;&#x672C; 0.11.0 &#x4E4B;&#x524D;&#xFF0C;<code>status</code>&#x662F;&#x5355;&#x4E2A;&#x5F20;&#x91CF;&#x662F;&#x9ED8;&#x8BA4;&#x8BBE;&#x7F6E;&#x3002;</p>
<h2 id="&#x5728;&#x591A;&#x4E2A;-gpu-&#x4E0A;&#x5206;&#x5E03;&#x5F0F;&#x90E8;&#x7F72;&#x6DF1;&#x5EA6;-rnn-&#x7F51;&#x7EDC;">&#x5728;&#x591A;&#x4E2A; GPU &#x4E0A;&#x5206;&#x5E03;&#x5F0F;&#x90E8;&#x7F72;&#x6DF1;&#x5EA6; RNN &#x7F51;&#x7EDC;</h2>
<h2 id="dropout-&#x7684;&#x5E94;&#x7528;">Dropout &#x7684;&#x5E94;&#x7528;</h2>
<p>&#x5BF9;&#x4E8E;&#x6DF1;&#x5C42;&#x6DF1;&#x5EA6; RNN&#xFF0C;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x5F88;&#x5BB9;&#x6613;&#x8FC7;&#x62DF;&#x5408;&#x3002;Dropout &#x662F;&#x9632;&#x6B62;&#x8FC7;&#x62DF;&#x5408;&#x7684;&#x5E38;&#x7528;&#x6280;&#x672F;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x7684;&#x5728; RNN &#x5C42;&#x4E4B;&#x524D;&#x6216;&#x4E4B;&#x540E;&#x6DFB;&#x52A0;&#x4E00;&#x5C42; Dropout &#x5C42;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x9700;&#x8981;&#x5728; RNN &#x5C42;&#x4E4B;&#x95F4;&#x5E94;&#x7528; Dropout &#x6280;&#x672F;&#x5C31;&#x9700;&#x8981;<code>DropoutWrapper</code>&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E00;&#x5C42;&#x7684; RNN &#x7684;&#x8F93;&#x5165;&#x524D;&#x90FD;&#x5E94;&#x7528;&#x4E86; Dropout&#xFF0C;Dropout &#x7684;&#x6982;&#x7387;&#x4E3A; 50%&#x3002;</p>
<pre><code class="lang-python">keep_prob = <span class="hljs-number">0.5</span>

cell = tf.contrib.rnn.BasicRNNCell(num_units=n_neurons)
cell_drop = tf.contrib.rnn.DropoutWrapper(cell, input_keep_prob=keep_prob)
multi_layer_cell = tf.contrib.rnn.MultiRNNCell([cell_drop]*n_layers)
rnn_outputs, states = tf.nn.dynamic_rnn(multi_layer_cell, X, dtype=tf.float32)
</code></pre>
<p>&#x540C;&#x65F6;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8BBE;&#x7F6E;<code>output_keep_prob</code>&#x6765;&#x5728;&#x8F93;&#x51FA;&#x5E94;&#x7528; Dropout &#x6280;&#x672F;&#x3002;</p>
<p>&#x7136;&#x800C;&#x5728;&#x4EE5;&#x4E0A;&#x4EE3;&#x7801;&#x4E2D;&#x5B58;&#x5728;&#x7684;&#x4E3B;&#x8981;&#x95EE;&#x9898;&#x662F;&#xFF0C;Dropout &#x4E0D;&#x7BA1;&#x662F;&#x5728;&#x8BAD;&#x7EC3;&#x8FD8;&#x662F;&#x6D4B;&#x8BD5;&#x65F6;&#x90FD;&#x8D77;&#x4F5C;&#x7528;&#x4E86;&#xFF0C;&#x800C;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x7684;&#x4EC5;&#x4EC5;&#x662F;&#x5728;&#x8BAD;&#x7EC3;&#x65F6;&#x5E94;&#x7528; Dropout&#x3002;</p>
<p>&#x5F88;&#x4E0D;&#x5E78;&#x7684;&#x662F;<code>DropoutWrapper</code>&#x4E0D;&#x652F;&#x6301;<code>is_training</code>&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x8BBE;&#x7F6E;&#x9009;&#x9879;&#x3002;&#x56E0;&#x6B64;&#x5FC5;&#x987B;&#x81EA;&#x5DF1;&#x5199; Dropout &#x5305;&#x88C5;&#x7C7B;&#xFF0C;&#x6216;&#x8005;&#x521B;&#x5EFA;&#x4E24;&#x4E2A;&#x8BA1;&#x7B97;&#x56FE;&#xFF0C;&#x4E00;&#x4E2A;&#x7528;&#x6765;&#x8BAD;&#x7EC3;&#xFF0C;&#x4E00;&#x4E2A;&#x7528;&#x6765;&#x6D4B;&#x8BD5;&#x3002;&#x540E;&#x5219;&#x53EF;&#x901A;&#x8FC7;&#x5982;&#x4E0B;&#x9762;&#x4EE3;&#x7801;&#x8FD9;&#x6837;&#x5B9E;&#x73B0;&#x3002;</p>
<pre><code class="lang-python"><span class="hljs-keyword">import</span> sys
is_training  = (sys.argv[<span class="hljs-number">-1</span>] == <span class="hljs-string">&quot;train&quot;</span>)

X = tf.placeholder(tf.float32, [<span class="hljs-keyword">None</span>, n_steps, n_inputs])
y = tf.placeholder(tf.float32, [<span class="hljs-keyword">None</span>, n_steps, n_outputs])
cell = tf.contrib.rnn.BasicRNNCell(num_units=n_neurons)
<span class="hljs-keyword">if</span> is_training:
    cell = tf.contrib.rnn.DropoutWrapper(cell, input_keep_prob=keep_prob)
multi_layer_cell = tf.contrib.rnn.MultiRNNCell([cell]*n_layers)
rnn_outpus, status = tf.nn.dynamic_rnn(multi_layer_cell, X, dtype=tf.float32)

[...] <span class="hljs-comment"># bulid the rest of the graph</span>
init = tf.global_variables_initializer()
saver = tf.train.Saver()

<span class="hljs-keyword">with</span> tf.Session() <span class="hljs-keyword">as</span> sess:
    <span class="hljs-keyword">if</span> is_training:
        init.run()
        <span class="hljs-keyword">for</span> iteration <span class="hljs-keyword">in</span> range(n_iterations):
            [...] <span class="hljs-comment"># train the model</span>
        save_path = saver.save(sess, <span class="hljs-string">&quot;/tmp/my_model.ckpt&quot;</span>)
    <span class="hljs-keyword">else</span>:
        saver.restore(sess, <span class="hljs-string">&quot;/tmp/my_model.ckpt&quot;</span>)
        [...] <span class="hljs-comment"># use the model</span>
</code></pre>
<p>&#x901A;&#x8FC7;&#x4EE5;&#x4E0A;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x80FD;&#x591F;&#x8BAD;&#x7EC3;&#x5404;&#x79CD; RNN &#x7F51;&#x7EDC;&#x4E86;&#x3002;&#x7136;&#x800C;&#x5BF9;&#x4E8E;&#x957F;&#x5E8F;&#x5217;&#x7684; RNN &#x8BAD;&#x7EC3;&#x8FD8;&#x8A00;&#x4E4B;&#x8FC7;&#x65E9;&#xFF0C;&#x4E8B;&#x60C5;&#x4F1A;&#x53D8;&#x5F97;&#x6709;&#x4E00;&#x4E9B;&#x56F0;&#x96BE;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x6765;&#x63A2;&#x8BA8;&#x4E00;&#x4E0B;&#x7A76;&#x7ADF;&#x8FD9;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x548C;&#x600E;&#x4E48;&#x5E94;&#x5BF9;&#x5462;&#xFF1F;</p>
<h2 id="&#x957F;&#x65F6;&#x8BAD;&#x7EC3;&#x7684;&#x56F0;&#x96BE;">&#x957F;&#x65F6;&#x8BAD;&#x7EC3;&#x7684;&#x56F0;&#x96BE;</h2>
<p>&#x5728;&#x8BAD;&#x7EC3;&#x957F;&#x5E8F;&#x5217;&#x7684; RNN &#x6A21;&#x578B;&#x65F6;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x9700;&#x8981;&#x628A; RNN &#x5728;&#x65F6;&#x95F4;&#x7EF4;&#x5EA6;&#x4E0A;&#x5C55;&#x5F00;&#x6210;&#x5F88;&#x6DF1;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;&#x6B63;&#x5982;&#x4EFB;&#x4F55;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E00;&#x6837;&#xFF0C;&#x5176;&#x9762;&#x4E34;&#x7740;&#x68AF;&#x5EA6;&#x6D88;&#x5931;/&#x7206;&#x70B8;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4F7F;&#x8BAD;&#x7EC3;&#x65E0;&#x6CD5;&#x7EC8;&#x6B62;&#x6216;&#x6536;&#x655B;&#x3002;</p>
<p>&#x5F88;&#x591A;&#x4E4B;&#x524D;&#x8BA8;&#x8BBA;&#x8FC7;&#x7684;&#x7F13;&#x89E3;&#x8FD9;&#x79CD;&#x95EE;&#x9898;&#x7684;&#x6280;&#x5DE7;&#x90FD;&#x53EF;&#x4EE5;&#x5E94;&#x7528;&#x5728;&#x6DF1;&#x5EA6;&#x5C55;&#x5F00;&#x7684; RNN &#x7F51;&#x7EDC;&#xFF1A;&#x597D;&#x7684;&#x53C2;&#x6570;&#x521D;&#x59CB;&#x5316;&#x65B9;&#x5F0F;&#xFF0C;&#x975E;&#x9971;&#x548C;&#x7684;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF08;&#x5982; ReLU&#xFF09;&#xFF0C;&#x6279;&#x91CF;&#x89C4;&#x8303;&#x5316;&#xFF08;Batch Normalization&#xFF09;&#xFF0C; &#x68AF;&#x5EA6;&#x622A;&#x65AD;&#xFF08;Gradient Clipping&#xFF09;&#xFF0C;&#x66F4;&#x5FEB;&#x7684;&#x4F18;&#x5316;&#x5668;&#x3002;</p>
<p>&#x5373;&#x4FBF;&#x5982;&#x6B64;&#xFF0C; RNN &#x5728;&#x5904;&#x7406;&#x9002;&#x4E2D;&#x7684;&#x957F;&#x5E8F;&#x5217;&#xFF08;&#x5982; 100 &#x8F93;&#x5165;&#x5E8F;&#x5217;&#xFF09;&#x4E5F;&#x5728;&#x8BAD;&#x7EC3;&#x65F6;&#x8868;&#x73B0;&#x7684;&#x5F88;&#x6162;&#x3002;</p>
<p>&#x6700;&#x7B80;&#x5355;&#x548C;&#x5E38;&#x89C1;&#x7684;&#x65B9;&#x6CD5;&#x89E3;&#x51B3;&#x8BAD;&#x7EC3;&#x65F6;&#x957F;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x5728;&#x8BAD;&#x7EC3;&#x9636;&#x6BB5;&#x4EC5;&#x4EC5;&#x5C55;&#x5F00;&#x9650;&#x5B9A;&#x65F6;&#x95F4;&#x6B65;&#x957F;&#x7684; RNN &#x7F51;&#x7EDC;&#xFF0C;&#x4E00;&#x79CD;&#x79F0;&#x4E3A;&#x622A;&#x65AD;&#x65F6;&#x95F4;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x7684;&#x7B97;&#x6CD5;&#x3002;</p>
<p>&#x5728; TensorFlow &#x4E2D;&#x901A;&#x8FC7;&#x622A;&#x65AD;&#x8F93;&#x5165;&#x5E8F;&#x5217;&#x6765;&#x7B80;&#x5355;&#x5B9E;&#x73B0;&#x8FD9;&#x79CD;&#x529F;&#x80FD;&#x3002;&#x4F8B;&#x5982;&#x5728;&#x65F6;&#x95F4;&#x5E8F;&#x5217;&#x9884;&#x6D4B;&#x95EE;&#x9898;&#x4E0A;&#x53EF;&#x4EE5;&#x5728;&#x8BAD;&#x7EC3;&#x65F6;&#x51CF;&#x5C0F;<code>n_steps</code>&#x6765;&#x5B9E;&#x73B0;&#x622A;&#x65AD;&#x3002;&#x7406;&#x6240;&#x5F53;&#x7136;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x4F1A;&#x9650;&#x5236;&#x6A21;&#x578B;&#x5728;&#x957F;&#x671F;&#x6A21;&#x5F0F;&#x7684;&#x5B66;&#x4E60;&#x80FD;&#x529B;&#x3002;&#x4E00;&#x79CD;&#x53D8;&#x901A;&#x65B9;&#x6848;&#x65F6;&#x786E;&#x4FDD;&#x7F29;&#x77ED;&#x7684;&#x5E8F;&#x5217;&#x4E2D;&#x5305;&#x542B;&#x65E7;&#x6570;&#x636E;&#x548C;&#x65B0;&#x6570;&#x636E;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x6A21;&#x578B;&#x83B7;&#x5F97;&#x4E24;&#x8005;&#x4FE1;&#x606F;&#xFF08;&#x5982;&#x5E8F;&#x5217;&#x540C;&#x65F6;&#x5305;&#x542B;&#x6700;&#x8FD1;&#x4E94;&#x4E2A;&#x6708;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6700;&#x8FD1;&#x4E94;&#x5468;&#x7684;&#x548C;&#x6700;&#x8FD1;&#x4E94;&#x5929;&#x7684;&#x6570;&#x636E;&#xFF09;&#x3002;</p>
<p>&#x95EE;&#x9898;&#x65F6;&#x5982;&#x4F55;&#x786E;&#x4FDD;&#x4ECE;&#x53BB;&#x5E74;&#x7684;&#x7EC6;&#x5206;&#x7C7B;&#x4E2D;&#x83B7;&#x53D6;&#x7684;&#x6570;&#x636E;&#x6709;&#x6548;&#x6027;&#x5462;&#xFF1F;&#x8FD9;&#x671F;&#x95F4;&#x77ED;&#x6682;&#x4F46;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#x4EF6;&#x5BF9;&#x540E;&#x4E16;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x751A;&#x81F3;&#x65F6;&#x6570;&#x5E74;&#x540E;&#x8FD9;&#x79CD;&#x5F71;&#x54CD;&#x662F;&#x5426;&#x4E00;&#x5B9A;&#x8981;&#x8003;&#x8651;&#x5728;&#x5185;&#x5462;&#xFF08;&#x5982;&#x9009;&#x4E3E;&#x7ED3;&#x679C;&#xFF09;&#xFF1F;&#x8FD9;&#x79CD;&#x65B9;&#x6848;&#x6709;&#x5176;&#x5148;&#x5929;&#x7684;&#x4E0D;&#x8DB3;&#x4E4B;&#x5904;&#x3002;</p>
<p>&#x5728;&#x957F;&#x7684;&#x65F6;&#x95F4;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x8981;&#x9762;&#x4E34;&#x7684;&#x95EE;&#x9898;&#x65F6;&#x7B2C;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#x7684;&#x8BB0;&#x5FC6;&#x4F1A;&#x5728;&#x957F;&#x65F6;&#x95F4;&#x8FD0;&#x884C;&#x7684; RNN &#x7F51;&#x7EDC;&#x4E2D;&#x9010;&#x6E10;&#x6DE1;&#x53BB;&#x3002;&#x786E;&#x5B9E;&#xFF0C;&#x901A;&#x8FC7;&#x53D8;&#x6362;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x6570;&#x636E;&#x7A7F;&#x6D41;&#x5728; RNN &#x7F51;&#x7EDC;&#x4E4B;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#x957F;&#x540E;&#x90FD;&#x6709;&#x4E00;&#x4E9B;&#x4FE1;&#x606F;&#x88AB;&#x629B;&#x5F03;&#x6389;&#x4E86;&#x3002;&#x90A3;&#x4E48;&#x5728;&#x4E00;&#x5B9A;&#x65F6;&#x95F4;&#x540E;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#x5B9E;&#x9645;&#x4E0A;&#x4F1A;&#x5728; RNN &#x7684;&#x72B6;&#x6001;&#x4E2D;&#x6D88;&#x5931;&#x4E8E;&#x65E0;&#x5F62;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x4F60;&#x60F3;&#x8981;&#x5206;&#x6790;&#x957F;&#x7BC7;&#x5E45;&#x7684;&#x5F71;&#x8BC4;&#x7684;&#x60C5;&#x611F;&#x7C7B;&#x522B;&#xFF0C;&#x5F71;&#x8BC4;&#x4EE5;<code>&quot;I love this movie&quot;</code>&#x5F00;&#x7BC7;&#xFF0C;&#x5E76;&#x8F85;&#x4EE5;&#x5404;&#x79CD;&#x6539;&#x5584;&#x5F71;&#x7247;&#x7684;&#x4E00;&#x4E9B;&#x5EFA;&#x8BAE;&#x3002;&#x8BD5;&#x60F3;&#x4E00;&#x4E0B;&#xFF0C;&#x5982;&#x679C; RNN &#x7F51;&#x7EDC;&#x9010;&#x6E10;&#x5FD8;&#x8BB0;&#x4E86;&#x5F00;&#x5934;&#x7684;&#x51E0;&#x4E2A;&#x8BCD;&#xFF0C;RNN &#x7F51;&#x7EDC;&#x7684;&#x5224;&#x65AD;&#x5B8C;&#x5168;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x5BF9;&#x5F71;&#x8BC4;&#x65AD;&#x7AE0;&#x53D6;&#x4E49;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x5176;&#x4E2D;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5404;&#x79CD;&#x80FD;&#x591F;&#x643A;&#x5E26;&#x957F;&#x65F6;&#x8BB0;&#x5FC6;&#x7684;&#x795E;&#x7ECF;&#x5355;&#x5143;&#x7684;&#x53D8;&#x4F53;&#x88AB;&#x63D0;&#x51FA;&#x3002;&#x8FD9;&#x4E9B;&#x53D8;&#x4F53;&#x662F;&#x6709;&#x6548;&#x7684;&#xFF0C;&#x5F80;&#x5F80;&#x57FA;&#x672C;&#x5F62;&#x5F0F;&#x7684;&#x795E;&#x7ECF;&#x5355;&#x5143;&#x5C31;&#x4E0D;&#x600E;&#x4E48;&#x88AB;&#x4F7F;&#x7528;&#x4E86;&#x3002;</p>
<p>&#x9996;&#x5148;&#x4E86;&#x89E3;&#x4E00;&#x4E0B;&#x6700;&#x6D41;&#x884C;&#x7684;&#x4E00;&#x79CD;&#x957F;&#x65F6;&#x8BB0;&#x5FC6;&#x795E;&#x7ECF;&#x5355;&#x5143;&#xFF1A;&#x957F;&#x77ED;&#x65F6;&#x8BB0;&#x5FC6;&#x795E;&#x7ECF;&#x5355;&#x5143; LSTM&#x3002;</p>
<h2 id="lstm-&#x5355;&#x5143;">LSTM &#x5355;&#x5143;</h2>
<p>&#x957F;&#x77ED;&#x65F6;&#x8BB0;&#x5FC6;&#x5355;&#x5143;&#x5728; 1997 &#x5E74;<a href="https://goo.gl/j39AGv" target="_blank">&#x7531; S.H. &#x548C; J.S. &#x9996;&#x6B21;&#x63D0;&#x51FA;</a> [3]&#xFF0C;&#x5E76;&#x5728;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x51E0;&#x5E74;&#x5185;&#x7ECF;&#x8FC7; <a href="https://goo.gl/6BHh81" target="_blank">A.G&#xFF0C;H.S</a> [4]&#xFF0C;<a href="https://goo.gl/SZ9kzB" target="_blank">W.Z</a> [5] &#x7B49;&#x6570;&#x4F4D;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x7684;&#x6539;&#x8FDB;&#x9010;&#x6E10;&#x5F62;&#x6210;&#x3002;&#x5982;&#x679C;&#x628A; LSTM &#x5355;&#x5143;&#x770B;&#x4F5C;&#x4E00;&#x4E2A;&#x9ED1;&#x76D2;&#xFF0C;&#x4ECE;&#x5916;&#x56F4;&#x770B;&#x5B83;&#x548C;&#x57FA;&#x672C;&#x5F62;&#x5F0F;&#x7684;&#x8BB0;&#x5FC6;&#x5355;&#x5143;&#x5F88;&#x76F8;&#x4F3C;&#xFF0C;&#x4F46; LSTM &#x5355;&#x5143;&#x4F1A;&#x6BD4;&#x57FA;&#x672C;&#x5355;&#x5143;&#x6027;&#x80FD;&#x66F4;&#x597D;&#xFF0C;&#x6536;&#x655B;&#x66F4;&#x5FEB;&#xFF0C;&#x80FD;&#x591F;&#x611F;&#x77E5;&#x6570;&#x636E;&#x7684;&#x957F;&#x65F6;&#x4F9D;&#x8D56;&#x3002;TensorFlow &#x4E2D;&#x901A;&#x8FC7;<code>BasicLSTMCell</code>&#x5B9E;&#x73B0; LSTM &#x5355;&#x5143;&#x3002;</p>
<blockquote>
<p>[3]: &quot;Long Short-Term Memory,&quot; S.Hochreiter and J.Schmidhuber(1997)</p>
<p>[4]: &quot;Long Short-Term Memory Recurrent Neural Network Architectures for Large Scale Acoustic Modeling,&quot; H.Sak et al.(2014)</p>
<p>[5]: &quot;Recurrent Neural Network Regularization,&quot; W.Zaremba et al.(2015)</p>
</blockquote>
<pre><code class="lang-python">lstm_cell = tf.contrib.rnn.BasicLSTMCell(num_units=n_neurons)
</code></pre>
<p>LSTM &#x5355;&#x5143;&#x7684;&#x5DE5;&#x4F5C;&#x673A;&#x5236;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x5728;&#x56FE; 14-13 &#x4E2D;&#x5C55;&#x793A;&#x4E86;&#x57FA;&#x672C; LSTM &#x5355;&#x5143;&#x7684;&#x7ED3;&#x6784;&#x3002;</p>
<p><img src="../images/chapter_14/14-13.PNG" alt="Figure 14-13"></p>
<p>&#x4E0D;&#x89C2;&#x5BDF; LSTM &#x5355;&#x5143;&#x5185;&#x90E8;&#xFF0C;&#x9664;&#x4E86;&#x4E00;&#x4E9B;&#x4E0D;&#x540C;&#x5916;&#x8DDF;&#x5E38;&#x89C4; RNN &#x5355;&#x5143;&#x6781;&#x5176;&#x76F8;&#x4F3C;&#x3002;&#x8FD9;&#x4E9B;&#x4E0D;&#x540C;&#x5305;&#x62EC; LSTM &#x5355;&#x5143;&#x72B6;&#x6001;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x5411;&#x91CF;&#xFF1A;<img src="../images/tex-7ddb4d2d45df22e2e98e6cc504f84787.gif" alt="h^{(t)}"> &#x548C; <img src="../images/tex-d995862557c7577156d8598bbd676ff7.gif" alt="c^{(t)}">&#xFF08;<code>c</code>&#x4EE3;&#x8868; cell&#xFF09;&#x3002;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x8BA4;&#x4E3A; <img src="../images/tex-7ddb4d2d45df22e2e98e6cc504f84787.gif" alt="h^{(t)}"> &#x662F;&#x77ED;&#x671F;&#x8BB0;&#x5FC6;&#x72B6;&#x6001;&#xFF0C;<img src="../images/tex-d995862557c7577156d8598bbd676ff7.gif" alt="c^{(t)}"> &#x662F;&#x957F;&#x671F;&#x8BB0;&#x5FC6;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x597D;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x6253;&#x5F00;&#x76D2;&#x5B50;&#x3002;LSTM &#x5355;&#x5143;&#x7684;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x662F;&#x5176;&#x80FD;&#x591F;&#x5B66;&#x4E60;&#x4ECE;&#x957F;&#x671F;&#x72B6;&#x6001;&#x4E2D;&#x5B58;&#x50A8;&#x4EC0;&#x4E48;&#xFF0C;&#x5FD8;&#x8BB0;&#x4EC0;&#x4E48;&#xFF0C;&#x8BFB;&#x53D6;&#x4EC0;&#x4E48;&#x3002;&#x957F;&#x671F;&#x72B6;&#x6001; <img src="../images/tex-a61d3a5d3cda282b36fe4a3fe7e657c1.gif" alt="c^{(t-1)}"> &#x4ECE;&#x5DE6;&#x5411;&#x53F3;&#x5728;&#x7F51;&#x7EDC;&#x4E2D;&#x4F20;&#x64AD;&#xFF0C;&#x4F9D;&#x6B21;&#x7ECF;&#x8FC7;&#x9057;&#x5FD8;&#x95E8;&#xFF08;forget gate&#xFF09;&#x65F6;&#x4E22;&#x5F03;&#x4E00;&#x4E9B;&#x8BB0;&#x5FC6;&#xFF0C;&#x4E4B;&#x540E;&#x52A0;&#x6CD5;&#x64CD;&#x4F5C;&#x589E;&#x52A0;&#x4E00;&#x4E9B;&#x8BB0;&#x5FC6;&#xFF08;&#x4ECE;&#x8F93;&#x5165;&#x95E8;&#x4E2D;&#x9009;&#x62E9;&#x4E00;&#x4E9B;&#x8BB0;&#x5FC6;&#xFF09;&#x3002;&#x8F93;&#x51FA; <img src="../images/tex-d995862557c7577156d8598bbd676ff7.gif" alt="c^{(t)}"> &#x4E0D;&#x7ECF;&#x4EFB;&#x4F55;&#x8F6C;&#x6362;&#x76F4;&#x63A5;&#x8F93;&#x51FA;&#x3002;&#x6BCF;&#x4E2A;&#x5355;&#x4F4D;&#x65F6;&#x95F4;&#x6B65;&#x957F;&#x540E;&#xFF0C;&#x90FD;&#x6709;&#x4E00;&#x4E9B;&#x8BB0;&#x5FC6;&#x88AB;&#x629B;&#x5F03;&#xFF0C;&#x65B0;&#x7684;&#x8BB0;&#x5FC6;&#x88AB;&#x6DFB;&#x52A0;&#x8FDB;&#x6765;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x957F;&#x65F6;&#x72B6;&#x6001;&#x7ECF;&#x8FC7; tanh &#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x901A;&#x8FC7;&#x8F93;&#x51FA;&#x95E8;&#x5F97;&#x5230;&#x77ED;&#x65F6;&#x8BB0;&#x5FC6; <img src="../images/tex-7ddb4d2d45df22e2e98e6cc504f84787.gif" alt="h^{(t)}">&#xFF0C;&#x540C;&#x65F6;&#x5B83;&#x4E5F;&#x662F;&#x8FD9;&#x4E00;&#x65F6;&#x523B;&#x7684;&#x5355;&#x5143;&#x8F93;&#x51FA;&#x7ED3;&#x679C; <img src="../images/tex-cc685401bcf131ce4e9f980be319daac.gif" alt="y^{(t)}">&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x8BA8;&#x8BBA;&#x4E00;&#x4E0B;&#x65B0;&#x7684;&#x8BB0;&#x5FC6;&#x65F6;&#x5982;&#x4F55;&#x4EA7;&#x751F;&#x7684;&#xFF0C;&#x95E8;&#x7684;&#x529F;&#x80FD;&#x662F;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x7684;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x5F53;&#x524D;&#x7684;&#x8F93;&#x5165;&#x5411;&#x91CF; <img src="../images/tex-df9ed87e836e463cd086106035aef441.gif" alt="x^{(t)}"> &#x548C;&#x524D;&#x4E00;&#x65F6;&#x523B;&#x7684;&#x77ED;&#x65F6;&#x72B6;&#x6001; <img src="../images/tex-c94af4bec72c7e4e9e8f713c23232809.gif" alt="h^{(t-1)}"> &#x4F5C;&#x4E3A;&#x8F93;&#x5165;&#x4F20;&#x7ED9;&#x56DB;&#x4E2A;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#xFF0C;&#x8FD9;&#x56DB;&#x4E2A;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x76EE;&#x7684;&#xFF1A;</p>
<ul>
<li>&#x5176;&#x4E2D;&#x4E3B;&#x8981;&#x7684;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x8F93;&#x51FA; <img src="../images/tex-ededcb90b8071069a783dea14b4aad14.gif" alt="g^{(t)}">&#xFF0C;&#x5B83;&#x7684;&#x5E38;&#x89C4;&#x4EFB;&#x52A1;&#x5C31;&#x662F;&#x89E3;&#x6790;&#x5F53;&#x524D;&#x7684;&#x8F93;&#x5165; <img src="../images/tex-df9ed87e836e463cd086106035aef441.gif" alt="x^{(t)}"> &#x548C;&#x524D;&#x4E00;&#x65F6;&#x523B;&#x7684;&#x77ED;&#x65F6;&#x72B6;&#x6001; <img src="../images/tex-c94af4bec72c7e4e9e8f713c23232809.gif" alt="h^{(t-1)}">&#x3002;&#x5728;&#x57FA;&#x672C;&#x5F62;&#x5F0F;&#x7684; RNN &#x5355;&#x5143;&#x4E2D;&#xFF0C;&#x5C31;&#x4E0E;&#x8FD9;&#x79CD;&#x5F62;&#x5F0F;&#x4E00;&#x6837;&#xFF0C;&#x76F4;&#x63A5;&#x8F93;&#x51FA;&#x4E86; <img src="../images/tex-7ddb4d2d45df22e2e98e6cc504f84787.gif" alt="h^{(t)}">  &#x548C; <img src="../images/tex-cc685401bcf131ce4e9f980be319daac.gif" alt="y^{(t)}">&#x3002;&#x4E0E;&#x4E4B;&#x4E0D;&#x540C;&#x7684;&#x662F; LSTM &#x5355;&#x5143;&#x4F1A;&#x5C06;&#x4E00;&#x90E8;&#x5206; <img src="../images/tex-ededcb90b8071069a783dea14b4aad14.gif" alt="g^{(t)}"> &#x5B58;&#x50A8;&#x5728;&#x957F;&#x65F6;&#x72B6;&#x6001;&#x4E2D;&#x3002;</li>
<li>&#x5176;&#x5B83;&#x4E09;&#x4E2A;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x88AB;&#x79F0;&#x4E3A;&#x95E8;&#x63A7;&#x5236;&#x5668;&#xFF08;gate controller&#xFF09;&#x3002;&#x5176;&#x91C7;&#x7528; Logistic &#x4F5C;&#x4E3A;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF0C;&#x8F93;&#x51FA;&#x8303;&#x56F4;&#x5728; 0 &#x5230; 1 &#x4E4B;&#x95F4;&#x3002;&#x6B63;&#x5982;&#x5728;&#x7ED3;&#x6784;&#x56FE;&#x4E2D;&#x6240;&#x793A;&#xFF0C;&#x8FD9;&#x4E09;&#x4E2A;&#x5C42;&#x7684;&#x8F93;&#x51FA;&#x63D0;&#x4F9B;&#x7ED9;&#x4E86;&#x9010;&#x5143;&#x7D20;&#x4E58;&#x6CD5;&#x64CD;&#x4F5C;&#xFF0C;&#x5F53;&#x8F93;&#x5165;&#x4E3A; 0 &#x65F6;&#x95E8;&#x5173;&#x95ED;&#xFF0C;&#x8F93;&#x51FA;&#x4E3A; 1 &#x65F6;&#x95E8;&#x6253;&#x5F00;&#x3002;&#x5206;&#x522B;&#x4E3A;&#xFF1A;    <ul>
<li>&#x9057;&#x5FD8;&#x95E8;&#xFF08;forget gat&#xFF09;&#x7531; <img src="../images/tex-62f824d21d48162194f6ab54c819b0cc.gif" alt="f^{(t)}"> &#x63A7;&#x5236;&#xFF0C;&#x6765;&#x51B3;&#x5B9A;&#x54EA;&#x4E9B;&#x957F;&#x671F;&#x8BB0;&#x5FC6;&#x9700;&#x8981;&#x88AB;&#x64E6;&#x9664;&#xFF1B;</li>
<li>&#x8F93;&#x5165;&#x95E8;&#xFF08;input gate&#xFF09; &#x7531; <img src="../images/tex-94eb8618287f30c0e8acb55826546dd1.gif" alt="i^{(t)}"> &#x63A7;&#x5236;&#xFF0C;&#x5B83;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x5904;&#x7406;&#x54EA;&#x90E8;&#x5206; <img src="../images/tex-ededcb90b8071069a783dea14b4aad14.gif" alt="g^{(t)}"> &#x5E94;&#x8BE5;&#x88AB;&#x6DFB;&#x52A0;&#x5230;&#x957F;&#x65F6;&#x72B6;&#x6001;&#x4E2D;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x90E8;&#x5206;&#x5B58;&#x50A8;</strong>&#x3002;</li>
<li>&#x8F93;&#x51FA;&#x95E8;&#xFF08;output gate&#xFF09;&#x7531; <img src="../images/tex-8c4d6f1775020db40e7f11387a98b5ab.gif" alt="o^{(t)}"> &#x63A7;&#x5236;&#xFF0C;&#x5728;&#x8FD9;&#x4E00;&#x65F6;&#x523B;&#x7684;&#x8F93;&#x51FA; <img src="../images/tex-7ddb4d2d45df22e2e98e6cc504f84787.gif" alt="h^{(t)}"> &#x548C; <img src="../images/tex-cc685401bcf131ce4e9f980be319daac.gif" alt="y^{(t)}"> &#x5C31;&#x662F;&#x7531;&#x8F93;&#x51FA;&#x95E8;&#x63A7;&#x5236;&#x7684;&#xFF0C;&#x4ECE;&#x957F;&#x65F6;&#x72B6;&#x6001;&#x4E2D;&#x8BFB;&#x53D6;&#x7684;&#x8BB0;&#x5FC6;&#x3002;</li>
</ul>
</li>
</ul>
<p>&#x7B80;&#x8981;&#x6765;&#x8BF4;&#xFF0C;LSTM &#x5355;&#x5143;&#x80FD;&#x591F;&#x5B66;&#x4E60;&#x5230;&#x8BC6;&#x522B;&#x91CD;&#x8981;&#x8F93;&#x5165;&#xFF08;&#x8F93;&#x5165;&#x95E8;&#x4F5C;&#x7528;&#xFF09;&#xFF0C;&#x5B58;&#x50A8;&#x8FDB;&#x957F;&#x65F6;&#x72B6;&#x6001;&#xFF0C;&#x5E76;&#x4FDD;&#x5B58;&#x5FC5;&#x8981;&#x7684;&#x65F6;&#x95F4;&#xFF08;&#x9057;&#x5FD8;&#x95E8;&#x529F;&#x80FD;&#xFF09;&#xFF0C;&#x5E76;&#x5B66;&#x4F1A;&#x63D0;&#x53D6;&#x5F53;&#x524D;&#x8F93;&#x51FA;&#x6240;&#x9700;&#x8981;&#x7684;&#x8BB0;&#x5FC6;&#x3002;</p>
<p>&#x8FD9;&#x4E5F;&#x89E3;&#x91CA;&#x4E86; LSTM &#x5355;&#x5143;&#x80FD;&#x591F;&#x5728;&#x63D0;&#x53D6;&#x957F;&#x65F6;&#x5E8F;&#x5217;&#xFF0C;&#x957F;&#x6587;&#x672C;&#xFF0C;&#x5F55;&#x97F3;&#x7B49;&#x6570;&#x636E;&#x4E2D;&#x7684;&#x957F;&#x671F;&#x6A21;&#x5F0F;&#x7684;&#x60CA;&#x4EBA;&#x6210;&#x529F;&#x7684;&#x539F;&#x56E0;&#x3002;</p>
<p>&#x516C;&#x5F0F; 14-3 &#x603B;&#x7ED3;&#x4E86;&#x5982;&#x4F55;&#x8BA1;&#x7B97;&#x5355;&#x5143;&#x7684;&#x957F;&#x65F6;&#x72B6;&#x6001;&#xFF0C;&#x77ED;&#x65F6;&#x72B6;&#x6001;&#xFF0C;&#x548C;&#x5355;&#x4E2A;&#x8F93;&#x5165;&#x60C5;&#x5F62;&#x65F6;&#x6BCF;&#x5355;&#x4F4D;&#x6B65;&#x957F;&#x7684;&#x8F93;&#x51FA;&#xFF08;&#x5C0F;&#x6279;&#x91CF;&#x7684;&#x65B9;&#x7A0B;&#x5F62;&#x5F0F;&#x4E0E;&#x5355;&#x8F93;&#x5165;&#x7684;&#x5F62;&#x5F0F;&#x76F8;&#x4F3C;&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_14/14-3E.PNG" alt="Equation 14-3"></p>
<ul>
<li><img src="../images/tex-d5f696a5a6696de34b0622a8f14b4516.gif" alt="W_{xi}">&#xFF0C;<img src="../images/tex-d038d062c32d4dc01937728b95d25e0e.gif" alt="W_{xf}">&#xFF0C;<img src="../images/tex-6ffd6603299e89df0513e4d1b9d67637.gif" alt="W_{xo}">&#xFF0C;<img src="../images/tex-9e957014b85eb320bc79506f6fc8c80b.gif" alt="W_{xg}"> &#x662F;&#x56DB;&#x4E2A;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x5173;&#x4E8E;&#x8F93;&#x5165;&#x5411;&#x91CF; <img src="../images/tex-df9ed87e836e463cd086106035aef441.gif" alt="x^{(t)}"> &#x7684;&#x6743;&#x91CD;&#x3002;</li>
<li><img src="../images/tex-f60ef6008ce0d9eac12ac8a81cb64981.gif" alt="W_{hi}">&#xFF0C;<img src="../images/tex-07d3e0eb59fb1b95dc15ecc6cb36a65c.gif" alt="W_{hf}">&#xFF0C;<img src="../images/tex-c0b288b67c4f03e4fa7d866233a1c91c.gif" alt="W_{ho}">&#xFF0C;<img src="../images/tex-47a1cfce155783c735e46b38d6513419.gif" alt="W_{hg}"> &#x662F;&#x56DB;&#x4E2A;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x5173;&#x4E8E;&#x4E0A;&#x4E00;&#x65F6;&#x523B;&#x7684;&#x77ED;&#x65F6;&#x72B6;&#x6001; <img src="../images/tex-c94af4bec72c7e4e9e8f713c23232809.gif" alt="h^{(t-1)}"> &#x7684;&#x6743;&#x91CD;&#x3002;</li>
<li><img src="../images/tex-fe3e01a305f27284ff5115f4c5ea0fa4.gif" alt="b_i">&#xFF0C;<img src="../images/tex-8b9664471b48978a8d67e67efdbf131d.gif" alt="b_f">&#xFF0C;<img src="../images/tex-cd5404d7725e8dc13bb35de8c3a6fdf2.gif" alt="b_o">&#xFF0C;<img src="../images/tex-56ac14615d54896bf04d40cde6bc37f7.gif" alt="b_g"> &#x662F;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x7684;&#x56DB;&#x4E2A;&#x504F;&#x7F6E;&#x9879;&#xFF0C;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F; TensorFlow &#x5C06;&#x5176;&#x521D;&#x59CB;&#x5316;&#x4E3A;&#x5168; 1 &#x5411;&#x91CF;&#xFF0C;&#x800C;&#x975E;&#x5168; 0&#xFF0C;&#x4E3A;&#x4E86;&#x963B;&#x6B62;&#x7F51;&#x7EDC;&#x521D;&#x59CB;&#x8BAD;&#x7EC3;&#x72B6;&#x6001;&#x4E0B;&#xFF0C;&#x5404;&#x4E2A;&#x95E8;&#x5173;&#x95ED;&#x4ECE;&#x800C;&#x5FD8;&#x8BB0;&#x6240;&#x6709;&#x8BB0;&#x5FC6;&#x3002;</li>
</ul>
<h3 id="&#x7AA5;&#x5B54;&#x8FDE;&#x63A5;">&#x7AA5;&#x5B54;&#x8FDE;&#x63A5;</h3>
<p>&#x57FA;&#x672C;&#x5F62;&#x5F0F;&#x7684; LSTM &#x5355;&#x5143;&#x4E2D;&#xFF0C;&#x95E8;&#x7684;&#x63A7;&#x5236;&#x4EC5;&#x6709;&#x5F53;&#x524D;&#x7684;&#x8F93;&#x5165; <img src="../images/tex-df9ed87e836e463cd086106035aef441.gif" alt="x^{(t)}"> &#x548C;&#x524D;&#x4E00;&#x65F6;&#x523B;&#x7684;&#x77ED;&#x65F6;&#x72B6;&#x6001; <img src="../images/tex-c94af4bec72c7e4e9e8f713c23232809.gif" alt="h^{(t-1)}">&#x3002;&#x4E0D;&#x59A8;&#x8BA9;&#x5404;&#x4E2A;&#x63A7;&#x5236;&#x95E8;&#x7AA5;&#x89C6;&#x4E00;&#x4E0B;&#x957F;&#x65F6;&#x72B6;&#x6001;&#xFF0C;&#x83B7;&#x53D6;&#x4E00;&#x4E9B;&#x4E0A;&#x4E0B;&#x6587;&#x4FE1;&#x606F;&#x4E0D;&#x5931;&#x4E3A;&#x4E00;&#x79CD;&#x5C1D;&#x8BD5;&#x3002;<a href="https://goo.gl/ch8xz3" target="_blank">&#x8BE5;&#x60F3;&#x6CD5;</a>&#x7531; F.G.he J.S. &#x5728; 2000 &#x5E74;&#x63D0;&#x51FA;&#x3002;&#x4ED6;&#x4EEC;&#x63D0;&#x51FA;&#x7684; LSTM &#x7684;&#x53D8;&#x4F53;&#x62E5;&#x6709;&#x53EB;&#x505A;&#x7AA5;&#x5B54;&#x8FDE;&#x63A5;&#x7684;&#x989D;&#x5916;&#x8FDE;&#x63A5;&#xFF1A;&#x628A;&#x524D;&#x4E00;&#x65F6;&#x523B;&#x7684;&#x957F;&#x65F6;&#x72B6;&#x6001; <img src="../images/tex-a61d3a5d3cda282b36fe4a3fe7e657c1.gif" alt="c^{(t-1)}"> &#x52A0;&#x5165;&#x9057;&#x5FD8;&#x95E8;&#x548C;&#x8F93;&#x5165;&#x95E8;&#x63A7;&#x5236;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x5F53;&#x524D;&#x65F6;&#x523B;&#x7684;&#x957F;&#x65F6;&#x72B6;&#x6001;&#x52A0;&#x5165;&#x8F93;&#x51FA;&#x95E8;&#x7684;&#x63A7;&#x5236;&#x8F93;&#x5165;&#x3002;</p>
<p>TensorFLow &#x4E2D;&#x7531;<code>LSTMCell</code>&#x5B9E;&#x73B0;&#x4EE5;&#x4E0A;&#x53D8;&#x4F53; LSTM&#xFF0C;&#x5E76;&#x8BBE;&#x7F6E;<code>use_peepholes=True</code>&#x3002;</p>
<pre><code class="lang-python">lstm_cell = tf.contrib.rnn.LSTMCell(num_units=n_neurons, use_peepholes=<span class="hljs-keyword">True</span>)
</code></pre>
<p>&#x5728;&#x4F17;&#x591A; LSTM &#x53D8;&#x4F53;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x7279;&#x522B;&#x6D41;&#x884C;&#x7684;&#x53D8;&#x4F53;&#x5C31;&#x662F; GRU &#x5355;&#x5143;&#x3002;</p>
<h2 id="gru-&#x5355;&#x5143;">GRU &#x5355;&#x5143;</h2>
<p><img src="../images/chapter_14/14-14.PNG" alt="Figure 14-14"></p>
<p>&#x95E8;&#x63A7;&#x5FAA;&#x73AF;&#x5355;&#x5143;&#xFF08;&#x56FE; 14-14&#xFF09;&#x5728; 2014 &#x5E74;&#x7684; <a href="http://goo.gl/ZnAEOZ" target="_blank">K.Cho et al. &#x7684;&#x8BBA;&#x6587;</a>&#x4E2D;&#x63D0;&#x51FA;&#xFF0C;&#x5E76;&#x4E14;&#x6B64;&#x6587;&#x4E5F;&#x5F15;&#x5165;&#x4E86;&#x524D;&#x6587;&#x6240;&#x8FF0;&#x7684;&#x7F16;&#x89E3;&#x7801;&#x7F51;&#x7EDC;&#x3002;</p>
<p>&#x95E8;&#x63A7;&#x5FAA;&#x73AF;&#x5355;&#x5143;&#x662F; LSTM &#x5355;&#x5143;&#x7684;&#x7B80;&#x5316;&#x7248;&#x672C;&#xFF0C;&#x80FD;&#x5B9E;&#x73B0;&#x540C;&#x6837;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x8FD9;&#x4E5F;&#x8BF4;&#x660E;&#x4E86;&#x4E3A;&#x4EC0;&#x4E48;&#x5B83;&#x80FD;&#x8D8A;&#x6765;&#x8D8A;&#x6D41;&#x884C;&#x3002;&#x7B80;&#x5316;&#x4E3B;&#x8981;&#x5728;&#x4E00;&#x4E0B;&#x51E0;&#x4E2A;&#x65B9;&#x9762;&#xFF1A;</p>
<ul>
<li>&#x957F;&#x65F6;&#x72B6;&#x6001;&#x548C;&#x77ED;&#x65F6;&#x72B6;&#x6001;&#x5408;&#x5E76;&#x4E3A;&#x4E00;&#x4E2A;&#x5411;&#x91CF; <img src="../images/tex-7ddb4d2d45df22e2e98e6cc504f84787.gif" alt="h^{(t)}">&#x3002;</li>
<li>&#x7528;&#x540C;&#x4E00;&#x4E2A;&#x95E8;&#x63A7;&#x5236;&#x9057;&#x5FD8;&#x95E8;&#x548C;&#x8F93;&#x5165;&#x95E8;&#x3002;&#x5982;&#x679C;&#x95E8;&#x63A7;&#x5236;&#x8F93;&#x5165; 1&#xFF0C;&#x8F93;&#x5165;&#x95E8;&#x6253;&#x5F00;&#xFF0C;&#x9057;&#x5FD8;&#x95E8;&#x5173;&#x95ED;&#xFF0C;&#x53CD;&#x4E4B;&#x4EA6;&#x7136;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x5F53;&#x6709;&#x65B0;&#x7684;&#x8BB0;&#x5FC6;&#x9700;&#x8981;&#x5B58;&#x50A8;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x5FC5;&#x987B;&#x5B9E;&#x73B0;&#x5728;&#x5176;&#x5BF9;&#x5E94;&#x4F4D;&#x7F6E;&#x4E8B;&#x5148;&#x64E6;&#x9664;&#x8BE5;&#x5904;&#x8BB0;&#x5FC6;&#x3002;&#x8FD9;&#x4E5F;&#x6784;&#x6210;&#x4E86; LSTM &#x672C;&#x8EAB;&#x7684;&#x5E38;&#x89C1;&#x53D8;&#x4F53;&#x3002;</li>
<li>GRU &#x5355;&#x5143;&#x53D6;&#x6D88;&#x4E86;&#x8F93;&#x51FA;&#x95E8;&#xFF0C;&#x5355;&#x5143;&#x7684;&#x5168;&#x90E8;&#x72B6;&#x6001;&#x5C31;&#x662F;&#x8BE5;&#x65F6;&#x523B;&#x7684;&#x5355;&#x5143;&#x8F93;&#x51FA;&#x3002;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#xFF0C;&#x589E;&#x52A0;&#x4E86;&#x4E00;&#x4E2A;&#x63A7;&#x5236;&#x95E8; <img src="../images/tex-fd4cd5a78b3b4c8a13ed0184d6ca84b7.gif" alt="r^{(t)}"> &#x6765;&#x63A7;&#x5236;&#x54EA;&#x90E8;&#x5206;&#x524D;&#x4E00;&#x65F6;&#x95F4;&#x6B65;&#x7684;&#x72B6;&#x6001;&#x5728;&#x8BE5;&#x65F6;&#x523B;&#x7684;&#x5355;&#x5143;&#x5185;&#x5448;&#x73B0;&#x3002;</li>
</ul>
<p><img src="../images/chapter_14/14-4E.PNG" alt="Equation 14-4"></p>
<p>&#x516C;&#x5F0F; 14-4 &#x603B;&#x7ED3;&#x4E86;&#x5982;&#x4F55;&#x8BA1;&#x7B97;&#x5355;&#x4E2A;&#x8F93;&#x5165;&#x60C5;&#x5F62;&#x65F6;&#x6BCF;&#x5355;&#x4F4D;&#x6B65;&#x7684;&#x5355;&#x5143;&#x7684;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x5728; TensoFlow &#x4E2D;&#x521B;&#x5EFA; GRU &#x5355;&#x5143;&#x5F88;&#x7B80;&#x5355;&#xFF1A;</p>
<pre><code class="lang-python">gru_cell = tf.contrib.rnn.GRUCell(n_units=n_neurons)
</code></pre>
<p>LSTM &#x6216; GRU &#x5355;&#x5143;&#x662F;&#x8FD1;&#x5E74;&#x6765; RNN &#x6210;&#x529F;&#x80CC;&#x540E;&#x7684;&#x4E3B;&#x8981;&#x539F;&#x56E0;&#x4E4B;&#x4E00;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5728;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x5904;&#x7406;&#xFF08;NLP&#xFF09;&#x4E2D;&#x7684;&#x5E94;&#x7528;&#x3002;</p>
<h2 id="&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x5904;&#x7406;">&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x5904;&#x7406;</h2>
<p>&#x73B0;&#x5728;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x6700;&#x5148;&#x8FDB;&#x7684; NLP &#x5E94;&#x7528;&#xFF08;&#x5982;&#x673A;&#x5668;&#x7FFB;&#x8BD1;&#xFF0C;&#x81EA;&#x52A8;&#x6458;&#x8981;&#xFF0C;&#x89E3;&#x6790;&#xFF0C;&#x60C5;&#x611F;&#x5206;&#x6790;&#x7B49;&#xFF09;&#xFF0C;&#x73B0;&#x5728;&#xFF08;&#x81F3;&#x5C11;&#x4E00;&#x90E8;&#x5206;&#xFF09;&#x90FD;&#x57FA;&#x4E8E; RNN&#x3002; &#x5728;&#x6700;&#x540E;&#x4E00;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5FEB;&#x901F;&#x4E86;&#x89E3;&#x673A;&#x5668;&#x7FFB;&#x8BD1;&#x6A21;&#x578B;&#x7684;&#x6982;&#x51B5;&#x3002; TensorFlow &#x7684;&#x5F88;&#x5389;&#x5BB3;&#x7684; <a href="https://goo.gl/edArdi" target="_blank">Word2Vec</a> &#x548C; <a href="https://goo.gl/L82gvS" target="_blank">Seq2Seq</a> &#x6559;&#x7A0B;&#x975E;&#x5E38;&#x597D;&#x5730;&#x4ECB;&#x7ECD;&#x4E86;&#x8FD9;&#x4E2A;&#x4E3B;&#x9898;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x4E00;&#x5B9A;&#x8981;&#x9605;&#x8BFB;&#x4E00;&#x4E0B;&#x3002;</p>
<h3 id="&#x5355;&#x8BCD;&#x5D4C;&#x5165;">&#x5355;&#x8BCD;&#x5D4C;&#x5165;</h3>
<p>&#x5728;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x8BCD;&#x7684;&#x8868;&#x793A;&#x5F62;&#x5F0F;&#x3002; &#x4E00;&#x79CD;&#x9009;&#x62E9;&#x53EF;&#x4EE5;&#x662F;&#xFF0C;&#x4F7F;&#x7528;&#x5355;&#x70ED;&#x5411;&#x91CF;&#x8868;&#x793A;&#x6BCF;&#x4E2A;&#x8BCD;&#x3002; &#x5047;&#x8BBE;&#x4F60;&#x7684;&#x8BCD;&#x6C47;&#x8868;&#x5305;&#x542B; 5 &#x4E07;&#x4E2A;&#x5355;&#x8BCD;&#xFF0C;&#x90A3;&#x4E48;&#x7B2C;<code>n</code>&#x4E2A;&#x5355;&#x8BCD;&#x5C06;&#x88AB;&#x8868;&#x793A;&#x4E3A; 50,000 &#x7EF4;&#x7684;&#x5411;&#x91CF;&#xFF0C;&#x9664;&#x4E86;&#x7B2C;<code>n</code>&#x4E2A;&#x4F4D;&#x7F6E;&#x4E3A; 1 &#x4E4B;&#x5916;&#xFF0C;&#x5176;&#x5B83;&#x5168;&#x90E8;&#x4E3A; 0&#x3002; &#x7136;&#x800C;&#xFF0C;&#x5BF9;&#x4E8E;&#x5982;&#x6B64;&#x5E9E;&#x5927;&#x7684;&#x8BCD;&#x6C47;&#x8868;&#xFF0C;&#x8FD9;&#x79CD;&#x7A00;&#x758F;&#x8868;&#x793A;&#x6839;&#x672C;&#x5C31;&#x4E0D;&#x4F1A;&#x6709;&#x6548;&#x3002; &#x7406;&#x60F3;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F60;&#x5E0C;&#x671B;&#x76F8;&#x4F3C;&#x7684;&#x5355;&#x8BCD;&#x5177;&#x6709;&#x76F8;&#x4F3C;&#x7684;&#x8868;&#x793A;&#x5F62;&#x5F0F;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x6A21;&#x578B;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x5730;&#x5C06;&#x6240;&#x5B66;&#x7684;&#x5173;&#x4E8E;&#x5355;&#x8BCD;&#x7684;&#x53EA;&#x662F;&#xFF0C;&#x63A8;&#x5E7F;&#x5230;&#x6240;&#x6709;&#x76F8;&#x4F3C;&#x5355;&#x8BCD;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x6A21;&#x578B;&#x88AB;&#x544A;&#x77E5;<code>&quot;I drink milk&quot;</code>&#x662F;&#x4E00;&#x4E2A;&#x6709;&#x6548;&#x7684;&#x53E5;&#x5B50;&#xFF0C;&#x5E76;&#x4E14;&#x5982;&#x679C;&#x5B83;&#x77E5;&#x9053;<code>&quot;milk&quot;</code>&#x63A5;&#x8FD1;&#x4E8E;<code>&quot;water&quot;</code>&#xFF0C;&#x800C;&#x4E0D;&#x540C;&#x4E8E;<code>&quot;shoes&quot;</code>&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x4F1A;&#x77E5;&#x9053;<code>&quot;I drink water&quot;</code> &#x4E5F;&#x8BB8;&#x662F;&#x4E00;&#x4E2A;&#x6709;&#x6548;&#x7684;&#x53E5;&#x5B50;&#xFF0C;&#x800C;<code>&quot;I drink shoes&quot;</code>&#x53EF;&#x80FD;&#x4E0D;&#x662F;&#x3002; &#x4F46;&#x4F60;&#x5982;&#x4F55;&#x63D0;&#x51FA;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x6709;&#x610F;&#x4E49;&#x7684;&#x8868;&#x793A;&#x5462;&#xFF1F;</p>
<p>&#x6700;&#x5E38;&#x89C1;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#xFF0C;&#x7528;&#x4E00;&#x4E2A;&#x76F8;&#x5F53;&#x5C0F;&#x4E14;&#x5BC6;&#x96C6;&#x7684;&#x5411;&#x91CF;&#xFF08;&#x4F8B;&#x5982; 150 &#x7EF4;&#xFF09;&#x8868;&#x793A;&#x8BCD;&#x6C47;&#x8868;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x5355;&#x8BCD;&#xFF0C;&#x79F0;&#x4E3A;&#x5D4C;&#x5165;&#xFF0C;&#x5E76;&#x8BA9;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5728;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4E3A;&#x6BCF;&#x4E2A;&#x5355;&#x8BCD;&#x5B66;&#x4E60;&#x4E00;&#x4E2A;&#x826F;&#x597D;&#x7684;&#x5D4C;&#x5165;&#x3002; &#x5728;&#x8BAD;&#x7EC3;&#x5F00;&#x59CB;&#x65F6;&#xFF0C;&#x5D4C;&#x5165;&#x53EA;&#x662F;&#x968F;&#x673A;&#x9009;&#x62E9;&#x7684;&#xFF0C;&#x4F46;&#x5728;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x4F1A;&#x81EA;&#x52A8;&#x66F4;&#x65B0;&#x5D4C;&#x5165;&#xFF0C;&#x6765;&#x5E2E;&#x52A9;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x3002; &#x901A;&#x5E38;&#x8FD9;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x76F8;&#x4F3C;&#x7684;&#x8BCD;&#x4F1A;&#x9010;&#x6E10;&#x5F7C;&#x6B64;&#x9760;&#x8FD1;&#xFF0C;&#x751A;&#x81F3;&#x6700;&#x7EC8;&#x4EE5;&#x4E00;&#x79CD;&#x76F8;&#x5F53;&#x6709;&#x610F;&#x4E49;&#x7684;&#x65B9;&#x5F0F;&#x7EC4;&#x7EC7;&#x8D77;&#x6765;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x5D4C;&#x5165;&#x53EF;&#x80FD;&#x6700;&#x7EC8;&#x6CBF;&#x7740;&#x5404;&#x79CD;&#x8F74;&#x5206;&#x5E03;&#xFF0C;&#x5B83;&#x4EEC;&#x4EE3;&#x8868;&#x6027;&#x522B;&#xFF0C;&#x5355;&#x6570;/&#x590D;&#x6570;&#xFF0C;&#x5F62;&#x5BB9;&#x8BCD;/&#x540D;&#x8BCD;&#x3002; &#x7ED3;&#x679C;&#x53EF;&#x80FD;&#x771F;&#x7684;&#x5F88;&#x795E;&#x5947;&#x3002;</p>
<p>&#x5728;TensorFlow&#x4E2D;&#xFF0C;&#x9996;&#x5148;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x6765;&#x8868;&#x793A;&#x8BCD;&#x6C47;&#x8868;&#x4E2D;&#x6BCF;&#x4E2A;&#x8BCD;&#x7684;&#x5D4C;&#x5165;&#xFF08;&#x968F;&#x673A;&#x521D;&#x59CB;&#x5316;&#xFF09;&#xFF1A;</p>
<pre><code class="lang-py">vocabulary_size = <span class="hljs-number">50000</span>
embedding_size = <span class="hljs-number">150</span>
embeddings = tf.Variable(
    tf.random_uniform([vocabulary_size, embedding_size], <span class="hljs-number">-1.0</span>, <span class="hljs-number">1.0</span>))
</code></pre>
<p>&#x73B0;&#x5728;&#x5047;&#x8BBE;&#x4F60;&#x6253;&#x7B97;&#x5C06;&#x53E5;&#x5B50;<code>&quot;I drink milk&quot;</code>&#x63D0;&#x4F9B;&#x7ED9;&#x4F60;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002; &#x4F60;&#x5E94;&#x8BE5;&#x9996;&#x5148;&#x5BF9;&#x53E5;&#x5B50;&#x8FDB;&#x884C;&#x9884;&#x5904;&#x7406;&#x5E76;&#x5C06;&#x5176;&#x5206;&#x89E3;&#x6210;&#x5DF2;&#x77E5;&#x5355;&#x8BCD;&#x7684;&#x5217;&#x8868;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5220;&#x9664;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x5B57;&#x7B26;&#xFF0C;&#x7528;&#x9884;&#x5B9A;&#x4E49;&#x7684;&#x6807;&#x8BB0;&#x8BCD;&#xFF08;&#x5982;<code>&quot;[UNK]&quot;</code>&#xFF09;&#x66FF;&#x6362;&#x672A;&#x77E5;&#x5355;&#x8BCD;&#xFF0C;&#x7528;<code>&quot;[NUM]&quot;</code>&#x66FF;&#x6362;&#x6570;&#x5B57;&#x503C;&#xFF0C;&#x7528;<code>&quot;[URL]&quot;</code>&#x66FF;&#x6362; URL &#x7B49;&#x3002; &#x4E00;&#x65E6;&#x4F60;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x5DF2;&#x77E5;&#x5355;&#x8BCD;&#x5217;&#x8868;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x5B57;&#x5178;&#x4E2D;&#x67E5;&#x627E;&#x6BCF;&#x4E2A;&#x5355;&#x8BCD;&#x7684;&#x6574;&#x6570;&#x6807;&#x8BC6;&#x7B26;&#xFF08;&#x4ECE; 0 &#x5230; 49999&#xFF09;&#xFF0C;&#x4F8B;&#x5982;<code>[72&#xFF0C;3335&#xFF0C;288]</code>&#x3002; &#x6B64;&#x65F6;&#xFF0C;&#x4F60;&#x5DF2;&#x51C6;&#x5907;&#x597D;&#x4F7F;&#x7528;&#x5360;&#x4F4D;&#x7B26;&#x5C06;&#x8FD9;&#x4E9B;&#x5355;&#x8BCD;&#x6807;&#x8BC6;&#x7B26;&#x63D0;&#x4F9B;&#x7ED9; TensorFlow&#xFF0C;&#x5E76;&#x5E94;&#x7528;<code>embedding_lookup()</code>&#x51FD;&#x6570;&#x6765;&#x83B7;&#x53D6;&#x76F8;&#x5E94;&#x7684;&#x5D4C;&#x5165;&#xFF1A;</p>
<pre><code class="lang-py">train_inputs = tf.placeholder(tf.int32, shape=[<span class="hljs-keyword">None</span>])  <span class="hljs-comment"># from ids...</span>
embed = tf.nn.embedding_lookup(embeddings, train_inputs)  <span class="hljs-comment"># ...to embeddings</span>
</code></pre>
<p>&#x4E00;&#x65E6;&#x4F60;&#x7684;&#x6A21;&#x578B;&#x4E60;&#x5F97;&#x4E86;&#x826F;&#x597D;&#x7684;&#x8BCD;&#x5D4C;&#x5165;&#xFF0C;&#x5B83;&#x4EEC;&#x5B9E;&#x9645;&#x4E0A;&#x53EF;&#x4EE5;&#x5728;&#x4EFB;&#x4F55; NLP &#x5E94;&#x7528;&#x4E2D;&#x9AD8;&#x6548;&#x590D;&#x7528;&#xFF1A;&#x6BD5;&#x7ADF;&#xFF0C;<code>&quot;milk&quot;</code>&#x4F9D;&#x7136;&#x63A5;&#x8FD1;&#x4E8E;<code>&quot;water&quot;</code>&#xFF0C;&#x800C;&#x4E14;&#x4E0D;&#x7BA1;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x5B83;&#x90FD;&#x4E0D;&#x540C;&#x4E8E;<code>&quot;shoes&quot;</code>&#x3002; &#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x4E0B;&#x8F7D;&#x9884;&#x8BAD;&#x7EC3;&#x7684;&#x5355;&#x8BCD;&#x5D4C;&#x5165;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8BAD;&#x7EC3;&#x81EA;&#x5DF1;&#x7684;&#x5355;&#x8BCD;&#x5D4C;&#x5165;&#x3002; &#x5C31;&#x50CF;&#x590D;&#x7528;&#x9884;&#x8BAD;&#x7EC3;&#x5C42;&#xFF08;&#x53C2;&#x89C1;&#x7B2C; 11 &#x7AE0;&#xFF09;&#x4E00;&#x6837;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x51BB;&#x7ED3;&#x9884;&#x8BAD;&#x7EC3;&#x5D4C;&#x5165;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x4F7F;&#x7528;<code>trainable=False</code>&#x521B;&#x5EFA;&#x5D4C;&#x5165;&#x53D8;&#x91CF;&#xFF09;&#xFF0C;&#x6216;&#x8005;&#x8BA9;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x4E3A;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x8C03;&#x6574;&#x5B83;&#x4EEC;&#x3002; &#x7B2C;&#x4E00;&#x79CD;&#x9009;&#x62E9;&#x5C06;&#x52A0;&#x901F;&#x8BAD;&#x7EC3;&#xFF0C;&#x4F46;&#x7B2C;&#x4E8C;&#x79CD;&#x9009;&#x62E9;&#x53EF;&#x80FD;&#x4F1A;&#x4EA7;&#x751F;&#x7A0D;&#x9AD8;&#x7684;&#x6027;&#x80FD;&#x3002;</p>
<blockquote>
<p>&#x63D0;&#x793A;</p>
<p>&#x5BF9;&#x4E8E;&#x8868;&#x793A;&#x53EF;&#x80FD;&#x62E5;&#x6709;&#x5927;&#x91CF;&#x4E0D;&#x540C;&#x503C;&#x7684;&#x7C7B;&#x522B;&#x5C5E;&#x6027;&#xFF0C;&#x5D4C;&#x5165;&#x4E5F;&#x5F88;&#x6709;&#x7528;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5F53;&#x503C;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x590D;&#x6742;&#x7684;&#x76F8;&#x4F3C;&#x6027;&#x7684;&#x65F6;&#x5019;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x8003;&#x8651;&#x804C;&#x4E1A;&#xFF0C;&#x7231;&#x597D;&#xFF0C;&#x83DC;&#x54C1;&#xFF0C;&#x7269;&#x79CD;&#xFF0C;&#x54C1;&#x724C;&#x7B49;&#x3002;</p>
</blockquote>
<p>&#x4F60;&#x73B0;&#x5728;&#x62E5;&#x6709;&#x4E86;&#x5B9E;&#x73B0;&#x673A;&#x5668;&#x7FFB;&#x8BD1;&#x7CFB;&#x7EDF;&#x6240;&#x9700;&#x7684;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x7684;&#x5DE5;&#x5177;&#x3002; &#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;&#x5B83;&#x5427;&#x3002;</p>
<h3 id="&#x7528;&#x4E8E;&#x673A;&#x5668;&#x7FFB;&#x8BD1;&#x7684;&#x7F16;&#x89E3;&#x7801;&#x5668;&#x7F51;&#x7EDC;">&#x7528;&#x4E8E;&#x673A;&#x5668;&#x7FFB;&#x8BD1;&#x7684;&#x7F16;&#x89E3;&#x7801;&#x5668;&#x7F51;&#x7EDC;</h3>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;&#x7B80;&#x5355;&#x7684;&#x673A;&#x5668;&#x7FFB;&#x8BD1;&#x6A21;&#x578B;&#xFF0C;&#x5B83;&#x5C06;&#x82F1;&#x8BED;&#x53E5;&#x5B50;&#x7FFB;&#x8BD1;&#x6210;&#x6CD5;&#x8BED;&#xFF08;&#x53C2;&#x89C1;&#x56FE; 14-15&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_14/14-15.jpg" alt=""></p>
<p>&#x56FE; 14-15&#xFF1A;&#x7B80;&#x5355;&#x7684;&#x673A;&#x5668;&#x7FFB;&#x8BD1;&#x6A21;&#x578B;</p>
<p>&#x82F1;&#x8BED;&#x53E5;&#x5B50;&#x88AB;&#x9001;&#x8FDB;&#x7F16;&#x7801;&#x5668;&#xFF0C;&#x89E3;&#x7801;&#x5668;&#x8F93;&#x51FA;&#x6CD5;&#x8BED;&#x7FFB;&#x8BD1;&#x3002; &#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x6CD5;&#x8BED;&#x7FFB;&#x8BD1;&#x4E5F;&#x88AB;&#x7528;&#x4F5C;&#x89E3;&#x7801;&#x5668;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x4F46;&#x540E;&#x9000;&#x4E86;&#x4E00;&#x6B65;&#x3002; &#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x89E3;&#x7801;&#x5668;&#x7684;&#x8F93;&#x5165;&#x662F;&#x5B83;&#x5E94;&#x8BE5;&#x5728;&#x524D;&#x4E00;&#x6B65;&#x8F93;&#x51FA;&#x7684;&#x5B57;&#xFF08;&#x4E0D;&#x7BA1;&#x5B83;&#x5B9E;&#x9645;&#x8F93;&#x51FA;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#xFF09;&#x3002; &#x5BF9;&#x4E8E;&#x7B2C;&#x4E00;&#x4E2A;&#x5355;&#x8BCD;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x8868;&#x793A;&#x53E5;&#x5B50;&#x5F00;&#x59CB;&#x7684;&#x6807;&#x8BB0;&#xFF08;<code>&quot;&lt;go&gt;&quot;</code>&#xFF09;&#x3002; &#x89E3;&#x7801;&#x5668;&#x9884;&#x671F;&#x4EE5;&#x5E8F;&#x5217;&#x672B;&#x5C3E;&#x6807;&#x8BB0;&#xFF08;EOS&#xFF09;&#x7ED3;&#x675F;&#x53E5;&#x5B50;&#xFF08;<code>&quot;&lt;eos&gt;&quot;</code>&#xFF09;&#x3002;</p>
<p>&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x82F1;&#x8BED;&#x53E5;&#x5B50;&#x5728;&#x9001;&#x5165;&#x7F16;&#x7801;&#x5668;&#x4E4B;&#x524D;&#x4F1A;&#x53CD;&#x8F6C;&#x3002; &#x4F8B;&#x5982;&#xFF0C;<code>&quot;I drink milk&quot;</code>&#x4E0E;<code>&quot;milk drink I&quot;</code>&#x76F8;&#x53CD;&#x3002;&#x8FD9;&#x786E;&#x4FDD;&#x4E86;&#x82F1;&#x8BED;&#x53E5;&#x5B50;&#x7684;&#x5F00;&#x5934;&#x5C06;&#x4F1A;&#x6700;&#x540E;&#x9001;&#x5230;&#x7F16;&#x7801;&#x5668;&#xFF0C;&#x8FD9;&#x5F88;&#x6709;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x901A;&#x5E38;&#x662F;&#x89E3;&#x7801;&#x5668;&#x9700;&#x8981;&#x7FFB;&#x8BD1;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x4E1C;&#x897F;&#x3002;</p>
<p>&#x6BCF;&#x4E2A;&#x5355;&#x8BCD;&#x6700;&#x521D;&#x7531;&#x7B80;&#x5355;&#x6574;&#x6570;&#x6807;&#x8BC6;&#x7B26;&#x8868;&#x793A;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5355;&#x8BCD;<code>&quot;milk&quot;</code>&#x4E3A; 288&#xFF09;&#x3002; &#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x5D4C;&#x5165;&#x67E5;&#x627E;&#x8FD4;&#x56DE;&#x8BCD;&#x7684;&#x5D4C;&#x5165;&#xFF08;&#x5982;&#x524D;&#x6240;&#x8FF0;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5BC6;&#x96C6;&#x7684;&#xFF0C;&#x76F8;&#x5F53;&#x4F4E;&#x7EF4;&#x7684;&#x5411;&#x91CF;&#xFF09;&#x3002; &#x8FD9;&#x4E9B;&#x8BCD;&#x7684;&#x5D4C;&#x5165;&#x662F;&#x5B9E;&#x9645;&#x9001;&#x5230;&#x7F16;&#x7801;&#x5668;&#x548C;&#x89E3;&#x7801;&#x5668;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x5728;&#x6BCF;&#x4E2A;&#x6B65;&#x9AA4;&#x4E2D;&#xFF0C;&#x89E3;&#x7801;&#x5668;&#x8F93;&#x51FA;&#x8F93;&#x51FA;&#x8BCD;&#x6C47;&#x8868;&#xFF08;&#x5373;&#x6CD5;&#x8BED;&#xFF09;&#x4E2D;&#x6BCF;&#x4E2A;&#x8BCD;&#x7684;&#x5F97;&#x5206;&#xFF0C;&#x7136;&#x540E; Softmax &#x5C42;&#x5C06;&#x8FD9;&#x4E9B;&#x5F97;&#x5206;&#x8F6C;&#x6362;&#x4E3A;&#x6982;&#x7387;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x7B2C;&#x4E00;&#x6B65;&#x4E2D;&#xFF0C;&#x5355;&#x8BCD;<code>&quot;Je&quot;</code>&#x6709; 20% &#x7684;&#x6982;&#x7387;&#xFF0C;<code>&quot;Tu&quot;</code>&#x6709; 1% &#x7684;&#x6982;&#x7387;&#xFF0C;&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#x3002; &#x6982;&#x7387;&#x6700;&#x9AD8;&#x7684;&#x8BCD;&#x4F1A;&#x8F93;&#x51FA;&#x3002; &#x8FD9;&#x975E;&#x5E38;&#x7C7B;&#x4F3C;&#x4E8E;&#x5E38;&#x89C4;&#x5206;&#x7C7B;&#x4EFB;&#x52A1;&#xFF0C;&#x56E0;&#x6B64;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>softmax_cross_entropy_with_logits()</code>&#x51FD;&#x6570;&#x6765;&#x8BAD;&#x7EC3;&#x6A21;&#x578B;&#x3002;</p>
<p>&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x5728;&#x63A8;&#x65AD;&#x671F;&#x95F4;&#xFF08;&#x8BAD;&#x7EC3;&#x4E4B;&#x540E;&#xFF09;&#xFF0C;&#x4F60;&#x4E0D;&#x518D;&#x5C06;&#x76EE;&#x6807;&#x53E5;&#x5B50;&#x9001;&#x5165;&#x89E3;&#x7801;&#x5668;&#x3002; &#x76F8;&#x53CD;&#xFF0C;&#x53EA;&#x9700;&#x5411;&#x89E3;&#x7801;&#x5668;&#x63D0;&#x4F9B;&#x5B83;&#x5728;&#x4E0A;&#x4E00;&#x6B65;&#x8F93;&#x51FA;&#x7684;&#x5355;&#x8BCD;&#xFF0C;&#x5982;&#x56FE; 14-16 &#x6240;&#x793A;&#xFF08;&#x8FD9;&#x5C06;&#x9700;&#x8981;&#x5D4C;&#x5165;&#x67E5;&#x627E;&#xFF0C;&#x5B83;&#x672A;&#x5728;&#x56FE;&#x4E2D;&#x663E;&#x793A;&#xFF09;&#x3002;</p>
<p>&#x56FE; 14-16&#xFF1A;&#x5728;&#x63A8;&#x65AD;&#x671F;&#x95F4;&#xFF0C;&#x5C06;&#x4E4B;&#x524D;&#x7684;&#x8F93;&#x51FA;&#x5355;&#x8BCD;&#x63D0;&#x4F9B;&#x4E3A;&#x8F93;&#x5165;</p>
<p>&#x597D;&#x7684;&#xFF0C;&#x73B0;&#x5728;&#x4F60;&#x6709;&#x4E86;&#x5927;&#x65B9;&#x5411;&#x3002; &#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x9605;&#x8BFB; TensorFlow &#x7684;&#x5E8F;&#x5217;&#x6559;&#x7A0B;&#xFF0C;&#x5E76;&#x67E5;&#x770B;<code>rnn/translate/seq2seq_model.py</code>&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#xFF08;&#x5728; TensorFlow &#x6A21;&#x578B;&#x4E2D;&#xFF09;&#xFF0C;&#x4F60;&#x4F1A;&#x6CE8;&#x610F;&#x5230;&#x4E00;&#x4E9B;&#x91CD;&#x8981;&#x7684;&#x533A;&#x522B;&#xFF1A;</p>
<ul>
<li><p>&#x9996;&#x5148;&#xFF0C;&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5047;&#x5B9A;&#x6240;&#x6709;&#x8F93;&#x5165;&#x5E8F;&#x5217;&#xFF08;&#x7F16;&#x7801;&#x5668;&#x548C;&#x89E3;&#x7801;&#x5668;&#x7684;&#xFF09;&#x5177;&#x6709;&#x6052;&#x5B9A;&#x7684;&#x957F;&#x5EA6;&#x3002;&#x4F46;&#x663E;&#x7136;&#x53E5;&#x5B50;&#x957F;&#x5EA6;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x6240;&#x4E0D;&#x540C;&#x3002;&#x6709;&#x51E0;&#x79CD;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x5B83; - &#x4F8B;&#x5982;&#xFF0C;&#x4F7F;&#x7528;<code>static_rnn()</code>&#x6216;<code>dynamic_rnn()</code>&#x51FD;&#x6570;&#x7684;<code>sequence_length</code>&#x53C2;&#x6570;&#xFF0C;&#x6765;&#x6307;&#x5B9A;&#x6BCF;&#x4E2A;&#x53E5;&#x5B50;&#x7684;&#x957F;&#x5EA6;&#xFF08;&#x5982;&#x524D;&#x6240;&#x8FF0;&#xFF09;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x6559;&#x7A0B;&#x4E2D;&#x4F7F;&#x7528;&#x4E86;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#xFF08;&#x5927;&#x6982;&#x662F;&#x51FA;&#x4E8E;&#x6027;&#x80FD;&#x539F;&#x56E0;&#xFF09;&#xFF1A;&#x53E5;&#x5B50;&#x5206;&#x5230;&#x957F;&#x5EA6;&#x76F8;&#x4F3C;&#x7684;&#x6876;&#x4E2D;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x53E5;&#x5B50;&#x7684;&#x5355;&#x8BCD; 1 &#x5230; 6 &#x5206;&#x5230;&#x4E00;&#x4E2A;&#x6876;&#xFF0C;&#x5355;&#x8BCD; 7 &#x5230; 12 &#x5206;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x6876;&#xFF0C;&#x7B49;&#x7B49;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x4F7F;&#x7528;&#x7279;&#x6B8A;&#x7684;&#x586B;&#x5145;&#x6807;&#x8BB0;&#xFF08;&#x4F8B;&#x5982;<code>&quot;&lt;pad&gt;&quot;</code>&#xFF09;&#x6765;&#x586B;&#x5145;&#x8F83;&#x77ED;&#x7684;&#x53E5;&#x5B50;&#x3002;&#x4F8B;&#x5982;&#xFF0C;<code>&quot;I drink milk&quot;</code>&#x53D8;&#x6210;<code>&quot;&lt;pad&gt; &lt;pad&gt; &lt;pad&gt; milk drink I&quot;</code>&#xFF0C;&#x7FFB;&#x8BD1;&#x6210;<code>&quot;Je bois du lait &lt;eos&gt; &lt;pad&gt;&quot;</code>&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x5FFD;&#x7565;&#x4EFB;&#x4F55; EOS &#x6807;&#x8BB0;&#x4E4B;&#x540E;&#x7684;&#x8F93;&#x51FA;&#x3002;&#x4E3A;&#x6B64;&#xFF0C;&#x672C;&#x6559;&#x7A0B;&#x7684;&#x5B9E;&#x73B0;&#x4F7F;&#x7528;<code>target_weights</code>&#x5411;&#x91CF;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5BF9;&#x4E8E;&#x76EE;&#x6807;&#x53E5;&#x5B50;<code>&quot;Je bois du lait &lt;eos&gt; &lt;pad&gt;&quot;</code>&#xFF0C;&#x6743;&#x91CD;&#x5C06;&#x8BBE;&#x7F6E;&#x4E3A;<code>[1.0,1.0,1.0,1.0,1.0,0.0]</code>&#xFF08;&#x6CE8;&#x610F;&#x6743;&#x91CD; 0.0 &#x5BF9;&#x5E94;&#x76EE;&#x6807;&#x53E5;&#x5B50;&#x4E2D;&#x7684;&#x586B;&#x5145;&#x6807;&#x8BB0;&#xFF09;&#x3002;&#x7B80;&#x5355;&#x5730;&#x5C06;&#x635F;&#x5931;&#x4E58;&#x4EE5;&#x76EE;&#x6807;&#x6743;&#x91CD;&#xFF0C;&#x5C06;&#x6D88;&#x9664;&#x5BF9;&#x5E94; EOS &#x6807;&#x8BB0;&#x4E4B;&#x540E;&#x7684;&#x5355;&#x8BCD;&#x7684;&#x635F;&#x5931;&#x3002;</p>
</li>
<li><p>&#x5176;&#x6B21;&#xFF0C;&#x5F53;&#x8F93;&#x51FA;&#x8BCD;&#x6C47;&#x8868;&#x5F88;&#x5927;&#x65F6;&#xFF08;&#x5C31;&#x662F;&#x8FD9;&#x91CC;&#x7684;&#x60C5;&#x51B5;&#xFF09;&#xFF0C;&#x8F93;&#x51FA;&#x6BCF;&#x4E2A;&#x53EF;&#x80FD;&#x7684;&#x5355;&#x8BCD;&#x7684;&#x6982;&#x7387;&#x5C06;&#x4F1A;&#x975E;&#x5E38;&#x6162;&#x3002; &#x5982;&#x679C;&#x76EE;&#x6807;&#x8BCD;&#x6C47;&#x8868;&#x5305;&#x542B; 50,000 &#x4E2A;&#x6CD5;&#x8BED;&#x5355;&#x8BCD;&#xFF0C;&#x5219;&#x89E3;&#x7801;&#x5668;&#x5C06;&#x8F93;&#x51FA; 50,000 &#x7EF4;&#x5411;&#x91CF;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x8FD9;&#x6837;&#x7684;&#x5927;&#x5411;&#x91CF;&#x4E0A;&#x8BA1;&#x7B97; softmax &#x51FD;&#x6570;&#xFF0C;&#x8BA1;&#x7B97;&#x91CF;&#x5C06;&#x975E;&#x5E38;&#x5927;&#x3002; &#x4E3A;&#x4E86;&#x907F;&#x514D;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x4E00;&#x79CD;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x8BA9;&#x89E3;&#x7801;&#x5668;&#x8F93;&#x51FA;&#x66F4;&#x5C0F;&#x7684;&#x5411;&#x91CF;&#xFF0C;&#x4F8B;&#x5982; 1,000 &#x7EF4;&#x5411;&#x91CF;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x91C7;&#x6837;&#x6280;&#x672F;&#x6765;&#x4F30;&#x8BA1;&#x635F;&#x5931;&#xFF0C;&#x800C;&#x4E0D;&#x5FC5;&#x5BF9;&#x76EE;&#x6807;&#x8BCD;&#x6C47;&#x8868;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x5355;&#x8BCD;&#x8BA1;&#x7B97;&#x5B83;&#x3002; &#x8FD9;&#x79CD;&#x91C7;&#x6837; Softmax &#x6280;&#x672F;&#x662F;&#x7531; S&#xE9;bastienJean &#x7B49;&#x4EBA;&#x5728; 2015 &#x5E74;&#x63D0;&#x51FA;&#x7684;&#x3002;&#x5728; TensorFlow &#x4E2D;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>sampled_softmax_loss()</code>&#x51FD;&#x6570;&#x3002;</p>
</li>
<li><p>&#x7B2C;&#x4E09;&#xFF0C;&#x6559;&#x7A0B;&#x7684;&#x5B9E;&#x73B0;&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x79CD;&#x6CE8;&#x610F;&#x529B;&#x673A;&#x5236;&#xFF0C;&#x8BA9;&#x89E3;&#x7801;&#x5668;&#x80FD;&#x591F;&#x7AA5;&#x89C6;&#x8F93;&#x5165;&#x5E8F;&#x5217;&#x3002; &#x6CE8;&#x610F;&#x529B;&#x589E;&#x5F3A;&#x7684; RNN &#x4E0D;&#x5728;&#x672C;&#x4E66;&#x7684;&#x8BA8;&#x8BBA;&#x8303;&#x56F4;&#x4E4B;&#x5185;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x4F60;&#x6709;&#x5174;&#x8DA3;&#xFF0C;&#x53EF;&#x4EE5;&#x5173;&#x6CE8;&#x673A;&#x5668;&#x7FFB;&#x8BD1;&#xFF0C;&#x673A;&#x5668;&#x9605;&#x8BFB;&#x548C;&#x56FE;&#x50CF;&#x8BF4;&#x660E;&#x7684;&#x76F8;&#x5173;&#x8BBA;&#x6587;&#x3002;</p>
</li>
<li><p>&#x6700;&#x540E;&#xFF0C;&#x672C;&#x6559;&#x7A0B;&#x7684;&#x5B9E;&#x73B0;&#x4F7F;&#x7528;&#x4E86;<code>tf.nn.legacy_seq2seq</code>&#x6A21;&#x5757;&#xFF0C;&#x8BE5;&#x6A21;&#x5757;&#x63D0;&#x4F9B;&#x4E86;&#x8F7B;&#x677E;&#x6784;&#x5EFA;&#x5404;&#x79CD;&#x7F16;&#x89E3;&#x7801;&#x5668;&#x6A21;&#x578B;&#x7684;&#x5DE5;&#x5177;&#x3002; &#x4F8B;&#x5982;&#xFF0C;<code>embedding_rnn_seq2seq()</code>&#x51FD;&#x6570;&#x4F1A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x7F16;&#x89E3;&#x7801;&#x5668;&#x6A21;&#x578B;&#xFF0C;&#x5B83;&#x4F1A;&#x81EA;&#x52A8;&#x4E3A;&#x4F60;&#x5904;&#x7406;&#x5355;&#x8BCD;&#x5D4C;&#x5165;&#xFF0C;&#x5C31;&#x50CF;&#x56FE; 14-15 &#x4E2D;&#x6240;&#x793A;&#x7684;&#x4E00;&#x6837;&#x3002; &#x6B64;&#x4EE3;&#x7801;&#x53EF;&#x80FD;&#x4F1A;&#x5F88;&#x5FEB;&#x66F4;&#x65B0;&#xFF0C;&#x6765;&#x4F7F;&#x7528;&#x65B0;&#x7684;<code>tf.nn.seq2seq</code>&#x6A21;&#x5757;&#x3002;</p>
</li>
</ul>
<p>&#x4F60;&#x73B0;&#x5728;&#x62E5;&#x6709;&#x4E86;&#xFF0C;&#x4E86;&#x89E3;&#x6240;&#x6709; seq2seq &#x6559;&#x7A0B;&#x7684;&#x5B9E;&#x73B0;&#x6240;&#x9700;&#x7684;&#x5168;&#x90E8;&#x5DE5;&#x5177;&#x3002; &#x5C06;&#x5B83;&#x4EEC;&#x53D6;&#x51FA;&#xFF0C;&#x5E76;&#x8BAD;&#x7EC3;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x82F1;&#x6CD5;&#x7FFB;&#x8BD1;&#x5668;&#x5427;&#xFF01;</p>
<h2 id="&#x7EC3;&#x4E60;">&#x7EC3;&#x4E60;</h2>
<ol>
<li>&#x4F60;&#x80FD;&#x60F3;&#x8C61; seq2seq RNN &#x7684;&#x51E0;&#x4E2A;&#x5E94;&#x7528;&#x5417;&#xFF1F; seq2vec &#x7684; RNN &#x5462;&#xFF1F;vex2seq &#x7684; RNN &#x5462;&#xFF1F;</li>
<li>&#x4E3A;&#x4EC0;&#x4E48;&#x4EBA;&#x4EEC;&#x4F7F;&#x7528;&#x7F16;&#x89E3;&#x7801;&#x5668; RNN &#x800C;&#x4E0D;&#x662F;&#x7B80;&#x5355;&#x7684; seq2seq RNN &#x6765;&#x81EA;&#x52A8;&#x7FFB;&#x8BD1;&#xFF1F;</li>
<li>&#x5982;&#x4F55;&#x5C06;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E0E; RNN &#x7ED3;&#x5408;&#xFF0C;&#x6765;&#x5BF9;&#x89C6;&#x9891;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#xFF1F;</li>
<li>&#x4F7F;&#x7528;<code>dynamic_rnn()</code>&#x800C;&#x4E0D;&#x662F;<code>static_rnn()</code>&#x6784;&#x5EFA; RNN &#x6709;&#x4EC0;&#x4E48;&#x597D;&#x5904;&#xFF1F;</li>
<li>&#x4F60;&#x5982;&#x4F55;&#x5904;&#x7406;&#x957F;&#x5EA6;&#x53EF;&#x53D8;&#x7684;&#x8F93;&#x5165;&#x5E8F;&#x5217;&#xFF1F; &#x90A3;&#x4E48;&#x957F;&#x5EA6;&#x53EF;&#x53D8;&#x8F93;&#x51FA;&#x5E8F;&#x5217;&#x5462;&#xFF1F;</li>
<li>&#x5728;&#x591A;&#x4E2A; GPU &#x4E0A;&#x5206;&#x914D;&#x6DF1;&#x5C42; RNN &#x7684;&#x8BAD;&#x7EC3;&#x548C;&#x6267;&#x884C;&#x7684;&#x5E38;&#x89C1;&#x65B9;&#x5F0F;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</li>
<li>Hochreiter &#x548C; Schmidhuber &#x5728;&#x5176;&#x5173;&#x4E8E; LSTM &#x7684;&#x6587;&#x7AE0;&#x4E2D;&#x4F7F;&#x7528;&#x4E86;&#x5D4C;&#x5165;&#x5F0F; Reber &#x8BED;&#x6CD5;&#x3002; &#x5B83;&#x4EEC;&#x662F;&#x4EA7;&#x751F;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5982;<code>&quot;BPBTSXXVPSEPE&quot;</code>&#x7684;&#x4EBA;&#x9020;&#x8BED;&#x6CD5;&#x3002;&#x67E5;&#x770B; Jenny Orr &#x5BF9;&#x6B64;&#x4E3B;&#x9898;&#x7684;<a href="https://goo.gl/7CkNRn" target="_blank">&#x4E0D;&#x9519;&#x7684;&#x4ECB;&#x7ECD;</a>&#x3002; &#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x5D4C;&#x5165;&#x5F0F; Reber &#x8BED;&#x6CD5;&#xFF08;&#x4F8B;&#x5982; Jenny Orr &#x9875;&#x9762;&#x4E0A;&#x663E;&#x793A;&#x7684;&#x8BED;&#x6CD5;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A; RNN &#x6765;&#x786E;&#x5B9A;&#x5B57;&#x7B26;&#x4E32;&#x662F;&#x5426;&#x9075;&#x5FAA;&#x8BE5;&#x8BED;&#x6CD5;&#x3002; &#x4F60;&#x9996;&#x5148;&#x9700;&#x8981;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x8BE5;&#x51FD;&#x6570;&#x80FD;&#x591F;&#x751F;&#x6210;&#x8BAD;&#x7EC3;&#x6279;&#x91CF;&#xFF0C;&#x5305;&#x542B;&#x5927;&#x7EA6; 50% &#x9075;&#x5FAA;&#x8BED;&#x6CD5;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x4EE5;&#x53CA; 50% &#x4E0D;&#x9075;&#x5FAA;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x3002;</li>
<li>&#x89E3;&#x51B3;&#x201C;How much did it rain? II&#x201D;&#xFF08;&#x4E0B;&#x96E8;&#x4E0B;&#x4E86;&#x591A;&#x4E45; II&#xFF09;<a href="https://goo.gl/0DS5Xe" target="_blank">Kaggle &#x6BD4;&#x8D5B;</a>&#x3002; &#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x5E8F;&#x5217;&#x9884;&#x6D4B;&#x4EFB;&#x52A1;&#xFF1A;&#x5B83;&#x4E3A;&#x4F60;&#x63D0;&#x4F9B;&#x6781;&#x5316;&#x96F7;&#x8FBE;&#x503C;&#x7684;&#x5FEB;&#x7167;&#xFF0C;&#x5E76;&#x8981;&#x6C42;&#x9884;&#x6D4B;&#x6BCF;&#x5C0F;&#x65F6;&#x964D;&#x6C34;&#x91CF;&#x3002; Luis Andre Dutra e Silva &#x7684;<a href="https://goo.gl/fTA90W" target="_blank">&#x91C7;&#x8BBF;</a>&#x5BF9;&#x4ED6;&#x5728;&#x6BD4;&#x8D5B;&#x4E2D;&#x83B7;&#x5F97;&#x7B2C;&#x4E8C;&#x540D;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E9B;&#x6709;&#x8DA3;&#x7684;&#x89C1;&#x89E3;&#x3002; &#x7279;&#x522B;&#x662F;&#xFF0C;&#x4ED6;&#x4F7F;&#x7528;&#x4E86;&#x7531;&#x4E24;&#x4E2A; LSTM &#x5C42;&#x7EC4;&#x6210;&#x7684; RNN&#x3002;</li>
<li>&#x901A;&#x8FC7; TensorFlow &#x7684; <a href="https://goo.gl/edArdi" target="_blank">Word2Vec</a> &#x6559;&#x7A0B;&#x6765;&#x521B;&#x5EFA;&#x5355;&#x8BCD;&#x5D4C;&#x5165;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7; <a href="https://goo.gl/L82gvS" target="_blank">Seq2Seq</a> &#x6559;&#x7A0B;&#x6765;&#x8BAD;&#x7EC3;&#x82F1;&#x6CD5;&#x7FFB;&#x8BD1;&#x7CFB;&#x7EDF;&#x3002;</li>
</ol>
<p>&#x9644;&#x5F55; A &#x63D0;&#x4F9B;&#x4E86;&#x8FD9;&#x4E9B;&#x7EC3;&#x4E60;&#x7684;&#x7B54;&#x6848;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="13.卷积神经网络.html" class="navigation navigation-prev " aria-label="Previous page: 十三、卷积神经网络">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="15.自编码器.html" class="navigation navigation-next " aria-label="Next page: 十五、自编码器">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"十四、循环神经网络","level":"1.16","depth":1,"next":{"title":"十五、自编码器","level":"1.17","depth":1,"path":"docs/15.自编码器.md","ref":"docs/15.自编码器.md","articles":[]},"previous":{"title":"十三、卷积神经网络","level":"1.15","depth":1,"path":"docs/13.卷积神经网络.md","ref":"docs/13.卷积神经网络.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"docs/14.循环神经网络.md","mtime":"2019-04-18T03:01:37.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-05-07T09:41:36.357Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

