
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>十五、自编码器 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="16.强化学习.html" />
    
    
    <link rel="prev" href="14.循环神经网络.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Sklearn 与 TensorFlow 机器学习实用指南
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="0.前言.html">
            
                <a href="0.前言.html">
            
                    
                    零、前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="1.机器学习概览.html">
            
                <a href="1.机器学习概览.html">
            
                    
                    一、机器学习概览
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="2.一个完整的机器学习项目.html">
            
                <a href="2.一个完整的机器学习项目.html">
            
                    
                    二、一个完整的机器学习项目
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="3.分类.html">
            
                <a href="3.分类.html">
            
                    
                    三、分类
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="4.训练模型.html">
            
                <a href="4.训练模型.html">
            
                    
                    四、训练模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="5.支持向量机.html">
            
                <a href="5.支持向量机.html">
            
                    
                    五、支持向量机
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="6.决策树.html">
            
                <a href="6.决策树.html">
            
                    
                    六、决策树
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="7.集成学习和随机森林.html">
            
                <a href="7.集成学习和随机森林.html">
            
                    
                    七、集成学习和随机森林
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="8.降维.html">
            
                <a href="8.降维.html">
            
                    
                    八、降维
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="9.启动并运行_TensorFlow.html">
            
                <a href="9.启动并运行_TensorFlow.html">
            
                    
                    九、启动并运行 TensorFlow
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="10.人工神经网络介绍.html">
            
                <a href="10.人工神经网络介绍.html">
            
                    
                    十、人工神经网络介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="11.训练深层神经网络.html">
            
                <a href="11.训练深层神经网络.html">
            
                    
                    十一、训练深层神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="12.设备和服务器上的分布式_TensorFlow.html">
            
                <a href="12.设备和服务器上的分布式_TensorFlow.html">
            
                    
                    十二、设备和服务器上的分布式 TensorFlow
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="13.卷积神经网络.html">
            
                <a href="13.卷积神经网络.html">
            
                    
                    十三、卷积神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="14.循环神经网络.html">
            
                <a href="14.循环神经网络.html">
            
                    
                    十四、循环神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.17" data-path="15.自编码器.html">
            
                <a href="15.自编码器.html">
            
                    
                    十五、自编码器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="16.强化学习.html">
            
                <a href="16.强化学习.html">
            
                    
                    十六、强化学习
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="B.机器学习项目清单.html">
            
                <a href="B.机器学习项目清单.html">
            
                    
                    附录 B、机器学习项目清单
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="C.SVM_对偶问题.html">
            
                <a href="C.SVM_对偶问题.html">
            
                    
                    附录 C、SVM 对偶问题
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="D.自动微分.html">
            
                <a href="D.自动微分.html">
            
                    
                    附录 D、自动微分
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >十五、自编码器</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x5341;&#x4E94;&#x3001;&#x81EA;&#x7F16;&#x7801;&#x5668;">&#x5341;&#x4E94;&#x3001;&#x81EA;&#x7F16;&#x7801;&#x5668;</h1>
<blockquote>
<p>&#x8BD1;&#x8005;&#xFF1A;<a href="https://github.com/wangxupeng" target="_blank">@akonwang</a></p>
<p>&#x6821;&#x5BF9;&#x8005;&#xFF1A;<a href="https://github.com/wizardforcel" target="_blank">@&#x98DE;&#x9F99;</a>&#x3001;<a href="https://github.com/yanmengk" target="_blank">@yanmengk</a></p>
</blockquote>
<p>&#x81EA;&#x7F16;&#x7801;&#x5668;&#x662F;&#x80FD;&#x591F;&#x5728;&#x65E0;&#x76D1;&#x7763;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5B66;&#x4E60;&#x8F93;&#x5165;&#x6570;&#x636E;&#x7684;&#x6709;&#x6548;&#x8868;&#x793A;&#xFF08;&#x53EB;&#x505A;&#x7F16;&#x7801;&#xFF09;&#x7684;&#x4EBA;&#x5DE5;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF08;&#x5373;&#xFF0C;&#x8BAD;&#x7EC3;&#x96C6;&#x662F;&#x672A;&#x6807;&#x8BB0;&#xFF09;&#x3002;&#x8FD9;&#x4E9B;&#x7F16;&#x7801;&#x901A;&#x5E38;&#x5177;&#x6709;&#x6BD4;&#x8F93;&#x5165;&#x6570;&#x636E;&#x4F4E;&#x5F97;&#x591A;&#x7684;&#x7EF4;&#x5EA6;&#xFF0C;&#x4F7F;&#x5F97;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x5BF9;&#x964D;&#x7EF4;&#x6709;&#x7528;&#xFF08;&#x53C2;&#x89C1;&#x7B2C; 8 &#x7AE0;&#xFF09;&#x3002;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x5F3A;&#x5927;&#x7684;&#x7279;&#x5F81;&#x68C0;&#x6D4B;&#x5668;&#xFF0C;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x65E0;&#x76D1;&#x7763;&#x7684;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x9884;&#x8BAD;&#x7EC3;&#xFF08;&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x5728;&#x7B2C; 11 &#x7AE0;&#x4E2D;&#x8BA8;&#x8BBA;&#x8FC7;&#x7684;&#xFF09;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x4ED6;&#x4EEC;&#x80FD;&#x591F;&#x968F;&#x673A;&#x751F;&#x6210;&#x4E0E;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#x7684;&#x65B0;&#x6570;&#x636E;&#xFF1B;&#x8FD9;&#x88AB;&#x79F0;&#x4E3A;&#x751F;&#x6210;&#x6A21;&#x578B;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5728;&#x8138;&#x90E8;&#x56FE;&#x7247;&#x4E0A;&#x8BAD;&#x7EC3;&#x81EA;&#x7F16;&#x7801;&#x5668;&#xFF0C;&#x7136;&#x540E;&#x53EF;&#x4EE5;&#x751F;&#x6210;&#x65B0;&#x8138;&#x90E8;&#x3002;</p>
<p>&#x4EE4;&#x4EBA;&#x60CA;&#x8BB6;&#x7684;&#x662F;&#xFF0C;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x53EA;&#x9700;&#x5B66;&#x4E60;&#x5C06;&#x8F93;&#x5165;&#x590D;&#x5236;&#x5230;&#x5176;&#x8F93;&#x51FA;&#x5373;&#x53EF;&#x5DE5;&#x4F5C;&#x3002; &#x8FD9;&#x542C;&#x8D77;&#x6765;&#x50CF;&#x662F;&#x4E00;&#x4EF6;&#x5C0F;&#x4E8B;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x4F1A;&#x770B;&#x5230;&#x4EE5;&#x5404;&#x79CD;&#x65B9;&#x5F0F;&#x7EA6;&#x675F;&#x7F51;&#x7EDC;&#x53EF;&#x80FD;&#x4F1A;&#x8BA9;&#x5B83;&#x53D8;&#x5F97;&#x76F8;&#x5F53;&#x56F0;&#x96BE;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x9650;&#x5236;&#x5185;&#x90E8;&#x8868;&#x793A;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x6216;&#x8005;&#x53EF;&#x4EE5;&#x5411;&#x8F93;&#x5165;&#x6DFB;&#x52A0;&#x566A;&#x58F0;&#x5E76;&#x8BAD;&#x7EC3;&#x7F51;&#x7EDC;&#x4EE5;&#x6062;&#x590D;&#x539F;&#x59CB;&#x8F93;&#x5165;&#x3002;&#x8FD9;&#x4E9B;&#x7EA6;&#x675F;&#x9632;&#x6B62;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x5C06;&#x8F93;&#x5165;&#x76F4;&#x63A5;&#x590D;&#x5236;&#x5230;&#x8F93;&#x51FA;&#xFF0C;&#x8FD9;&#x8FEB;&#x4F7F;&#x5B83;&#x5B66;&#x4E60;&#x8868;&#x793A;&#x6570;&#x636E;&#x7684;&#x6709;&#x6548;&#x65B9;&#x6CD5;&#x3002; &#x7B80;&#x8A00;&#x4E4B;&#xFF0C;&#x7F16;&#x7801;&#x662F;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x5728;&#x67D0;&#x4E9B;&#x9650;&#x5236;&#x6761;&#x4EF6;&#x4E0B;&#x5C1D;&#x8BD5;&#x5B66;&#x4E60;&#x6052;&#x7B49;&#x51FD;&#x6570;&#x7684;&#x526F;&#x4EA7;&#x54C1;&#x3002;</p>
<p>&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x66F4;&#x6DF1;&#x5165;&#x5730;&#x89E3;&#x91CA;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#xFF0C;&#x53EF;&#x4EE5;&#x65BD;&#x52A0;&#x4EC0;&#x4E48;&#x7C7B;&#x578B;&#x7684;&#x7EA6;&#x675F;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x4F7F;&#x7528; TensorFlow &#x5B9E;&#x73B0;&#x5B83;&#x4EEC;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x7528;&#x6765;&#x964D;&#x7EF4;&#xFF0C;&#x7279;&#x5F81;&#x63D0;&#x53D6;&#xFF0C;&#x65E0;&#x76D1;&#x7763;&#x9884;&#x8BAD;&#x7EC3;&#x8FD8;&#x662F;&#x4F5C;&#x4E3A;&#x751F;&#x6210;&#x5F0F;&#x6A21;&#x578B;&#x3002;</p>
<h2 id="&#x6709;&#x6548;&#x7684;&#x6570;&#x636E;&#x8868;&#x793A;">&#x6709;&#x6548;&#x7684;&#x6570;&#x636E;&#x8868;&#x793A;</h2>
<p>&#x60A8;&#x53D1;&#x73B0;&#x4EE5;&#x4E0B;&#x54EA;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#x5E8F;&#x5217;&#x6700;&#x5BB9;&#x6613;&#x8BB0;&#x5FC6;&#xFF1F;</p>
<ul>
<li><code>40, 27, 25, 36, 81, 57, 10, 73, 19, 68</code></li>
<li><code>50, 25, 76, 38, 19, 58, 29, 88, 44, 22, 11, 34, 17, 52, 26, 13, 40, 20</code></li>
</ul>
<p>&#x4E4D;&#x4E00;&#x770B;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x5E8F;&#x5217;&#x4F3C;&#x4E4E;&#x5E94;&#x8BE5;&#x66F4;&#x5BB9;&#x6613;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x8981;&#x77ED;&#x5F97;&#x591A;&#x3002; &#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4ED4;&#x7EC6;&#x89C2;&#x5BDF;&#x7B2C;&#x4E8C;&#x4E2A;&#x5E8F;&#x5217;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x4F1A;&#x6CE8;&#x610F;&#x5230;&#x5B83;&#x9075;&#x5FAA;&#x4E24;&#x6761;&#x7B80;&#x5355;&#x89C4;&#x5219;&#xFF1A;&#x5076;&#x6570;&#x662F;&#x524D;&#x9762;&#x6570;&#x7684;&#x4E00;&#x534A;&#xFF0C;&#x5947;&#x6570;&#x662F;&#x524D;&#x9762;&#x6570;&#x7684;&#x4E09;&#x500D;&#x52A0;&#x4E00;&#xFF08;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x7740;&#x540D;&#x7684;&#x5E8F;&#x5217;&#xFF0C;&#x79F0;&#x4E3A;&#x96F9;&#x77F3;&#x5E8F;&#x5217;&#xFF09;&#x3002;&#x4E00;&#x65E6;&#x4F60;&#x6CE8;&#x610F;&#x5230;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x5E8F;&#x5217;&#x6BD4;&#x7B2C;&#x4E00;&#x4E2A;&#x66F4;&#x5BB9;&#x6613;&#x8BB0;&#x5FC6;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x8BB0;&#x4F4F;&#x4E24;&#x4E2A;&#x89C4;&#x5219;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#x548C;&#x5E8F;&#x5217;&#x7684;&#x957F;&#x5EA6;&#x3002; &#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x8F7B;&#x677E;&#x5730;&#x8BB0;&#x4F4F;&#x975E;&#x5E38;&#x957F;&#x7684;&#x5E8F;&#x5217;&#xFF0C;&#x5219;&#x60A8;&#x4E0D;&#x4F1A;&#x5728;&#x610F;&#x7B2C;&#x4E8C;&#x4E2A;&#x5E8F;&#x5217;&#x4E2D;&#x5B58;&#x5728;&#x7684;&#x6A21;&#x5F0F;&#x3002; &#x4F60;&#x53EA;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x6BCF;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#xFF0C;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x3002; &#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5F88;&#x96BE;&#x8BB0;&#x4F4F;&#x957F;&#x5E8F;&#x5217;&#xFF0C;&#x56E0;&#x6B64;&#x8BC6;&#x522B;&#x6A21;&#x5F0F;&#x975E;&#x5E38;&#x6709;&#x7528;&#xFF0C;&#x5E76;&#x4E14;&#x5E0C;&#x671B;&#x80FD;&#x591F;&#x6F84;&#x6E05;&#x4E3A;&#x4EC0;&#x4E48;&#x5728;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#x4E2D;&#x9650;&#x5236;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x4F1A;&#x4FC3;&#x4F7F;&#x5B83;&#x53D1;&#x73B0;&#x5E76;&#x5229;&#x7528;&#x6570;&#x636E;&#x4E2D;&#x7684;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x8BB0;&#x5FC6;&#xFF0C;&#x611F;&#x77E5;&#x548C;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x5728; 20 &#x4E16;&#x7EAA; 70 &#x5E74;&#x4EE3;&#x65E9;&#x671F;&#x7531; William Chase &#x548C; Herbert Simon &#x7740;&#x540D;&#x7814;&#x7A76;&#x3002; &#x4ED6;&#x4EEC;&#x89C2;&#x5BDF;&#x5230;&#xFF0C;&#x4E13;&#x5BB6;&#x68CB;&#x624B;&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x89C2;&#x770B;&#x68CB;&#x76D8;5&#x79D2;&#x949F;&#x6765;&#x8BB0;&#x5FC6;&#x6240;&#x6709;&#x68CB;&#x5B50;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x8FD9;&#x662F;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x8BA4;&#x4E3A;&#x4E0D;&#x53EF;&#x80FD;&#x5B8C;&#x6210;&#x7684;&#x4EFB;&#x52A1;&#x3002; &#x7136;&#x800C;&#xFF0C;&#x53EA;&#x6709;&#x5F53;&#x8FD9;&#x4E9B;&#x68CB;&#x5B50;&#x88AB;&#x653E;&#x7F6E;&#x5728;&#x73B0;&#x5B9E;&#x4F4D;&#x7F6E;&#xFF08;&#x6765;&#x81EA;&#x5B9E;&#x9645;&#x6BD4;&#x8D5B;&#xFF09;&#x65F6;&#x624D;&#x662F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x968F;&#x673A;&#x653E;&#x7F6E;&#x68CB;&#x5B50;&#x3002; &#x56FD;&#x9645;&#x8C61;&#x68CB;&#x4E13;&#x5BB6;&#x6CA1;&#x6709;&#x6BD4;&#x4F60;&#x66F4;&#x597D;&#x7684;&#x8BB0;&#x5FC6;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EA;&#x662F;&#x66F4;&#x5BB9;&#x6613;&#x770B;&#x5230;&#x56FD;&#x9645;&#x8C61;&#x68CB;&#x6A21;&#x5F0F;&#xFF0C;&#x8FD9;&#x8981;&#x5F52;&#x529F;&#x4E8E;&#x4ED6;&#x4EEC;&#x5BF9;&#x6BD4;&#x8D5B;&#x7684;&#x7ECF;&#x9A8C;&#x3002; &#x6CE8;&#x610F;&#x6A21;&#x5F0F;&#x6709;&#x52A9;&#x4E8E;&#x4ED6;&#x4EEC;&#x6709;&#x6548;&#x5730;&#x5B58;&#x50A8;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x5C31;&#x50CF;&#x8FD9;&#x4E2A;&#x8BB0;&#x5FC6;&#x5B9E;&#x9A8C;&#x4E2D;&#x7684;&#x8C61;&#x68CB;&#x68CB;&#x624B;&#x4E00;&#x6837;&#xFF0C;&#x4E00;&#x4E2A;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x4F1A;&#x67E5;&#x770B;&#x8F93;&#x5165;&#x4FE1;&#x606F;&#xFF0C;&#x5C06;&#x5B83;&#x4EEC;&#x8F6C;&#x6362;&#x4E3A;&#x9AD8;&#x6548;&#x7684;&#x5185;&#x90E8;&#x8868;&#x793A;&#x5F62;&#x5F0F;&#xFF0C;&#x7136;&#x540E;&#x5410;&#x51FA;&#x4E00;&#x4E9B;&#xFF08;&#x5E0C;&#x671B;&#xFF09;&#x770B;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x63A5;&#x8FD1;&#x8F93;&#x5165;&#x7684;&#x4E1C;&#x897F;&#x3002; &#x81EA;&#x7F16;&#x7801;&#x5668;&#x603B;&#x662F;&#x7531;&#x4E24;&#x90E8;&#x5206;&#x7EC4;&#x6210;&#xFF1A;&#x5C06;&#x8F93;&#x5165;&#x8F6C;&#x6362;&#x4E3A;&#x5185;&#x90E8;&#x8868;&#x793A;&#x7684;&#x7F16;&#x7801;&#x5668;&#xFF08;&#x6216;&#x8BC6;&#x522B;&#x7F51;&#x7EDC;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x662F;&#x5C06;&#x5185;&#x90E8;&#x8868;&#x793A;&#x8F6C;&#x6362;&#x4E3A;&#x8F93;&#x51FA;&#x7684;&#x89E3;&#x7801;&#x5668;&#xFF08;&#x6216;&#x751F;&#x6210;&#x7F51;&#x7EDC;&#xFF09;&#xFF08;&#x89C1;&#x56FE; 15-1&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_15/pic1.png" alt=""></p>
<p>&#x5982;&#x60A8;&#x6240;&#x89C1;&#xFF0C;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x901A;&#x5E38;&#x5177;&#x6709;&#x4E0E;&#x591A;&#x5C42;&#x611F;&#x77E5;&#x5668;&#xFF08;MLP&#xFF0C;&#x8BF7;&#x53C2;&#x9605;&#x7B2C; 10 &#x7AE0;&#xFF09;&#x76F8;&#x540C;&#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#xFF0C;&#x4F46;&#x8F93;&#x51FA;&#x5C42;&#x4E2D;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x6570;&#x91CF;&#x5FC5;&#x987B;&#x7B49;&#x4E8E;&#x8F93;&#x5165;&#x6570;&#x91CF;&#x3002; &#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x7531;&#x4E24;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#xFF08;&#x7F16;&#x7801;&#x5668;&#xFF09;&#x7EC4;&#x6210;&#x7684;&#x9690;&#x85CF;&#x5C42;&#x548C;&#x4E00;&#x4E2A;&#x7531;&#x4E09;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#xFF08;&#x89E3;&#x7801;&#x5668;&#xFF09;&#x7EC4;&#x6210;&#x7684;&#x8F93;&#x51FA;&#x5C42;&#x3002; &#x7531;&#x4E8E;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x8BD5;&#x56FE;&#x91CD;&#x6784;&#x8F93;&#x5165;&#xFF0C;&#x6240;&#x4EE5;&#x8F93;&#x51FA;&#x901A;&#x5E38;&#x88AB;&#x79F0;&#x4E3A;&#x91CD;&#x5EFA;&#xFF0C;&#x5E76;&#x4E14;&#x635F;&#x5931;&#x51FD;&#x6570;&#x5305;&#x542B;&#x91CD;&#x5EFA;&#x635F;&#x5931;&#xFF0C;&#x5F53;&#x91CD;&#x5EFA;&#x4E0E;&#x8F93;&#x5165;&#x4E0D;&#x540C;&#x65F6;&#xFF0C;&#x91CD;&#x5EFA;&#x635F;&#x5931;&#x4F1A;&#x5BF9;&#x6A21;&#x578B;&#x8FDB;&#x884C;&#x60E9;&#x7F5A;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x5185;&#x90E8;&#x8868;&#x793A;&#x5177;&#x6709;&#x6BD4;&#x8F93;&#x5165;&#x6570;&#x636E;&#x66F4;&#x4F4E;&#x7684;&#x7EF4;&#x5EA6;&#xFF08;&#x5B83;&#x662F; 2D &#x800C;&#x4E0D;&#x662F; 3D&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x4E0D;&#x5B8C;&#x6574;&#x7684;&#x3002; &#x4E0D;&#x5B8C;&#x6574;&#x7684;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x4E0D;&#x80FD;&#x7B80;&#x5355;&#x5730;&#x5C06;&#x5176;&#x8F93;&#x5165;&#x590D;&#x5236;&#x5230;&#x7F16;&#x7801;&#xFF0C;&#x4F46;&#x5B83;&#x5FC5;&#x987B;&#x627E;&#x5230;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x6765;&#x8F93;&#x51FA;&#x5176;&#x8F93;&#x5165;&#x7684;&#x526F;&#x672C;&#x3002; &#x5B83;&#x88AB;&#x8FEB;&#x5B66;&#x4E60;&#x8F93;&#x5165;&#x6570;&#x636E;&#x4E2D;&#x6700;&#x91CD;&#x8981;&#x7684;&#x7279;&#x5F81;&#xFF08;&#x5E76;&#x5220;&#x9664;&#x4E0D;&#x91CD;&#x8981;&#x7684;&#x7279;&#x5F81;&#xFF09;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x4E0D;&#x5B8C;&#x6574;&#x7684;&#x81EA;&#x7F16;&#x7801;&#x5668;&#xFF0C;&#x4EE5;&#x964D;&#x4F4E;&#x7EF4;&#x5EA6;&#x3002;</p>
<h2 id="&#x7528;&#x4E0D;&#x5B8C;&#x6574;&#x7684;&#x7EBF;&#x6027;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x6267;&#x884C;-pca">&#x7528;&#x4E0D;&#x5B8C;&#x6574;&#x7684;&#x7EBF;&#x6027;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x6267;&#x884C; PCA</h2>
<p>&#x5982;&#x679C;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x4EC5;&#x4F7F;&#x7528;&#x7EBF;&#x6027;&#x6FC0;&#x6D3B;&#x5E76;&#x4E14;&#x635F;&#x5931;&#x51FD;&#x6570;&#x662F;&#x5747;&#x65B9;&#x8BEF;&#x5DEE;&#xFF08;MSE&#xFF09;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x663E;&#x793A;&#x5B83;&#x6700;&#x7EC8;&#x6267;&#x884C;&#x4E3B;&#x6210;&#x5206;&#x5206;&#x6790;&#xFF08;&#x53C2;&#x89C1;&#x7B2C; 8 &#x7AE0;&#xFF09;&#x3002;</p>
<p>&#x4EE5;&#x4E0B;&#x4EE3;&#x7801;&#x6784;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x7EBF;&#x6027;&#x81EA;&#x7F16;&#x7801;&#x5668;&#xFF0C;&#x4EE5;&#x5728; 3D &#x6570;&#x636E;&#x96C6;&#x4E0A;&#x6267;&#x884C; PCA&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x6295;&#x5F71;&#x5230; 2D&#xFF1A;</p>
<pre><code class="lang-py"><span class="hljs-keyword">import</span> tensorflow <span class="hljs-keyword">as</span> tf
<span class="hljs-keyword">from</span> tensorflow.contrib.layers <span class="hljs-keyword">import</span> fully_connected
n_inputs = <span class="hljs-number">3</span> <span class="hljs-comment"># 3D inputs</span>
n_hidden = <span class="hljs-number">2</span> <span class="hljs-comment"># 2D codings</span>
n_outputs = n_inputs
learning_rate = <span class="hljs-number">0.01</span>
X = tf.placeholder(tf.float32, shape=[<span class="hljs-keyword">None</span>, n_inputs])
hidden = fully_connected(X, n_hidden, activation_fn=<span class="hljs-keyword">None</span>)
outputs = fully_connected(hidden, n_outputs, activation_fn=<span class="hljs-keyword">None</span>)
reconstruction_loss = tf.reduce_mean(tf.square(outputs - X)) <span class="hljs-comment"># MSE</span>
optimizer = tf.train.AdamOptimizer(learning_rate)
training_op = optimizer.minimize(reconstruction_loss)
init = tf.global_variables_initializer()
</code></pre>
<p>&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x4E0E;&#x6211;&#x4EEC;&#x5728;&#x8FC7;&#x53BB;&#x7AE0;&#x8282;&#x4E2D;&#x5EFA;&#x7ACB;&#x7684;&#x6240;&#x6709; MLP &#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x4E0D;&#x540C;&#x3002; &#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x4E24;&#x4EF6;&#x4E8B;&#x662F;&#xFF1A;</p>
<ul>
<li>&#x8F93;&#x51FA;&#x7684;&#x6570;&#x91CF;&#x7B49;&#x4E8E;&#x8F93;&#x5165;&#x7684;&#x6570;&#x91CF;&#x3002;</li>
<li>&#x4E3A;&#x4E86;&#x6267;&#x884C;&#x7B80;&#x5355;&#x7684; PCA&#xFF0C;&#x6211;&#x4EEC;&#x8BBE;&#x7F6E;<code>activation_fn = None</code>&#xFF08;&#x5373;&#xFF0C;&#x6240;&#x6709;&#x795E;&#x7ECF;&#x5143;&#x90FD;&#x662F;&#x7EBF;&#x6027;&#x7684;&#xFF09;</li>
</ul>
<p>&#x800C;&#x635F;&#x5931;&#x51FD;&#x6570;&#x662F; MSE&#x3002; &#x6211;&#x4EEC;&#x5F88;&#x5FEB;&#x4F1A;&#x770B;&#x5230;&#x66F4;&#x590D;&#x6742;&#x7684;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x8BA9;&#x6211;&#x4EEC;&#x52A0;&#x8F7D;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x8BAD;&#x7EC3;&#x6A21;&#x578B;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x5B83;&#x6765;&#x5BF9;&#x6D4B;&#x8BD5;&#x96C6;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#xFF08;&#x5373;&#x5C06;&#x5176;&#x6295;&#x5F71;&#x5230; 2D&#xFF09;&#xFF1A;</p>
<pre><code class="lang-py">X_train, X_test = [...] <span class="hljs-comment"># load the dataset</span>
n_iterations = <span class="hljs-number">1000</span>
codings = hidden <span class="hljs-comment"># the output of the hidden layer provides the codings</span>
<span class="hljs-keyword">with</span> tf.Session() <span class="hljs-keyword">as</span> sess:
    init.run()
    <span class="hljs-keyword">for</span> iteration <span class="hljs-keyword">in</span> range(n_iterations):
        training_op.run(feed_dict={X: X_train}) <span class="hljs-comment"># no labels (unsupervised)</span>
    codings_val = codings.eval(feed_dict={X: X_test})
</code></pre>
<p>&#x56FE; 15-2 &#x663E;&#x793A;&#x4E86;&#x539F;&#x59CB; 3D &#x6570;&#x636E;&#x96C6;&#xFF08;&#x5DE6;&#x4FA7;&#xFF09;&#x548C;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x9690;&#x85CF;&#x5C42;&#x7684;&#x8F93;&#x51FA;&#xFF08;&#x5373;&#x7F16;&#x7801;&#x5C42;&#xFF0C;&#x53F3;&#x4FA7;&#xFF09;&#x3002; &#x6B63;&#x5982;&#x60A8;&#x6240;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x627E;&#x5230;&#x4E86;&#x5C06;&#x6570;&#x636E;&#x6295;&#x5F71;&#x5230;&#x6570;&#x636E;&#x4E0A;&#x7684;&#x6700;&#x4F73;&#x4E8C;&#x7EF4;&#x5E73;&#x9762;&#xFF0C;&#x4FDD;&#x7559;&#x4E86;&#x6570;&#x636E;&#x7684;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x7684;&#x5DEE;&#x5F02;&#xFF08;&#x5C31;&#x50CF; PCA &#x4E00;&#x6837;&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_15/pic2.png" alt=""></p>
<h2 id="&#x6808;&#x5F0F;&#x81EA;&#x7F16;&#x7801;&#x5668;&#xFF08;sae&#xFF09;">&#x6808;&#x5F0F;&#x81EA;&#x7F16;&#x7801;&#x5668;&#xFF08;SAE&#xFF09;</h2>
<p>&#x5C31;&#x50CF;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x8FC7;&#x7684;&#x5176;&#x4ED6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E00;&#x6837;&#xFF0C;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x53EF;&#x4EE5;&#x6709;&#x591A;&#x4E2A;&#x9690;&#x85CF;&#x5C42;&#x3002; &#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B83;&#x4EEC;&#x88AB;&#x79F0;&#x4E3A;&#x6808;&#x5F0F;&#x81EA;&#x7F16;&#x7801;&#x5668;&#xFF08;&#x6216;&#x6DF1;&#x5EA6;&#x81EA;&#x7F16;&#x7801;&#x5668;&#xFF09;&#x3002; &#x6DFB;&#x52A0;&#x66F4;&#x591A;&#x5C42;&#x6709;&#x52A9;&#x4E8E;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x4E86;&#x89E3;&#x66F4;&#x590D;&#x6742;&#x7684;&#x7F16;&#x7801;&#x3002; &#x4F46;&#x662F;&#xFF0C;&#x5FC5;&#x987B;&#x6CE8;&#x610F;&#x4E0D;&#x8981;&#x8BA9;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x529F;&#x80FD;&#x592A;&#x5F3A;&#x5927;&#x3002; &#x8BBE;&#x60F3;&#x4E00;&#x4E2A;&#x7F16;&#x7801;&#x5668;&#x975E;&#x5E38;&#x5F3A;&#x5927;&#xFF0C;&#x53EA;&#x9700;&#x5B66;&#x4E60;&#x5C06;&#x6BCF;&#x4E2A;&#x8F93;&#x5165;&#x6620;&#x5C04;&#x5230;&#x4E00;&#x4E2A;&#x4EFB;&#x610F;&#x6570;&#x5B57;&#xFF08;&#x5E76;&#x4E14;&#x89E3;&#x7801;&#x5668;&#x5B66;&#x4E60;&#x53CD;&#x5411;&#x6620;&#x5C04;&#xFF09;&#x5373;&#x53EF;&#x3002; &#x5F88;&#x660E;&#x663E;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x5C06;&#x5B8C;&#x7F8E;&#x5730;&#x91CD;&#x6784;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#xFF0C;&#x4F46;&#x5B83;&#x4E0D;&#x4F1A;&#x5728;&#x8FC7;&#x7A0B;&#x4E2D;&#x5B66;&#x4E60;&#x5230;&#x4EFB;&#x4F55;&#x6709;&#x7528;&#x7684;&#x6570;&#x636E;&#x8868;&#x793A;&#xFF08;&#x5E76;&#x4E14;&#x5B83;&#x4E0D;&#x53EF;&#x80FD;&#x5F88;&#x597D;&#x5730;&#x63A8;&#x5E7F;&#x5230;&#x65B0;&#x7684;&#x5B9E;&#x4F8B;&#xFF09;&#x3002;</p>
<p>&#x6808;&#x5F0F;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x7684;&#x67B6;&#x6784;&#x5173;&#x4E8E;&#x4E2D;&#x592E;&#x9690;&#x85CF;&#x5C42;&#xFF08;&#x7F16;&#x7801;&#x5C42;&#xFF09;&#x901A;&#x5E38;&#x662F;&#x5BF9;&#x79F0;&#x7684;&#x3002; &#x7B80;&#x5355;&#x6765;&#x8BF4;&#xFF0C;&#x5B83;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x4E00;&#x4E2A;&#x4E09;&#x660E;&#x6CBB;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;&#x7528;&#x4E8E; MNIST &#x7684;&#x81EA;&#x7F16;&#x7801;&#x5668;&#xFF08;&#x5728;&#x7B2C; 3 &#x7AE0;&#x4E2D;&#x4ECB;&#x7ECD;&#xFF09;&#x53EF;&#x80FD;&#x6709; 784 &#x4E2A;&#x8F93;&#x5165;&#xFF0C;&#x5176;&#x6B21;&#x662F;&#x4E00;&#x4E2A;&#x9690;&#x85CF;&#x5C42;&#xFF0C;&#x6709; 300 &#x4E2A;&#x795E;&#x7ECF;&#x5143;&#xFF0C;&#x7136;&#x540E;&#x662F;&#x4E00;&#x4E2A;&#x4E2D;&#x592E;&#x9690;&#x85CF;&#x5C42;&#xFF0C;&#x6709; 150 &#x4E2A;&#x795E;&#x7ECF;&#x5143;&#xFF0C;&#x7136;&#x540E;&#x662F;&#x53E6;&#x4E00;&#x4E2A;&#x9690;&#x85CF;&#x5C42;&#xFF0C;&#x6709; 300 &#x4E2A;&#x795E;&#x7ECF;&#x5143;&#xFF0C;&#x8F93;&#x51FA;&#x5C42;&#x6709; 784 &#x795E;&#x7ECF;&#x5143;&#x3002; &#x8FD9;&#x4E2A;&#x6808;&#x5F0F;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x5982;&#x56FE; 15-3 &#x6240;&#x793A;&#x3002;</p>
<p><img src="../images/chapter_15/pic3.png" alt=""></p>
<h2 id="tensorflow&#x5B9E;&#x73B0;">TensorFlow&#x5B9E;&#x73B0;</h2>
<p>&#x60A8;&#x53EF;&#x4EE5;&#x50CF;&#x5E38;&#x89C4;&#x6DF1;&#x5EA6; MLP &#x4E00;&#x6837;&#x5B9E;&#x73B0;&#x6808;&#x5F0F;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x3002; &#x7279;&#x522B;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x7B2C; 11 &#x7AE0;&#x4E2D;&#x7528;&#x4E8E;&#x8BAD;&#x7EC3;&#x6DF1;&#x5EA6;&#x7F51;&#x7EDC;&#x7684;&#x6280;&#x672F;&#x4E5F;&#x53EF;&#x4EE5;&#x5E94;&#x7528;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x4F7F;&#x7528; He &#x521D;&#x59CB;&#x5316;&#xFF0C;ELU &#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x548C; l2 &#x6B63;&#x5219;&#x5316;&#x4E3A; MNIST &#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x6808;&#x5F0F;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x3002; &#x4EE3;&#x7801;&#x5E94;&#x8BE5;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x719F;&#x6089;&#xFF0C;&#x9664;&#x4E86;&#x6CA1;&#x6709;&#x6807;&#x7B7E;&#xFF08;&#x6CA1;&#x6709;<code>y</code>&#xFF09;&#xFF1A;</p>
<pre><code class="lang-py">n_inputs = <span class="hljs-number">28</span> * <span class="hljs-number">28</span> <span class="hljs-comment"># for MNIST</span>
n_hidden1 = <span class="hljs-number">300</span>
n_hidden2 = <span class="hljs-number">150</span> <span class="hljs-comment"># codings</span>
n_hidden3 = n_hidden1
n_outputs = n_inputs

learning_rate = <span class="hljs-number">0.01</span>
l2_reg = <span class="hljs-number">0.001</span>

X = tf.placeholder(tf.float32, shape=[<span class="hljs-keyword">None</span>, n_inputs])
<span class="hljs-keyword">with</span> tf.contrib.framework.arg_scope(
        [fully_connected],
        activation_fn=tf.nn.elu,
        weights_initializer=tf.contrib.layers.variance_scaling_initializer(),
        weights_regularizer=tf.contrib.layers.l2_regularizer(l2_reg)):
    hidden1 = fully_connected(X, n_hidden1)
    hidden2 = fully_connected(hidden1, n_hidden2) <span class="hljs-comment"># codings</span>
    hidden3 = fully_connected(hidden2, n_hidden3)
    outputs = fully_connected(hidden3, n_outputs, activation_fn=<span class="hljs-keyword">None</span>)
reconstruction_loss = tf.reduce_mean(tf.square(outputs - X)) <span class="hljs-comment"># MSE</span>

reg_losses = tf.get_collection(tf.GraphKeys.REGULARIZATION_LOSSES)
loss = tf.add_n([reconstruction_loss] + reg_losses)

optimizer = tf.train.AdamOptimizer(learning_rate)
training_op = optimizer.minimize(loss)

init = tf.global_variables_initializer()
</code></pre>
<p>&#x7136;&#x540E;&#x53EF;&#x4EE5;&#x6B63;&#x5E38;&#x8BAD;&#x7EC3;&#x6A21;&#x578B;&#x3002; &#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x6570;&#x5B57;&#x6807;&#x7B7E;&#xFF08;<code>y_batch</code>&#xFF09;&#x672A;&#x4F7F;&#x7528;&#xFF1A;</p>
<pre><code class="lang-py">n_epochs = <span class="hljs-number">5</span>
batch_size = <span class="hljs-number">150</span>
<span class="hljs-keyword">with</span> tf.Session() <span class="hljs-keyword">as</span> sess:
    init.run()
    <span class="hljs-keyword">for</span> epoch <span class="hljs-keyword">in</span> range(n_epochs):
        n_batches = mnist.train.num_examples // batch_size
        <span class="hljs-keyword">for</span> iteration <span class="hljs-keyword">in</span> range(n_batches):
            X_batch, y_batch = mnist.train.next_batch(batch_size)
            sess.run(training_op, feed_dict={X: X_batch})
</code></pre>
<h2 id="&#x5173;&#x8054;&#x6743;&#x91CD;">&#x5173;&#x8054;&#x6743;&#x91CD;</h2>
<p>&#x5F53;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x6574;&#x9F50;&#x5730;&#x5BF9;&#x79F0;&#x65F6;&#xFF0C;&#x5C31;&#x50CF;&#x6211;&#x4EEC;&#x521A;&#x521A;&#x6784;&#x5EFA;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x4E00;&#x79CD;&#x5E38;&#x7528;&#x6280;&#x672F;&#x662F;&#x5C06;&#x89E3;&#x7801;&#x5668;&#x5C42;&#x7684;&#x6743;&#x91CD;&#x4E0E;&#x7F16;&#x7801;&#x5668;&#x5C42;&#x7684;&#x6743;&#x91CD;&#x76F8;&#x5173;&#x8054;&#x3002; &#x8FD9;&#x6837;&#x51CF;&#x5C11;&#x4E86;&#x6A21;&#x578B;&#x4E2D;&#x7684;&#x6743;&#x91CD;&#x6570;&#x91CF;&#xFF0C;&#x52A0;&#x5FEB;&#x4E86;&#x8BAD;&#x7EC3;&#x901F;&#x5EA6;&#xFF0C;&#x5E76;&#x9650;&#x5236;&#x4E86;&#x8FC7;&#x5EA6;&#x62DF;&#x5408;&#x7684;&#x98CE;&#x9669;&#x3002;</p>
<p>&#x5177;&#x4F53;&#x6765;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x603B;&#x5171;&#x5177;&#x6709;<code>N</code>&#x4E2A;&#x5C42;&#xFF08;&#x4E0D;&#x8BA1;&#x5165;&#x8F93;&#x5165;&#x5C42;&#xFF09;&#xFF0C;&#x5E76;&#x4E14; <img src="../images/tex-25d23c777ed15931c5e6af6f459eadd1.gif" alt="W^{[L]}"> &#x8868;&#x793A;&#x7B2C;<code>L</code>&#x5C42;&#x7684;&#x8FDE;&#x63A5;&#x6743;&#x91CD;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5C42; 1 &#x662F;&#x7B2C;&#x4E00;&#x9690;&#x85CF;&#x5C42;&#xFF0C;&#x5219;&#x5C42;<code>N / 2</code>&#x662F;&#x7F16;&#x7801; &#x5C42;&#xFF0C;&#x800C;&#x5C42;<code>N</code>&#x662F;&#x8F93;&#x51FA;&#x5C42;&#xFF09;&#xFF0C;&#x5219;&#x89E3;&#x7801;&#x5668;&#x5C42;&#x6743;&#x91CD;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x5730;&#x5B9A;&#x4E49;&#x4E3A;&#xFF1A;<img src="../images/tex-27afe5e7581cb89a36bafc735b501d7a.gif" alt="W^{[N-L + 1]}= W^{[L]T}">&#xFF08;&#x5176;&#x4E2D;<code>L = 1, 2, ..., N2</code>&#xFF09;&#x3002;</p>
<p>&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x4F7F;&#x7528;<code>fully_connected()</code>&#x51FD;&#x6570;&#x5728; TensorFlow &#x4E2D;&#x5B9E;&#x73B0;&#x76F8;&#x5173;&#x6743;&#x91CD;&#x6709;&#x70B9;&#x9EBB;&#x70E6;&#xFF1B;&#x624B;&#x52A8;&#x5B9A;&#x4E49;&#x5C42;&#x5B9E;&#x9645;&#x4E0A;&#x66F4;&#x5BB9;&#x6613;&#x3002; &#x4EE3;&#x7801;&#x7ED3;&#x5C3E;&#x660E;&#x663E;&#x66F4;&#x52A0;&#x5197;&#x957F;&#xFF1A;</p>
<pre><code class="lang-py">activation = tf.nn.elu
regularizer = tf.contrib.layers.l2_regularizer(l2_reg)
initializer = tf.contrib.layers.variance_scaling_initializer()

X = tf.placeholder(tf.float32, shape=[<span class="hljs-keyword">None</span>, n_inputs])

weights1_init = initializer([n_inputs, n_hidden1])
weights2_init = initializer([n_hidden1, n_hidden2])

weights1 = tf.Variable(weights1_init, dtype=tf.float32, name=<span class="hljs-string">&quot;weights1&quot;</span>)
weights2 = tf.Variable(weights2_init, dtype=tf.float32, name=<span class="hljs-string">&quot;weights2&quot;</span>)
weights3 = tf.transpose(weights2, name=<span class="hljs-string">&quot;weights3&quot;</span>) <span class="hljs-comment"># tied weights</span>
weights4 = tf.transpose(weights1, name=<span class="hljs-string">&quot;weights4&quot;</span>) <span class="hljs-comment"># tied weights</span>

biases1 = tf.Variable(tf.zeros(n_hidden1), name=<span class="hljs-string">&quot;biases1&quot;</span>)
biases2 = tf.Variable(tf.zeros(n_hidden2), name=<span class="hljs-string">&quot;biases2&quot;</span>)
biases3 = tf.Variable(tf.zeros(n_hidden3), name=<span class="hljs-string">&quot;biases3&quot;</span>)
biases4 = tf.Variable(tf.zeros(n_outputs), name=<span class="hljs-string">&quot;biases4&quot;</span>)

hidden1 = activation(tf.matmul(X, weights1) + biases1)
hidden2 = activation(tf.matmul(hidden1, weights2) + biases2)
hidden3 = activation(tf.matmul(hidden2, weights3) + biases3)
outputs = tf.matmul(hidden3, weights4) + biases4

reconstruction_loss = tf.reduce_mean(tf.square(outputs - X))
reg_loss = regularizer(weights1) + regularizer(weights2)
loss = reconstruction_loss + reg_loss

optimizer = tf.train.AdamOptimizer(learning_rate)
training_op = optimizer.minimize(loss)

init = tf.global_variables_initializer()
</code></pre>
<p>&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x6709;&#x51E0;&#x4EF6;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#x60C5;&#x9700;&#x8981;&#x6CE8;&#x610F;&#xFF1A;</p>
<ul>
<li>&#x9996;&#x5148;&#xFF0C;&#x6743;&#x91CD; 3 &#x548C;&#x6743;&#x91CD; 4 &#x4E0D;&#x662F;&#x53D8;&#x91CF;&#xFF0C;&#x5B83;&#x4EEC;&#x5206;&#x522B;&#x662F;&#x6743;&#x91CD; 2 &#x548C;&#x6743;&#x91CD; 1 &#x7684;&#x8F6C;&#x7F6E;&#xFF08;&#x5B83;&#x4EEC;&#x4E0E;&#x5B83;&#x4EEC;&#x201C;&#x7ED1;&#x5B9A;&#x201D;&#xFF09;&#x3002;</li>
<li>&#x5176;&#x6B21;&#xFF0C;&#x7531;&#x4E8E;&#x5B83;&#x4EEC;&#x4E0D;&#x662F;&#x53D8;&#x91CF;&#xFF0C;&#x6240;&#x4EE5;&#x89C4;&#x8303;&#x5B83;&#x4EEC;&#x662F;&#x6CA1;&#x6709;&#x7528;&#x7684;&#xFF1A;&#x6211;&#x4EEC;&#x53EA;&#x8C03;&#x6574;&#x6743;&#x91CD; 1 &#x548C;&#x6743;&#x91CD; 2&#x3002;</li>
<li>&#x7B2C;&#x4E09;&#xFF0C;&#x504F;&#x7F6E;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x88AB;&#x675F;&#x7F1A;&#xFF0C;&#x5E76;&#x4E14;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x6B63;&#x89C4;&#x5316;&#x3002;</li>
</ul>
<h2 id="&#x4E00;&#x6B21;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x81EA;&#x7F16;&#x7801;&#x5668;">&#x4E00;&#x6B21;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x81EA;&#x7F16;&#x7801;&#x5668;</h2>
<p>&#x6211;&#x4EEC;&#x4E0D;&#x662F;&#x4E00;&#x6B21;&#x5B8C;&#x6210;&#x6574;&#x4E2A;&#x6808;&#x5F0F;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x7684;&#x8BAD;&#x7EC3;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x6B21;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x6D45;&#x81EA;&#x7F16;&#x7801;&#x5668;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x5806;&#x53E0;&#x5230;&#x4E00;&#x4E2A;&#x6808;&#x5F0F;&#x81EA;&#x7F16;&#x7801;&#x5668;&#xFF08;&#x56E0;&#x6B64;&#x540D;&#x79F0;&#xFF09;&#x4E2D;&#xFF0C;&#x901A;&#x5E38;&#x8981;&#x5FEB;&#x5F97;&#x591A;&#xFF0C;&#x5982;&#x56FE; 15-4 &#x6240;&#x793A;&#x3002; &#x8FD9;&#x5BF9;&#x4E8E;&#x975E;&#x5E38;&#x6DF1;&#x7684;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x7279;&#x522B;&#x6709;&#x7528;&#x3002;</p>
<p><img src="../images/chapter_15/pic4.png" alt=""></p>
<p>&#x5728;&#x8BAD;&#x7EC3;&#x7684;&#x7B2C;&#x4E00;&#x9636;&#x6BB5;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x5B66;&#x4E60;&#x91CD;&#x6784;&#x8F93;&#x5165;&#x3002; &#x5728;&#x7B2C;&#x4E8C;&#x9636;&#x6BB5;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x5B66;&#x4E60;&#x91CD;&#x6784;&#x7B2C;&#x4E00;&#x4E2A;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x9690;&#x85CF;&#x5C42;&#x7684;&#x8F93;&#x51FA;&#x3002; &#x6700;&#x540E;&#xFF0C;&#x60A8;&#x53EA;&#x9700;&#x4F7F;&#x7528;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x6765;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x5927;&#x4E09;&#x660E;&#x6CBB;&#xFF0C;&#x5982;&#x56FE; 15-4 &#x6240;&#x793A;&#xFF08;&#x5373;&#xFF0C;&#x60A8;&#x9996;&#x5148;&#x5C06;&#x6BCF;&#x4E2A;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x7684;&#x9690;&#x85CF;&#x5C42;&#xFF0C;&#x7136;&#x540E;&#x6309;&#x76F8;&#x53CD;&#x987A;&#x5E8F;&#x5806;&#x53E0;&#x8F93;&#x51FA;&#x5C42;&#xFF09;&#x3002; &#x8FD9;&#x7ED9;&#x4F60;&#x6700;&#x540E;&#x7684;&#x6808;&#x5F0F;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x3002; &#x60A8;&#x53EF;&#x4EE5;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x8F7B;&#x677E;&#x5730;&#x8BAD;&#x7EC3;&#x66F4;&#x591A;&#x7684;&#x81EA;&#x7F16;&#x7801;&#x5668;&#xFF0C;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x6DF1;&#x7684;&#x6808;&#x5F0F;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x8FD9;&#x79CD;&#x591A;&#x9636;&#x6BB5;&#x8BAD;&#x7EC3;&#x7B97;&#x6CD5;&#xFF0C;&#x6700;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x5BF9;&#x6BCF;&#x4E2A;&#x9636;&#x6BB5;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684; TensorFlow &#x56FE;&#x3002; &#x8BAD;&#x7EC3;&#x5B8C;&#x4E00;&#x4E2A;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x540E;&#xFF0C;&#x60A8;&#x53EA;&#x9700;&#x901A;&#x8FC7;&#x5B83;&#x8FD0;&#x884C;&#x8BAD;&#x7EC3;&#x96C6;&#x5E76;&#x6355;&#x83B7;&#x9690;&#x85CF;&#x5C42;&#x7684;&#x8F93;&#x51FA;&#x3002; &#x8FD9;&#x4E2A;&#x8F93;&#x51FA;&#x4F5C;&#x4E3A;&#x4E0B;&#x4E00;&#x4E2A;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#x3002; &#x4E00;&#x65E6;&#x6240;&#x6709;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x90FD;&#x4EE5;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x4E86;&#x8BAD;&#x7EC3;,&#x60A8;&#x53EA;&#x9700;&#x590D;&#x5236;&#x6BCF;&#x4E2A;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x7684;&#x6743;&#x91CD;&#x548C;&#x504F;&#x7F6E;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x6765;&#x6784;&#x5EFA;&#x5806;&#x53E0;&#x7684;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x3002; &#x5B9E;&#x73B0;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x4E0D;&#x5728;&#x8FD9;&#x91CC;&#x8BE6;&#x7EC6;&#x8BF4;&#x660E;&#xFF0C;&#x4F46;&#x8BF7;&#x67E5;&#x9605; Jupyter notebooks &#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x4F5C;&#x4E3A;&#x793A;&#x4F8B;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x4F7F;&#x7528;&#x5305;&#x542B;&#x6574;&#x4E2A;&#x6808;&#x5F0F;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x7684;&#x5355;&#x4E2A;&#x56FE;&#xFF0C;&#x4EE5;&#x53CA;&#x6267;&#x884C;&#x6BCF;&#x4E2A;&#x8BAD;&#x7EC3;&#x9636;&#x6BB5;&#x7684;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x64CD;&#x4F5C;&#xFF0C;&#x5982;&#x56FE; 15-5 &#x6240;&#x793A;&#x3002;</p>
<p><img src="../images/chapter_15/pic5.png" alt=""></p>
<p>&#x8FD9;&#x503C;&#x5F97;&#x89E3;&#x91CA;&#x4E00;&#x4E0B;&#xFF1A;</p>
<ul>
<li><p>&#x56FE;&#x4E2D;&#x7684;&#x4E2D;&#x592E;&#x5217;&#x662F;&#x5B8C;&#x6574;&#x7684;&#x6808;&#x5F0F;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x3002;&#x8FD9;&#x90E8;&#x5206;&#x53EF;&#x4EE5;&#x5728;&#x8BAD;&#x7EC3;&#x540E;&#x4F7F;&#x7528;&#x3002;</p>
</li>
<li><p>&#x5DE6;&#x5217;&#x662F;&#x8FD0;&#x884C;&#x7B2C;&#x4E00;&#x9636;&#x6BB5;&#x8BAD;&#x7EC3;&#x6240;&#x9700;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x64CD;&#x4F5C;&#x3002;&#x5B83;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7ED5;&#x8FC7;&#x9690;&#x85CF;&#x5C42; 2 &#x548C; 3 &#x7684;&#x8F93;&#x51FA;&#x5C42;&#x3002;&#x8BE5;&#x8F93;&#x51FA;&#x5C42;&#x4E0E;&#x5806;&#x53E0;&#x7684;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x7684;&#x8F93;&#x51FA;&#x5C42;&#x5171;&#x4EAB;&#x76F8;&#x540C;&#x7684;&#x6743;&#x91CD;&#x548C;&#x504F;&#x7F6E;&#x3002;&#x6B64;&#x5916;&#x8FD8;&#x6709;&#x65E8;&#x5728;&#x4F7F;&#x8F93;&#x51FA;&#x5C3D;&#x53EF;&#x80FD;&#x63A5;&#x8FD1;&#x8F93;&#x5165;&#x7684;&#x8BAD;&#x7EC3;&#x64CD;&#x4F5C;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8BE5;&#x9636;&#x6BB5;&#x5C06;&#x8BAD;&#x7EC3;&#x9690;&#x85CF;&#x5C42;1&#x548C;&#x8F93;&#x51FA;&#x5C42;&#xFF08;&#x5373;&#xFF0C;&#x7B2C;&#x4E00;&#x81EA;&#x7F16;&#x7801;&#x5668;&#xFF09;&#x7684;&#x6743;&#x91CD;&#x548C;&#x504F;&#x7F6E;&#x3002;</p>
</li>
<li><p>&#x56FE;&#x4E2D;&#x7684;&#x53F3;&#x5217;&#x662F;&#x8FD0;&#x884C;&#x7B2C;&#x4E8C;&#x9636;&#x6BB5;&#x8BAD;&#x7EC3;&#x6240;&#x9700;&#x7684;&#x4E00;&#x7EC4;&#x64CD;&#x4F5C;&#x3002;&#x5B83;&#x589E;&#x52A0;&#x4E86;&#x8BAD;&#x7EC3;&#x64CD;&#x4F5C;&#xFF0C;&#x76EE;&#x7684;&#x662F;&#x4F7F;&#x9690;&#x85CF;&#x5C42; 3 &#x7684;&#x8F93;&#x51FA;&#x5C3D;&#x53EF;&#x80FD;&#x63A5;&#x8FD1;&#x9690;&#x85CF;&#x5C42; 1 &#x7684;&#x8F93;&#x51FA;&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x5728;&#x8FD0;&#x884C;&#x9636;&#x6BB5; 2 &#x65F6;&#x51BB;&#x7ED3;&#x9690;&#x85CF;&#x5C42; 1&#x3002;&#x6B64;&#x9636;&#x6BB5;&#x5C06;&#x8BAD;&#x7EC3;&#x9690;&#x85CF;&#x5C42; 2 &#x548C; 3 &#x7684;&#x6743;&#x91CD;&#x548C;&#x504F;&#x7F6E;&#xFF08;&#x5373;&#x7B2C;&#x4E8C;&#x81EA;&#x7F16;&#x7801;&#x5668;&#xFF09;&#x3002;</p>
</li>
</ul>
<p>TensorFlow &#x4EE3;&#x7801;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<pre><code class="lang-py">[...] <span class="hljs-comment"># Build the whole stacked autoencoder normally.</span>
<span class="hljs-comment"># In this example, the weights are not tied.</span>
optimizer = tf.train.AdamOptimizer(learning_rate)

<span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&quot;phase1&quot;</span>):
    phase1_outputs = tf.matmul(hidden1, weights4) + biases4
    phase1_reconstruction_loss = tf.reduce_mean(tf.square(phase1_outputs - X))
    phase1_reg_loss = regularizer(weights1) + regularizer(weights4)
    phase1_loss = phase1_reconstruction_loss + phase1_reg_loss
    phase1_training_op = optimizer.minimize(phase1_loss)

<span class="hljs-keyword">with</span> tf.name_scope(<span class="hljs-string">&quot;phase2&quot;</span>):
    phase2_reconstruction_loss = tf.reduce_mean(tf.square(hidden3 - hidden1))
    phase2_reg_loss = regularizer(weights2) + regularizer(weights3)
    phase2_loss = phase2_reconstruction_loss + phase2_reg_loss
    train_vars = [weights2, biases2, weights3, biases3]
    phase2_training_op = optimizer.minimize(phase2_loss, var_list=train_vars)
</code></pre>
<p>&#x7B2C;&#x4E00;&#x9636;&#x6BB5;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#xFF1A;&#x6211;&#x4EEC;&#x53EA;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x8DF3;&#x8FC7;&#x9690;&#x85CF;&#x5C42; 2 &#x548C; 3 &#x7684;&#x8F93;&#x51FA;&#x5C42;&#xFF0C;&#x7136;&#x540E;&#x6784;&#x5EFA;&#x8BAD;&#x7EC3;&#x64CD;&#x4F5C;&#x4EE5;&#x6700;&#x5C0F;&#x5316;&#x8F93;&#x51FA;&#x548C;&#x8F93;&#x5165;&#x4E4B;&#x95F4;&#x7684;&#x8DDD;&#x79BB;&#xFF08;&#x52A0;&#x4E0A;&#x4E00;&#x4E9B;&#x6B63;&#x5219;&#x5316;&#xFF09;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x9636;&#x6BB5;&#x53EA;&#x662F;&#x589E;&#x52A0;&#x4E86;&#x5C06;&#x9690;&#x85CF;&#x5C42; 3 &#x548C;&#x9690;&#x85CF;&#x5C42; 1 &#x7684;&#x8F93;&#x51FA;&#x4E4B;&#x95F4;&#x7684;&#x8DDD;&#x79BB;&#x6700;&#x5C0F;&#x5316;&#x7684;&#x64CD;&#x4F5C;&#xFF08;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x6B63;&#x5219;&#x5316;&#xFF09;&#x3002; &#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x5411;<code>minim()</code>&#x65B9;&#x6CD5;&#x63D0;&#x4F9B;&#x53EF;&#x8BAD;&#x7EC3;&#x53D8;&#x91CF;&#x7684;&#x5217;&#x8868;&#xFF0C;&#x786E;&#x4FDD;&#x7701;&#x7565;&#x6743;&#x91CD; 1 &#x548C;&#x504F;&#x5DEE; 1&#xFF1B;&#x8FD9;&#x6709;&#x6548;&#x5730;&#x51BB;&#x7ED3;&#x4E86;&#x9636;&#x6BB5; 2 &#x671F;&#x95F4;&#x7684;&#x9690;&#x85CF;&#x5C42; 1&#x3002;</p>
<p>&#x5728;&#x6267;&#x884C;&#x9636;&#x6BB5;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x4E3A;&#x9636;&#x6BB5; 1 &#x4E00;&#x4E9B;&#x8FED;&#x4EE3;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#x64CD;&#x4F5C;&#xFF0C;&#x7136;&#x540E;&#x9636;&#x6BB5; 2 &#x8BAD;&#x7EC3;&#x8FD0;&#x884C;&#x66F4;&#x591A;&#x7684;&#x8FED;&#x4EE3;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x9690;&#x85CF;&#x5C42; 1 &#x5728;&#x9636;&#x6BB5; 2 &#x671F;&#x95F4;&#x88AB;&#x51BB;&#x7ED3;&#xFF0C;&#x6240;&#x4EE5;&#x5BF9;&#x4E8E;&#x4EFB;&#x4F55;&#x7ED9;&#x5B9A;&#x7684;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#x5176;&#x8F93;&#x51FA;&#x5C06;&#x603B;&#x662F;&#x76F8;&#x540C;&#x7684;&#x3002; &#x4E3A;&#x4E86;&#x907F;&#x514D;&#x5728;&#x6BCF;&#x4E2A;&#x65F6;&#x671F;&#x91CD;&#x65B0;&#x8BA1;&#x7B97;&#x9690;&#x85CF;&#x5C42;1&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5728;&#x9636;&#x6BB5; 1 &#x7ED3;&#x675F;&#x65F6;&#x4E3A;&#x6574;&#x4E2A;&#x8BAD;&#x7EC3;&#x96C6;&#x8BA1;&#x7B97;&#x5B83;&#xFF0C;&#x7136;&#x540E;&#x76F4;&#x63A5;&#x5728;&#x9636;&#x6BB5; 2 &#x4E2D;&#x8F93;&#x5165;&#x9690;&#x85CF;&#x5C42; 1 &#x7684;&#x7F13;&#x5B58;&#x8F93;&#x51FA;&#x3002;&#x8FD9;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x6027;&#x80FD;&#x4E0A;&#x7684;&#x63D0;&#x5347;&#x3002;</p>
<h2 id="&#x53EF;&#x89C6;&#x5316;&#x91CD;&#x5EFA;">&#x53EF;&#x89C6;&#x5316;&#x91CD;&#x5EFA;</h2>
<p>&#x786E;&#x4FDD;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x5F97;&#x5230;&#x9002;&#x5F53;&#x8BAD;&#x7EC3;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x6BD4;&#x8F83;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x3002; &#x5B83;&#x4EEC;&#x5FC5;&#x987B;&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#xFF0C;&#x5DEE;&#x5F02;&#x5E94;&#x8BE5;&#x662F;&#x4E0D;&#x91CD;&#x8981;&#x7684;&#x7EC6;&#x8282;&#x3002; &#x6211;&#x4EEC;&#x6765;&#x7ED8;&#x5236;&#x4E24;&#x4E2A;&#x968F;&#x673A;&#x6570;&#x5B57;&#x53CA;&#x5176;&#x91CD;&#x5EFA;&#xFF1A;</p>
<pre><code class="lang-py">n_test_digits = <span class="hljs-number">2</span>
X_test = mnist.test.images[:n_test_digits]

<span class="hljs-keyword">with</span> tf.Session() <span class="hljs-keyword">as</span> sess:
    [...] <span class="hljs-comment"># Train the Autoencoder</span>
    outputs_val = outputs.eval(feed_dict={X: X_test})

<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">plot_image</span><span class="hljs-params">(image, shape=[<span class="hljs-number">28</span>, <span class="hljs-number">28</span>])</span>:</span>
    plt.imshow(image.reshape(shape), cmap=<span class="hljs-string">&quot;Greys&quot;</span>, interpolation=<span class="hljs-string">&quot;nearest&quot;</span>)
    plt.axis(<span class="hljs-string">&quot;off&quot;</span>)

<span class="hljs-keyword">for</span> digit_index <span class="hljs-keyword">in</span> range(n_test_digits):
    plt.subplot(n_test_digits, <span class="hljs-number">2</span>, digit_index * <span class="hljs-number">2</span> + <span class="hljs-number">1</span>)
    plot_image(X_test[digit_index])
    plt.subplot(n_test_digits, <span class="hljs-number">2</span>, digit_index * <span class="hljs-number">2</span> + <span class="hljs-number">2</span>)
    plot_image(outputs_val[digit_index])
</code></pre>
<p><img src="../images/chapter_15/pic6.png" alt=""></p>
<p>&#x770B;&#x8D77;&#x6765;&#x591F;&#x63A5;&#x8FD1;&#x3002; &#x6240;&#x4EE5;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x5DF2;&#x7ECF;&#x9002;&#x5F53;&#x5730;&#x5B66;&#x4F1A;&#x4E86;&#x91CD;&#x73B0;&#x5B83;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x5B66;&#x5230;&#x4E86;&#x6709;&#x7528;&#x7684;&#x7279;&#x6027;&#xFF1F; &#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;&#x3002;</p>
<h2 id="&#x53EF;&#x89C6;&#x5316;&#x529F;&#x80FD;">&#x53EF;&#x89C6;&#x5316;&#x529F;&#x80FD;</h2>
<p>&#x4E00;&#x65E6;&#x4F60;&#x7684;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x5B66;&#x4E60;&#x4E86;&#x4E00;&#x4E9B;&#x529F;&#x80FD;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x60F3;&#x770B;&#x770B;&#x5B83;&#x4EEC;&#x3002; &#x6709;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x6280;&#x672F;&#x3002; &#x53EF;&#x4EE5;&#x8BF4;&#x6700;&#x7B80;&#x5355;&#x7684;&#x6280;&#x672F;&#x662F;&#x5728;&#x6BCF;&#x4E2A;&#x9690;&#x85CF;&#x5C42;&#x4E2D;&#x8003;&#x8651;&#x6BCF;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#xFF0C;&#x5E76;&#x627E;&#x5230;&#x6700;&#x80FD;&#x6FC0;&#x6D3B;&#x5B83;&#x7684;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#x3002; &#x8FD9;&#x5BF9;&#x9876;&#x5C42;&#x9690;&#x85CF;&#x5C42;&#x7279;&#x522B;&#x6709;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x901A;&#x5E38;&#x4F1A;&#x6355;&#x83B7;&#x76F8;&#x5BF9;&#x8F83;&#x5927;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5728;&#x5305;&#x542B;&#x5B83;&#x4EEC;&#x7684;&#x4E00;&#x7EC4;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#x4E2D;&#x8F7B;&#x677E;&#x627E;&#x5230;&#x8FD9;&#x4E9B;&#x529F;&#x80FD;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x795E;&#x7ECF;&#x5143;&#x5728;&#x56FE;&#x7247;&#x4E2D;&#x770B;&#x5230;&#x4E00;&#x53EA;&#x732B;&#x65F6;&#x5F3A;&#x70C8;&#x6FC0;&#x6D3B;&#xFF0C;&#x90A3;&#x4E48;&#x6FC0;&#x6D3B;&#x5B83;&#x7684;&#x56FE;&#x7247;&#x6700;&#x663E;&#x773C;&#x7684;&#x5730;&#x65B9;&#x90FD;&#x4F1A;&#x5305;&#x542B;&#x732B;&#x3002; &#x7136;&#x800C;&#xFF0C;&#x5BF9;&#x4E8E;&#x8F83;&#x4F4E;&#x5C42;&#xFF0C;&#x8FD9;&#x79CD;&#x6280;&#x672F;&#x5E76;&#x4E0D;&#x80FD;&#x5F88;&#x597D;&#x5730;&#x5DE5;&#x4F5C;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x7279;&#x5F81;&#x66F4;&#x5C0F;&#xFF0C;&#x66F4;&#x62BD;&#x8C61;&#xFF0C;&#x56E0;&#x6B64;&#x5F88;&#x96BE;&#x51C6;&#x786E;&#x7406;&#x89E3;&#x795E;&#x7ECF;&#x5143;&#x6B63;&#x5728;&#x4E3A;&#x4EC0;&#x4E48;&#x800C;&#x5174;&#x594B;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x53E6;&#x4E00;&#x79CD;&#x6280;&#x672F;&#x3002; &#x5BF9;&#x4E8E;&#x7B2C;&#x4E00;&#x4E2A;&#x9690;&#x85CF;&#x5C42;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x56FE;&#x50CF;&#xFF0C;&#x5176;&#x4E2D;&#x50CF;&#x7D20;&#x7684;&#x5F3A;&#x5EA6;&#x5BF9;&#x5E94;&#x4E8E;&#x7ED9;&#x5B9A;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x8FDE;&#x63A5;&#x6743;&#x91CD;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x4EE5;&#x4E0B;&#x4EE3;&#x7801;&#x7ED8;&#x5236;&#x4E86;&#x7B2C;&#x4E00;&#x4E2A;&#x9690;&#x85CF;&#x5C42;&#x4E2D;&#x4E94;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x5B66;&#x4E60;&#x7684;&#x7279;&#x5F81;&#xFF1A;</p>
<pre><code class="lang-py"><span class="hljs-keyword">with</span> tf.Session() <span class="hljs-keyword">as</span> sess:
    [...] <span class="hljs-comment"># train autoencoder</span>
    weights1_val = weights1.eval()

<span class="hljs-keyword">for</span> i <span class="hljs-keyword">in</span> range(<span class="hljs-number">5</span>):
    plt.subplot(<span class="hljs-number">1</span>, <span class="hljs-number">5</span>, i + <span class="hljs-number">1</span>)
    plot_image(weights1_val.T[i])
</code></pre>
<p>&#x60A8;&#x53EF;&#x80FD;&#x4F1A;&#x5F97;&#x5230;&#x5982;&#x56FE; 15-7 &#x6240;&#x793A;&#x7684;&#x4F4E;&#x7EA7;&#x529F;&#x80FD;&#x3002;</p>
<p><img src="../images/chapter_15/pic7.png" alt=""></p>
<p>&#x524D;&#x56DB;&#x4E2A;&#x7279;&#x5F81;&#x4F3C;&#x4E4E;&#x5BF9;&#x5E94;&#x4E8E;&#x5C0F;&#x5757;&#xFF0C;&#x800C;&#x7B2C;&#x4E94;&#x4E2A;&#x7279;&#x5F81;&#x4F3C;&#x4E4E;&#x5BFB;&#x627E;&#x5782;&#x76F4;&#x7B14;&#x5212;&#xFF08;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x8FD9;&#x4E9B;&#x7279;&#x5F81;&#x6765;&#x81EA;&#x5806;&#x53E0;&#x53BB;&#x566A;&#x81EA;&#x7F16;&#x7801;&#x5668;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x540E;&#x9762;&#x8BA8;&#x8BBA;&#xFF09;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x79CD;&#x6280;&#x672F;&#x662F;&#x7ED9;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x8F93;&#x5165;&#x56FE;&#x50CF;&#xFF0C;&#x6D4B;&#x91CF;&#x60A8;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x6FC0;&#x6D3B;&#xFF0C;&#x7136;&#x540E;&#x6267;&#x884C;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x6765;&#x8C03;&#x6574;&#x56FE;&#x50CF;&#xFF0C;&#x4F7F;&#x795E;&#x7ECF;&#x5143;&#x6FC0;&#x6D3B;&#x5F97;&#x66F4;&#x591A;&#x3002; &#x5982;&#x679C;&#x8FED;&#x4EE3;&#x6570;&#x6B21;&#xFF08;&#x6267;&#x884C;&#x6E10;&#x53D8;&#x4E0A;&#x5347;&#xFF09;&#xFF0C;&#x56FE;&#x50CF;&#x5C06;&#x9010;&#x6E10;&#x53D8;&#x6210;&#x6700;&#x4EE4;&#x4EBA;&#x5174;&#x594B;&#x7684;&#x56FE;&#x50CF;&#xFF08;&#x7528;&#x4E8E;&#x795E;&#x7ECF;&#x5143;&#xFF09;&#x3002; &#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x6709;&#x7528;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x7528;&#x4E8E;&#x53EF;&#x89C6;&#x5316;&#x795E;&#x7ECF;&#x5143;&#x6B63;&#x5728;&#x5BFB;&#x627E;&#x7684;&#x8F93;&#x5165;&#x7C7B;&#x578B;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x6267;&#x884C;&#x65E0;&#x76D1;&#x7763;&#x9884;&#x8BAD;&#x7EC3;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5BF9;&#x4E8E;&#x5206;&#x7C7B;&#x4EFB;&#x52A1;&#xFF09;&#xFF0C;&#x9A8C;&#x8BC1;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x7279;&#x5F81;&#x662F;&#x5426;&#x6709;&#x7528;&#x7684;&#x4E00;&#x79CD;&#x7B80;&#x5355;&#x65B9;&#x6CD5;&#x662F;&#x6D4B;&#x91CF;&#x5206;&#x7C7B;&#x5668;&#x7684;&#x6027;&#x80FD;&#x3002;</p>
<h2 id="&#x65E0;&#x76D1;&#x7763;&#x9884;&#x8BAD;&#x7EC3;&#x4F7F;&#x7528;&#x6808;&#x5F0F;&#x81EA;&#x7F16;&#x7801;&#x5668;">&#x65E0;&#x76D1;&#x7763;&#x9884;&#x8BAD;&#x7EC3;&#x4F7F;&#x7528;&#x6808;&#x5F0F;&#x81EA;&#x7F16;&#x7801;&#x5668;</h2>
<p>&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x5728;&#x7B2C; 11 &#x7AE0;&#x4E2D;&#x8BA8;&#x8BBA;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x6B63;&#x5728;&#x5904;&#x7406;&#x590D;&#x6742;&#x7684;&#x76D1;&#x7763;&#x4EFB;&#x52A1;&#xFF0C;&#x4F46;&#x60A8;&#x6CA1;&#x6709;&#x5927;&#x91CF;&#x6807;&#x8BB0;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#xFF0C;&#x5219;&#x4E00;&#x79CD;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x627E;&#x5230;&#x6267;&#x884C;&#x7C7B;&#x4F3C;&#x4EFB;&#x52A1;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x7136;&#x540E;&#x91CD;&#x65B0;&#x4F7F;&#x7528;&#x5176;&#x8F83;&#x4F4E;&#x5C42;&#x3002; &#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x4EC5;&#x4F7F;&#x7528;&#x5F88;&#x5C11;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x6765;&#x8BAD;&#x7EC3;&#x9AD8;&#x6027;&#x80FD;&#x6A21;&#x578B;&#xFF0C;&#x56E0;&#x4E3A;&#x60A8;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E0D;&#x5FC5;&#x5B66;&#x4E60;&#x6240;&#x6709;&#x7684;&#x4F4E;&#x7EA7;&#x7279;&#x5F81;&#xFF1B;&#x5B83;&#x5C06;&#x91CD;&#x65B0;&#x4F7F;&#x7528;&#x73B0;&#x6709;&#x7F51;&#x7EDC;&#x5B66;&#x4E60;&#x7684;&#x7279;&#x5F81;&#x68C0;&#x6D4B;&#x5668;&#x3002;</p>
<p>&#x540C;&#x6837;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x6709;&#x4E00;&#x4E2A;&#x5927;&#x578B;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x4F46;&#x5927;&#x591A;&#x6570;&#x6570;&#x636E;&#x96C6;&#x672A;&#x6807;&#x8BB0;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5148;&#x4F7F;&#x7528;&#x6240;&#x6709;&#x6570;&#x636E;&#x8BAD;&#x7EC3;&#x6808;&#x5F0F;&#x81EA;&#x7F16;&#x7801;&#x5668;&#xFF0C;&#x7136;&#x540E;&#x91CD;&#x65B0;&#x4F7F;&#x7528;&#x8F83;&#x4F4E;&#x5C42;&#x4E3A;&#x5B9E;&#x9645;&#x4EFB;&#x52A1;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x6807;&#x8BB0;&#x6570;&#x636E;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x56FE; 15-8 &#x663E;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x6808;&#x5F0F;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x4E3A;&#x5206;&#x7C7B;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6267;&#x884C;&#x65E0;&#x76D1;&#x7763;&#x9884;&#x8BAD;&#x7EC3;&#x3002; &#x6B63;&#x5982;&#x524D;&#x9762;&#x8BA8;&#x8BBA;&#x8FC7;&#x7684;&#xFF0C;&#x6808;&#x5F0F;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x672C;&#x8EAB;&#x901A;&#x5E38;&#x6BCF;&#x6B21;&#x90FD;&#x4F1A;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x3002; &#x5728;&#x8BAD;&#x7EC3;&#x5206;&#x7C7B;&#x5668;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x786E;&#x5B9E;&#x6CA1;&#x6709;&#x592A;&#x591A;&#x6807;&#x8BB0;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x51BB;&#x7ED3;&#x9884;&#x8BAD;&#x7EC3;&#x5C42;&#xFF08;&#x81F3;&#x5C11;&#x662F;&#x8F83;&#x4F4E;&#x5C42;&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_15/pic8.png" alt=""></p>
<p>&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x5B9E;&#x9645;&#x4E0A;&#x5F88;&#x5E38;&#x89C1;&#xFF0C;&#x56E0;&#x4E3A;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x5927;&#x578B;&#x7684;&#x65E0;&#x6807;&#x7B7E;&#x6570;&#x636E;&#x96C6;&#x901A;&#x5E38;&#x5F88;&#x4FBF;&#x5B9C;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x811A;&#x672C;&#x53EF;&#x4EE5;&#x4ECE;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x4E0B;&#x8F7D;&#x6570;&#x767E;&#x4E07;&#x5F20;&#x56FE;&#x50CF;&#xFF09;&#xFF0C;&#x4F46;&#x53EA;&#x80FD;&#x7531;&#x4EBA;&#x7C7B;&#x53EF;&#x9760;&#x5730;&#x6807;&#x8BB0;&#x5B83;&#x4EEC;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5C06;&#x56FE;&#x50CF;&#x5206;&#x7C7B;&#x4E3A;&#x53EF;&#x7231;&#x6216;&#x4E0D;&#x53EF;&#x7231;&#xFF09;&#x3002; &#x6807;&#x8BB0;&#x5B9E;&#x4F8B;&#x662F;&#x8017;&#x65F6;&#x4E14;&#x6602;&#x8D35;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x53EA;&#x6709;&#x51E0;&#x5343;&#x4E2A;&#x6807;&#x8BB0;&#x5B9E;&#x4F8B;&#x662F;&#x5F88;&#x5E38;&#x89C1;&#x7684;&#x3002;</p>
<p>&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x524D;&#x9762;&#x6240;&#x8BA8;&#x8BBA;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x5F53;&#x524D;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x6D77;&#x5578;&#x7684;&#x89E6;&#x53D1;&#x56E0;&#x7D20;&#x4E4B;&#x4E00;&#x662F; Geoffrey Hinton &#x7B49;&#x4EBA;&#x5728; 2006 &#x5E74;&#x7684;&#x53D1;&#x73B0;&#xFF0C;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x53EF;&#x4EE5;&#x4EE5;&#x65E0;&#x76D1;&#x7763;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x9884;&#x8BAD;&#x7EC3;&#x3002; &#x4ED6;&#x4EEC;&#x4F7F;&#x7528;&#x53D7;&#x9650;&#x73BB;&#x5C14;&#x5179;&#x66FC;&#x673A;&#x5668;&#xFF08;&#x89C1;&#x9644;&#x5F55; E&#xFF09;&#xFF0C;&#x4F46;&#x5728; 2007 &#x5E74; Yoshua Bengio &#x7B49;&#x4EBA;&#x8868;&#x660E;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x4E5F;&#x8D77;&#x4F5C;&#x7528;&#x3002;</p>
<p>TensorFlow &#x7684;&#x5B9E;&#x73B0;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x7279;&#x522B;&#x4E4B;&#x5904;&#xFF1A;&#x53EA;&#x9700;&#x4F7F;&#x7528;&#x6240;&#x6709;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x8BAD;&#x7EC3;&#x81EA;&#x7F16;&#x7801;&#x5668;&#xFF0C;&#x7136;&#x540E;&#x91CD;&#x7528;&#x5176;&#x7F16;&#x7801;&#x5668;&#x5C42;&#x4EE5;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF08;&#x6709;&#x5173;&#x5982;&#x4F55;&#x91CD;&#x7528;&#x9884;&#x8BAD;&#x7EC3;&#x5C42;&#x7684;&#x66F4;&#x591A;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x9605;&#x7B2C; 11 &#x7AE0;&#x6216;&#x67E5;&#x770B; Jupyte notebooks &#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x793A;&#x4F8B;&#xFF09;&#x3002;</p>
<p>&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x4E3A;&#x4E86;&#x5F3A;&#x5236;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x5B66;&#x4E60;&#x6709;&#x8DA3;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x6211;&#x4EEC;&#x9650;&#x5236;&#x4E86;&#x7F16;&#x7801;&#x5C42;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x4F7F;&#x5176;&#x4E0D;&#x591F;&#x5B8C;&#x5584;&#x3002; &#x5B9E;&#x9645;&#x4E0A;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8BB8;&#x591A;&#x5176;&#x4ED6;&#x7C7B;&#x578B;&#x7684;&#x7EA6;&#x675F;&#xFF0C;&#x5305;&#x62EC;&#x5141;&#x8BB8;&#x7F16;&#x7801;&#x5C42;&#x4E0E;&#x8F93;&#x5165;&#x4E00;&#x6837;&#x5927;&#x6216;&#x751A;&#x81F3;&#x66F4;&#x5927;&#x7684;&#x7EA6;&#x675F;&#xFF0C;&#x5BFC;&#x81F4;&#x8FC7;&#x5EA6;&#x5B8C;&#x6210;&#x7684;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x3002; &#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x65B9;&#x6CD5;&#x3002;</p>
<h2 id="&#x964D;&#x566A;&#x81EA;&#x7F16;&#x7801;&#xFF08;dae&#xFF09;">&#x964D;&#x566A;&#x81EA;&#x7F16;&#x7801;&#xFF08;DAE&#xFF09;</h2>
<p>&#x53E6;&#x4E00;&#x79CD;&#x5F3A;&#x5236;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x5B66;&#x4E60;&#x6709;&#x7528;&#x529F;&#x80FD;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x4E3A;&#x5176;&#x8F93;&#x5165;&#x6DFB;&#x52A0;&#x566A;&#x58F0;&#xFF0C;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#x4EE5;&#x6062;&#x590D;&#x539F;&#x59CB;&#x7684;&#x65E0;&#x566A;&#x58F0;&#x8F93;&#x5165;&#x3002; &#x8FD9;&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x5C06;&#x5176;&#x8F93;&#x5165;&#x590D;&#x5236;&#x5230;&#x5176;&#x8F93;&#x51FA;&#xFF0C;&#x56E0;&#x6B64;&#x6700;&#x7EC8;&#x4E0D;&#x5F97;&#x4E0D;&#x5728;&#x6570;&#x636E;&#x4E2D;&#x67E5;&#x627E;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x81EA; 20 &#x4E16;&#x7EAA; 80 &#x5E74;&#x4EE3;&#x4EE5;&#x6765;&#xFF0C;&#x4F7F;&#x7528;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x6D88;&#x9664;&#x566A;&#x97F3;&#x7684;&#x60F3;&#x6CD5;&#x5DF2;&#x7ECF;&#x51FA;&#x73B0;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5728; Yann LeCun &#x7684; 1987 &#x5E74;&#x7855;&#x58EB;&#x8BBA;&#x6587;&#x4E2D;&#x63D0;&#x5230;&#x8FC7;&#xFF09;&#x3002; &#x5728; 2008 &#x5E74;&#x7684;&#x4E00;&#x7BC7;&#x8BBA;&#x6587;&#x4E2D;&#xFF0C;&#x5E15;&#x65AF;&#x5361;&#x5C14;&#x6587;&#x68EE;&#x7279;&#x7B49;&#x4EBA;&#x3002; &#x8868;&#x660E;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x4E5F;&#x53EF;&#x7528;&#x4E8E;&#x7279;&#x5F81;&#x63D0;&#x53D6;&#x3002; &#x5728; 2010 &#x5E74;&#x7684;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x4E2D; Vincent &#x7B49;&#x4EBA;&#x5F15;&#x5165;&#x5806;&#x53E0;&#x964D;&#x566A;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x3002;</p>
<p>&#x566A;&#x58F0;&#x53EF;&#x4EE5;&#x662F;&#x7EAF;&#x7CB9;&#x7684;&#x9AD8;&#x65AF;&#x566A;&#x58F0;&#x6DFB;&#x52A0;&#x5230;&#x8F93;&#x5165;&#xFF0C;&#x6216;&#x8005;&#x5B83;&#x53EF;&#x4EE5;&#x968F;&#x673A;&#x5173;&#x95ED;&#x8F93;&#x5165;&#xFF0C;&#x5C31;&#x50CF; drop out&#xFF08;&#x5728;&#x7B2C; 11 &#x7AE0;&#x4ECB;&#x7ECD;&#xFF09;&#x3002; &#x56FE; 15-9 &#x663E;&#x793A;&#x4E86;&#x8FD9;&#x4E24;&#x4E2A;&#x9009;&#x9879;&#x3002;</p>
<p><img src="../images/chapter_15/pic9.png" alt=""></p>
<h2 id="tensorflow-&#x5B9E;&#x73B0;">TensorFlow &#x5B9E;&#x73B0;</h2>
<p>&#x5728; TensorFlow &#x4E2D;&#x5B9E;&#x73B0;&#x53BB;&#x566A;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x5E76;&#x4E0D;&#x96BE;&#x3002; &#x6211;&#x4EEC;&#x4ECE;&#x9AD8;&#x65AF;&#x566A;&#x58F0;&#x5F00;&#x59CB;&#x3002; &#x8FD9;&#x5B9E;&#x9645;&#x4E0A;&#x5C31;&#x50CF;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x5E38;&#x89C4;&#x7684;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x4E00;&#x6837;&#xFF0C;&#x9664;&#x4E86;&#x7ED9;&#x8F93;&#x5165;&#x6DFB;&#x52A0;&#x566A;&#x58F0;&#x5916;&#xFF0C;&#x91CD;&#x5EFA;&#x635F;&#x8017;&#x662F;&#x6839;&#x636E;&#x539F;&#x59CB;&#x8F93;&#x5165;&#x8BA1;&#x7B97;&#x7684;&#xFF1A;</p>
<pre><code class="lang-py">X = tf.placeholder(tf.float32, shape=[<span class="hljs-keyword">None</span>, n_inputs])
X_noisy = X + tf.random_normal(tf.shape(X))
[...]
hidden1 = activation(tf.matmul(X_noisy, weights1) + biases1)
[...]
reconstruction_loss = tf.reduce_mean(tf.square(outputs - X)) <span class="hljs-comment"># MSE</span>
[...]
</code></pre>
<p>&#x7531;&#x4E8E;<code>X</code>&#x7684;&#x5F62;&#x72B6;&#x53EA;&#x662F;&#x5728;&#x6784;&#x9020;&#x9636;&#x6BB5;&#x90E8;&#x5206;&#x5B9A;&#x4E49;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x9884;&#x5148;&#x77E5;&#x9053;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x6DFB;&#x52A0;&#x5230;<code>X</code>&#x4E2D;&#x7684;&#x566A;&#x58F0;&#x7684;&#x5F62;&#x72B6;&#x3002;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x8C03;&#x7528;<code>X.get_shape()</code>&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x53EA;&#x4F1A;&#x8FD4;&#x56DE;&#x90E8;&#x5206;&#x5B9A;&#x4E49;&#x7684;<code>X</code>&#x7684;&#x5F62;&#x72B6; &#xFF08;<code>[None&#xFF0C;n_inputs]</code>&#xFF09;&#x548C;<code>random_normal()</code>&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x5B8C;&#x5168;&#x5B9A;&#x4E49;&#x7684;&#x5F62;&#x72B6;&#xFF0C;&#x56E0;&#x6B64;&#x4F1A;&#x5F15;&#x53D1;&#x5F02;&#x5E38;&#x3002; &#x76F8;&#x53CD;&#xFF0C;&#x6211;&#x4EEC;&#x8C03;&#x7528;<code>tf.shape(X)</code>&#xFF0C;&#x5B83;&#x5C06;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#xFF0C;&#x8BE5;&#x64CD;&#x4F5C;&#x5C06;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x8FD4;&#x56DE;<code>X</code>&#x7684;&#x5F62;&#x72B6;&#xFF0C;&#x8BE5;&#x64CD;&#x4F5C;&#x5C06;&#x5728;&#x6B64;&#x65F6;&#x5B8C;&#x5168;&#x5B9A;&#x4E49;&#x3002;</p>
<p>&#x5B9E;&#x65BD;&#x66F4;&#x666E;&#x904D;&#x7684; dropout &#x7248;&#x672C;,&#x800C;&#x4E14;&#x8FD9;&#x4E2A;&#x7248;&#x672C;&#x5E76;&#x4E0D;&#x56F0;&#x96BE;&#xFF1A;</p>
<pre><code class="lang-py"><span class="hljs-keyword">from</span> tensorflow.contrib.layers <span class="hljs-keyword">import</span> dropout

keep_prob = <span class="hljs-number">0.7</span>

is_training = tf.placeholder_with_default(<span class="hljs-keyword">False</span>, shape=(), name=<span class="hljs-string">&apos;is_training&apos;</span>)
X = tf.placeholder(tf.float32, shape=[<span class="hljs-keyword">None</span>, n_inputs])
X_drop = dropout(X, keep_prob, is_training=is_training)
[...]
hidden1 = activation(tf.matmul(X_drop, weights1) + biases1)
[...]
reconstruction_loss = tf.reduce_mean(tf.square(outputs - X)) <span class="hljs-comment"># MSE</span>
[...]
</code></pre>
<p>&#x5728;&#x8BAD;&#x7EC3;&#x671F;&#x95F4;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x4F7F;&#x7528;<code>feed_dict</code>&#x5C06;<code>is_training</code>&#x8BBE;&#x7F6E;&#x4E3A;<code>True</code>&#xFF08;&#x5982;&#x7B2C; 11 &#x7AE0;&#x6240;&#x8FF0;&#xFF09;&#xFF1A;</p>
<pre><code class="lang-py">sess.run(training_op, feed_dict={X: X_batch, is_training: <span class="hljs-keyword">True</span>})
</code></pre>
<p>&#x4F46;&#x662F;&#xFF0C;&#x5728;&#x6D4B;&#x8BD5;&#x671F;&#x95F4;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x5C06;<code>is_training</code>&#x8BBE;&#x7F6E;&#x4E3A;<code>False</code>&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5C06;&#x5176;&#x8BBE;&#x7F6E;&#x4E3A;&#x5BF9;<code>placeholder_with_default()</code>&#x51FD;&#x6570;&#x8C03;&#x7528;&#x7684;&#x9ED8;&#x8BA4;&#x503C;&#x3002;</p>
<h2 id="&#x7A00;&#x758F;&#x81EA;&#x7F16;&#x7801;&#x5668;">&#x7A00;&#x758F;&#x81EA;&#x7F16;&#x7801;&#x5668;</h2>
<p>&#x901A;&#x5E38;&#x826F;&#x597D;&#x7279;&#x5F81;&#x63D0;&#x53D6;&#x7684;&#x53E6;&#x4E00;&#x79CD;&#x7EA6;&#x675F;&#x662F;&#x7A00;&#x758F;&#x6027;&#xFF1A;&#x901A;&#x8FC7;&#x5411;&#x635F;&#x5931;&#x51FD;&#x6570;&#x6DFB;&#x52A0;&#x9002;&#x5F53;&#x7684;&#x9879;&#xFF0C;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x88AB;&#x63A8;&#x52A8;&#x4EE5;&#x51CF;&#x5C11;&#x7F16;&#x7801;&#x5C42;&#x4E2D;&#x6D3B;&#x52A8;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x6570;&#x91CF;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x88AB;&#x63A8;&#x5230;&#x7F16;&#x7801;&#x5C42;&#x4E2D;&#x5E73;&#x5747;&#x53EA;&#x6709; 5% &#x7684;&#x663E;&#x7740;&#x6D3B;&#x8DC3;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x3002; &#x8FD9;&#x8FEB;&#x4F7F;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x5C06;&#x6BCF;&#x4E2A;&#x8F93;&#x5165;&#x8868;&#x793A;&#x4E3A;&#x5C11;&#x91CF;&#x6FC0;&#x6D3B;&#x7684;&#x7EC4;&#x5408;&#x3002; &#x56E0;&#x6B64;&#xFF0C;&#x7F16;&#x7801;&#x5C42;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x901A;&#x5E38;&#x90FD;&#x4F1A;&#x4EE3;&#x8868;&#x4E00;&#x4E2A;&#x6709;&#x7528;&#x7684;&#x7279;&#x5F81;&#xFF08;&#x5982;&#x679C;&#x60A8;&#x6BCF;&#x4E2A;&#x6708;&#x53EA;&#x80FD;&#x8BF4;&#x51E0;&#x4E2A;&#x5B57;&#xFF0C;&#x60A8;&#x53EF;&#x80FD;&#x4F1A;&#x8BD5;&#x7740;&#x8BA9;&#x5B83;&#x4EEC;&#x503C;&#x5F97;&#x4E00;&#x542C;&#xFF09;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x652F;&#x6301;&#x7A00;&#x758F;&#x6A21;&#x578B;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x9996;&#x5148;&#x5728;&#x6BCF;&#x6B21;&#x8BAD;&#x7EC3;&#x8FED;&#x4EE3;&#x4E2D;&#x6D4B;&#x91CF;&#x7F16;&#x7801;&#x5C42;&#x7684;&#x5B9E;&#x9645;&#x7A00;&#x758F;&#x5EA6;&#x3002; &#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x8BA1;&#x7B97;&#x6574;&#x4E2A;&#x8BAD;&#x7EC3;&#x6279;&#x6B21;&#x4E2D;&#x7F16;&#x7801;&#x5C42;&#x4E2D;&#x6BCF;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x5E73;&#x5747;&#x6FC0;&#x6D3B;&#x6765;&#x5B9E;&#x73B0;&#x3002; &#x6279;&#x91CF;&#x5927;&#x5C0F;&#x4E0D;&#x80FD;&#x592A;&#x5C0F;&#xFF0C;&#x5426;&#x5219;&#x5E73;&#x5747;&#x6570;&#x4E0D;&#x51C6;&#x786E;&#x3002;</p>
<p>&#x4E00;&#x65E6;&#x6211;&#x4EEC;&#x5BF9;&#x6BCF;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x8FDB;&#x884C;&#x5E73;&#x5747;&#x6FC0;&#x6D3B;&#xFF0C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x901A;&#x8FC7;&#x5411;&#x635F;&#x5931;&#x51FD;&#x6570;&#x6DFB;&#x52A0;&#x7A00;&#x758F;&#x635F;&#x5931;&#x6765;&#x60E9;&#x7F5A;&#x592A;&#x6D3B;&#x8DC3;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x6D4B;&#x91CF;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x5E73;&#x5747;&#x6FC0;&#x6D3B;&#x503C;&#x4E3A; 0.3&#xFF0C;&#x4F46;&#x76EE;&#x6807;&#x7A00;&#x758F;&#x5EA6;&#x4E3A; 0.1&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5FC5;&#x987B;&#x53D7;&#x5230;&#x60E9;&#x7F5A;&#x624D;&#x80FD;&#x6FC0;&#x6D3B;&#x66F4;&#x5C11;&#x3002; &#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x5730;&#x5C06;&#x5E73;&#x65B9;&#x8BEF;&#x5DEE;<code>(0.3-0.1)^2</code>&#x6DFB;&#x52A0;&#x5230;&#x635F;&#x5931;&#x51FD;&#x6570;&#x4E2D;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#x66F4;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x4F7F;&#x7528; Kullback-Leibler &#x6563;&#x5EA6;&#xFF08;&#x5728;&#x7B2C; 4 &#x7AE0;&#x4E2D;&#x7B80;&#x8981;&#x8BA8;&#x8BBA;&#xFF09;&#xFF0C;&#x5176;&#x5177;&#x6709;&#x6BD4;&#x5747;&#x65B9;&#x8BEF;&#x5DEE;&#x66F4;&#x5F3A;&#x7684;&#x68AF;&#x5EA6;&#xFF0C;&#x5982;&#x56FE; 15-10 &#x6240;&#x793A;&#x3002;</p>
<p><img src="../images/chapter_15/pic10.png" alt=""></p>
<p>&#x7ED9;&#x5B9A;&#x4E24;&#x4E2A;&#x79BB;&#x6563;&#x7684;&#x6982;&#x7387;&#x5206;&#x5E03;<code>P</code>&#x548C;<code>Q</code>&#xFF0C;&#x8FD9;&#x4E9B;&#x5206;&#x5E03;&#x4E4B;&#x95F4;&#x7684; KL &#x6563;&#x5EA6;&#xFF0C;&#x8BB0;&#x4E3A;<code>Dkl(P || Q)</code>&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x516C;&#x5F0F; 15-1 &#x8BA1;&#x7B97;&#x3002;</p>
<p><img src="../images/chapter_15/pic11.png" alt=""></p>
<p>&#x5728;&#x6211;&#x4EEC;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x6D4B;&#x91CF;&#x7F16;&#x7801;&#x5C42;&#x4E2D;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x5C06;&#x6FC0;&#x6D3B;&#x7684;&#x76EE;&#x6807;&#x6982;&#x7387;<code>p</code>&#x4E0E;&#x5B9E;&#x9645;&#x6982;&#x7387;<code>q</code>&#xFF08;&#x5373;&#xFF0C;&#x8BAD;&#x7EC3;&#x6279;&#x6B21;&#x4E0A;&#x7684;&#x5E73;&#x5747;&#x6FC0;&#x6D3B;&#xFF09;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x5F02;&#x3002; &#x6240;&#x4EE5;KL&#x6563;&#x5EA6;&#x7B80;&#x5316;&#x4E3A;&#x516C;&#x5F0F; 15-2&#x3002;</p>
<p><img src="../images/chapter_15/pic12.png" alt=""></p>
<p>&#x4E00;&#x65E6;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x8BA1;&#x7B97;&#x4E86;&#x7F16;&#x7801;&#x5C42;&#x4E2D;&#x6BCF;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x7A00;&#x758F;&#x635F;&#x5931;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x603B;&#x7ED3;&#x8FD9;&#x4E9B;&#x635F;&#x5931;&#xFF0C;&#x5E76;&#x5C06;&#x7ED3;&#x679C;&#x6DFB;&#x52A0;&#x5230;&#x635F;&#x5931;&#x51FD;&#x6570;&#x4E2D;&#x3002; &#x4E3A;&#x4E86;&#x63A7;&#x5236;&#x7A00;&#x758F;&#x635F;&#x5931;&#x548C;&#x91CD;&#x6784;&#x635F;&#x5931;&#x7684;&#x76F8;&#x5BF9;&#x91CD;&#x8981;&#x6027;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;&#x7A00;&#x758F;&#x6743;&#x91CD;&#x8D85;&#x53C2;&#x6570;&#x4E58;&#x4EE5;&#x7A00;&#x758F;&#x635F;&#x5931;&#x3002; &#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x6743;&#x91CD;&#x592A;&#x9AD8;&#xFF0C;&#x6A21;&#x578B;&#x4F1A;&#x7D27;&#x8D34;&#x76EE;&#x6807;&#x7A00;&#x758F;&#x5EA6;&#xFF0C;&#x4F46;&#x5B83;&#x53EF;&#x80FD;&#x65E0;&#x6CD5;&#x6B63;&#x786E;&#x91CD;&#x5EFA;&#x8F93;&#x5165;&#xFF0C;&#x5BFC;&#x81F4;&#x6A21;&#x578B;&#x65E0;&#x7528;&#x3002; &#x76F8;&#x53CD;&#xFF0C;&#x5982;&#x679C;&#x5B83;&#x592A;&#x4F4E;&#xFF0C;&#x6A21;&#x578B;&#x5C06;&#x5927;&#x591A;&#x5FFD;&#x7565;&#x7A00;&#x758F;&#x76EE;&#x6807;&#xFF0C;&#x5B83;&#x4E0D;&#x4F1A;&#x5B66;&#x4E60;&#x4EFB;&#x4F55;&#x6709;&#x8DA3;&#x7684;&#x529F;&#x80FD;&#x3002;</p>
<h2 id="tensorflow-&#x5B9E;&#x73B0;">TensorFlow &#x5B9E;&#x73B0;</h2>
<p>&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x62E5;&#x6709;&#x4E86;&#x4F7F;&#x7528; TensorFlow &#x5B9E;&#x73B0;&#x7A00;&#x758F;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x6240;&#x9700;&#x7684;&#x5168;&#x90E8;&#x529F;&#x80FD;&#xFF1A;</p>
<pre><code class="lang-py"><span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">kl_divergence</span><span class="hljs-params">(p, q)</span>:</span>
    <span class="hljs-keyword">return</span> p * tf.log(p / q) + (<span class="hljs-number">1</span> - p) * tf.log((<span class="hljs-number">1</span> - p) / (<span class="hljs-number">1</span> - q))

learning_rate = <span class="hljs-number">0.01</span>
sparsity_target = <span class="hljs-number">0.1</span>
sparsity_weight = <span class="hljs-number">0.2</span>

[...] <span class="hljs-comment"># Build a normal autoencoder (in this example the coding layer is hidden1)</span>

optimizer = tf.train.AdamOptimizer(learning_rate)

hidden1_mean = tf.reduce_mean(hidden1, axis=<span class="hljs-number">0</span>) <span class="hljs-comment"># batch mean</span>
sparsity_loss = tf.reduce_sum(kl_divergence(sparsity_target, hidden1_mean))
reconstruction_loss = tf.reduce_mean(tf.square(outputs - X)) <span class="hljs-comment"># MSE</span>
loss = reconstruction_loss + sparsity_weight * sparsity_loss
training_op = optimizer.minimize(loss)
</code></pre>
<p>&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x7EC6;&#x8282;&#x662F;&#x7F16;&#x7801;&#x5C42;&#x7684;&#x6FC0;&#x6D3B;&#x5FC5;&#x987B;&#x4ECB;&#x4E8E; 0 &#x548C; 1 &#x4E4B;&#x95F4;&#xFF08;&#x4F46;&#x4E0D;&#x7B49;&#x4E8E; 0 &#x6216; 1&#xFF09;&#xFF0C;&#x5426;&#x5219; KL &#x6563;&#x5EA6;&#x5C06;&#x8FD4;&#x56DE;<code>NaN</code>&#xFF08;&#x975E;&#x6570;&#x5B57;&#xFF09;&#x3002; &#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x5BF9;&#x7F16;&#x7801;&#x5C42;&#x4F7F;&#x7528;&#x903B;&#x8F91;&#x6FC0;&#x6D3B;&#x529F;&#x80FD;&#xFF1A;</p>
<pre><code class="lang-py">hidden1 = tf.nn.sigmoid(tf.matmul(X, weights1) + biases1)
</code></pre>
<p>&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x6280;&#x5DE7;&#x53EF;&#x4EE5;&#x52A0;&#x901F;&#x6536;&#x655B;&#xFF1A;&#x4E0D;&#x662F;&#x4F7F;&#x7528; MSE&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x5177;&#x6709;&#x8F83;&#x5927;&#x68AF;&#x5EA6;&#x7684;&#x91CD;&#x5EFA;&#x635F;&#x5931;&#x3002; &#x4EA4;&#x53C9;&#x71B5;&#x901A;&#x5E38;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x9009;&#x62E9;&#x3002; &#x8981;&#x4F7F;&#x7528;&#x5B83;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x5BF9;&#x8F93;&#x5165;&#x8FDB;&#x884C;&#x89C4;&#x8303;&#x5316;&#x5904;&#x7406;&#xFF0C;&#x4F7F;&#x5B83;&#x4EEC;&#x7684;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x4E3A; 0 &#x5230; 1&#xFF0C;&#x5E76;&#x5728;&#x8F93;&#x51FA;&#x5C42;&#x4E2D;&#x4F7F;&#x7528;&#x903B;&#x8F91;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF0C;&#x4EE5;&#x4FBF;&#x8F93;&#x51FA;&#x4E5F;&#x53D6;&#x503C;&#x4E3A; 0 &#x5230; 1&#x3002;TensorFlow &#x7684;<code>sigmoid_cross_entropy_with_logits()</code>&#x51FD;&#x6570;&#x8D1F;&#x8D23; &#x6709;&#x6548;&#x5730;&#x5C06; logistic&#xFF08;sigmoid&#xFF09;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x5E94;&#x7528;&#x4E8E;&#x8F93;&#x51FA;&#x5E76;&#x8BA1;&#x7B97;&#x4EA4;&#x53C9;&#x71B5;&#xFF1A;</p>
<pre><code class="lang-py">[...]
logits = tf.matmul(hidden1, weights2) + biases2)
    outputs = tf.nn.sigmoid(logits)

reconstruction_loss = tf.reduce_sum(
    tf.nn.sigmoid_cross_entropy_with_logits(labels=X, logits=logits))
</code></pre>
<p>&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x8BAD;&#x7EC3;&#x671F;&#x95F4;&#x4E0D;&#x9700;&#x8981;&#x8F93;&#x51FA;&#x64CD;&#x4F5C;&#xFF08;&#x6211;&#x4EEC;&#x4EC5;&#x5728;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x67E5;&#x770B;&#x91CD;&#x5EFA;&#x65F6;&#x624D;&#x4F7F;&#x7528;&#x5B83;&#xFF09;&#x3002;</p>
<h2 id="&#x53D8;&#x5206;&#x81EA;&#x7F16;&#x7801;&#x5668;&#xFF08;vae&#xFF09;">&#x53D8;&#x5206;&#x81EA;&#x7F16;&#x7801;&#x5668;&#xFF08;VAE&#xFF09;</h2>
<p>Diederik Kingma &#x548C; Max Welling &#x4E8E; 2014 &#x5E74;&#x63A8;&#x51FA;&#x4E86;&#x53E6;&#x4E00;&#x7C7B;&#x91CD;&#x8981;&#x7684;&#x81EA;&#x7F16;&#x7801;&#x5668;&#xFF0C;&#x5E76;&#x8FC5;&#x901F;&#x6210;&#x4E3A;&#x6700;&#x53D7;&#x6B22;&#x8FCE;&#x7684;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x7C7B;&#x578B;&#x4E4B;&#x4E00;&#xFF1A;&#x53D8;&#x5206;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x3002;</p>
<p>&#x5B83;&#x4EEC;&#x4E0E;&#x6211;&#x4EEC;&#x8FC4;&#x4ECA;&#x4E3A;&#x6B62;&#x8BA8;&#x8BBA;&#x7684;&#x6240;&#x6709;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#xFF0C;&#x7279;&#x522B;&#x662F;&#xFF1A;</p>
<ul>
<li>&#x5B83;&#x4EEC;&#x662F;&#x6982;&#x7387;&#x81EA;&#x7F16;&#x7801;&#x5668;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x5373;&#x4F7F;&#x5728;&#x8BAD;&#x7EC3;&#x4E4B;&#x540E;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x8F93;&#x51FA;&#x90E8;&#x5206;&#x4E5F;&#x662F;&#x5076;&#x7136;&#x786E;&#x5B9A;&#x7684;&#xFF08;&#x76F8;&#x5BF9;&#x4E8E;&#x4EC5;&#x5728;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F7F;&#x7528;&#x968F;&#x673A;&#x6027;&#x7684;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x7684;&#x53BB;&#x566A;&#xFF09;&#x3002;</li>
<li>&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x5B83;&#x4EEC;&#x662F;&#x751F;&#x6210;&#x81EA;&#x7F16;&#x7801;&#x5668;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x751F;&#x6210;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x4ECE;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#x91C7;&#x6837;&#x7684;&#x65B0;&#x5B9E;&#x4F8B;&#x3002;</li>
</ul>
<p>&#x8FD9;&#x4E24;&#x4E2A;&#x5C5E;&#x6027;&#x4F7F;&#x5B83;&#x4EEC;&#x4E0E; RBM &#x975E;&#x5E38;&#x76F8;&#x4F3C;&#xFF08;&#x89C1;&#x9644;&#x5F55; E&#xFF09;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x66F4;&#x5BB9;&#x6613;&#x8BAD;&#x7EC3;&#xFF0C;&#x5E76;&#x4E14;&#x53D6;&#x6837;&#x8FC7;&#x7A0B;&#x66F4;&#x5FEB;&#xFF08;&#x5728; RBM &#x4E4B;&#x524D;&#xFF0C;&#x60A8;&#x9700;&#x8981;&#x7B49;&#x5F85;&#x7F51;&#x7EDC;&#x7A33;&#x5B9A;&#x5728;&#x201C;&#x70ED;&#x5E73;&#x8861;&#x201D;&#x4E4B;&#x540E;&#x624D;&#x80FD;&#x8FDB;&#x884C;&#x53D6;&#x6837;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5B9E;&#x4F8B;&#xFF09;</p>
<p>&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;&#x4ED6;&#x4EEC;&#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#x3002; &#x56FE; 15-11&#xFF08;&#x5DE6;&#xFF09;&#x663E;&#x793A;&#x4E86;&#x4E00;&#x4E2A;&#x53D8;&#x5206;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x3002; &#x5F53;&#x7136;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x8BA4;&#x8BC6;&#x5230;&#x6240;&#x6709;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x7684;&#x57FA;&#x672C;&#x7ED3;&#x6784;&#xFF0C;&#x7F16;&#x7801;&#x5668;&#x540E;&#x8DDF;&#x89E3;&#x7801;&#x5668;&#xFF08;&#x5728;&#x672C;&#x4F8B;&#x4E2D;&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x6709;&#x4E24;&#x4E2A;&#x9690;&#x85CF;&#x5C42;&#xFF09;&#xFF0C;&#x4F46;&#x6709;&#x4E00;&#x4E2A;&#x8F6C;&#x6298;&#x70B9;&#xFF1A;&#x4E0D;&#x662F;&#x76F4;&#x63A5;&#x4E3A;&#x7ED9;&#x5B9A;&#x7684;&#x8F93;&#x5165;&#x751F;&#x6210;&#x7F16;&#x7801; &#xFF0C;&#x7F16;&#x7801;&#x5668;&#x4EA7;&#x751F;&#x5E73;&#x5747;&#x7F16;&#x7801;<code>&#x3BC;</code>&#x548C;&#x6807;&#x51C6;&#x5DEE;<code>&#x3C3;</code>&#x3002; &#x7136;&#x540E;&#x4ECE;&#x5E73;&#x5747;&#x503C;<code>&#x3BC;</code>&#x548C;&#x6807;&#x51C6;&#x5DEE;<code>&#x3C3;</code>&#x7684;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#x968F;&#x673A;&#x91C7;&#x6837;&#x5B9E;&#x9645;&#x7F16;&#x7801;&#x3002; &#x4E4B;&#x540E;&#xFF0C;&#x89E3;&#x7801;&#x5668;&#x6B63;&#x5E38;&#x89E3;&#x7801;&#x91C7;&#x6837;&#x7684;&#x7F16;&#x7801;&#x3002; &#x8BE5;&#x56FE;&#x7684;&#x53F3;&#x4FA7;&#x90E8;&#x5206;&#x663E;&#x793A;&#x4E86;&#x4E00;&#x4E2A;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#x901A;&#x8FC7;&#x6B64;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x3002; &#x9996;&#x5148;&#xFF0C;&#x7F16;&#x7801;&#x5668;&#x4EA7;&#x751F;<code>&#x3BC;</code>&#x548C;<code>&#x3C3;</code>&#xFF0C;&#x968F;&#x540E;&#x5BF9;&#x7F16;&#x7801;&#x8FDB;&#x884C;&#x968F;&#x673A;&#x91C7;&#x6837;&#xFF08;&#x6CE8;&#x610F;&#x5B83;&#x4E0D;&#x662F;&#x5B8C;&#x5168;&#x4F4D;&#x4E8E;<code>&#x3BC;</code>&#x5904;&#xFF09;&#xFF0C;&#x6700;&#x540E;&#x5BF9;&#x7F16;&#x7801;&#x8FDB;&#x884C;&#x89E3;&#x7801;&#xFF0C;&#x6700;&#x7EC8;&#x7684;&#x8F93;&#x51FA;&#x4E0E;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#x7C7B;&#x4F3C;&#x3002;</p>
<p><img src="../images/chapter_15/pic13.png" alt=""></p>
<p>&#x4ECE;&#x56FE;&#x4E2D;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x5C3D;&#x7BA1;&#x8F93;&#x5165;&#x53EF;&#x80FD;&#x5177;&#x6709;&#x975E;&#x5E38;&#x590D;&#x6742;&#x7684;&#x5206;&#x5E03;&#xFF0C;&#x4F46;&#x53D8;&#x5206;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x503E;&#x5411;&#x4E8E;&#x4EA7;&#x751F;&#x7F16;&#x7801;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x597D;&#x50CF;&#x5B83;&#x4EEC;&#x662F;&#x4ECE;&#x7B80;&#x5355;&#x7684;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#x91C7;&#x6837;&#x7684;&#xFF1A;&#x5728;&#x8BAD;&#x7EC3;&#x671F;&#x95F4;&#xFF0C;&#x635F;&#x5931;&#x51FD;&#x6570;&#xFF08;&#x5C06;&#x5728;&#x4E0B;&#x9762;&#x8BA8;&#x8BBA;&#xFF09;&#x63A8;&#x52A8; &#x7F16;&#x7801;&#x5728;&#x7F16;&#x7801;&#x7A7A;&#x95F4;&#xFF08;&#x4E5F;&#x79F0;&#x4E3A;&#x6F5C;&#x5728;&#x7A7A;&#x95F4;&#xFF09;&#x5185;&#x9010;&#x6E10;&#x8FC1;&#x79FB;&#x4EE5;&#x5360;&#x636E;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x9AD8;&#x65AF;&#x70B9;&#x96C6;&#x6210;&#x7684;&#x4E91;&#x7684;&#x5927;&#x81F4;&#xFF08;&#x8D85;&#xFF09;&#x7403;&#x5F62;&#x533A;&#x57DF;&#x3002; &#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x7ED3;&#x679C;&#x662F;&#xFF0C;&#x5728;&#x8BAD;&#x7EC3;&#x4E86;&#x4E00;&#x4E2A;&#x53D8;&#x5206;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5B9E;&#x4F8B;&#xFF1A;&#x53EA;&#x9700;&#x4ECE;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#x4E2D;&#x62BD;&#x53D6;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x7F16;&#x7801;&#xFF0C;&#x5BF9;&#x5B83;&#x8FDB;&#x884C;&#x89E3;&#x7801;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#xFF01;</p>
<p>&#x90A3;&#x4E48;&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x635F;&#x5931;&#x51FD;&#x6570;&#x3002; &#x5B83;&#x7531;&#x4E24;&#x90E8;&#x5206;&#x7EC4;&#x6210;&#x3002; &#x9996;&#x5148;&#x662F;&#x901A;&#x5E38;&#x7684;&#x91CD;&#x5EFA;&#x635F;&#x5931;&#xFF0C;&#x63A8;&#x52A8;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x91CD;&#x73B0;&#x5176;&#x8F93;&#x5165;&#xFF08;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4EA4;&#x53C9;&#x71B5;&#x6765;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x524D;&#x6240;&#x8FF0;&#xFF09;&#x3002; &#x7B2C;&#x4E8C;&#x79CD;&#x662F;&#x6F5C;&#x5728;&#x7684;&#x635F;&#x5931;&#xFF0C;&#x63A8;&#x52A8;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x4F7F;&#x7F16;&#x7801;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x662F;&#x4ECE;&#x7B80;&#x5355;&#x7684;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#x4E2D;&#x91C7;&#x6837;&#xFF0C;&#x4E3A;&#x6B64;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x76EE;&#x6807;&#x5206;&#x5E03;&#xFF08;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#xFF09;&#x4E0E;&#x7F16;&#x7801;&#x5B9E;&#x9645;&#x5206;&#x5E03;&#x4E4B;&#x95F4;&#x7684; KL &#x6563;&#x5EA6;&#x3002; &#x6570;&#x5B66;&#x6BD4;&#x4EE5;&#x524D;&#x590D;&#x6742;&#x4E00;&#x70B9;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x56E0;&#x4E3A;&#x9AD8;&#x65AF;&#x566A;&#x58F0;&#xFF0C;&#x5B83;&#x9650;&#x5236;&#x4E86;&#x53EF;&#x4EE5;&#x4F20;&#x8F93;&#x5230;&#x7F16;&#x7801;&#x5C42;&#x7684;&#x4FE1;&#x606F;&#x91CF;&#xFF08;&#x4ECE;&#x800C;&#x63A8;&#x52A8;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x5B66;&#x4E60;&#x6709;&#x7528;&#x7684;&#x7279;&#x5F81;&#xFF09;&#x3002; &#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x4E9B;&#x65B9;&#x7A0B;&#x7B80;&#x5316;&#x4E3A;&#x4E0B;&#x9762;&#x7684;&#x6F5C;&#x5728;&#x635F;&#x5931;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code class="lang-py">eps = <span class="hljs-number">1e-10</span> <span class="hljs-comment"># smoothing term to avoid computing log(0) which is NaN</span>
latent_loss = <span class="hljs-number">0.5</span> * tf.reduce_sum(
    tf.square(hidden3_sigma) + tf.square(hidden3_mean)
    - <span class="hljs-number">1</span> - tf.log(eps + tf.square(hidden3_sigma)))
</code></pre>
<p>&#x4E00;&#x79CD;&#x5E38;&#x89C1;&#x7684;&#x53D8;&#x4F53;&#x662F;&#x8BAD;&#x7EC3;&#x7F16;&#x7801;&#x5668;&#x8F93;&#x51FA;<code>&#x3B3;= log(&#x3C3;^2)</code>&#x800C;&#x4E0D;&#x662F;<code>&#x3C3;</code>&#x3002; &#x53EA;&#x8981;&#x6211;&#x4EEC;&#x9700;&#x8981;<code>&#x3C3;</code>&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x8BA1;&#x7B97;<code>&#x3C3;= exp(2/&#x3B3;)</code>&#x3002; &#x8FD9;&#x4F7F;&#x5F97;&#x7F16;&#x7801;&#x5668;&#x53EF;&#x4EE5;&#x66F4;&#x8F7B;&#x677E;&#x5730;&#x6355;&#x83B7;&#x4E0D;&#x540C;&#x6BD4;&#x4F8B;&#x7684;<code>&#x3C3;</code>&#xFF0C;&#x4ECE;&#x800C;&#x6709;&#x52A9;&#x4E8E;&#x52A0;&#x5FEB;&#x6536;&#x655B;&#x901F;&#x5EA6;&#x3002; &#x6F5C;&#x5728;&#x635F;&#x5931;&#x7ED3;&#x675F;&#x4F1A;&#x53D8;&#x5F97;&#x66F4;&#x7B80;&#x5355;&#x4E00;&#x4E9B;&#xFF1A;</p>
<pre><code class="lang-py">latent_loss = <span class="hljs-number">0.5</span> * tf.reduce_sum(
    tf.exp(hidden3_gamma) + tf.square(hidden3_mean) - <span class="hljs-number">1</span> - hidden3_gamma)
</code></pre>
<p>&#x4EE5;&#x4E0B;&#x4EE3;&#x7801;&#x4F7F;&#x7528;<code>log(&#x3C3;^2)</code>&#x53D8;&#x4F53;&#x6784;&#x5EFA;&#x56FE; 15-11&#xFF08;&#x5DE6;&#xFF09;&#x6240;&#x793A;&#x7684;&#x53D8;&#x5206;&#x81EA;&#x7F16;&#x7801;&#x5668;:</p>
<pre><code class="lang-py">n_inputs = <span class="hljs-number">28</span> * <span class="hljs-number">28</span> <span class="hljs-comment"># for MNIST</span>
n_hidden1 = <span class="hljs-number">500</span>
n_hidden2 = <span class="hljs-number">500</span>
n_hidden3 = <span class="hljs-number">20</span> <span class="hljs-comment"># codings</span>
n_hidden4 = n_hidden2
n_hidden5 = n_hidden1
n_outputs = n_inputs

learning_rate = <span class="hljs-number">0.001</span>

<span class="hljs-keyword">with</span> tf.contrib.framework.arg_scope(    
        [fully_connected],
        activation_fn=tf.nn.elu,
        weights_initializer=tf.contrib.layers.variance_scaling_initializer()):
    X = tf.placeholder(tf.float32, [<span class="hljs-keyword">None</span>, n_inputs])
    hidden1 = fully_connected(X, n_hidden1)
    hidden2 = fully_connected(hidden1, n_hidden2)
    hidden3_mean = fully_connected(hidden2, n_hidden3, activation_fn=<span class="hljs-keyword">None</span>)
    hidden3_gamma = fully_connected(hidden2, n_hidden3, activation_fn=<span class="hljs-keyword">None</span>)
    hidden3_sigma = tf.exp(<span class="hljs-number">0.5</span> * hidden3_gamma)
    noise = tf.random_normal(tf.shape(hidden3_sigma), dtype=tf.float32)
    hidden3 = hidden3_mean + hidden3_sigma * noise
    hidden4 = fully_connected(hidden3, n_hidden4)
    hidden5 = fully_connected(hidden4, n_hidden5)
    logits = fully_connected(hidden5, n_outputs, activation_fn=<span class="hljs-keyword">None</span>)
    outputs = tf.sigmoid(logits)
reconstruction_loss = tf.reduce_sum(
    tf.nn.sigmoid_cross_entropy_with_logits(labels=X, logits=logits))
latent_loss = <span class="hljs-number">0.5</span> * tf.reduce_sum(
    tf.exp(hidden3_gamma) + tf.square(hidden3_mean) - <span class="hljs-number">1</span> - hidden3_gamma)
cost = reconstruction_loss + latent_loss

optimizer = tf.train.AdamOptimizer(learning_rate=learning_rate)
training_op = optimizer.minimize(cost)

init = tf.global_variables_initializer()
</code></pre>
<h2 id="&#x751F;&#x6210;&#x6570;&#x5B57;">&#x751F;&#x6210;&#x6570;&#x5B57;</h2>
<p>&#x73B0;&#x5728;&#x8BA9;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x53D8;&#x5206;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x6765;&#x751F;&#x6210;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x624B;&#x5199;&#x6570;&#x5B57;&#x7684;&#x56FE;&#x50CF;&#x3002; &#x6211;&#x4EEC;&#x6240;&#x9700;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x8BAD;&#x7EC3;&#x6A21;&#x578B;&#xFF0C;&#x7136;&#x540E;&#x4ECE;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#x4E2D;&#x5BF9;&#x968F;&#x673A;&#x7F16;&#x7801;&#x8FDB;&#x884C;&#x91C7;&#x6837;&#x5E76;&#x5BF9;&#x5B83;&#x4EEC;&#x8FDB;&#x884C;&#x89E3;&#x7801;&#x3002;</p>
<pre><code class="lang-py"><span class="hljs-keyword">import</span> numpy <span class="hljs-keyword">as</span> np
n_digits = <span class="hljs-number">60</span>
n_epochs = <span class="hljs-number">50</span>
batch_size = <span class="hljs-number">150</span>
<span class="hljs-keyword">with</span> tf.Session() <span class="hljs-keyword">as</span> sess:
    init.run()
    <span class="hljs-keyword">for</span> epoch <span class="hljs-keyword">in</span> range(n_epochs):
        n_batches = mnist.train.num_examples // batch_size
        <span class="hljs-keyword">for</span> iteration <span class="hljs-keyword">in</span> range(n_batches):
            X_batch, y_batch = mnist.train.next_batch(batch_size)
            sess.run(training_op, feed_dict={X: X_batch})

    codings_rnd = np.random.normal(size=[n_digits, n_hidden3])
    outputs_val = outputs.eval(feed_dict={hidden3: codings_rnd})
</code></pre>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x7531;autoencoder&#x751F;&#x6210;&#x7684;&#x201C;&#x624B;&#x5199;&#x201D;&#x6570;&#x5B57;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#xFF08;&#x53C2;&#x89C1;&#x56FE;15-12&#xFF09;&#xFF1A;</p>
<pre><code class="lang-py"><span class="hljs-keyword">for</span> iteration <span class="hljs-keyword">in</span> range(n_digits):
    plt.subplot(n_digits, <span class="hljs-number">10</span>, iteration + <span class="hljs-number">1</span>)
    plot_image(outputs_val[iteration])
</code></pre>
<p><img src="../images/chapter_15/pic14.png" alt=""></p>
<h2 id="&#x5176;&#x4ED6;&#x81EA;&#x7F16;&#x7801;&#x5668;">&#x5176;&#x4ED6;&#x81EA;&#x7F16;&#x7801;&#x5668;</h2>
<p>&#x76D1;&#x7763;&#x5F0F;&#x5B66;&#x4E60;&#x5728;&#x56FE;&#x50CF;&#x8BC6;&#x522B;&#xFF0C;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#xFF0C;&#x6587;&#x672C;&#x7FFB;&#x8BD1;&#x7B49;&#x65B9;&#x9762;&#x53D6;&#x5F97;&#x7684;&#x60CA;&#x4EBA;&#x6210;&#x5C31;&#x5728;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x63A9;&#x76D6;&#x4E86;&#x65E0;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x7684;&#x5C40;&#x9762;&#xFF0C;&#x4F46;&#x5B83;&#x5B9E;&#x9645;&#x4E0A;&#x6B63;&#x5728;&#x84EC;&#x52C3;&#x53D1;&#x5C55;&#x3002; &#x81EA;&#x7F16;&#x7801;&#x5668;&#x548C;&#x5176;&#x4ED6;&#x65E0;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x7684;&#x65B0;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x5B9A;&#x671F;&#x53D1;&#x660E;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x5728;&#x672C;&#x4E66;&#x4E2D;&#x5168;&#x9762;&#x4ECB;&#x7ECD;&#x5B83;&#x4EEC;&#x3002; &#x4EE5;&#x4E0B;&#x662F;&#x60A8;&#x53EF;&#x80FD;&#x60F3;&#x8981;&#x67E5;&#x770B;&#x7684;&#x51E0;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x7684;&#x7B80;&#x8981;&#x8BF4;&#x660E;&#xFF08;&#x7EDD;&#x975E;&#x8BE6;&#x5C3D;&#x65E0;&#x9057;&#xFF09;&#xFF1A;</p>
<p>&#x538B;&#x7F29;&#x81EA;&#x7F16;&#x7801;&#x5668;&#xFF08;CAE&#xFF09;</p>
<p>&#x81EA;&#x7F16;&#x7801;&#x5668;&#x5728;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#x4E2D;&#x53D7;&#x5230;&#x7EA6;&#x675F;&#xFF0C;&#x56E0;&#x6B64;&#x4E0E;&#x8F93;&#x5165;&#x6709;&#x5173;&#x7684;&#x7F16;&#x7801;&#x7684;&#x5BFC;&#x6570;&#x5F88;&#x5C0F;&#x3002; &#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x4E24;&#x4E2A;&#x7C7B;&#x4F3C;&#x7684;&#x8F93;&#x5165;&#x5FC5;&#x987B;&#x5177;&#x6709;&#x76F8;&#x4F3C;&#x7684;&#x7F16;&#x7801;&#x3002;</p>
<p>&#x6808;&#x5F0F;&#x5377;&#x79EF;&#x81EA;&#x7F16;&#x7801;&#x5668;&#xFF08;SCAE&#xFF09;</p>
<p>&#x5B66;&#x4E60;&#x901A;&#x8FC7;&#x91CD;&#x6784;&#x901A;&#x8FC7;&#x5377;&#x79EF;&#x5C42;&#x5904;&#x7406;&#x7684;&#x56FE;&#x50CF;&#x6765;&#x63D0;&#x53D6;&#x89C6;&#x89C9;&#x7279;&#x5F81;&#x7684;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x3002;</p>
<p>&#x751F;&#x6210;&#x968F;&#x673A;&#x7F51;&#x7EDC;&#xFF08;GSN&#xFF09;</p>
<p>&#x6D88;&#x9664;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x7684;&#x6CDB;&#x5316;&#xFF0C;&#x589E;&#x52A0;&#x4E86;&#x751F;&#x6210;&#x6570;&#x636E;&#x7684;&#x80FD;&#x529B;&#x3002;</p>
<p>&#x8D62;&#x5BB6;&#x901A;&#x5403;&#xFF08;WTA&#xFF09;&#x7684;&#x81EA;&#x7F16;&#x7801;</p>
<p>&#x5728;&#x8BAD;&#x7EC3;&#x671F;&#x95F4;&#xFF0C;&#x5728;&#x8BA1;&#x7B97;&#x7F16;&#x7801;&#x5C42;&#x4E2D;&#x6240;&#x6709;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x6FC0;&#x6D3B;&#x4E4B;&#x540E;&#xFF0C;&#x53EA;&#x4FDD;&#x7559;&#x8BAD;&#x7EC3;&#x6279;&#x6B21;&#x4E0A;&#x6BCF;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x524D; k% &#x6FC0;&#x6D3B;&#xFF0C;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x8BBE;&#x4E3A;&#x96F6;&#x3002; &#x81EA;&#x7136;&#x8FD9;&#x5BFC;&#x81F4;&#x7A00;&#x758F;&#x7684;&#x7F16;&#x7801;&#x3002; &#x800C;&#x4E14;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7C7B;&#x4F3C;&#x7684; WTA &#x65B9;&#x6CD5;&#x6765;&#x4EA7;&#x751F;&#x7A00;&#x758F;&#x5377;&#x79EF;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x3002;</p>
<p>&#x5BF9;&#x6297;&#x81EA;&#x7F16;&#x7801;&#x5668;&#xFF08;AAE&#xFF09;</p>
<p>&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x88AB;&#x8BAD;&#x7EC3;&#x6765;&#x91CD;&#x73B0;&#x5B83;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x540C;&#x65F6;&#x53E6;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x88AB;&#x8BAD;&#x7EC3;&#x53BB;&#x627E;&#x5230;&#x7B2C;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x4E0D;&#x80FD;&#x6B63;&#x786E;&#x91CD;&#x5EFA;&#x7684;&#x8F93;&#x5165;&#x3002; &#x8FD9;&#x63A8;&#x52A8;&#x4E86;&#x7B2C;&#x4E00;&#x4E2A;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x5B66;&#x4E60;&#x5065;&#x58EE;&#x7684;&#x7F16;&#x7801;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="14.循环神经网络.html" class="navigation navigation-prev " aria-label="Previous page: 十四、循环神经网络">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="16.强化学习.html" class="navigation navigation-next " aria-label="Next page: 十六、强化学习">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"十五、自编码器","level":"1.17","depth":1,"next":{"title":"十六、强化学习","level":"1.18","depth":1,"path":"docs/16.强化学习.md","ref":"docs/16.强化学习.md","articles":[]},"previous":{"title":"十四、循环神经网络","level":"1.16","depth":1,"path":"docs/14.循环神经网络.md","ref":"docs/14.循环神经网络.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"docs/15.自编码器.md","mtime":"2019-04-18T03:01:37.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-05-07T09:41:36.357Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

