
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>四、训练模型 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="5.支持向量机.html" />
    
    
    <link rel="prev" href="3.分类.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Sklearn 与 TensorFlow 机器学习实用指南
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="0.前言.html">
            
                <a href="0.前言.html">
            
                    
                    零、前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="1.机器学习概览.html">
            
                <a href="1.机器学习概览.html">
            
                    
                    一、机器学习概览
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="2.一个完整的机器学习项目.html">
            
                <a href="2.一个完整的机器学习项目.html">
            
                    
                    二、一个完整的机器学习项目
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="3.分类.html">
            
                <a href="3.分类.html">
            
                    
                    三、分类
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.6" data-path="4.训练模型.html">
            
                <a href="4.训练模型.html">
            
                    
                    四、训练模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="5.支持向量机.html">
            
                <a href="5.支持向量机.html">
            
                    
                    五、支持向量机
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="6.决策树.html">
            
                <a href="6.决策树.html">
            
                    
                    六、决策树
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="7.集成学习和随机森林.html">
            
                <a href="7.集成学习和随机森林.html">
            
                    
                    七、集成学习和随机森林
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="8.降维.html">
            
                <a href="8.降维.html">
            
                    
                    八、降维
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="9.启动并运行_TensorFlow.html">
            
                <a href="9.启动并运行_TensorFlow.html">
            
                    
                    九、启动并运行 TensorFlow
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="10.人工神经网络介绍.html">
            
                <a href="10.人工神经网络介绍.html">
            
                    
                    十、人工神经网络介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="11.训练深层神经网络.html">
            
                <a href="11.训练深层神经网络.html">
            
                    
                    十一、训练深层神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="12.设备和服务器上的分布式_TensorFlow.html">
            
                <a href="12.设备和服务器上的分布式_TensorFlow.html">
            
                    
                    十二、设备和服务器上的分布式 TensorFlow
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="13.卷积神经网络.html">
            
                <a href="13.卷积神经网络.html">
            
                    
                    十三、卷积神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="14.循环神经网络.html">
            
                <a href="14.循环神经网络.html">
            
                    
                    十四、循环神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="15.自编码器.html">
            
                <a href="15.自编码器.html">
            
                    
                    十五、自编码器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="16.强化学习.html">
            
                <a href="16.强化学习.html">
            
                    
                    十六、强化学习
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="B.机器学习项目清单.html">
            
                <a href="B.机器学习项目清单.html">
            
                    
                    附录 B、机器学习项目清单
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="C.SVM_对偶问题.html">
            
                <a href="C.SVM_对偶问题.html">
            
                    
                    附录 C、SVM 对偶问题
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="D.自动微分.html">
            
                <a href="D.自动微分.html">
            
                    
                    附录 D、自动微分
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >四、训练模型</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x56DB;&#x3001;&#x8BAD;&#x7EC3;&#x6A21;&#x578B;">&#x56DB;&#x3001;&#x8BAD;&#x7EC3;&#x6A21;&#x578B;</h1>
<blockquote>
<p>&#x8BD1;&#x8005;&#xFF1A;<a href="https://github.com/C-PIG" target="_blank">@C-PIG</a></p>
<p>&#x6821;&#x5BF9;&#x8005;&#xFF1A;<a href="https://github.com/PeterHo" target="_blank">@PeterHo</a>&#x3001;<a href="https://github.com/wizardforcel" target="_blank">@&#x98DE;&#x9F99;</a>&#x3001;<a href="https://github.com/bigeyex" target="_blank">@YuWang</a>&#x3001;<a href="https://github.com/alecchen" target="_blank">@AlecChen</a></p>
</blockquote>
<p>&#x5728;&#x4E4B;&#x524D;&#x7684;&#x63CF;&#x8FF0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x628A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6A21;&#x578B;&#x548C;&#x8BAD;&#x7EC3;&#x7B97;&#x6CD5;&#x5F53;&#x4F5C;&#x9ED1;&#x7BB1;&#x5B50;&#x6765;&#x5904;&#x7406;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5B9E;&#x8DF5;&#x8FC7;&#x524D;&#x51E0;&#x7AE0;&#x7684;&#x4E00;&#x4E9B;&#x793A;&#x4F8B;&#xFF0C;&#x4F60;&#x60CA;&#x5947;&#x7684;&#x53D1;&#x73B0;&#x4F60;&#x53EF;&#x4EE5;&#x4F18;&#x5316;&#x56DE;&#x5F52;&#x7CFB;&#x7EDF;&#xFF0C;&#x6539;&#x8FDB;&#x6570;&#x5B57;&#x56FE;&#x50CF;&#x7684;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x4F60;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x96F6;&#x57FA;&#x7840;&#x642D;&#x5EFA;&#x4E00;&#x4E2A;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x7684;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x5374;&#x5BF9;&#x5B83;&#x4EEC;&#x5185;&#x90E8;&#x7684;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#x4E00;&#x65E0;&#x6240;&#x77E5;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x8BB8;&#x591A;&#x573A;&#x5408;&#x4F60;&#x90FD;&#x4E0D;&#x9700;&#x8981;&#x77E5;&#x9053;&#x8FD9;&#x4E9B;&#x9ED1;&#x7BB1;&#x5B50;&#x7684;&#x5185;&#x90E8;&#x6709;&#x4EC0;&#x4E48;&#xFF0C;&#x5E72;&#x4E86;&#x4EC0;&#x4E48;&#x3002;</p>
<p>&#x7136;&#x800C;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x5176;&#x5185;&#x90E8;&#x7684;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#x6709;&#x4E00;&#x5B9A;&#x4E86;&#x89E3;&#x7684;&#x8BDD;&#xFF0C;&#x5F53;&#x9762;&#x5BF9;&#x4E00;&#x4E2A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4EFB;&#x52A1;&#x65F6;&#x5019;&#xFF0C;&#x8FD9;&#x4E9B;&#x7406;&#x8BBA;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x4F60;&#x5FEB;&#x901F;&#x7684;&#x627E;&#x5230;&#x6070;&#x5F53;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6A21;&#x578B;&#xFF0C;&#x5408;&#x9002;&#x7684;&#x8BAD;&#x7EC3;&#x7B97;&#x6CD5;&#xFF0C;&#x4EE5;&#x53CA;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x5047;&#x8BBE;&#x96C6;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x4E86;&#x89E3;&#x9ED1;&#x7BB1;&#x5B50;&#x5185;&#x90E8;&#x7684;&#x6784;&#x6210;&#xFF0C;&#x6709;&#x52A9;&#x4E8E;&#x4F60;&#x66F4;&#x597D;&#x5730;&#x8C03;&#x8BD5;&#x53C2;&#x6570;&#x4EE5;&#x53CA;&#x66F4;&#x6709;&#x6548;&#x7684;&#x8BEF;&#x5DEE;&#x5206;&#x6790;&#x3002;&#x672C;&#x7AE0;&#x8BA8;&#x8BBA;&#x7684;&#x5927;&#x90E8;&#x5206;&#x8BDD;&#x9898;&#x5BF9;&#x4E8E;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6A21;&#x578B;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x6784;&#x5EFA;&#xFF0C;&#x4EE5;&#x53CA;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF08;&#x8BE6;&#x7EC6;&#x53C2;&#x8003;&#x672C;&#x4E66;&#x7684;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#xFF09;&#x7684;&#x8BAD;&#x7EC3;&#x90FD;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x3002;</p>
<p>&#x9996;&#x5148;&#x6211;&#x4EEC;&#x5C06;&#x4EE5;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x6A21;&#x578B;&#x4E3A;&#x4F8B;&#xFF0C;&#x8BA8;&#x8BBA;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x8BAD;&#x7EC3;&#x65B9;&#x6CD5;&#x6765;&#x5F97;&#x5230;&#x6A21;&#x578B;&#x7684;&#x6700;&#x4F18;&#x89E3;&#xFF1A;</p>
<ul>
<li><p>&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x5C01;&#x95ED;&#x65B9;&#x7A0B;&#x8FDB;&#x884C;&#x6C42;&#x6839;&#x8FD0;&#x7B97;&#xFF0C;&#x5F97;&#x5230;&#x6A21;&#x578B;&#x5728;&#x5F53;&#x524D;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x7684;&#x6700;&#x4F18;&#x53C2;&#x6570;&#xFF08;&#x5373;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x4F7F;&#x635F;&#x5931;&#x51FD;&#x6570;&#x8FBE;&#x5230;&#x6700;&#x5C0F;&#x503C;&#x7684;&#x6A21;&#x578B;&#x53C2;&#x6570;&#xFF09;</p>
</li>
<li><p>&#x4F7F;&#x7528;&#x8FED;&#x4EE3;&#x4F18;&#x5316;&#x65B9;&#x6CD5;&#xFF1A;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#xFF08;GD&#xFF09;&#xFF0C;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x9010;&#x6E10;&#x8C03;&#x6574;&#x6A21;&#x578B;&#x53C2;&#x6570;&#x4EE5;&#x83B7;&#x5F97;&#x6700;&#x5C0F;&#x7684;&#x635F;&#x5931;&#x51FD;&#x6570;&#xFF0C;&#x6700;&#x7EC8;&#xFF0C;&#x53C2;&#x6570;&#x4F1A;&#x6536;&#x655B;&#x5230;&#x548C;&#x7B2C;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x76F8;&#x540C;&#x7684;&#x7684;&#x503C;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x4F1A;&#x4ECB;&#x7ECD;&#x4E00;&#x4E9B;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7684;&#x53D8;&#x4F53;&#x5F62;&#x5F0F;&#xFF1A;&#x6279;&#x91CF;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#xFF08;Batch GD&#xFF09;&#x3001;&#x5C0F;&#x6279;&#x91CF;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#xFF08;Mini-batch GD&#xFF09;&#x3001;&#x968F;&#x673A;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#xFF08;Stochastic GD&#xFF09;&#xFF0C;&#x5728;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x90E8;&#x5206;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x591A;&#x6B21;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x3002;</p>
</li>
</ul>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x7814;&#x7A76;&#x4E00;&#x4E2A;&#x66F4;&#x590D;&#x6742;&#x7684;&#x6A21;&#x578B;&#xFF1A;&#x591A;&#x9879;&#x5F0F;&#x56DE;&#x5F52;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x62DF;&#x5408;&#x975E;&#x7EBF;&#x6027;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x7531;&#x4E8E;&#x5B83;&#x6BD4;&#x7EBF;&#x6027;&#x6A21;&#x578B;&#x62E5;&#x6709;&#x66F4;&#x591A;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x4E8E;&#x662F;&#x5B83;&#x66F4;&#x5BB9;&#x6613;&#x51FA;&#x73B0;&#x6A21;&#x578B;&#x7684;&#x8FC7;&#x62DF;&#x5408;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4ECB;&#x7ECD;&#x5982;&#x4F55;&#x901A;&#x8FC7;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;&#x53BB;&#x5224;&#x65AD;&#x6A21;&#x578B;&#x662F;&#x5426;&#x51FA;&#x73B0;&#x4E86;&#x8FC7;&#x62DF;&#x5408;&#xFF0C;&#x5E76;&#x4ECB;&#x7ECD;&#x51E0;&#x79CD;&#x6B63;&#x5219;&#x5316;&#x65B9;&#x6CD5;&#x4EE5;&#x51CF;&#x5C11;&#x6A21;&#x578B;&#x51FA;&#x73B0;&#x8FC7;&#x62DF;&#x5408;&#x7684;&#x98CE;&#x9669;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4ECB;&#x7ECD;&#x4E24;&#x4E2A;&#x5E38;&#x7528;&#x4E8E;&#x5206;&#x7C7B;&#x7684;&#x6A21;&#x578B;&#xFF1A;Logistic&#x56DE;&#x5F52;&#x548C;Softmax&#x56DE;&#x5F52;</p>
<blockquote>
<p>&#x63D0;&#x793A;</p>
<p>&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#x5305;&#x542B;&#x8BB8;&#x591A;&#x6570;&#x5B66;&#x516C;&#x5F0F;&#xFF0C;&#x4EE5;&#x53CA;&#x4E00;&#x4E9B;&#x7EBF;&#x6027;&#x4EE3;&#x6570;&#x548C;&#x5FAE;&#x79EF;&#x5206;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#x3002;&#x4E3A;&#x4E86;&#x7406;&#x89E3;&#x8FD9;&#x4E9B;&#x516C;&#x5F0F;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x77E5;&#x9053;&#x4EC0;&#x4E48;&#x662F;&#x5411;&#x91CF;&#xFF0C;&#x4EC0;&#x4E48;&#x662F;&#x77E9;&#x9635;&#xFF0C;&#x4EE5;&#x53CA;&#x5B83;&#x4EEC;&#x76F4;&#x63A5;&#x662F;&#x5982;&#x4F55;&#x8F6C;&#x5316;&#x7684;&#xFF0C;&#x4EE5;&#x53CA;&#x4EC0;&#x4E48;&#x662F;&#x70B9;&#x79EF;&#xFF0C;&#x4EC0;&#x4E48;&#x662F;&#x77E9;&#x9635;&#x7684;&#x9006;&#xFF0C;&#x4EC0;&#x4E48;&#x662F;&#x504F;&#x5BFC;&#x6570;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x8FD9;&#x4E9B;&#x4E0D;&#x662F;&#x5F88;&#x719F;&#x6089;&#x7684;&#x8BDD;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x9605;&#x8BFB;&#x672C;&#x4E66;&#x63D0;&#x4F9B;&#x7684; Jupyter &#x5728;&#x7EBF;&#x7B14;&#x8BB0;&#xFF0C;&#x5B83;&#x5305;&#x62EC;&#x4E86;&#x7EBF;&#x6027;&#x4EE3;&#x6570;&#x548C;&#x5FAE;&#x79EF;&#x5206;&#x7684;&#x5165;&#x95E8;&#x6307;&#x5BFC;&#x3002;&#x5BF9;&#x4E8E;&#x90A3;&#x4E9B;&#x4E0D;&#x559C;&#x6B22;&#x6570;&#x5B66;&#x7684;&#x4EBA;&#xFF0C;&#x4F60;&#x4E5F;&#x5E94;&#x8BE5;&#x5FEB;&#x901F;&#x7B80;&#x5355;&#x7684;&#x6D4F;&#x89C8;&#x8FD9;&#x4E9B;&#x516C;&#x5F0F;&#x3002;&#x5E0C;&#x671B;&#x5B83;&#x8DB3;&#x4EE5;&#x5E2E;&#x52A9;&#x4F60;&#x7406;&#x89E3;&#x5927;&#x591A;&#x6570;&#x7684;&#x6982;&#x5FF5;&#x3002;</p>
</blockquote>
<h2 id="&#x7EBF;&#x6027;&#x56DE;&#x5F52;">&#x7EBF;&#x6027;&#x56DE;&#x5F52;</h2>
<p>&#x5728;&#x7B2C;&#x4E00;&#x7AE0;&#xFF0C;&#x6211;&#x4EEC;&#x4ECB;&#x7ECD;&#x4E86;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x751F;&#x6D3B;&#x6EE1;&#x610F;&#x5EA6;&#x56DE;&#x5F52;&#x6A21;&#x578B;:</p>
<p><img src="../images/tex-2b4fc5fcdceb2e12c666415e9ebb793a.gif" alt="life\_satisfaction = \theta_{0} + \theta_{1} * GDP\_per\_capita"></p>
<p>&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#x4EC5;&#x4EC5;&#x662F;&#x8F93;&#x5165;&#x91CF;<code>GDP_per_capita</code>&#x7684;&#x7EBF;&#x6027;&#x51FD;&#x6570;&#xFF0C;<img src="../images/tex-3d7e996adfe310516ca31c796df1ce8c.gif" alt="\theta _{0}"> &#x548C; <img src="../images/tex-92c9134527161fd7453fe848b821d8c7.gif" alt="\theta _{1}"> &#x662F;&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x7EBF;&#x6027;&#x6A21;&#x578B;&#x66F4;&#x4E00;&#x822C;&#x5316;&#x7684;&#x63CF;&#x8FF0;&#x6307;&#x901A;&#x8FC7;&#x8BA1;&#x7B97;&#x8F93;&#x5165;&#x53D8;&#x91CF;&#x7684;&#x52A0;&#x6743;&#x548C;&#xFF0C;&#x5E76;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&#x5E38;&#x6570;&#x504F;&#x7F6E;&#x9879;&#xFF08;&#x622A;&#x8DDD;&#x9879;&#xFF09;&#x6765;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x9884;&#x6D4B;&#x503C;&#x3002;&#x5982;&#x516C;&#x5F0F; 4-1&#xFF1A;</p>
<p>&#x516C;&#x5F0F; 4-1&#xFF1A;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x9884;&#x6D4B;&#x6A21;&#x578B;</p>
<p><img src="../images/tex-f99876b625a13a0aad9631f61d934a61.gif" alt="\hat{y} = \theta _{0} + \theta _{1}x _{1}+\theta _{2}x _{2}+\dots+\theta _{n}x _{n}"></p>
<ul>
<li><img src="../images/tex-5d28a7ba1a44a73b8c2ed21321697c59.gif" alt="\hat{y}"> &#x8868;&#x793A;&#x9884;&#x6D4B;&#x7ED3;&#x679C;</li>
<li><img src="../images/tex-7b8b965ad4bca0e41ab51de7b31363a1.gif" alt="n"> &#x8868;&#x793A;&#x7279;&#x5F81;&#x7684;&#x4E2A;&#x6570;</li>
<li><img src="../images/tex-05e42209d67fe1eb15a055e9d3b3770e.gif" alt="x_{i}"> &#x8868;&#x793A;&#x7B2C;<code>i</code>&#x4E2A;&#x7279;&#x5F81;&#x7684;&#x503C;</li>
<li><img src="../images/tex-4c5645510c6b63f6bd0c770fceea4ac1.gif" alt="\theta_{j}"> &#x8868;&#x793A;&#x7B2C;<code>j</code>&#x4E2A;&#x53C2;&#x6570;&#xFF08;&#x5305;&#x62EC;&#x504F;&#x7F6E;&#x9879; <img src="../images/tex-3d7e996adfe310516ca31c796df1ce8c.gif" alt="\theta _{0}"> &#x548C;&#x7279;&#x5F81;&#x6743;&#x91CD;&#x503C; <img src="../images/tex-54552e28fe2d86eb74de3db6abb5aab8.gif" alt="\theta _{1},\theta _{2},\dots,\theta _{n}">&#xFF09;</li>
</ul>
<p>&#x4E0A;&#x8FF0;&#x516C;&#x5F0F;&#x53EF;&#x4EE5;&#x5199;&#x6210;&#x66F4;&#x4E3A;&#x7B80;&#x6D01;&#x7684;&#x5411;&#x91CF;&#x5F62;&#x5F0F;&#xFF0C;&#x5982;&#x516C;&#x5F0F; 4-2&#xFF1A;</p>
<p>&#x516C;&#x5F0F; 4-2&#xFF1A;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x9884;&#x6D4B;&#x6A21;&#x578B;&#xFF08;&#x5411;&#x91CF;&#x5F62;&#x5F0F;&#xFF09;</p>
<p><img src="../images/tex-5da22015388cdeacf9c75c3511592953.gif" alt="\hat{y} = h _{\theta} (\mathbf{x})= \theta^T  \cdot \mathbf{x}"></p>
<ul>
<li><img src="../images/tex-2554a2bb846cffd697389e5dc8912759.gif" alt="\theta"> &#x8868;&#x793A;&#x6A21;&#x578B;&#x7684;&#x53C2;&#x6570;&#x5411;&#x91CF;&#x5305;&#x62EC;&#x504F;&#x7F6E;&#x9879; <img src="../images/tex-3d7e996adfe310516ca31c796df1ce8c.gif" alt="\theta _{0}"> &#x548C;&#x7279;&#x5F81;&#x6743;&#x91CD;&#x503C; <img src="../images/tex-92c9134527161fd7453fe848b821d8c7.gif" alt="\theta _{1}"> &#x5230; <img src="../images/tex-f5c4858c5101df83fa23d1f57981c12b.gif" alt="\theta _{n}"></li>
<li><img src="../images/tex-616944242afb697770bd2354c57e4773.gif" alt="\theta^T"> &#x8868;&#x793A;&#x5411;&#x91CF;<img src="../images/tex-2554a2bb846cffd697389e5dc8912759.gif" alt="\theta">&#x7684;&#x8F6C;&#x7F6E;&#xFF08;&#x884C;&#x5411;&#x91CF;&#x53D8;&#x4E3A;&#x4E86;&#x5217;&#x5411;&#x91CF;&#xFF09;</li>
<li><img src="../images/tex-70e59a996bd69a0c21878b4093375e92.gif" alt="\mathbf{x}"> &#x4E3A;&#x6BCF;&#x4E2A;&#x6837;&#x672C;&#x4E2D;&#x7279;&#x5F81;&#x503C;&#x7684;&#x5411;&#x91CF;&#x5F62;&#x5F0F;&#xFF0C;&#x5305;&#x62EC; <img src="../images/tex-f1dd81ad21180e074e52e8cccdcbb172.gif" alt="x _{1}"> &#x5230; <img src="../images/tex-67b68721103b5a16194f4b3e3ec222db.gif" alt="x_{n}">&#xFF0C;&#x800C;&#x4E14; <img src="../images/tex-3e0d691f3a530e6c7e079636f20c111b.gif" alt="x_0"> &#x6052;&#x4E3A; 1</li>
<li><img src="../images/tex-dc285d84f74bea2336104ee5eafff150.gif" alt="\theta^T  \cdot \mathbf{x}"> &#x8868;&#x793A; <img src="../images/tex-616944242afb697770bd2354c57e4773.gif" alt="\theta^T"> &#x548C;<img src="../images/tex-7186298c04fa42047e7992afaf52dfe0.gif" alt="  \mathbf{x}"> &#x7684;&#x70B9;&#x79EF;</li>
<li><img src="../images/tex-b7ae93cd51ba1d38fe4ebac15eab3aa1.gif" alt="h_{\theta}"> &#x8868;&#x793A;&#x53C2;&#x6570;&#x4E3A; <img src="../images/tex-2554a2bb846cffd697389e5dc8912759.gif" alt="\theta"> &#x7684;&#x5047;&#x8BBE;&#x51FD;&#x6570;</li>
</ul>
<p>&#x600E;&#x4E48;&#x6837;&#x53BB;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x6A21;&#x578B;&#x5462;&#xFF1F;&#x597D;&#x5427;&#xFF0C;&#x56DE;&#x60F3;&#x4E00;&#x4E0B;&#xFF0C;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x6A21;&#x578B;&#x6307;&#x7684;&#x662F;&#x8BBE;&#x7F6E;&#x6A21;&#x578B;&#x7684;&#x53C2;&#x6570;&#x4F7F;&#x5F97;&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x8868;&#x73B0;&#x8F83;&#x597D;&#x3002;&#x4E3A;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x9700;&#x8981;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x8861;&#x91CF;&#x6A21;&#x578B;&#x597D;&#x574F;&#x7684;&#x8BC4;&#x5B9A;&#x65B9;&#x6CD5;&#x3002;&#x5728;&#x7B2C;&#x4E8C;&#x7AE0;&#xFF0C;&#x6211;&#x4EEC;&#x4ECB;&#x7ECD;&#x5230;&#x5728;&#x56DE;&#x5F52;&#x6A21;&#x578B;&#x4E0A;&#xFF0C;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x8BC4;&#x5B9A;&#x6807;&#x51C6;&#x662F;&#x5747;&#x65B9;&#x6839;&#x8BEF;&#x5DEE;&#xFF08;RMSE&#xFF0C;&#x8BE6;&#x89C1;&#x516C;&#x5F0F; 2-1&#xFF09;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4E3A;&#x4E86;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x6A21;&#x578B;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x627E;&#x5230;&#x4E00;&#x4E2A; <img src="../images/tex-2554a2bb846cffd697389e5dc8912759.gif" alt="\theta"> &#x503C;&#xFF0C;&#x5B83;&#x4F7F;&#x5F97;&#x5747;&#x65B9;&#x6839;&#x8BEF;&#x5DEE;&#xFF08;&#x6807;&#x51C6;&#x8BEF;&#x5DEE;&#xFF09;&#x8FBE;&#x5230;&#x6700;&#x5C0F;&#x503C;&#x3002;&#x5B9E;&#x8DF5;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6700;&#x5C0F;&#x5316;&#x5747;&#x65B9;&#x8BEF;&#x5DEE;&#x6BD4;&#x6700;&#x5C0F;&#x5316;&#x5747;&#x65B9;&#x6839;&#x8BEF;&#x5DEE;&#x66F4;&#x52A0;&#x7684;&#x7B80;&#x5355;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x8FC7;&#x7A0B;&#x4F1A;&#x5F97;&#x5230;&#x76F8;&#x540C;&#x7684; <img src="../images/tex-2554a2bb846cffd697389e5dc8912759.gif" alt="\theta">&#xFF0C;&#x56E0;&#x4E3A;&#x51FD;&#x6570;&#x5728;&#x6700;&#x5C0F;&#x503C;&#x65F6;&#x5019;&#x7684;&#x81EA;&#x53D8;&#x91CF;&#xFF0C;&#x540C;&#x6837;&#x80FD;&#x4F7F;&#x51FD;&#x6570;&#x7684;&#x65B9;&#x6839;&#x8FD0;&#x7B97;&#x5F97;&#x5230;&#x6700;&#x5C0F;&#x503C;&#x3002;</p>
<p>&#x5728;&#x8BAD;&#x7EC3;&#x96C6; <img src="../images/tex-ca340abf4b48dc6d816137fbadf58b53.gif" alt="\mathbf{X}"> &#x4E0A;&#x4F7F;&#x7528;&#x516C;&#x5F0F; 4-3 &#x6765;&#x8BA1;&#x7B97;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x5047;&#x8BBE; <img src="../images/tex-b7ae93cd51ba1d38fe4ebac15eab3aa1.gif" alt="h_{\theta}"> &#x7684;&#x5747;&#x65B9;&#x5DEE;&#xFF08;<img src="../images/tex-a9fc1a03386ae38b64e06c8172994963.gif" alt="MSE">&#xFF09;&#x3002;</p>
<p>&#x516C;&#x5F0F; 4-3&#xFF1A;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x6A21;&#x578B;&#x7684; MSE &#x635F;&#x5931;&#x51FD;&#x6570;</p>
<p><img src="../images/tex-e42dee8953b9b2be4a3ed6f8c09e5314.gif" alt="MSE (\mathbf{X},h_{\theta}) = \frac{1}{m} \sum\limits_{i=1}^m{\left(\theta^T \cdot \mathbf{x}^{(i)}-y^{(i)}\right)}^2"></p>
<p>&#x516C;&#x5F0F;&#x4E2D;&#x7B26;&#x53F7;&#x7684;&#x542B;&#x4E49;&#x5927;&#x591A;&#x6570;&#x90FD;&#x5728;&#x7B2C;&#x4E8C;&#x7AE0;&#xFF08;&#x8BE6;&#x89C1;&#x201C;&#x7B26;&#x53F7;&#x201D;&#xFF09;&#x8FDB;&#x884C;&#x4E86;&#x8BF4;&#x660E;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF1A;&#x4E3A;&#x4E86;&#x7A81;&#x51FA;&#x6A21;&#x578B;&#x7684;&#x53C2;&#x6570;&#x5411;&#x91CF; <img src="../images/tex-2554a2bb846cffd697389e5dc8912759.gif" alt="\theta">&#xFF0C;&#x4F7F;&#x7528; <img src="../images/tex-b7ae93cd51ba1d38fe4ebac15eab3aa1.gif" alt="h_{\theta}"> &#x6765;&#x4EE3;&#x66FF; <img src="../images/tex-2510c39011c5be704182423e3a695e91.gif" alt="h">&#x3002;&#x4EE5;&#x540E;&#x7684;&#x4F7F;&#x7528;&#x4E2D;&#x4E3A;&#x4E86;&#x516C;&#x5F0F;&#x7684;&#x7B80;&#x6D01;&#xFF0C;&#x4F7F;&#x7528; <img src="../images/tex-e6e3116680e8cef8739f29e51e9ae4dc.gif" alt="MSE(\theta)"> &#x6765;&#x4EE3;&#x66FF; <img src="../images/tex-8fdec996997ab7fb44bf97399fda93c7.gif" alt="MSE(\mathbf{X},h _{\theta})">&#x3002;</p>
<h3 id="&#x6B63;&#x89C4;&#x65B9;&#x7A0B;the-normal-equation">&#x6B63;&#x89C4;&#x65B9;&#x7A0B;(The Normal Equation)</h3>
<p>&#x4E3A;&#x4E86;&#x627E;&#x5230;&#x6700;&#x5C0F;&#x5316;&#x635F;&#x5931;&#x51FD;&#x6570;&#x7684; <img src="../images/tex-2554a2bb846cffd697389e5dc8912759.gif" alt="\theta"> &#x503C;&#xFF0C;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x516C;&#x5F0F;&#x89E3;&#xFF0C;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5C31;&#x662F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x89E3;&#x6B63;&#x89C4;&#x65B9;&#x7A0B;&#x76F4;&#x63A5;&#x5F97;&#x5230;&#x6700;&#x540E;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x516C;&#x5F0F; 4-4&#xFF1A;&#x6B63;&#x89C4;&#x65B9;&#x7A0B;</p>
<p><img src="../images/tex-43bfb04cdbbd85ad21489e8e2dc853ed.gif" alt="\hat{\theta} = ({\mathbf{X}}^T\cdot\mathbf{X})^{-1}\cdot{\mathbf{X}}^T\cdot\mathbf{y}"></p>
<ul>
<li><img src="../images/tex-0678caa04da34220a4e8dc041488b618.gif" alt="\hat{\theta}"> &#x6307;&#x6700;&#x5C0F;&#x5316;&#x635F;&#x5931; <img src="../images/tex-2554a2bb846cffd697389e5dc8912759.gif" alt="\theta"> &#x7684;&#x503C;</li>
<li><img src="../images/tex-971f2023c1f5f54b8bd389bb06fa6d86.gif" alt="\mathbf{y}"> &#x662F;&#x4E00;&#x4E2A;&#x5411;&#x91CF;&#xFF0C;&#x5176;&#x5305;&#x542B;&#x4E86; <img src="../images/tex-a2c0f1b552d410257a2cc027b24757a9.gif" alt="y^{(1)}"> &#x5230; <img src="../images/tex-a4bd3c895fe9f194e30d5ce53dbb5fee.gif" alt="y^{(m)}"> &#x7684;&#x503C;</li>
</ul>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x751F;&#x6210;&#x4E00;&#x4E9B;&#x8FD1;&#x4F3C;&#x7EBF;&#x6027;&#x7684;&#x6570;&#x636E;&#xFF08;&#x5982;&#x56FE; 4-1&#xFF09;&#x6765;&#x6D4B;&#x8BD5;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;&#x65B9;&#x7A0B;&#x3002;</p>
<pre><code class="lang-python"><span class="hljs-keyword">import</span> numpy <span class="hljs-keyword">as</span> np
X = <span class="hljs-number">2</span> * np.random.rand(<span class="hljs-number">100</span>, <span class="hljs-number">1</span>)
y = <span class="hljs-number">4</span> + <span class="hljs-number">3</span> * X + np.random.randn(<span class="hljs-number">100</span>, <span class="hljs-number">1</span>)
</code></pre>
<p><img src="../images/chapter_4/&#x56FE;4-1.PNG" alt=""></p>
<p>&#x56FE; 4-1&#xFF1A;&#x968F;&#x673A;&#x7EBF;&#x6027;&#x6570;&#x636E;&#x96C6;</p>
<p>&#x73B0;&#x5728;&#x8BA9;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x6B63;&#x89C4;&#x65B9;&#x7A0B;&#x6765;&#x8BA1;&#x7B97; <img src="../images/tex-0678caa04da34220a4e8dc041488b618.gif" alt="\hat{\theta}">&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F7F;&#x7528; Numpy &#x7684;&#x7EBF;&#x6027;&#x4EE3;&#x6570;&#x6A21;&#x5757;&#xFF08;<code>np.linalg</code>&#xFF09;&#x4E2D;&#x7684;<code>inv()</code>&#x51FD;&#x6570;&#x6765;&#x8BA1;&#x7B97;&#x77E9;&#x9635;&#x7684;&#x9006;&#xFF0C;&#x4EE5;&#x53CA;<code>dot()</code>&#x65B9;&#x6CD5;&#x6765;&#x8BA1;&#x7B97;&#x77E9;&#x9635;&#x7684;&#x4E58;&#x6CD5;&#x3002;</p>
<pre><code class="lang-python">X_b = np.c_[np.ones((<span class="hljs-number">100</span>, <span class="hljs-number">1</span>)), X]
theta_best = np.linalg.inv(X_b.T.dot(X_b)).dot(X_b.T).dot(y)
</code></pre>
<p>&#x6211;&#x4EEC;&#x751F;&#x4EA7;&#x6570;&#x636E;&#x7684;&#x51FD;&#x6570;&#x5B9E;&#x9645;&#x4E0A;&#x662F; <img src="../images/tex-751d6173162c5bb7b6294ca57e03d5b1.gif" alt="y = 4 + 3x_0 + &#x9AD8;&#x65AF;&#x566A;&#x58F0;">&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x4E00;&#x4E0B;&#x6700;&#x540E;&#x7684;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x3002;</p>
<pre><code class="lang-python"><span class="hljs-meta">&gt;&gt;&gt; </span>theta_best
array([[<span class="hljs-number">4.21509616</span>],[<span class="hljs-number">2.77011339</span>]])
</code></pre>
<p>&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x6700;&#x540E;&#x5F97;&#x5230;&#x7684;&#x53C2;&#x6570;&#x4E3A; <img src="../images/tex-e62a4db03666029d1dc53713c5632ac6.gif" alt="\theta_0=4,\theta_1=3"> &#x800C;&#x4E0D;&#x662F; <img src="../images/tex-4443b7e9e72b482475432b88c0e4fdd8.gif" alt="\theta_0=3.865,\theta_1=3.139"> &#xFF08;&#x8BD1;&#x8005;&#x6CE8;&#xFF1A;&#x6211;&#x8BA4;&#x4E3A;&#x5E94;&#x8BE5;&#x662F; <img src="../images/tex-74747d7f311ae50d3c361e82606617d1.gif" alt="\theta_0=4.2150,\theta_1=2.7701">&#xFF09;&#x3002;&#x8FD9;&#x5DF2;&#x7ECF;&#x8DB3;&#x591F;&#x4E86;&#xFF0C;&#x7531;&#x4E8E;&#x5B58;&#x5728;&#x566A;&#x58F0;&#xFF0C;&#x53C2;&#x6570;&#x4E0D;&#x53EF;&#x80FD;&#x8FBE;&#x5230;&#x5230;&#x539F;&#x59CB;&#x51FD;&#x6570;&#x7684;&#x503C;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x4F7F;&#x7528; <img src="../images/tex-0678caa04da34220a4e8dc041488b618.gif" alt="\hat{\theta}"> &#x6765;&#x8FDB;&#x884C;&#x9884;&#x6D4B;&#xFF1A;</p>
<pre><code class="lang-python"><span class="hljs-meta">&gt;&gt;&gt; </span>X_new = np.array([[<span class="hljs-number">0</span>],[<span class="hljs-number">2</span>]])
<span class="hljs-meta">&gt;&gt;&gt; </span>X_new_b = np.c_[np.ones((<span class="hljs-number">2</span>, <span class="hljs-number">1</span>)), X_new]
<span class="hljs-meta">&gt;&gt;&gt; </span>y_predict = X_new_b.dot(theta_best)
<span class="hljs-meta">&gt;&gt;&gt; </span>y_predict
array([[<span class="hljs-number">4.21509616</span>],[<span class="hljs-number">9.75532293</span>]])
</code></pre>
<p>&#x753B;&#x51FA;&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#x7684;&#x56FE;&#x50CF;&#xFF0C;&#x5982;&#x56FE; 4-2</p>
<pre><code class="lang-python">plt.plot(X_new,y_predict,<span class="hljs-string">&quot;r-&quot;</span>)
plt.plot(X,y,<span class="hljs-string">&quot;b.&quot;</span>)
plt.axis([<span class="hljs-number">0</span>,<span class="hljs-number">2</span>,<span class="hljs-number">0</span>,<span class="hljs-number">15</span>])
plt.show()
</code></pre>
<p><img src="../images/chapter_4/&#x56FE;4-2.PNG" alt=""></p>
<p>&#x56FE;4-2&#xFF1A;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x9884;&#x6D4B;</p>
<p>&#x4F7F;&#x7528;&#x4E0B;&#x9762;&#x7684; Scikit-Learn &#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x8FBE;&#x5230;&#x76F8;&#x540C;&#x7684;&#x6548;&#x679C;&#xFF1A;</p>
<pre><code class="lang-python"><span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-keyword">from</span> sklearn.linear_model <span class="hljs-keyword">import</span> LinearRegression
<span class="hljs-meta">&gt;&gt;&gt; </span>lin_reg = LinearRegression()
<span class="hljs-meta">&gt;&gt;&gt; </span>lin_reg.fit(X,y)
<span class="hljs-meta">&gt;&gt;&gt; </span>lin_reg.intercept_, lin_reg.coef_
(array([<span class="hljs-number">4.21509616</span>]),array([<span class="hljs-number">2.77011339</span>]))
<span class="hljs-meta">&gt;&gt;&gt; </span>lin_reg.predict(X_new)
array([[<span class="hljs-number">4.21509616</span>],[<span class="hljs-number">9.75532293</span>]])
</code></pre>
<h3 id="&#x8BA1;&#x7B97;&#x590D;&#x6742;&#x5EA6;">&#x8BA1;&#x7B97;&#x590D;&#x6742;&#x5EA6;</h3>
<p>&#x6B63;&#x89C4;&#x65B9;&#x7A0B;&#x9700;&#x8981;&#x8BA1;&#x7B97;&#x77E9;&#x9635; <img src="../images/tex-e5949d4f83eb4e13761f2b76ab62386e.gif" alt="{\mathbf{X}}^T\cdot\mathbf{X}"> &#x7684;&#x9006;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A; <img src="../images/tex-6679fc33e499a90a99b97201f4d00ed5.gif" alt="n * n"> &#x7684;&#x77E9;&#x9635;&#xFF08;<img src="../images/tex-7b8b965ad4bca0e41ab51de7b31363a1.gif" alt="n"> &#x662F;&#x7279;&#x5F81;&#x7684;&#x4E2A;&#x6570;&#xFF09;&#x3002;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x77E9;&#x9635;&#x6C42;&#x9006;&#x7684;&#x8FD0;&#x7B97;&#x590D;&#x6742;&#x5EA6;&#x5927;&#x7EA6;&#x5728; <img src="../images/tex-31ba2ac7dbc438cef695358d6e49deb3.gif" alt="O(n^{2.4})"> &#x5230; <img src="../images/tex-4a7d22b39e93fbbcbe107e7a19e8bd34.gif" alt="O(n^3)"> &#x4E4B;&#x95F4;&#xFF0C;&#x5177;&#x4F53;&#x503C;&#x53D6;&#x51B3;&#x4E8E;&#x8BA1;&#x7B97;&#x65B9;&#x5F0F;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5C06;&#x4F60;&#x7684;&#x7279;&#x5F81;&#x4E2A;&#x6570;&#x7FFB;&#x500D;&#x7684;&#x8BDD;&#xFF0C;&#x5176;&#x8BA1;&#x7B97;&#x65F6;&#x95F4;&#x5927;&#x6982;&#x4F1A;&#x53D8;&#x4E3A;&#x539F;&#x6765;&#x7684; 5.3&#xFF08;<img src="../images/tex-61f8abcb13be8d0a51b2868de491d3a8.gif" alt="2^{2.4}">&#xFF09;&#x5230; 8&#xFF08;<img src="../images/tex-5b9a77af89d04a685b4f649da485aed3.gif" alt="2^3">&#xFF09;&#x500D;&#x3002;</p>
<blockquote>
<p>&#x63D0;&#x793A;</p>
<p>&#x5F53;&#x7279;&#x5F81;&#x7684;&#x4E2A;&#x6570;&#x8F83;&#x5927;&#x7684;&#x65F6;&#x5019;&#xFF08;&#x4F8B;&#x5982;&#xFF1A;&#x7279;&#x5F81;&#x6570;&#x91CF;&#x4E3A; 100000&#xFF09;&#xFF0C;&#x6B63;&#x89C4;&#x65B9;&#x7A0B;&#x6C42;&#x89E3;&#x5C06;&#x4F1A;&#x975E;&#x5E38;&#x6162;&#x3002;</p>
</blockquote>
<p>&#x6709;&#x5229;&#x7684;&#x4E00;&#x9762;&#x662F;&#xFF0C;&#x8FD9;&#x4E2A;&#x65B9;&#x7A0B;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#x6765;&#x8BF4;&#x662F;&#x7EBF;&#x6027;&#x7684;&#xFF0C;&#x5176;&#x590D;&#x6742;&#x5EA6;&#x4E3A; <img src="../images/tex-0e2ae329177722b1818828e92b441032.gif" alt="O(m)">&#xFF0C;&#x56E0;&#x6B64;&#x53EA;&#x8981;&#x6709;&#x80FD;&#x653E;&#x5F97;&#x4E0B;&#x5B83;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x5B83;&#x5C31;&#x53EF;&#x4EE5;&#x5BF9;&#x5927;&#x89C4;&#x6A21;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x4E00;&#x65E6;&#x4F60;&#x5F97;&#x5230;&#x4E86;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x6A21;&#x578B;&#xFF08;&#x901A;&#x8FC7;&#x89E3;&#x6B63;&#x89C4;&#x65B9;&#x7A0B;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x7684;&#x7B97;&#x6CD5;&#xFF09;&#xFF0C;&#x8FDB;&#x884C;&#x9884;&#x6D4B;&#x662F;&#x975E;&#x5E38;&#x5FEB;&#x7684;&#x3002;&#x56E0;&#x4E3A;&#x6A21;&#x578B;&#x4E2D;&#x8BA1;&#x7B97;&#x590D;&#x6742;&#x5EA6;&#x5BF9;&#x4E8E;&#x8981;&#x8FDB;&#x884C;&#x9884;&#x6D4B;&#x7684;&#x5B9E;&#x4F8B;&#x6570;&#x91CF;&#x548C;&#x7279;&#x5F81;&#x4E2A;&#x6570;&#x90FD;&#x662F;&#x7EBF;&#x6027;&#x7684;&#x3002; &#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5F53;&#x5B9E;&#x4F8B;&#x4E2A;&#x6570;&#x53D8;&#x4E3A;&#x539F;&#x6765;&#x7684;&#x4E24;&#x500D;&#x591A;&#x7684;&#x65F6;&#x5019;&#xFF08;&#x6216;&#x7279;&#x5F81;&#x4E2A;&#x6570;&#x53D8;&#x4E3A;&#x539F;&#x6765;&#x7684;&#x4E24;&#x500D;&#x591A;&#xFF09;&#xFF0C;&#x9884;&#x6D4B;&#x65F6;&#x95F4;&#x4E5F;&#x4EC5;&#x4EC5;&#x662F;&#x539F;&#x6765;&#x7684;&#x4E24;&#x500D;&#x591A;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4ECB;&#x7ECD;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x53BB;&#x8BAD;&#x7EC3;&#x6A21;&#x578B;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x9002;&#x5408;&#x5728;&#x7279;&#x5F81;&#x4E2A;&#x6570;&#x975E;&#x5E38;&#x591A;&#xFF0C;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#x975E;&#x5E38;&#x591A;&#xFF0C;&#x5185;&#x5B58;&#x65E0;&#x6CD5;&#x6EE1;&#x8DB3;&#x8981;&#x6C42;&#x7684;&#x65F6;&#x5019;&#x4F7F;&#x7528;&#x3002;</p>
<h2 id="&#x68AF;&#x5EA6;&#x4E0B;&#x964D;">&#x68AF;&#x5EA6;&#x4E0B;&#x964D;</h2>
<p>&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x662F;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x901A;&#x7528;&#x7684;&#x4F18;&#x5316;&#x7B97;&#x6CD5;&#xFF0C;&#x5B83;&#x80FD;&#x591F;&#x5F88;&#x597D;&#x5730;&#x89E3;&#x51B3;&#x4E00;&#x7CFB;&#x5217;&#x95EE;&#x9898;&#x3002;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7684;&#x6574;&#x4F53;&#x601D;&#x8DEF;&#x662F;&#x901A;&#x8FC7;&#x7684;&#x8FED;&#x4EE3;&#x6765;&#x9010;&#x6E10;&#x8C03;&#x6574;&#x53C2;&#x6570;&#x4F7F;&#x5F97;&#x635F;&#x5931;&#x51FD;&#x6570;&#x8FBE;&#x5230;&#x6700;&#x5C0F;&#x503C;&#x3002;</p>
<p>&#x5047;&#x8BBE;&#x6D53;&#x96FE;&#x4E0B;&#xFF0C;&#x4F60;&#x8FF7;&#x5931;&#x5728;&#x4E86;&#x5927;&#x5C71;&#x4E2D;&#xFF0C;&#x4F60;&#x53EA;&#x80FD;&#x611F;&#x53D7;&#x5230;&#x81EA;&#x5DF1;&#x811A;&#x4E0B;&#x7684;&#x5761;&#x5EA6;&#x3002;&#x4E3A;&#x4E86;&#x6700;&#x5FEB;&#x5230;&#x8FBE;&#x5C71;&#x5E95;&#xFF0C;&#x4E00;&#x4E2A;&#x6700;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x6CBF;&#x7740;&#x5761;&#x5EA6;&#x6700;&#x9661;&#x7684;&#x5730;&#x65B9;&#x4E0B;&#x5C71;&#x3002;&#x8FD9;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x6240;&#x505A;&#x7684;&#xFF1A;&#x5B83;&#x8BA1;&#x7B97;&#x8BEF;&#x5DEE;&#x51FD;&#x6570;&#x5173;&#x4E8E;&#x53C2;&#x6570;&#x5411;&#x91CF;<img src="../images/tex-2554a2bb846cffd697389e5dc8912759.gif" alt="\theta">&#x7684;&#x5C40;&#x90E8;&#x68AF;&#x5EA6;&#xFF0C;&#x540C;&#x65F6;&#x5B83;&#x6CBF;&#x7740;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7684;&#x65B9;&#x5411;&#x8FDB;&#x884C;&#x4E0B;&#x4E00;&#x6B21;&#x8FED;&#x4EE3;&#x3002;&#x5F53;&#x68AF;&#x5EA6;&#x503C;&#x4E3A;&#x96F6;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x8FBE;&#x5230;&#x4E86;&#x8BEF;&#x5DEE;&#x51FD;&#x6570;&#x6700;&#x5C0F;&#x503C; &#x3002;</p>
<p>&#x5177;&#x4F53;&#x6765;&#x8BF4;&#xFF0C;&#x5F00;&#x59CB;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x9009;&#x5B9A;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x7684;<img src="../images/tex-2554a2bb846cffd697389e5dc8912759.gif" alt="\theta">&#xFF08;&#x8FD9;&#x4E2A;&#x503C;&#x79F0;&#x4E3A;&#x968F;&#x673A;&#x521D;&#x59CB;&#x503C;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x9010;&#x6E10;&#x53BB;&#x6539;&#x8FDB;&#x5B83;&#xFF0C;&#x6BCF;&#x4E00;&#x6B21;&#x53D8;&#x5316;&#x4E00;&#x5C0F;&#x6B65;&#xFF0C;&#x6BCF;&#x4E00;&#x6B65;&#x90FD;&#x8BD5;&#x7740;&#x964D;&#x4F4E;&#x635F;&#x5931;&#x51FD;&#x6570;&#xFF08;&#x4F8B;&#x5982;&#xFF1A;&#x5747;&#x65B9;&#x5DEE;&#x635F;&#x5931;&#x51FD;&#x6570;&#xFF09;&#xFF0C;&#x76F4;&#x5230;&#x7B97;&#x6CD5;&#x6536;&#x655B;&#x5230;&#x4E00;&#x4E2A;&#x6700;&#x5C0F;&#x503C;&#xFF08;&#x5982;&#x56FE;&#xFF1A;4-3&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_4/&#x56FE;4-3.PNG" alt=""></p>
<p>&#x56FE; 4-3&#xFF1A;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;</p>
<p>&#x5728;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x4E2D;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x53C2;&#x6570;&#x662F;&#x6B65;&#x957F;&#xFF0C;&#x8D85;&#x53C2;&#x6570;&#x5B66;&#x4E60;&#x7387;&#x7684;&#x503C;&#x51B3;&#x5B9A;&#x4E86;&#x6B65;&#x957F;&#x7684;&#x5927;&#x5C0F;&#x3002;&#x5982;&#x679C;&#x5B66;&#x4E60;&#x7387;&#x592A;&#x5C0F;&#xFF0C;&#x5FC5;&#x987B;&#x7ECF;&#x8FC7;&#x591A;&#x6B21;&#x8FED;&#x4EE3;&#xFF0C;&#x7B97;&#x6CD5;&#x624D;&#x80FD;&#x6536;&#x655B;&#xFF0C;&#x8FD9;&#x662F;&#x975E;&#x5E38;&#x8017;&#x65F6;&#x7684;&#xFF08;&#x5982;&#x56FE; 4-4&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_4/&#x56FE;4-4.PNG" alt=""></p>
<p>&#x56FE; 4-4:&#x5B66;&#x4E60;&#x7387;&#x8FC7;&#x5C0F;</p>
<p>&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5982;&#x679C;&#x5B66;&#x4E60;&#x7387;&#x592A;&#x5927;&#xFF0C;&#x4F60;&#x5C06;&#x8DF3;&#x8FC7;&#x6700;&#x4F4E;&#x70B9;&#xFF0C;&#x5230;&#x8FBE;&#x5C71;&#x8C37;&#x7684;&#x53E6;&#x4E00;&#x9762;&#xFF0C;&#x53EF;&#x80FD;&#x4E0B;&#x4E00;&#x6B21;&#x7684;&#x503C;&#x6BD4;&#x4E0A;&#x4E00;&#x6B21;&#x8FD8;&#x8981;&#x5927;&#x3002;&#x8FD9;&#x53EF;&#x80FD;&#x4F7F;&#x7684;&#x7B97;&#x6CD5;&#x662F;&#x53D1;&#x6563;&#x7684;&#xFF0C;&#x51FD;&#x6570;&#x503C;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x5927;&#xFF0C;&#x6C38;&#x8FDC;&#x4E0D;&#x53EF;&#x80FD;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x7B54;&#x6848;&#xFF08;&#x5982;&#x56FE; 4-5&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_4/&#x56FE;4-5.PNG" alt=""></p>
<p>&#x56FE; 4-5&#xFF1A;&#x5B66;&#x4E60;&#x7387;&#x8FC7;&#x5927;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7684;&#x635F;&#x5931;&#x51FD;&#x6570;&#x770B;&#x8D77;&#x6765;&#x90FD;&#x50CF;&#x4E00;&#x4E2A;&#x89C4;&#x5219;&#x7684;&#x7897;&#x3002;&#x5B83;&#x4EEC;&#x53EF;&#x80FD;&#x662F;&#x6D1E;&#xFF0C;&#x5C71;&#x810A;&#xFF0C;&#x9AD8;&#x539F;&#x548C;&#x5404;&#x79CD;&#x4E0D;&#x89C4;&#x5219;&#x7684;&#x5730;&#x5F62;&#xFF0C;&#x4F7F;&#x5B83;&#x4EEC;&#x6536;&#x655B;&#x5230;&#x6700;&#x5C0F;&#x503C;&#x975E;&#x5E38;&#x7684;&#x56F0;&#x96BE;&#x3002; &#x56FE; 4-6 &#x663E;&#x793A;&#x4E86;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7684;&#x4E24;&#x4E2A;&#x4E3B;&#x8981;&#x6311;&#x6218;&#xFF1A;&#x5982;&#x679C;&#x968F;&#x673A;&#x521D;&#x59CB;&#x503C;&#x9009;&#x5728;&#x4E86;&#x56FE;&#x50CF;&#x7684;&#x5DE6;&#x4FA7;&#xFF0C;&#x5219;&#x5B83;&#x5C06;&#x6536;&#x655B;&#x5230;&#x5C40;&#x90E8;&#x6700;&#x5C0F;&#x503C;&#xFF0C;&#x8FD9;&#x4E2A;&#x503C;&#x8981;&#x6BD4;&#x5168;&#x5C40;&#x6700;&#x5C0F;&#x503C;&#x8981;&#x5927;&#x3002; &#x5982;&#x679C;&#x5B83;&#x4ECE;&#x53F3;&#x4FA7;&#x5F00;&#x59CB;&#xFF0C;&#x90A3;&#x4E48;&#x8DE8;&#x8D8A;&#x9AD8;&#x539F;&#x5C06;&#x9700;&#x8981;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x65E9;&#x65E9;&#x5730;&#x7ED3;&#x675F;&#x8BAD;&#x7EC3;&#xFF0C;&#x4F60;&#x5C06;&#x6C38;&#x8FDC;&#x5230;&#x4E0D;&#x4E86;&#x5168;&#x5C40;&#x6700;&#x5C0F;&#x503C;&#x3002;</p>
<p><img src="../images/chapter_4/&#x56FE;4-6.PNG" alt=""></p>
<p>&#x56FE; 4-6&#xFF1A;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7684;&#x9677;&#x9631;</p>
<p>&#x5E78;&#x8FD0;&#x7684;&#x662F;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x6A21;&#x578B;&#x7684;&#x5747;&#x65B9;&#x5DEE;&#x635F;&#x5931;&#x51FD;&#x6570;&#x662F;&#x4E00;&#x4E2A;&#x51F8;&#x51FD;&#x6570;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5982;&#x679C;&#x4F60;&#x9009;&#x62E9;&#x66F2;&#x7EBF;&#x4E0A;&#x7684;&#x4EFB;&#x610F;&#x4E24;&#x70B9;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x8FDE;&#x7EBF;&#x6BB5;&#x4E0D;&#x4F1A;&#x4E0E;&#x66F2;&#x7EBF;&#x53D1;&#x751F;&#x4EA4;&#x53C9;&#xFF08;&#x8BD1;&#x8005;&#x6CE8;&#xFF1A;&#x8BE5;&#x7EBF;&#x6BB5;&#x4E0D;&#x4F1A;&#x4E0E;&#x66F2;&#x7EBF;&#x6709;&#x7B2C;&#x4E09;&#x4E2A;&#x4EA4;&#x70B9;&#xFF09;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x8FD9;&#x4E2A;&#x635F;&#x5931;&#x51FD;&#x6570;&#x6CA1;&#x6709;&#x5C40;&#x90E8;&#x6700;&#x5C0F;&#x503C;&#xFF0C;&#x4EC5;&#x4EC5;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x6700;&#x5C0F;&#x503C;&#x3002;&#x540C;&#x65F6;&#x5B83;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x659C;&#x7387;&#x4E0D;&#x80FD;&#x7A81;&#x53D8;&#x7684;&#x8FDE;&#x7EED;&#x51FD;&#x6570;&#x3002;&#x8FD9;&#x4E24;&#x4E2A;&#x56E0;&#x7D20;&#x5BFC;&#x81F4;&#x4E86;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x7ED3;&#x679C;&#xFF1A;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x53EF;&#x4EE5;&#x65E0;&#x9650;&#x63A5;&#x8FD1;&#x5168;&#x5C40;&#x6700;&#x5C0F;&#x503C;&#x3002;&#xFF08;&#x53EA;&#x8981;&#x4F60;&#x8BAD;&#x7EC3;&#x65F6;&#x95F4;&#x8DB3;&#x591F;&#x957F;&#xFF0C;&#x540C;&#x65F6;&#x5B66;&#x4E60;&#x7387;&#x4E0D;&#x662F;&#x592A;&#x5927; &#xFF09;&#x3002;</p>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x635F;&#x5931;&#x51FD;&#x6570;&#x7684;&#x56FE;&#x50CF;&#x5448;&#x73B0;&#x7897;&#x72B6;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x540C;&#x7279;&#x5F81;&#x7684;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x76F8;&#x5DEE;&#x8F83;&#x5927;&#x7684;&#x65F6;&#xFF0C;&#x8FD9;&#x4E2A;&#x7897;&#x53EF;&#x80FD;&#x662F;&#x7EC6;&#x957F;&#x7684;&#x3002;&#x56FE; 4-7 &#x5C55;&#x793A;&#x4E86;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x5728;&#x4E0D;&#x540C;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x7684;&#x8868;&#x73B0;&#x3002;&#x5728;&#x5DE6;&#x56FE;&#x4E2D;&#xFF0C;&#x7279;&#x5F81; 1 &#x548C;&#x7279;&#x5F81; 2 &#x6709;&#x7740;&#x76F8;&#x540C;&#x7684;&#x6570;&#x503C;&#x5C3A;&#x5EA6;&#x3002;&#x5728;&#x53F3;&#x56FE;&#x4E2D;&#xFF0C;&#x7279;&#x5F81; 1 &#x6BD4;&#x7279;&#x5F81;2&#x7684;&#x53D6;&#x503C;&#x8981;&#x5C0F;&#x7684;&#x591A;&#xFF0C;&#x7531;&#x4E8E;&#x7279;&#x5F81; 1 &#x8F83;&#x5C0F;&#xFF0C;&#x56E0;&#x6B64;&#x635F;&#x5931;&#x51FD;&#x6570;&#x6539;&#x53D8;&#x65F6;&#xFF0C;<img src="../images/tex-7672d625e9a2492987c50d3b87c04349.gif" alt="\theta_1"> &#x4F1A;&#x6709;&#x8F83;&#x5927;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x4E8E;&#x662F;&#x8FD9;&#x4E2A;&#x56FE;&#x50CF;&#x4F1A;&#x5728;<img src="../images/tex-7672d625e9a2492987c50d3b87c04349.gif" alt="\theta_1">&#x8F74;&#x65B9;&#x5411;&#x53D8;&#x5F97;&#x7EC6;&#x957F;&#x3002;</p>
<p><img src="../images/chapter_4/&#x56FE;4-7.PNG" alt=""></p>
<p>&#x56FE; 4-7&#xFF1A;&#x6709;&#x65E0;&#x7279;&#x5F81;&#x7F29;&#x653E;&#x7684;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;</p>
<p>&#x6B63;&#x5982;&#x4F60;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x5DE6;&#x9762;&#x7684;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5FEB;&#x901F;&#x5730;&#x5230;&#x8FBE;&#x6700;&#x5C0F;&#x503C;&#xFF0C;&#x7136;&#x800C;&#x5728;&#x53F3;&#x9762;&#x7684;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7B2C;&#x4E00;&#x6B21;&#x524D;&#x8FDB;&#x7684;&#x65B9;&#x5411;&#x51E0;&#x4E4E;&#x548C;&#x5168;&#x5C40;&#x6700;&#x5C0F;&#x503C;&#x7684;&#x65B9;&#x5411;&#x5782;&#x76F4;&#xFF0C;&#x5E76;&#x4E14;&#x6700;&#x540E;&#x5230;&#x8FBE;&#x4E00;&#x4E2A;&#x51E0;&#x4E4E;&#x5E73;&#x5766;&#x7684;&#x5C71;&#x8C37;&#xFF0C;&#x5728;&#x5E73;&#x5766;&#x7684;&#x5C71;&#x8C37;&#x8D70;&#x4E86;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#x3002;&#x5B83;&#x6700;&#x7EC8;&#x4F1A;&#x8FBE;&#x5230;&#x6700;&#x5C0F;&#x503C;&#xFF0C;&#x4F46;&#x5B83;&#x9700;&#x8981;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#x3002;</p>
<blockquote>
<p>&#x63D0;&#x793A;</p>
<p>&#x5F53;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5E94;&#x8BE5;&#x786E;&#x4FDD;&#x6240;&#x6709;&#x7684;&#x7279;&#x5F81;&#x6709;&#x7740;&#x76F8;&#x8FD1;&#x7684;&#x5C3A;&#x5EA6;&#x8303;&#x56F4;&#xFF08;&#x4F8B;&#x5982;&#xFF1A;&#x4F7F;&#x7528; Scikit Learn &#x7684; <code>StandardScaler</code>&#x7C7B;&#xFF09;&#xFF0C;&#x5426;&#x5219;&#x5B83;&#x5C06;&#x9700;&#x8981;&#x5F88;&#x957F;&#x7684;&#x65F6;&#x95F4;&#x624D;&#x80FD;&#x591F;&#x6536;&#x655B;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x5E45;&#x56FE;&#x4E5F;&#x8868;&#x660E;&#x4E86;&#x4E00;&#x4E2A;&#x4E8B;&#x5B9E;&#xFF1A;&#x8BAD;&#x7EC3;&#x6A21;&#x578B;&#x610F;&#x5473;&#x7740;&#x627E;&#x5230;&#x4E00;&#x7EC4;&#x6A21;&#x578B;&#x53C2;&#x6570;&#xFF0C;&#x8FD9;&#x7EC4;&#x53C2;&#x6570;&#x53EF;&#x4EE5;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x4F7F;&#x5F97;&#x635F;&#x5931;&#x51FD;&#x6570;&#x6700;&#x5C0F;&#x3002;&#x8FD9;&#x662F;&#x5BF9;&#x4E8E;&#x6A21;&#x578B;&#x53C2;&#x6570;&#x7A7A;&#x95F4;&#x7684;&#x641C;&#x7D22;&#xFF0C;&#x6A21;&#x578B;&#x7684;&#x53C2;&#x6570;&#x8D8A;&#x591A;&#xFF0C;&#x53C2;&#x6570;&#x7A7A;&#x95F4;&#x7684;&#x7EF4;&#x5EA6;&#x8D8A;&#x591A;&#xFF0C;&#x627E;&#x5230;&#x5408;&#x9002;&#x7684;&#x53C2;&#x6570;&#x8D8A;&#x56F0;&#x96BE;&#x3002;&#x4F8B;&#x5982;&#x5728;300&#x7EF4;&#x7684;&#x7A7A;&#x95F4;&#x627E;&#x5230;&#x4E00;&#x679A;&#x9488;&#x8981;&#x6BD4;&#x5728;&#x4E09;&#x7EF4;&#x7A7A;&#x95F4;&#x91CC;&#x627E;&#x5230;&#x4E00;&#x679A;&#x9488;&#x590D;&#x6742;&#x7684;&#x591A;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x6A21;&#x578B;&#x7684;&#x635F;&#x5931;&#x51FD;&#x6570;&#x662F;&#x51F8;&#x51FD;&#x6570;&#xFF0C;&#x8FD9;&#x4E2A;&#x6700;&#x4F18;&#x53C2;&#x6570;&#x4E00;&#x5B9A;&#x5728;&#x7897;&#x7684;&#x5E95;&#x90E8;&#x3002;</p>
<h3 id="&#x6279;&#x91CF;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;">&#x6279;&#x91CF;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;</h3>
<p>&#x4F7F;&#x7528;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x8BA1;&#x7B97;&#x6BCF;&#x4E00;&#x4E2A; <img src="../images/tex-cb0e17d96e58d55d1eb06dc1b14b7a7b.gif" alt="\theta_j"> &#x4E0B;&#x635F;&#x5931;&#x51FD;&#x6570;&#x7684;&#x68AF;&#x5EA6;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x8BA1;&#x7B97;&#x5F53;<img src="../images/tex-cb0e17d96e58d55d1eb06dc1b14b7a7b.gif" alt="\theta_j">&#x53D8;&#x5316;&#x4E00;&#x70B9;&#x70B9;&#x65F6;&#xFF0C;&#x635F;&#x5931;&#x51FD;&#x6570;&#x6539;&#x53D8;&#x4E86;&#x591A;&#x5C11;&#x3002;&#x8FD9;&#x79F0;&#x4E3A;&#x504F;&#x5BFC;&#x6570;&#xFF0C;&#x5B83;&#x5C31;&#x50CF;&#x5F53;&#x4F60;&#x9762;&#x5BF9;&#x4E1C;&#x65B9;&#x7684;&#x65F6;&#x5019;&#x95EE;&#xFF1A;&quot;&#x6211;&#x811A;&#x4E0B;&#x7684;&#x5761;&#x5EA6;&#x662F;&#x591A;&#x5C11;&#xFF1F;&quot;&#x3002;&#x7136;&#x540E;&#x9762;&#x5411;&#x5317;&#x65B9;&#x7684;&#x65F6;&#x5019;&#x95EE;&#x540C;&#x6837;&#x7684;&#x95EE;&#x9898;&#xFF08;&#x5982;&#x679C;&#x4F60;&#x80FD;&#x60F3;&#x8C61;&#x4E00;&#x4E2A;&#x8D85;&#x8FC7;&#x4E09;&#x7EF4;&#x7684;&#x5B87;&#x5B99;&#xFF0C;&#x53EF;&#x4EE5;&#x5BF9;&#x6240;&#x6709;&#x7684;&#x65B9;&#x5411;&#x90FD;&#x8FD9;&#x6837;&#x505A;&#xFF09;&#x3002;&#x516C;&#x5F0F; 4-5 &#x8BA1;&#x7B97;&#x5173;&#x4E8E; <img src="../images/tex-cb0e17d96e58d55d1eb06dc1b14b7a7b.gif" alt="\theta_j"> &#x7684;&#x635F;&#x5931;&#x51FD;&#x6570;&#x7684;&#x504F;&#x5BFC;&#x6570;&#xFF0C;&#x8BB0;&#x4E3A; <img src="../images/tex-5c3b6b00cffc9732138715003b0e557a.gif" alt="\frac{\partial }{\partial \theta_j}MSE(\theta)">&#x3002;</p>
<p>&#x516C;&#x5F0F; 4-5&#xFF1A; &#x635F;&#x5931;&#x51FD;&#x6570;&#x7684;&#x504F;&#x5BFC;&#x6570;</p>
<p><img src="../images/tex-3a877201402d7cd2b9d3f5b726d22b24.gif" alt="\frac{\partial }{\partial \theta_j}MSE(\theta)=\frac{2}{m} \sum\limits_{i=1}^m{\left(\theta^T \cdot \mathbf{x}^{(i)}-y^{(i)}\right)}{x_j}^{(i)}"></p>
<p>&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x5355;&#x72EC;&#x8BA1;&#x7B97;&#x6BCF;&#x4E00;&#x4E2A;&#x68AF;&#x5EA6;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x516C;&#x5F0F; 4-6 &#x6765;&#x4E00;&#x8D77;&#x8BA1;&#x7B97;&#x5B83;&#x4EEC;&#x3002;&#x68AF;&#x5EA6;&#x5411;&#x91CF;&#x8BB0;&#x4E3A; <img src="../images/tex-2046197f9491e759ad46d9ee09227c01.gif" alt="\nabla_{\theta}MSE(\theta)">&#xFF0C;&#x5176;&#x5305;&#x542B;&#x4E86;&#x635F;&#x5931;&#x51FD;&#x6570;&#x6240;&#x6709;&#x7684;&#x504F;&#x5BFC;&#x6570;&#xFF08;&#x6BCF;&#x4E2A;&#x6A21;&#x578B;&#x53C2;&#x6570;&#x53EA;&#x51FA;&#x73B0;&#x4E00;&#x6B21;&#xFF09;&#x3002;</p>
<p>&#x516C;&#x5F0F; 4-6&#xFF1A;&#x635F;&#x5931;&#x51FD;&#x6570;&#x7684;&#x68AF;&#x5EA6;&#x5411;&#x91CF;</p>
<p><img src="../images/tex-a007d1162d9c4957e8336b4b10d5fda3.gif" alt="\nabla_{\theta}MSE(\theta)= \left(\begin{matrix} \frac{\partial }{\partial \theta_0}MSE(\theta)\\ \frac{\partial }{\partial \theta_1}MSE(\theta)\\ \vdots \\ \frac{\partial }{\partial \theta_n}MSE(\theta)\\ \end{matrix}\right)=\frac{2}{m}{\mathbf{X}}^T\cdot{(\mathbf{X}\cdot\theta-y)}"></p>
<blockquote>
<p>&#x63D0;&#x793A;</p>
<p>&#x5728;&#x8FD9;&#x4E2A;&#x65B9;&#x7A0B;&#x4E2D;&#x6BCF;&#x4E00;&#x6B65;&#x8BA1;&#x7B97;&#x65F6;&#x90FD;&#x5305;&#x542B;&#x4E86;&#x6574;&#x4E2A;&#x8BAD;&#x7EC3;&#x96C6; <img src="../images/tex-ca340abf4b48dc6d816137fbadf58b53.gif" alt="\mathbf{X}">&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x79F0;&#x4E3A;&#x6279;&#x91CF;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#xFF1A;&#x6BCF;&#x4E00;&#x6B21;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#x90FD;&#x4F7F;&#x7528;&#x6240;&#x6709;&#x7684;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x5927;&#x6570;&#x636E;&#x96C6;&#x4E0A;&#xFF0C;&#x5176;&#x4F1A;&#x53D8;&#x5F97;&#x76F8;&#x5F53;&#x7684;&#x6162;&#xFF08;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x63A5;&#x4E0B;&#x6765;&#x5C06;&#x4F1A;&#x4ECB;&#x7ECD;&#x66F4;&#x5FEB;&#x7684;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7B97;&#x6CD5;&#xFF09;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7684;&#x8FD0;&#x7B97;&#x89C4;&#x6A21;&#x548C;&#x7279;&#x5F81;&#x7684;&#x6570;&#x91CF;&#x6210;&#x6B63;&#x6BD4;&#x3002;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x6570;&#x5343;&#x6570;&#x91CF;&#x7279;&#x5F81;&#x7684;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x6A21;&#x578B;&#x4F7F;&#x7528;*&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x8981;&#x6BD4;&#x4F7F;&#x7528;&#x6B63;&#x89C4;&#x65B9;&#x7A0B;&#x5FEB;&#x7684;&#x591A;&#x3002;</p>
</blockquote>
<p>&#x4E00;&#x65E6;&#x6C42;&#x5F97;&#x4E86;&#x65B9;&#x5411;&#x662F;&#x4E0A;&#x5C71;&#x7684;&#x68AF;&#x5EA6;&#x5411;&#x91CF;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x5411;&#x7740;&#x76F8;&#x53CD;&#x7684;&#x65B9;&#x5411;&#x53BB;&#x4E0B;&#x5C71;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4ECE; <img src="../images/tex-2554a2bb846cffd697389e5dc8912759.gif" alt="\theta"> &#x4E2D;&#x51CF;&#x53BB; <img src="../images/tex-2046197f9491e759ad46d9ee09227c01.gif" alt="\nabla_{\theta}MSE(\theta)">&#x3002;&#x5B66;&#x4E60;&#x7387; <img src="../images/tex-ffe9f913124f345732e9f00fa258552e.gif" alt="\eta"> &#x548C;&#x68AF;&#x5EA6;&#x5411;&#x91CF;&#x7684;&#x79EF;&#x51B3;&#x5B9A;&#x4E86;&#x4E0B;&#x5C71;&#x65F6;&#x6BCF;&#x4E00;&#x6B65;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x5982;&#x516C;&#x5F0F; 4-7&#x3002;</p>
<p>&#x516C;&#x5F0F; 4-7&#xFF1A;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x6B65;&#x957F;</p>
<p><img src="../images/tex-e25626090e2c767f539550e3c02fa6c8.gif" alt="\theta^{(next\ step)}=\theta - \eta\nabla_{\theta}MSE(\theta)"></p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x7684;&#x5E94;&#x7528;&#xFF1A;</p>
<pre><code class="lang-python">eta = <span class="hljs-number">0.1</span> <span class="hljs-comment"># &#x5B66;&#x4E60;&#x7387;</span>
n_iterations = <span class="hljs-number">1000</span>
m = <span class="hljs-number">100</span>

theta = np.random.randn(<span class="hljs-number">2</span>,<span class="hljs-number">1</span>) <span class="hljs-comment"># &#x968F;&#x673A;&#x521D;&#x59CB;&#x503C;</span>

<span class="hljs-keyword">for</span> iteration <span class="hljs-keyword">in</span> range(n_iterations):
    gradients = <span class="hljs-number">2</span>/m * X_b.T.dot(X_b.dot(theta) - y)
    theta = theta - eta * gradients
</code></pre>
<p>&#x8FD9;&#x4E0D;&#x662F;&#x592A;&#x96BE;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x4E00;&#x4E0B;&#x6700;&#x540E;&#x7684;&#x7ED3;&#x679C; <img src="../images/tex-2554a2bb846cffd697389e5dc8912759.gif" alt="\theta">&#xFF1A;</p>
<pre><code class="lang-python"><span class="hljs-meta">&gt;&gt;&gt; </span>theta
array([[<span class="hljs-number">4.21509616</span>],[<span class="hljs-number">2.77011339</span>]])
</code></pre>
<p>&#x770B;&#xFF01;&#x6B63;&#x89C4;&#x65B9;&#x7A0B;&#x7684;&#x8868;&#x73B0;&#x975E;&#x5E38;&#x597D;&#x3002;&#x5B8C;&#x7F8E;&#x5730;&#x6C42;&#x51FA;&#x4E86;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7684;&#x53C2;&#x6570;&#x3002;&#x4F46;&#x662F;&#x5F53;&#x4F60;&#x6362;&#x4E00;&#x4E2A;&#x5B66;&#x4E60;&#x7387;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#xFF1F;&#x56FE; 4-8 &#x5C55;&#x793A;&#x4E86;&#x4F7F;&#x7528;&#x4E86;&#x4E09;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x5B66;&#x4E60;&#x7387;&#x8FDB;&#x884C;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7684;&#x524D; 10 &#x6B65;&#x8FD0;&#x7B97;&#xFF08;&#x865A;&#x7EBF;&#x4EE3;&#x8868;&#x8D77;&#x59CB;&#x4F4D;&#x7F6E;&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_4/&#x56FE;4-8.PNG" alt=""></p>
<p>&#x56FE; 4-8&#xFF1A;&#x4E0D;&#x540C;&#x5B66;&#x4E60;&#x7387;&#x7684;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;</p>
<p>&#x5728;&#x5DE6;&#x9762;&#x7684;&#x90A3;&#x526F;&#x56FE;&#x4E2D;&#xFF0C;&#x5B66;&#x4E60;&#x7387;&#x662F;&#x6700;&#x5C0F;&#x7684;&#xFF0C;&#x7B97;&#x6CD5;&#x51E0;&#x4E4E;&#x4E0D;&#x80FD;&#x6C42;&#x51FA;&#x6700;&#x540E;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x4F1A;&#x82B1;&#x8D39;&#x5927;&#x91CF;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x5728;&#x4E2D;&#x95F4;&#x7684;&#x8FD9;&#x5E45;&#x56FE;&#x4E2D;&#xFF0C;&#x5B66;&#x4E60;&#x7387;&#x7684;&#x8868;&#x73B0;&#x770B;&#x8D77;&#x6765;&#x4E0D;&#x9519;&#xFF0C;&#x4EC5;&#x4EC5;&#x51E0;&#x6B21;&#x8FED;&#x4EE3;&#x540E;&#xFF0C;&#x5B83;&#x5C31;&#x6536;&#x655B;&#x5230;&#x4E86;&#x6700;&#x540E;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x5728;&#x53F3;&#x9762;&#x7684;&#x90A3;&#x526F;&#x56FE;&#x4E2D;&#xFF0C;&#x5B66;&#x4E60;&#x7387;&#x592A;&#x5927;&#x4E86;&#xFF0C;&#x7B97;&#x6CD5;&#x662F;&#x53D1;&#x6563;&#x7684;&#xFF0C;&#x8DF3;&#x8FC7;&#x4E86;&#x6240;&#x6709;&#x7684;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#xFF0C;&#x540C;&#x65F6;&#x6BCF;&#x4E00;&#x6B65;&#x90FD;&#x79BB;&#x6B63;&#x786E;&#x7684;&#x7ED3;&#x679C;&#x8D8A;&#x6765;&#x8D8A;&#x8FDC;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x5B66;&#x4E60;&#x7387;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7F51;&#x683C;&#x641C;&#x7D22;&#xFF08;&#x8BE6;&#x89C1;&#x7B2C;&#x4E8C;&#x7AE0;&#xFF09;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x4F60;&#x4E00;&#x822C;&#x4F1A;&#x9650;&#x5236;&#x8FED;&#x4EE3;&#x7684;&#x6B21;&#x6570;&#xFF0C;&#x4EE5;&#x4FBF;&#x7F51;&#x683C;&#x641C;&#x7D22;&#x53EF;&#x4EE5;&#x6D88;&#x9664;&#x6A21;&#x578B;&#x9700;&#x8981;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#x624D;&#x80FD;&#x6536;&#x655B;&#x8FD9;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x80FD;&#x60F3;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x9009;&#x53D6;&#x8FED;&#x4EE3;&#x7684;&#x6B21;&#x6570;&#x3002;&#x5982;&#x679C;&#x5B83;&#x592A;&#x5C0F;&#x4E86;&#xFF0C;&#x5F53;&#x7B97;&#x6CD5;&#x505C;&#x6B62;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x4F9D;&#x7136;&#x6CA1;&#x6709;&#x627E;&#x5230;&#x6700;&#x4F18;&#x89E3;&#x3002;&#x5982;&#x679C;&#x5B83;&#x592A;&#x5927;&#x4E86;&#xFF0C;&#x7B97;&#x6CD5;&#x4F1A;&#x975E;&#x5E38;&#x7684;&#x8017;&#x65F6;&#x540C;&#x65F6;&#x540E;&#x6765;&#x7684;&#x8FED;&#x4EE3;&#x53C2;&#x6570;&#x4E5F;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x6539;&#x53D8;&#x3002;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#x662F;&#xFF1A;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x5927;&#x7684;&#x8FED;&#x4EE3;&#x6B21;&#x6570;&#xFF0C;&#x4F46;&#x662F;&#x5F53;&#x68AF;&#x5EA6;&#x5411;&#x91CF;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x5C0F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7ED3;&#x675F;&#x8FED;&#x4EE3;&#x3002;&#x975E;&#x5E38;&#x5C0F;&#x6307;&#x7684;&#x662F;&#xFF1A;&#x68AF;&#x5EA6;&#x5411;&#x91CF;&#x5C0F;&#x4E8E;&#x4E00;&#x4E2A;&#x503C; <img src="../images/tex-f8b1c5a729a09649c275fca88976d8dd.gif" alt="\varepsilon">&#xFF08;&#x79F0;&#x4E3A;&#x5BB9;&#x5DEE;&#xFF09;&#x3002;&#x8FD9;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x51E0;&#x4E4E;&#x5DF2;&#x7ECF;&#x8FBE;&#x5230;&#x4E86;&#x6700;&#x5C0F;&#x503C;&#x3002;</p>
<blockquote>
<p>&#x6536;&#x655B;&#x901F;&#x7387;&#xFF1A;</p>
<p>&#x5F53;&#x635F;&#x5931;&#x51FD;&#x6570;&#x662F;&#x51F8;&#x51FD;&#x6570;&#xFF0C;&#x540C;&#x65F6;&#x5B83;&#x7684;&#x659C;&#x7387;&#x4E0D;&#x80FD;&#x7A81;&#x53D8;&#xFF08;&#x5C31;&#x50CF;&#x5747;&#x65B9;&#x5DEE;&#x635F;&#x5931;&#x51FD;&#x6570;&#x90A3;&#x6837;&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x7684;&#x6279;&#x91CF;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7B97;&#x6CD5;&#x56FA;&#x5B9A;&#x5B66;&#x4E60;&#x7387;&#x4E4B;&#x540E;&#xFF0C;&#x5B83;&#x7684;&#x6536;&#x655B;&#x901F;&#x7387;&#x662F; <img src="../images/tex-2381690b73b9410210542c6128e83b96.gif" alt="O(\frac{1}{iterations})">&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5C06;&#x5BB9;&#x5DEE; <img src="../images/tex-f8b1c5a729a09649c275fca88976d8dd.gif" alt="\varepsilon"> &#x7F29;&#x5C0F; 10 &#x500D;&#x540E;&#xFF08;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x66F4;&#x7CBE;&#x786E;&#x7684;&#x7ED3;&#x679C;&#xFF09;&#xFF0C;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x7684;&#x8FED;&#x4EE3;&#x6B21;&#x6570;&#x5927;&#x7EA6;&#x4F1A;&#x53D8;&#x6210;&#x539F;&#x6765;&#x7684; 10 &#x500D;&#x3002;</p>
</blockquote>
<h3 id="&#x968F;&#x673A;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;">&#x968F;&#x673A;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;</h3>
<p>&#x6279;&#x91CF;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7684;&#x6700;&#x8981;&#x95EE;&#x9898;&#x662F;&#x8BA1;&#x7B97;&#x6BCF;&#x4E00;&#x6B65;&#x7684;&#x68AF;&#x5EA6;&#x65F6;&#x90FD;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x6574;&#x4E2A;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x8FD9;&#x5BFC;&#x81F4;&#x5728;&#x89C4;&#x6A21;&#x8F83;&#x5927;&#x7684;&#x6570;&#x636E;&#x96C6;&#x4E0A;&#xFF0C;&#x5176;&#x4F1A;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x7684;&#x6162;&#x3002;&#x4E0E;&#x5176;&#x5B8C;&#x5168;&#x76F8;&#x53CD;&#x7684;&#x968F;&#x673A;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#xFF0C;&#x5728;&#x6BCF;&#x4E00;&#x6B65;&#x7684;&#x68AF;&#x5EA6;&#x8BA1;&#x7B97;&#x4E0A;&#x53EA;&#x968F;&#x673A;&#x9009;&#x53D6;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x6837;&#x672C;&#x3002;&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x7531;&#x4E8E;&#x6BCF;&#x4E00;&#x6B21;&#x7684;&#x64CD;&#x4F5C;&#x90FD;&#x4F7F;&#x7528;&#x4E86;&#x975E;&#x5E38;&#x5C11;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x6837;&#x4F7F;&#x5F97;&#x7B97;&#x6CD5;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x5FEB;&#x3002;&#x7531;&#x4E8E;&#x6BCF;&#x4E00;&#x6B21;&#x8FED;&#x4EE3;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#xFF0C;&#x8FD9;&#x4F7F;&#x968F;&#x673A;&#x68AF;&#x5EA6;&#x7B97;&#x6CD5;&#x53EF;&#x4EE5;&#x5728;&#x5927;&#x89C4;&#x6A21;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x7531;&#x4E8E;&#x5B83;&#x7684;&#x968F;&#x673A;&#x6027;&#xFF0C;&#x4E0E;&#x6279;&#x91CF;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x76F8;&#x6BD4;&#xFF0C;&#x5176;&#x5448;&#x73B0;&#x51FA;&#x66F4;&#x591A;&#x7684;&#x4E0D;&#x89C4;&#x5F8B;&#x6027;&#xFF1A;&#x5B83;&#x5230;&#x8FBE;&#x6700;&#x5C0F;&#x503C;&#x4E0D;&#x662F;&#x5E73;&#x7F13;&#x7684;&#x4E0B;&#x964D;&#xFF0C;&#x635F;&#x5931;&#x51FD;&#x6570;&#x4F1A;&#x5FFD;&#x9AD8;&#x5FFD;&#x4F4E;&#xFF0C;&#x53EA;&#x662F;&#x5728;&#x5927;&#x4F53;&#x4E0A;&#x5448;&#x4E0B;&#x964D;&#x8D8B;&#x52BF;&#x3002;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#xFF0C;&#x5B83;&#x4F1A;&#x975E;&#x5E38;&#x7684;&#x9760;&#x8FD1;&#x6700;&#x5C0F;&#x503C;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4E0D;&#x4F1A;&#x505C;&#x6B62;&#x5728;&#x4E00;&#x4E2A;&#x503C;&#x4E0A;&#xFF0C;&#x5B83;&#x4F1A;&#x4E00;&#x76F4;&#x5728;&#x8FD9;&#x4E2A;&#x503C;&#x9644;&#x8FD1;&#x6446;&#x52A8;&#xFF08;&#x5982;&#x56FE; 4-9&#xFF09;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5F53;&#x7B97;&#x6CD5;&#x505C;&#x6B62;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6700;&#x540E;&#x7684;&#x53C2;&#x6570;&#x8FD8;&#x4E0D;&#x9519;&#xFF0C;&#x4F46;&#x4E0D;&#x662F;&#x6700;&#x4F18;&#x503C;&#x3002;</p>
<p><img src="../images/chapter_4/&#x56FE;4-9.PNG" alt=""></p>
<p>&#x56FE;4-9&#xFF1A;&#x968F;&#x673A;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;</p>
<p>&#x5F53;&#x635F;&#x5931;&#x51FD;&#x6570;&#x5F88;&#x4E0D;&#x89C4;&#x5219;&#x65F6;&#xFF08;&#x5982;&#x56FE; 4-6&#xFF09;&#xFF0C;&#x968F;&#x673A;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7B97;&#x6CD5;&#x80FD;&#x591F;&#x8DF3;&#x8FC7;&#x5C40;&#x90E8;&#x6700;&#x5C0F;&#x503C;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x968F;&#x673A;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x5728;&#x5BFB;&#x627E;&#x5168;&#x5C40;&#x6700;&#x5C0F;&#x503C;&#x4E0A;&#x6BD4;&#x6279;&#x91CF;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x8868;&#x73B0;&#x8981;&#x597D;&#x3002;</p>
<p>&#x867D;&#x7136;&#x968F;&#x673A;&#x6027;&#x53EF;&#x4EE5;&#x5F88;&#x597D;&#x7684;&#x8DF3;&#x8FC7;&#x5C40;&#x90E8;&#x6700;&#x4F18;&#x503C;&#xFF0C;&#x4F46;&#x540C;&#x65F6;&#x5B83;&#x5374;&#x4E0D;&#x80FD;&#x8FBE;&#x5230;&#x6700;&#x5C0F;&#x503C;&#x3002;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x96BE;&#x9898;&#x7684;&#x4E00;&#x4E2A;&#x529E;&#x6CD5;&#x662F;&#x9010;&#x6E10;&#x964D;&#x4F4E;&#x5B66;&#x4E60;&#x7387;&#x3002; &#x5F00;&#x59CB;&#x65F6;&#xFF0C;&#x8D70;&#x7684;&#x6BCF;&#x4E00;&#x6B65;&#x8F83;&#x5927;&#xFF08;&#x8FD9;&#x6709;&#x52A9;&#x4E8E;&#x5FEB;&#x901F;&#x524D;&#x8FDB;&#x540C;&#x65F6;&#x8DF3;&#x8FC7;&#x5C40;&#x90E8;&#x6700;&#x5C0F;&#x503C;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x5C0F;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x7B97;&#x6CD5;&#x5230;&#x8FBE;&#x5168;&#x5C40;&#x6700;&#x5C0F;&#x503C;&#x3002; &#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x88AB;&#x79F0;&#x4E3A;&#x6A21;&#x62DF;&#x9000;&#x706B;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x7C7B;&#x4F3C;&#x4E8E;&#x7194;&#x878D;&#x91D1;&#x5C5E;&#x6162;&#x6162;&#x51B7;&#x5374;&#x7684;&#x51B6;&#x91D1;&#x5B66;&#x9000;&#x706B;&#x8FC7;&#x7A0B;&#x3002; &#x51B3;&#x5B9A;&#x6BCF;&#x6B21;&#x8FED;&#x4EE3;&#x7684;&#x5B66;&#x4E60;&#x7387;&#x7684;&#x51FD;&#x6570;&#x79F0;&#x4E3A;<code>learning schedule</code>&#x3002; &#x5982;&#x679C;&#x5B66;&#x4E60;&#x901F;&#x5EA6;&#x964D;&#x4F4E;&#x5F97;&#x8FC7;&#x5FEB;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x9677;&#x5165;&#x5C40;&#x90E8;&#x6700;&#x5C0F;&#x503C;&#xFF0C;&#x751A;&#x81F3;&#x5728;&#x5230;&#x8FBE;&#x6700;&#x5C0F;&#x503C;&#x7684;&#x534A;&#x8DEF;&#x5C31;&#x505C;&#x6B62;&#x4E86;&#x3002; &#x5982;&#x679C;&#x5B66;&#x4E60;&#x901F;&#x5EA6;&#x964D;&#x4F4E;&#x5F97;&#x592A;&#x6162;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x5728;&#x6700;&#x5C0F;&#x503C;&#x7684;&#x9644;&#x8FD1;&#x957F;&#x65F6;&#x95F4;&#x6446;&#x52A8;&#xFF0C;&#x540C;&#x65F6;&#x5982;&#x679C;&#x8FC7;&#x65E9;&#x505C;&#x6B62;&#x8BAD;&#x7EC3;&#xFF0C;&#x6700;&#x7EC8;&#x53EA;&#x4F1A;&#x51FA;&#x73B0;&#x6B21;&#x4F18;&#x89E3;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;<code>learning schedule</code>&#x6765;&#x5B9E;&#x73B0;&#x968F;&#x673A;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#xFF1A;</p>
<pre><code class="lang-python">n_epochs = <span class="hljs-number">50</span>
t0, t1 = <span class="hljs-number">5</span>, <span class="hljs-number">50</span>  <span class="hljs-comment">#learning_schedule&#x7684;&#x8D85;&#x53C2;&#x6570;</span>

<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">learning_schedule</span><span class="hljs-params">(t)</span>:</span>
    <span class="hljs-keyword">return</span> t0 / (t + t1)

theta = np.random.randn(<span class="hljs-number">2</span>,<span class="hljs-number">1</span>)

<span class="hljs-keyword">for</span> epoch <span class="hljs-keyword">in</span> range(n_epochs):
    <span class="hljs-keyword">for</span> i <span class="hljs-keyword">in</span> range(m):
        random_index = np.random.randint(m)
        xi = X_b[random_index:random_index+<span class="hljs-number">1</span>]
        yi = y[random_index:random_index+<span class="hljs-number">1</span>]
        gradients = <span class="hljs-number">2</span> * xi.T.dot(xi.dot(theta)-yi)
        eta = learning_schedule(epoch * m + i)
        theta = theta - eta * gradients
</code></pre>
<p>&#x6309;&#x4E60;&#x60EF;&#x6765;&#x8BB2;&#xFF0C;&#x6211;&#x4EEC;&#x8FDB;&#x884C; <img src="../images/tex-6f8f57715090da2632453988d9a1501b.gif" alt="m"> &#x8F6E;&#x7684;&#x8FED;&#x4EE3;&#xFF0C;&#x6BCF;&#x4E00;&#x8F6E;&#x8FED;&#x4EE3;&#x88AB;&#x79F0;&#x4E3A;&#x4E00;&#x4EE3;&#x3002;&#x5728;&#x6574;&#x4E2A;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#xFF0C;&#x968F;&#x673A;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x8FED;&#x4EE3;&#x4E86; 1000 &#x6B21;&#x65F6;&#xFF0C;&#x4E00;&#x822C;&#x5728;&#x7B2C; 50 &#x6B21;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x53EF;&#x4EE5;&#x8FBE;&#x5230;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<pre><code class="lang-python"><span class="hljs-meta">&gt;&gt;&gt; </span>theta
array([[<span class="hljs-number">4.21076011</span>],[<span class="hljs-number">2.748560791</span>]])
</code></pre>
<p>&#x56FE; 4-10 &#x5C55;&#x793A;&#x4E86;&#x524D; 10 &#x6B21;&#x7684;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#xFF08;&#x6CE8;&#x610F;&#x6BCF;&#x4E00;&#x6B65;&#x7684;&#x4E0D;&#x89C4;&#x5219;&#x7A0B;&#x5EA6;&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_4/&#x56FE;4-10.PNG" alt=""></p>
<p>&#x56FE; 4-10&#xFF1A;&#x968F;&#x673A;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7684;&#x524D;10&#x6B21;&#x8FED;&#x4EE3;</p>
<p>&#x7531;&#x4E8E;&#x6BCF;&#x4E2A;&#x5B9E;&#x4F8B;&#x7684;&#x9009;&#x62E9;&#x662F;&#x968F;&#x673A;&#x7684;&#xFF0C;&#x6709;&#x7684;&#x5B9E;&#x4F8B;&#x53EF;&#x80FD;&#x5728;&#x6BCF;&#x4E00;&#x4EE3;&#x4E2D;&#x90FD;&#x88AB;&#x9009;&#x5230;&#xFF0C;&#x8FD9;&#x6837;&#x5176;&#x4ED6;&#x7684;&#x5B9E;&#x4F8B;&#x4E5F;&#x53EF;&#x80FD;&#x4E00;&#x76F4;&#x4E0D;&#x88AB;&#x9009;&#x5230;&#x3002;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x4FDD;&#x8BC1;&#x6BCF;&#x4E00;&#x4EE3;&#x8FED;&#x4EE3;&#x8FC7;&#x7A0B;&#xFF0C;&#x7B97;&#x6CD5;&#x53EF;&#x4EE5;&#x904D;&#x5386;&#x6240;&#x6709;&#x5B9E;&#x4F8B;&#xFF0C;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x5C06;&#x8BAD;&#x7EC3;&#x96C6;&#x6253;&#x4E71;&#x91CD;&#x6392;&#xFF0C;&#x7136;&#x540E;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#xFF0C;&#x4E4B;&#x540E;&#x518D;&#x7EE7;&#x7EED;&#x6253;&#x4E71;&#x91CD;&#x6392;&#xFF0C;&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#x4E00;&#x76F4;&#x8FDB;&#x884C;&#x4E0B;&#x53BB;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x6837;&#x6536;&#x655B;&#x901F;&#x5EA6;&#x4F1A;&#x975E;&#x5E38;&#x7684;&#x6162;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x4F7F;&#x7528; Scikit-Learn &#x5B8C;&#x6210;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x7684;&#x968F;&#x673A;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4F7F;&#x7528;<code>SGDRegressor</code>&#x7C7B;&#xFF0C;&#x8FD9;&#x4E2A;&#x7C7B;&#x9ED8;&#x8BA4;&#x4F18;&#x5316;&#x7684;&#x662F;&#x5747;&#x65B9;&#x5DEE;&#x635F;&#x5931;&#x51FD;&#x6570;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x8FED;&#x4EE3;&#x4E86; 50 &#x4EE3;&#xFF0C;&#x5176;&#x5B66;&#x4E60;&#x7387; <img src="../images/tex-ffe9f913124f345732e9f00fa258552e.gif" alt="\eta"> &#x4E3A;0.1&#xFF08;<code>eta0=0.1</code>&#xFF09;&#xFF0C;&#x4F7F;&#x7528;&#x9ED8;&#x8BA4;&#x7684;<code>learning schedule</code>&#xFF08;&#x4E0E;&#x524D;&#x9762;&#x7684;&#x4E0D;&#x4E00;&#x6837;&#xFF09;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x6CA1;&#x6709;&#x6DFB;&#x52A0;&#x4EFB;&#x4F55;&#x6B63;&#x5219;&#x9879;&#xFF08;<code>penalty = None</code>&#xFF09;&#xFF1A;</p>
<pre><code class="lang-python"><span class="hljs-keyword">from</span> sklearn.linear_model <span class="hljs-keyword">import</span> SGDRegressor
sgd_reg = SGDRegressor(n_iter=<span class="hljs-number">50</span>, penalty=<span class="hljs-keyword">None</span>, eta0=<span class="hljs-number">0.1</span>)
sgd_reg.fit(X,y.ravel())
</code></pre>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x518D;&#x4E00;&#x6B21;&#x53D1;&#x73B0;&#xFF0C;&#x8FD9;&#x4E2A;&#x7ED3;&#x679C;&#x975E;&#x5E38;&#x7684;&#x63A5;&#x8FD1;&#x6B63;&#x89C4;&#x65B9;&#x7A0B;&#x7684;&#x89E3;&#xFF1A;</p>
<pre><code>&gt;&gt;&gt; sgd_reg.intercept_, sgd_reg.coef_
(array([4.18380366]),array([2.74205299]))
</code></pre><h3 id="&#x5C0F;&#x6279;&#x91CF;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;">&#x5C0F;&#x6279;&#x91CF;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;</h3>
<p>&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7B97;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4ECB;&#x7ECD;&#x5C0F;&#x6279;&#x91CF;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7B97;&#x6CD5;&#x3002;&#x4E00;&#x65E6;&#x4F60;&#x7406;&#x89E3;&#x4E86;&#x6279;&#x91CF;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x548C;&#x968F;&#x673A;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#xFF0C;&#x518D;&#x53BB;&#x7406;&#x89E3;&#x5C0F;&#x6279;&#x91CF;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x662F;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x3002;&#x5728;&#x8FED;&#x4EE3;&#x7684;&#x6BCF;&#x4E00;&#x6B65;&#xFF0C;&#x6279;&#x91CF;&#x68AF;&#x5EA6;&#x4F7F;&#x7528;&#x6574;&#x4E2A;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x968F;&#x673A;&#x68AF;&#x5EA6;&#x65F6;&#x5019;&#x7528;&#x4EC5;&#x4EC5;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#xFF0C;&#x5728;&#x5C0F;&#x6279;&#x91CF;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x4E2D;&#xFF0C;&#x5B83;&#x5219;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x7684;&#x5C0F;&#x578B;&#x5B9E;&#x4F8B;&#x96C6;&#x3002;&#x5B83;&#x6BD4;&#x968F;&#x673A;&#x68AF;&#x5EA6;&#x7684;&#x4E3B;&#x8981;&#x4F18;&#x70B9;&#x5728;&#x4E8E;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x77E9;&#x9635;&#x8FD0;&#x7B97;&#x7684;&#x786C;&#x4EF6;&#x4F18;&#x5316;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x8F83;&#x597D;&#x7684;&#x8BAD;&#x7EC3;&#x8868;&#x73B0;&#xFF0C;&#x5C24;&#x5176;&#x5F53;&#x4F60;&#x4F7F;&#x7528; GPU &#x8FDB;&#x884C;&#x8FD0;&#x7B97;&#x7684;&#x65F6;&#x5019;&#x3002;</p>
<p>&#x5C0F;&#x6279;&#x91CF;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x5728;&#x53C2;&#x6570;&#x7A7A;&#x95F4;&#x4E0A;&#x7684;&#x8868;&#x73B0;&#x6BD4;&#x968F;&#x673A;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x8981;&#x597D;&#x7684;&#x591A;&#xFF0C;&#x5C24;&#x5176;&#x5728;&#x6709;&#x5927;&#x91CF;&#x7684;&#x5C0F;&#x578B;&#x5B9E;&#x4F8B;&#x96C6;&#x65F6;&#x3002;&#x4F5C;&#x4E3A;&#x7ED3;&#x679C;&#xFF0C;&#x5C0F;&#x6279;&#x91CF;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x4F1A;&#x6BD4;&#x968F;&#x673A;&#x68AF;&#x5EA6;&#x66F4;&#x9760;&#x8FD1;&#x6700;&#x5C0F;&#x503C;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5B83;&#x6709;&#x53EF;&#x80FD;&#x9677;&#x5728;&#x5C40;&#x90E8;&#x6700;&#x5C0F;&#x503C;&#x4E2D;&#xFF08;&#x5728;&#x9047;&#x5230;&#x5C40;&#x90E8;&#x6700;&#x5C0F;&#x503C;&#x95EE;&#x9898;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x548C;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x770B;&#x5230;&#x7684;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x4E0D;&#x4E00;&#x6837;&#xFF09;&#x3002; &#x56FE;4-11&#x663E;&#x793A;&#x4E86;&#x8BAD;&#x7EC3;&#x671F;&#x95F4;&#x4E09;&#x79CD;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7B97;&#x6CD5;&#x5728;&#x53C2;&#x6570;&#x7A7A;&#x95F4;&#x4E2D;&#x6240;&#x91C7;&#x7528;&#x7684;&#x8DEF;&#x5F84;&#x3002; &#x4ED6;&#x4EEC;&#x90FD;&#x63A5;&#x8FD1;&#x6700;&#x5C0F;&#x503C;&#xFF0C;&#x4F46;&#x6279;&#x91CF;&#x68AF;&#x5EA6;&#x7684;&#x8DEF;&#x5F84;&#x6700;&#x540E;&#x505C;&#x5728;&#x4E86;&#x6700;&#x5C0F;&#x503C;&#xFF0C;&#x800C;&#x968F;&#x673A;&#x68AF;&#x5EA6;&#x548C;&#x5C0F;&#x6279;&#x91CF;&#x68AF;&#x5EA6;&#x6700;&#x540E;&#x90FD;&#x5728;&#x6700;&#x5C0F;&#x503C;&#x9644;&#x8FD1;&#x6446;&#x52A8;&#x3002; &#x4F46;&#x662F;&#xFF0C;&#x4E0D;&#x8981;&#x5FD8;&#x8BB0;&#xFF0C;&#x6279;&#x91CF;&#x68AF;&#x5EA6;&#x9700;&#x8981;&#x82B1;&#x8D39;&#x5927;&#x91CF;&#x65F6;&#x95F4;&#x6765;&#x5B8C;&#x6210;&#x6BCF;&#x4E00;&#x6B65;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x8F83;&#x597D;&#x7684;<code>learning schedule</code>&#xFF0C;&#x968F;&#x673A;&#x68AF;&#x5EA6;&#x548C;&#x5C0F;&#x6279;&#x91CF;&#x68AF;&#x5EA6;&#x4E5F;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x6700;&#x5C0F;&#x503C;&#x3002;</p>
<p><img src="../images/chapter_4/&#x56FE;4-11.PNG" alt=""></p>
<p>&#x56FE; 4-11&#xFF1A;&#x53C2;&#x6570;&#x7A7A;&#x95F4;&#x7684;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x8DEF;&#x5F84;</p>
<p>&#x8BA9;&#x6211;&#x6BD4;&#x8F83;&#x4E00;&#x4E0B;&#x76EE;&#x524D;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x63A2;&#x8BA8;&#x8FC7;&#x7684;&#x5BF9;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x7684;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7B97;&#x6CD5;&#x3002;&#x5982;&#x8868; 4-1 &#x6240;&#x793A;&#xFF0C;&#x5176;&#x4E2D; <img src="../images/tex-6f8f57715090da2632453988d9a1501b.gif" alt="m"> &#x8868;&#x793A;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#x7684;&#x4E2A;&#x6570;&#xFF0C;<img src="../images/tex-7b8b965ad4bca0e41ab51de7b31363a1.gif" alt="n"> &#x8868;&#x793A;&#x7279;&#x5F81;&#x7684;&#x4E2A;&#x6570;&#x3002;</p>
<p>&#x8868; 4-1&#xFF1A;&#x6BD4;&#x8F83;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x7684;&#x4E0D;&#x540C;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7B97;&#x6CD5;</p>
<p><img src="../images/chapter_4/&#x8868;4-1.PNG" alt=""></p>
<blockquote>
<p>&#x63D0;&#x793A;</p>
<p>&#x4E0A;&#x8FF0;&#x7B97;&#x6CD5;&#x5728;&#x5B8C;&#x6210;&#x8BAD;&#x7EC3;&#x540E;&#xFF0C;&#x5F97;&#x5230;&#x7684;&#x53C2;&#x6570;&#x57FA;&#x672C;&#x6CA1;&#x4EC0;&#x4E48;&#x4E0D;&#x540C;&#xFF0C;&#x5B83;&#x4EEC;&#x4F1A;&#x5F97;&#x5230;&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x6700;&#x540E;&#x4F1A;&#x4EE5;&#x4E00;&#x6837;&#x7684;&#x65B9;&#x5F0F;&#x53BB;&#x8FDB;&#x884C;&#x9884;&#x6D4B;&#x3002;</p>
</blockquote>
<h2 id="&#x591A;&#x9879;&#x5F0F;&#x56DE;&#x5F52;">&#x591A;&#x9879;&#x5F0F;&#x56DE;&#x5F52;</h2>
<p>&#x5982;&#x679C;&#x4F60;&#x7684;&#x6570;&#x636E;&#x5B9E;&#x9645;&#x4E0A;&#x6BD4;&#x7B80;&#x5355;&#x7684;&#x76F4;&#x7EBF;&#x66F4;&#x590D;&#x6742;&#x5462;&#xFF1F; &#x4EE4;&#x4EBA;&#x60CA;&#x8BB6;&#x7684;&#x662F;&#xFF0C;&#x4F60;&#x4F9D;&#x7136;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7EBF;&#x6027;&#x6A21;&#x578B;&#x6765;&#x62DF;&#x5408;&#x975E;&#x7EBF;&#x6027;&#x6570;&#x636E;&#x3002; &#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x5BF9;&#x6BCF;&#x4E2A;&#x7279;&#x5F81;&#x8FDB;&#x884C;&#x52A0;&#x6743;&#x540E;&#x4F5C;&#x4E3A;&#x65B0;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x7136;&#x540E;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x7EBF;&#x6027;&#x6A21;&#x578B;&#x5728;&#x8FD9;&#x4E2A;&#x6269;&#x5C55;&#x7684;&#x7279;&#x5F81;&#x96C6;&#x3002; &#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x79F0;&#x4E3A;&#x591A;&#x9879;&#x5F0F;&#x56DE;&#x5F52;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x3002; &#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x6839;&#x636E;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4E8C;&#x6B21;&#x65B9;&#x7A0B;&#xFF08;&#x5E76;&#x52A0;&#x4E0A;&#x4E00;&#x4E9B;&#x566A;&#x58F0;&#xFF0C;&#x5982;&#x56FE; 4-12&#xFF09;&#x6765;&#x751F;&#x6210;&#x4E00;&#x4E9B;&#x975E;&#x7EBF;&#x6027;&#x6570;&#x636E;&#xFF1A;</p>
<pre><code class="lang-python">m = <span class="hljs-number">100</span>
X = <span class="hljs-number">6</span> * np.random.rand(m, <span class="hljs-number">1</span>) - <span class="hljs-number">3</span>
y = <span class="hljs-number">0.5</span> * X**<span class="hljs-number">2</span> + X + <span class="hljs-number">2</span> + np.random.randn(m, <span class="hljs-number">1</span>)
</code></pre>
<p><img src="../images/chapter_4/&#x56FE;4-12.PNG" alt=""></p>
<p>&#x56FE; 4-12&#xFF1A;&#x751F;&#x4EA7;&#x52A0;&#x5165;&#x566A;&#x58F0;&#x7684;&#x975E;&#x7EBF;&#x6027;&#x6570;&#x636E;</p>
<p>&#x5F88;&#x6E05;&#x695A;&#x7684;&#x770B;&#x51FA;&#xFF0C;&#x76F4;&#x7EBF;&#x4E0D;&#x80FD;&#x6070;&#x5F53;&#x7684;&#x62DF;&#x5408;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x3002;&#x4E8E;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528; Scikit-Learning &#x7684;<code>PolynomialFeatures</code>&#x7C7B;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x96C6;&#x7684;&#x8F6C;&#x6362;&#xFF0C;&#x8BA9;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#x6BCF;&#x4E2A;&#x7279;&#x5F81;&#x7684;&#x5E73;&#x65B9;&#xFF08;2 &#x6B21;&#x591A;&#x9879;&#x5F0F;&#xFF09;&#x4F5C;&#x4E3A;&#x65B0;&#x7279;&#x5F81;&#xFF08;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4EC5;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x7279;&#x5F81;&#xFF09;&#xFF1A;</p>
<pre><code class="lang-python"><span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-keyword">from</span> sklearn.preprocessing <span class="hljs-keyword">import</span> PolynomialFeatures
<span class="hljs-meta">&gt;&gt;&gt; </span>poly_features = PolynomialFeatures(degree=<span class="hljs-number">2</span>,include_bias=<span class="hljs-keyword">False</span>)
<span class="hljs-meta">&gt;&gt;&gt; </span>X_poly = poly_features.fit_transform(X)
<span class="hljs-meta">&gt;&gt;&gt; </span>X[<span class="hljs-number">0</span>]
array([<span class="hljs-number">-0.75275929</span>])
<span class="hljs-meta">&gt;&gt;&gt; </span>X_poly[<span class="hljs-number">0</span>]
array([<span class="hljs-number">-0.75275929</span>, <span class="hljs-number">0.56664654</span>])
</code></pre>
<p><code>X_poly</code>&#x73B0;&#x5728;&#x5305;&#x542B;&#x539F;&#x59CB;&#x7279;&#x5F81;<img src="../images/tex-02129bb861061d1a052c592e2dc6b383.gif" alt="X">&#x5E76;&#x52A0;&#x4E0A;&#x4E86;&#x8FD9;&#x4E2A;&#x7279;&#x5F81;&#x7684;&#x5E73;&#x65B9; <img src="../images/tex-75299c2520ca389119694b3da7cc7a84.gif" alt="X^2">&#x3002;&#x73B0;&#x5728;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x8FD9;&#x4E2A;&#x6269;&#x5C55;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x4F7F;&#x7528;<code>LinearRegression</code>&#x6A21;&#x578B;&#x8FDB;&#x884C;&#x62DF;&#x5408;&#xFF0C;&#x5982;&#x56FE; 4-13&#xFF1A;</p>
<pre><code class="lang-python"><span class="hljs-meta">&gt;&gt;&gt; </span>lin_reg = LinearRegression()
<span class="hljs-meta">&gt;&gt;&gt; </span>lin_reg.fit(X_poly, y)
<span class="hljs-meta">&gt;&gt;&gt; </span>lin_reg.intercept_, lin_reg.coef_
(array([ <span class="hljs-number">1.78134581</span>]), array([[ <span class="hljs-number">0.93366893</span>, <span class="hljs-number">0.56456263</span>]]))
</code></pre>
<p><img src="../images/chapter_4/&#x56FE;4-13.PNG" alt=""></p>
<p>&#x56FE; 4-13&#xFF1A;&#x591A;&#x9879;&#x5F0F;&#x56DE;&#x5F52;&#x6A21;&#x578B;&#x9884;&#x6D4B;</p>
<p>&#x8FD8;&#x662F;&#x4E0D;&#x9519;&#x7684;&#xFF0C;&#x6A21;&#x578B;&#x9884;&#x6D4B;&#x51FD;&#x6570; <img src="../images/tex-24ff843f62db9062b4bb1fba4040c10f.gif" alt="\hat{y}=0.56x_1^2+0.93x_1+1.78">&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#x539F;&#x59CB;&#x51FD;&#x6570;&#x4E3A; <img src="../images/tex-6f58e3449c2d62d9634b79c0484c14ac.gif" alt="y=0.5x_1^2+1.0x_1+2.0"> &#x518D;&#x52A0;&#x4E0A;&#x4E00;&#x4E9B;&#x9AD8;&#x65AF;&#x566A;&#x58F0;&#x3002;</p>
<p>&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x5F53;&#x5B58;&#x5728;&#x591A;&#x4E2A;&#x7279;&#x5F81;&#x65F6;&#xFF0C;&#x591A;&#x9879;&#x5F0F;&#x56DE;&#x5F52;&#x80FD;&#x591F;&#x627E;&#x51FA;&#x7279;&#x5F81;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#xFF08;&#x8FD9;&#x662F;&#x666E;&#x901A;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x6A21;&#x578B;&#x65E0;&#x6CD5;&#x505A;&#x5230;&#x7684;&#xFF09;&#x3002; &#x8FD9;&#x662F;&#x56E0;&#x4E3A;<code>LinearRegression</code>&#x4F1A;&#x81EA;&#x52A8;&#x6DFB;&#x52A0;&#x5F53;&#x524D;&#x9636;&#x6570;&#x4E0B;&#x7279;&#x5F81;&#x7684;&#x6240;&#x6709;&#x7EC4;&#x5408;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x4E24;&#x4E2A;&#x7279;&#x5F81; <img src="../images/tex-b345e1dc09f20fdefdea469f09167892.gif" alt="a,b">&#xFF0C;&#x4F7F;&#x7528; 3 &#x9636;&#xFF08;<code>degree=3</code>&#xFF09;&#x7684;<code>LinearRegression</code>&#x65F6;&#xFF0C;&#x4E0D;&#x4EC5;&#x6709; <img src="../images/tex-e2319eb828681ba30bf7e05e07d7f5fa.gif" alt="a^2,a^3,b^2"> &#x4EE5;&#x53CA; <img src="../images/tex-2d275b176c3436e8981c70371f474c9c.gif" alt="b^3">&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x4F1A;&#x6709;&#x5B83;&#x4EEC;&#x7684;&#x5176;&#x4ED6;&#x7EC4;&#x5408;&#x9879; <img src="../images/tex-e373951eded9d8d1fddb4db810c5069f.gif" alt="ab,a^2b,ab^2">&#x3002;</p>
<blockquote>
<p>&#x63D0;&#x793A;</p>
<p><code>PolynomialFeatures(degree=d)</code>&#x628A;&#x4E00;&#x4E2A;&#x5305;&#x542B; <img src="../images/tex-7b8b965ad4bca0e41ab51de7b31363a1.gif" alt="n"> &#x4E2A;&#x7279;&#x5F81;&#x7684;&#x6570;&#x7EC4;&#x8F6C;&#x6362;&#x4E3A;&#x4E00;&#x4E2A;&#x5305;&#x542B; <img src="../images/tex-bbbca49c7d6afb0938a5c37bb5b5fbcf.gif" alt="\frac{(n+d)!}{d!n!}"> &#x7279;&#x5F81;&#x7684;&#x6570;&#x7EC4;&#xFF0C;<img src="../images/tex-388f554901ba5d77339eec8b26beebea.gif" alt="n!"> &#x8868;&#x793A; <img src="../images/tex-7b8b965ad4bca0e41ab51de7b31363a1.gif" alt="n"> &#x7684;&#x9636;&#x4E58;&#xFF0C;&#x7B49;&#x4E8E; <img src="../images/tex-62b4db05802cc87cf8ed00845ce751af.gif" alt="1 * 2 * 3 \cdots * n">&#x3002;&#x5C0F;&#x5FC3;&#x5927;&#x91CF;&#x7279;&#x5F81;&#x7684;&#x7EC4;&#x5408;&#x7206;&#x70B8;&#xFF01;</p>
</blockquote>
<h2 id="&#x5B66;&#x4E60;&#x66F2;&#x7EBF;">&#x5B66;&#x4E60;&#x66F2;&#x7EBF;</h2>
<p>&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x9AD8;&#x9636;&#x7684;&#x591A;&#x9879;&#x5F0F;&#x56DE;&#x5F52;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x53D1;&#x73B0;&#x5B83;&#x7684;&#x62DF;&#x5408;&#x7A0B;&#x5EA6;&#x8981;&#x6BD4;&#x666E;&#x901A;&#x7684;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x8981;&#x597D;&#x7684;&#x591A;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x56FE; 4-14 &#x4F7F;&#x7528;&#x4E00;&#x4E2A; 300 &#x9636;&#x7684;&#x591A;&#x9879;&#x5F0F;&#x6A21;&#x578B;&#x53BB;&#x62DF;&#x5408;&#x4E4B;&#x524D;&#x7684;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x5E76;&#x540C;&#x7B80;&#x5355;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x3001;2 &#x9636;&#x7684;&#x591A;&#x9879;&#x5F0F;&#x56DE;&#x5F52;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x3002;&#x6CE8;&#x610F; 300 &#x9636;&#x7684;&#x591A;&#x9879;&#x5F0F;&#x6A21;&#x578B;&#x5982;&#x4F55;&#x6446;&#x52A8;&#x4EE5;&#x5C3D;&#x53EF;&#x80FD;&#x63A5;&#x8FD1;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#x3002;</p>
<p><img src="../images/chapter_4/&#x56FE;4-14.PNG" alt=""></p>
<p>&#x56FE; 4-14&#xFF1A;&#x9AD8;&#x9636;&#x591A;&#x9879;&#x5F0F;&#x56DE;&#x5F52;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x79CD;&#x9AD8;&#x9636;&#x591A;&#x9879;&#x5F0F;&#x56DE;&#x5F52;&#x6A21;&#x578B;&#x5728;&#x8FD9;&#x4E2A;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x4E25;&#x91CD;&#x8FC7;&#x62DF;&#x5408;&#x4E86;&#xFF0C;&#x7EBF;&#x6027;&#x6A21;&#x578B;&#x5219;&#x6B20;&#x62DF;&#x5408;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#xFF0C;&#x4E8C;&#x6B21;&#x6A21;&#x578B;&#x6709;&#x7740;&#x8F83;&#x597D;&#x7684;&#x6CDB;&#x5316;&#x80FD;&#x529B;&#x3002;&#x90A3;&#x662F;&#x56E0;&#x4E3A;&#x5728;&#x751F;&#x6210;&#x6570;&#x636E;&#x65F6;&#x4F7F;&#x7528;&#x4E86;&#x4E8C;&#x6B21;&#x6A21;&#x578B;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x822C;&#x6211;&#x4EEC;&#x4E0D;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x751F;&#x6210;&#x51FD;&#x6570;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x90A3;&#x6211;&#x4EEC;&#x8BE5;&#x5982;&#x4F55;&#x51B3;&#x5B9A;&#x6211;&#x4EEC;&#x6A21;&#x578B;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x5462;&#xFF1F;&#x4F60;&#x5982;&#x4F55;&#x544A;&#x8BC9;&#x6211;&#x4F60;&#x7684;&#x6A21;&#x578B;&#x662F;&#x8FC7;&#x62DF;&#x5408;&#x8FD8;&#x662F;&#x6B20;&#x62DF;&#x5408;&#xFF1F;</p>
<p>&#x5728;&#x7B2C;&#x4E8C;&#x7AE0;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x6765;&#x4F30;&#x8BA1;&#x4E00;&#x4E2A;&#x6A21;&#x578B;&#x7684;&#x6CDB;&#x5316;&#x80FD;&#x529B;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x6A21;&#x578B;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x8868;&#x73B0;&#x826F;&#x597D;&#xFF0C;&#x901A;&#x8FC7;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x6307;&#x6807;&#x5374;&#x5F97;&#x51FA;&#x5176;&#x6CDB;&#x5316;&#x80FD;&#x529B;&#x5F88;&#x5DEE;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x7684;&#x6A21;&#x578B;&#x5C31;&#x662F;&#x8FC7;&#x62DF;&#x5408;&#x4E86;&#x3002;&#x5982;&#x679C;&#x5728;&#x8FD9;&#x4E24;&#x65B9;&#x9762;&#x90FD;&#x8868;&#x73B0;&#x4E0D;&#x597D;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5C31;&#x662F;&#x6B20;&#x62DF;&#x5408;&#x4E86;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#xFF0C;&#x4F60;&#x7684;&#x6A21;&#x578B;&#x662F;&#x592A;&#x590D;&#x6742;&#x8FD8;&#x662F;&#x592A;&#x7B80;&#x5355;&#x4E86;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x89C2;&#x5BDF;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;&#xFF1A;&#x753B;&#x51FA;&#x6A21;&#x578B;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x540C;&#x65F6;&#x753B;&#x51FA;&#x4EE5;&#x8BAD;&#x7EC3;&#x96C6;&#x89C4;&#x6A21;&#x4E3A;&#x81EA;&#x53D8;&#x91CF;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#x51FD;&#x6570;&#x3002;&#x4E3A;&#x4E86;&#x5F97;&#x5230;&#x56FE;&#x50CF;&#xFF0C;&#x9700;&#x8981;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x4E0D;&#x540C;&#x89C4;&#x6A21;&#x5B50;&#x96C6;&#x4E0A;&#x8FDB;&#x884C;&#x591A;&#x6B21;&#x8BAD;&#x7EC3;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x7528;&#x6765;&#x753B;&#x51FA;&#x7ED9;&#x5B9A;&#x8BAD;&#x7EC3;&#x96C6;&#x540E;&#x7684;&#x6A21;&#x578B;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;&#xFF1A;</p>
<pre><code class="lang-python"><span class="hljs-keyword">from</span> sklearn.metrics <span class="hljs-keyword">import</span> mean_squared_error
<span class="hljs-keyword">from</span> sklearn.model_selection <span class="hljs-keyword">import</span> train_test_split

<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">plot_learning_curves</span><span class="hljs-params">(model, X, y)</span>:</span>
    X_train, X_val, y_train, y_val = train_test_split(X, y, test_size=<span class="hljs-number">0.2</span>)
    train_errors, val_errors = [], []
    <span class="hljs-keyword">for</span> m <span class="hljs-keyword">in</span> range(<span class="hljs-number">1</span>, len(X_train)):
        model.fit(X_train[:m], y_train[:m])
        y_train_predict = model.predict(X_train[:m])
        y_val_predict = model.predict(X_val)
        train_errors.append(mean_squared_error(y_train_predict, y_train[:m]))
        val_errors.append(mean_squared_error(y_val_predict, y_val))
    plt.plot(np.sqrt(train_errors), <span class="hljs-string">&quot;r-+&quot;</span>, linewidth=<span class="hljs-number">2</span>, label=<span class="hljs-string">&quot;train&quot;</span>)
    plt.plot(np.sqrt(val_errors), <span class="hljs-string">&quot;b-&quot;</span>, linewidth=<span class="hljs-number">3</span>, label=<span class="hljs-string">&quot;val&quot;</span>)
</code></pre>
<p>&#x6211;&#x4EEC;&#x4E00;&#x8D77;&#x770B;&#x4E00;&#x4E0B;&#x7B80;&#x5355;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x6A21;&#x578B;&#x7684;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;&#xFF08;&#x56FE; 4-15&#xFF09;&#xFF1A;</p>
<pre><code class="lang-python">lin_reg = LinearRegression()
plot_learning_curves(lin_reg, X, y)
</code></pre>
<p><img src="../images/chapter_4/&#x56FE;4-15.PNG" alt=""></p>
<p>&#x56FE; 4-15&#xFF1A;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;</p>
<p>&#x8FD9;&#x5E45;&#x56FE;&#x503C;&#x5F97;&#x6211;&#x4EEC;&#x6DF1;&#x7A76;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x89C2;&#x5BDF;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x8868;&#x73B0;&#xFF1A;&#x5F53;&#x8BAD;&#x7EC3;&#x96C6;&#x53EA;&#x6709;&#x4E00;&#x4E24;&#x4E2A;&#x6837;&#x672C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6A21;&#x578B;&#x80FD;&#x591F;&#x975E;&#x5E38;&#x597D;&#x7684;&#x62DF;&#x5408;&#x5B83;&#x4EEC;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x66F2;&#x7EBF;&#x662F;&#x4ECE;&#x96F6;&#x5F00;&#x59CB;&#x7684;&#x539F;&#x56E0;&#x3002;&#x4F46;&#x662F;&#x5F53;&#x52A0;&#x5165;&#x4E86;&#x4E00;&#x4E9B;&#x65B0;&#x7684;&#x6837;&#x672C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x7684;&#x62DF;&#x5408;&#x7A0B;&#x5EA6;&#x53D8;&#x5F97;&#x96BE;&#x4EE5;&#x63A5;&#x53D7;&#xFF0C;&#x51FA;&#x73B0;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x6709;&#x4E24;&#x4E2A;&#x539F;&#x56E0;&#xFF0C;&#x4E00;&#x662F;&#x56E0;&#x4E3A;&#x6570;&#x636E;&#x4E2D;&#x542B;&#x6709;&#x566A;&#x58F0;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x662F;&#x6570;&#x636E;&#x6839;&#x672C;&#x4E0D;&#x662F;&#x7EBF;&#x6027;&#x7684;&#x3002;&#x56E0;&#x6B64;&#x968F;&#x7740;&#x6570;&#x636E;&#x89C4;&#x6A21;&#x7684;&#x589E;&#x5927;&#xFF0C;&#x8BEF;&#x5DEE;&#x4E5F;&#x4F1A;&#x4E00;&#x76F4;&#x589E;&#x5927;&#xFF0C;&#x76F4;&#x5230;&#x8FBE;&#x5230;&#x9AD8;&#x539F;&#x5730;&#x5E26;&#x5E76;&#x8D8B;&#x4E8E;&#x7A33;&#x5B9A;&#xFF0C;&#x5728;&#x4E4B;&#x540E;&#xFF0C;&#x7EE7;&#x7EED;&#x52A0;&#x5165;&#x65B0;&#x7684;&#x6837;&#x672C;&#xFF0C;&#x6A21;&#x578B;&#x7684;&#x5E73;&#x5747;&#x8BEF;&#x5DEE;&#x4E0D;&#x4F1A;&#x53D8;&#x5F97;&#x66F4;&#x597D;&#x6216;&#x8005;&#x66F4;&#x5DEE;&#x3002;&#x6211;&#x4EEC;&#x7EE7;&#x7EED;&#x6765;&#x770B;&#x6A21;&#x578B;&#x5728;&#x9A8C;&#x8BC1;&#x96C6;&#x4E0A;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x5F53;&#x4EE5;&#x975E;&#x5E38;&#x5C11;&#x7684;&#x6837;&#x672C;&#x53BB;&#x8BAD;&#x7EC3;&#x65F6;&#xFF0C;&#x6A21;&#x578B;&#x4E0D;&#x80FD;&#x6070;&#x5F53;&#x7684;&#x6CDB;&#x5316;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x9A8C;&#x8BC1;&#x8BEF;&#x5DEE;&#x4E00;&#x5F00;&#x59CB;&#x662F;&#x975E;&#x5E38;&#x5927;&#x7684;&#x3002;&#x5F53;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#x53D8;&#x591A;&#x7684;&#x5230;&#x65F6;&#x5019;&#xFF0C;&#x6A21;&#x578B;&#x5B66;&#x4E60;&#x7684;&#x4E1C;&#x897F;&#x53D8;&#x591A;&#xFF0C;&#x9A8C;&#x8BC1;&#x8BEF;&#x5DEE;&#x5F00;&#x59CB;&#x7F13;&#x6162;&#x7684;&#x4E0B;&#x964D;&#x3002;&#x4F46;&#x662F;&#x4E00;&#x6761;&#x76F4;&#x7EBF;&#x4E0D;&#x53EF;&#x80FD;&#x5F88;&#x597D;&#x7684;&#x62DF;&#x5408;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#xFF0C;&#x56E0;&#x6B64;&#x6700;&#x540E;&#x8BEF;&#x5DEE;&#x4F1A;&#x5230;&#x8FBE;&#x5728;&#x4E00;&#x4E2A;&#x9AD8;&#x539F;&#x5730;&#x5E26;&#x5E76;&#x8D8B;&#x4E8E;&#x7A33;&#x5B9A;&#xFF0C;&#x6700;&#x540E;&#x548C;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x66F2;&#x7EBF;&#x975E;&#x5E38;&#x63A5;&#x8FD1;&#x3002;</p>
<p>&#x4E0A;&#x9762;&#x7684;&#x66F2;&#x7EBF;&#x8868;&#x73B0;&#x4E86;&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x7684;&#x6B20;&#x62DF;&#x5408;&#x6A21;&#x578B;&#xFF0C;&#x4E24;&#x6761;&#x66F2;&#x7EBF;&#x90FD;&#x5230;&#x8FBE;&#x9AD8;&#x539F;&#x5730;&#x5E26;&#x5E76;&#x8D8B;&#x4E8E;&#x7A33;&#x5B9A;&#xFF0C;&#x5E76;&#x4E14;&#x6700;&#x540E;&#x4E24;&#x6761;&#x66F2;&#x7EBF;&#x975E;&#x5E38;&#x63A5;&#x8FD1;&#xFF0C;&#x540C;&#x65F6;&#x8BEF;&#x5DEE;&#x503C;&#x975E;&#x5E38;&#x5927;&#x3002;</p>
<blockquote>
<p>&#x63D0;&#x793A;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x7684;&#x6A21;&#x578B;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x662F;&#x6B20;&#x62DF;&#x5408;&#x7684;&#xFF0C;&#x6DFB;&#x52A0;&#x66F4;&#x591A;&#x7684;&#x6837;&#x672C;&#x662F;&#x6CA1;&#x7528;&#x7684;&#x3002;&#x4F60;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x66F4;&#x590D;&#x6742;&#x7684;&#x6A21;&#x578B;&#x6216;&#x8005;&#x627E;&#x5230;&#x66F4;&#x597D;&#x7684;&#x7279;&#x5F81;&#x3002;</p>
</blockquote>
<p>&#x73B0;&#x5728;&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x4E00;&#x4E2A;&#x5728;&#x76F8;&#x540C;&#x6570;&#x636E;&#x4E0A;10&#x9636;&#x591A;&#x9879;&#x5F0F;&#x6A21;&#x578B;&#x62DF;&#x5408;&#x7684;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;&#xFF08;&#x56FE; 4-16&#xFF09;&#xFF1A;</p>
<pre><code class="lang-python"><span class="hljs-keyword">from</span> sklearn.pipeline <span class="hljs-keyword">import</span> Pipeline

polynomial_regression = Pipeline((
    (<span class="hljs-string">&quot;poly_features&quot;</span>, PolynomialFeatures(degree=<span class="hljs-number">10</span>, include_bias=<span class="hljs-keyword">False</span>)),
    (<span class="hljs-string">&quot;sgd_reg&quot;</span>, LinearRegression()),
))

plot_learning_curves(polynomial_regression, X, y)
</code></pre>
<p>&#x8FD9;&#x5E45;&#x56FE;&#x50CF;&#x548C;&#x4E4B;&#x524D;&#x7684;&#x6709;&#x4E00;&#x70B9;&#x70B9;&#x50CF;&#xFF0C;&#x4F46;&#x662F;&#x5176;&#x6709;&#x4E24;&#x4E2A;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x4E0D;&#x540C;&#x70B9;&#xFF1A;</p>
<ul>
<li>&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#xFF0C;&#x8BEF;&#x5DEE;&#x8981;&#x6BD4;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x6A21;&#x578B;&#x4F4E;&#x7684;&#x591A;&#x3002;</li>
<li>&#x56FE;&#x4E2D;&#x7684;&#x4E24;&#x6761;&#x66F2;&#x7EBF;&#x4E4B;&#x95F4;&#x6709;&#x95F4;&#x9694;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x6A21;&#x578B;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x7684;&#x8868;&#x73B0;&#x8981;&#x6BD4;&#x9A8C;&#x8BC1;&#x96C6;&#x4E0A;&#x597D;&#x7684;&#x591A;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x6A21;&#x578B;&#x8FC7;&#x62DF;&#x5408;&#x7684;&#x663E;&#x8457;&#x7279;&#x70B9;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;&#x4E86;&#x66F4;&#x5927;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x4E24;&#x6761;&#x66F2;&#x7EBF;&#x6700;&#x540E;&#x4F1A;&#x975E;&#x5E38;&#x7684;&#x63A5;&#x8FD1;&#x3002;</li>
</ul>
<p><img src="../images/chapter_4/&#x56FE;4-16.PNG" alt=""></p>
<p>&#x56FE;4-16&#xFF1A;&#x591A;&#x9879;&#x5F0F;&#x6A21;&#x578B;&#x7684;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;</p>
<blockquote>
<p>&#x63D0;&#x793A;</p>
<p>&#x6539;&#x5584;&#x6A21;&#x578B;&#x8FC7;&#x62DF;&#x5408;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x63D0;&#x4F9B;&#x66F4;&#x591A;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#xFF0C;&#x76F4;&#x5230;&#x8BAD;&#x7EC3;&#x8BEF;&#x5DEE;&#x548C;&#x9A8C;&#x8BC1;&#x8BEF;&#x5DEE;&#x76F8;&#x7B49;&#x3002;</p>
<p>&#x504F;&#x5DEE;&#x548C;&#x65B9;&#x5DEE;&#x7684;&#x6743;&#x8861;</p>
<p>&#x5728;&#x7EDF;&#x8BA1;&#x548C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x9886;&#x57DF;&#x6709;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x7406;&#x8BBA;&#xFF1A;&#x4E00;&#x4E2A;&#x6A21;&#x578B;&#x7684;&#x6CDB;&#x5316;&#x8BEF;&#x5DEE;&#x7531;&#x4E09;&#x4E2A;&#x4E0D;&#x540C;&#x8BEF;&#x5DEE;&#x7684;&#x548C;&#x51B3;&#x5B9A;&#xFF1A;</p>
<ul>
<li>&#x504F;&#x5DEE;&#xFF1A;&#x6CDB;&#x5316;&#x8BEF;&#x5DEE;&#x7684;&#x8FD9;&#x90E8;&#x5206;&#x8BEF;&#x5DEE;&#x662F;&#x7531;&#x4E8E;&#x9519;&#x8BEF;&#x7684;&#x5047;&#x8BBE;&#x51B3;&#x5B9A;&#x7684;&#x3002;&#x4F8B;&#x5982;&#x5B9E;&#x9645;&#x662F;&#x4E00;&#x4E2A;&#x4E8C;&#x6B21;&#x6A21;&#x578B;&#xFF0C;&#x4F60;&#x5374;&#x5047;&#x8BBE;&#x4E86;&#x4E00;&#x4E2A;&#x7EBF;&#x6027;&#x6A21;&#x578B;&#x3002;&#x4E00;&#x4E2A;&#x9AD8;&#x504F;&#x5DEE;&#x7684;&#x6A21;&#x578B;&#x6700;&#x5BB9;&#x6613;&#x51FA;&#x73B0;&#x6B20;&#x62DF;&#x5408;&#x3002;</li>
<li>&#x65B9;&#x5DEE;&#xFF1A;&#x8FD9;&#x90E8;&#x5206;&#x8BEF;&#x5DEE;&#x662F;&#x7531;&#x4E8E;&#x6A21;&#x578B;&#x5BF9;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x7684;&#x5FAE;&#x5C0F;&#x53D8;&#x5316;&#x8F83;&#x4E3A;&#x654F;&#x611F;&#xFF0C;&#x4E00;&#x4E2A;&#x591A;&#x81EA;&#x7531;&#x5EA6;&#x7684;&#x6A21;&#x578B;&#x66F4;&#x5BB9;&#x6613;&#x6709;&#x9AD8;&#x7684;&#x65B9;&#x5DEE;&#xFF08;&#x4F8B;&#x5982;&#x4E00;&#x4E2A;&#x9AD8;&#x9636;&#x591A;&#x9879;&#x5F0F;&#x6A21;&#x578B;&#xFF09;&#xFF0C;&#x56E0;&#x6B64;&#x4F1A;&#x5BFC;&#x81F4;&#x6A21;&#x578B;&#x8FC7;&#x62DF;&#x5408;&#x3002;</li>
<li>&#x4E0D;&#x53EF;&#x7EA6;&#x8BEF;&#x5DEE;&#xFF1A;&#x8FD9;&#x90E8;&#x5206;&#x8BEF;&#x5DEE;&#x662F;&#x7531;&#x4E8E;&#x6570;&#x636E;&#x672C;&#x8EAB;&#x7684;&#x566A;&#x58F0;&#x51B3;&#x5B9A;&#x7684;&#x3002;&#x964D;&#x4F4E;&#x8FD9;&#x90E8;&#x5206;&#x8BEF;&#x5DEE;&#x7684;&#x552F;&#x4E00;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x6E05;&#x6D17;&#xFF08;&#x4F8B;&#x5982;&#xFF1A;&#x4FEE;&#x590D;&#x6570;&#x636E;&#x6E90;&#xFF0C;&#x4FEE;&#x590D;&#x574F;&#x7684;&#x4F20;&#x611F;&#x5668;&#xFF0C;&#x8BC6;&#x522B;&#x548C;&#x5254;&#x9664;&#x5F02;&#x5E38;&#x503C;&#xFF09;&#x3002;</li>
</ul>
</blockquote>
<h2 id="&#x7EBF;&#x6027;&#x6A21;&#x578B;&#x7684;&#x6B63;&#x5219;&#x5316;">&#x7EBF;&#x6027;&#x6A21;&#x578B;&#x7684;&#x6B63;&#x5219;&#x5316;</h2>
<p>&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x5728;&#x7B2C;&#x4E00;&#x548C;&#x7B2C;&#x4E8C;&#x7AE0;&#x770B;&#x5230;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x964D;&#x4F4E;&#x6A21;&#x578B;&#x7684;&#x8FC7;&#x62DF;&#x5408;&#x7684;&#x597D;&#x65B9;&#x6CD5;&#x662F;&#x6B63;&#x5219;&#x5316;&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#xFF08;&#x5373;&#x9650;&#x5236;&#x5B83;&#xFF09;&#xFF1A;&#x6A21;&#x578B;&#x6709;&#x8D8A;&#x5C11;&#x7684;&#x81EA;&#x7531;&#x5EA6;&#xFF0C;&#x5C31;&#x8D8A;&#x96BE;&#x4EE5;&#x62DF;&#x5408;&#x6570;&#x636E;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6B63;&#x5219;&#x5316;&#x4E00;&#x4E2A;&#x591A;&#x9879;&#x5F0F;&#x6A21;&#x578B;&#xFF0C;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x51CF;&#x5C11;&#x591A;&#x9879;&#x5F0F;&#x7684;&#x9636;&#x6570;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x7EBF;&#x6027;&#x6A21;&#x578B;&#xFF0C;&#x6B63;&#x5219;&#x5316;&#x7684;&#x5178;&#x578B;&#x5B9E;&#x73B0;&#x5C31;&#x662F;&#x7EA6;&#x675F;&#x6A21;&#x578B;&#x4E2D;&#x53C2;&#x6570;&#x7684;&#x6743;&#x91CD;&#x3002; &#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x5C06;&#x4ECB;&#x7ECD;&#x4E09;&#x79CD;&#x4E0D;&#x540C;&#x7EA6;&#x675F;&#x6743;&#x91CD;&#x7684;&#x65B9;&#x6CD5;&#xFF1A;Ridge &#x56DE;&#x5F52;&#xFF0C;Lasso &#x56DE;&#x5F52;&#x548C; Elastic Net&#x3002;</p>
<h3 id="&#x5CAD;&#xFF08;ridge&#xFF09;&#x56DE;&#x5F52;">&#x5CAD;&#xFF08;Ridge&#xFF09;&#x56DE;&#x5F52;</h3>
<p>&#x5CAD;&#x56DE;&#x5F52;&#xFF08;&#x4E5F;&#x79F0;&#x4E3A; Tikhonov &#x6B63;&#x5219;&#x5316;&#xFF09;&#x662F;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x7684;&#x6B63;&#x5219;&#x5316;&#x7248;&#xFF1A;&#x5728;&#x635F;&#x5931;&#x51FD;&#x6570;&#x4E0A;&#x76F4;&#x63A5;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&#x6B63;&#x5219;&#x9879; <img src="../images/tex-a21c05b05e3a61cef53414437bae86cf.gif" alt="\alpha\sum_{i=1}^n\theta_i^2">&#x3002;&#x8FD9;&#x4F7F;&#x5F97;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x4E0D;&#x4EC5;&#x80FD;&#x591F;&#x62DF;&#x5408;&#x6570;&#x636E;&#xFF0C;&#x800C;&#x4E14;&#x80FD;&#x591F;&#x4F7F;&#x6A21;&#x578B;&#x7684;&#x53C2;&#x6570;&#x6743;&#x91CD;&#x5C3D;&#x91CF;&#x7684;&#x5C0F;&#x3002;&#x6CE8;&#x610F;&#x5230;&#x8FD9;&#x4E2A;&#x6B63;&#x5219;&#x9879;&#x53EA;&#x6709;&#x5728;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#x4E2D;&#x624D;&#x4F1A;&#x88AB;&#x52A0;&#x5230;&#x635F;&#x5931;&#x51FD;&#x6570;&#x3002;&#x5F53;&#x5F97;&#x5230;&#x5B8C;&#x6210;&#x8BAD;&#x7EC3;&#x7684;&#x6A21;&#x578B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x6CA1;&#x6709;&#x6B63;&#x5219;&#x5316;&#x7684;&#x6D4B;&#x91CF;&#x65B9;&#x6CD5;&#x53BB;&#x8BC4;&#x4EF7;&#x6A21;&#x578B;&#x7684;&#x8868;&#x73B0;&#x3002;</p>
<blockquote>
<p>&#x63D0;&#x793A;</p>
<p>&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#x4F7F;&#x7528;&#x7684;&#x635F;&#x5931;&#x51FD;&#x6570;&#x548C;&#x6D4B;&#x8BD5;&#x8FC7;&#x7A0B;&#x4F7F;&#x7528;&#x7684;&#x8BC4;&#x4EF7;&#x51FD;&#x6570;&#x662F;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x3002;&#x9664;&#x4E86;&#x6B63;&#x5219;&#x5316;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x4E0D;&#x540C;&#xFF1A;&#x8BAD;&#x7EC3;&#x65F6;&#x7684;&#x635F;&#x5931;&#x51FD;&#x6570;&#x5E94;&#x8BE5;&#x5728;&#x4F18;&#x5316;&#x8FC7;&#x7A0B;&#x4E2D;&#x6613;&#x4E8E;&#x6C42;&#x5BFC;&#xFF0C;&#x800C;&#x5728;&#x6D4B;&#x8BD5;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x8BC4;&#x4EF7;&#x51FD;&#x6570;&#x66F4;&#x5E94;&#x8BE5;&#x63A5;&#x8FD1;&#x6700;&#x540E;&#x7684;&#x5BA2;&#x89C2;&#x8868;&#x73B0;&#x3002;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;&#x5728;&#x5206;&#x7C7B;&#x8BAD;&#x7EC3;&#x4E2D;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x5BF9;&#x6570;&#x635F;&#x5931;&#xFF08;&#x9A6C;&#x4E0A;&#x6211;&#x4EEC;&#x4F1A;&#x8BA8;&#x8BBA;&#x5B83;&#xFF09;&#x4F5C;&#x4E3A;&#x635F;&#x5931;&#x51FD;&#x6570;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x5374;&#x4F7F;&#x7528;&#x7CBE;&#x786E;&#x7387;/&#x53EC;&#x56DE;&#x7387;&#x6765;&#x4F5C;&#x4E3A;&#x5B83;&#x7684;&#x8BC4;&#x4EF7;&#x51FD;&#x6570;&#x3002;</p>
</blockquote>
<p>&#x8D85;&#x53C2;&#x6570; <img src="../images/tex-7b7f9dbfea05c83784f8b85149852f08.gif" alt="\alpha"> &#x51B3;&#x5B9A;&#x4E86;&#x4F60;&#x60F3;&#x6B63;&#x5219;&#x5316;&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#x7684;&#x5F3A;&#x5EA6;&#x3002;&#x5982;&#x679C; <img src="../images/tex-2aa447f3144cccc2865e6268c583f0f3.gif" alt="\alpha=0"> &#x90A3;&#x6B64;&#x65F6;&#x7684;&#x5CAD;&#x56DE;&#x5F52;&#x4FBF;&#x53D8;&#x4E3A;&#x4E86;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x3002;&#x5982;&#x679C; <img src="../images/tex-7b7f9dbfea05c83784f8b85149852f08.gif" alt="\alpha"> &#x975E;&#x5E38;&#x7684;&#x5927;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x6743;&#x91CD;&#x6700;&#x540E;&#x90FD;&#x63A5;&#x8FD1;&#x4E8E;&#x96F6;&#xFF0C;&#x6700;&#x540E;&#x7ED3;&#x679C;&#x5C06;&#x662F;&#x4E00;&#x6761;&#x7A7F;&#x8FC7;&#x6570;&#x636E;&#x5E73;&#x5747;&#x503C;&#x7684;&#x6C34;&#x5E73;&#x76F4;&#x7EBF;&#x3002;&#x516C;&#x5F0F; 4-8 &#x662F;&#x5CAD;&#x56DE;&#x5F52;&#x7684;&#x635F;&#x5931;&#x51FD;&#x6570;&#xFF1A;</p>
<p>&#x516C;&#x5F0F; 4-8&#xFF1A;&#x5CAD;&#x56DE;&#x5F52;&#x635F;&#x5931;&#x51FD;&#x6570;</p>
<p><img src="../images/tex-de03ddd330336d12e33df21217bdab9d.gif" alt="J(\theta)=MSE(\theta)+\alpha\frac{1}{2}\sum\limits_{i=1}^n\theta_i^2"></p>
<p>&#x503C;&#x5F97;&#x6CE8;&#x610F;&#x7684;&#x662F;&#x504F;&#x5DEE; <img src="../images/tex-dbc9011a370bca098d4752346ba71d5c.gif" alt="\theta_0"> &#x662F;&#x6CA1;&#x6709;&#x88AB;&#x6B63;&#x5219;&#x5316;&#x7684;&#xFF08;&#x7D2F;&#x52A0;&#x8FD0;&#x7B97;&#x7684;&#x5F00;&#x59CB;&#x662F; <img src="../images/tex-9a041ce63f6c28100344427c6d71837b.gif" alt="i=1"> &#x800C;&#x4E0D;&#x662F; <img src="../images/tex-8a8f1e8e0a73d8e44a17653f830f7947.gif" alt="i=0">&#xFF09;&#x3002;&#x5982;&#x6211;&#x5B9A;&#x4E49; <img src="../images/tex-17227d892ae518eab12eb3f0e596f1a0.gif" alt="\mathbf{w}"> &#x4F5C;&#x4E3A;&#x7279;&#x5F81;&#x7684;&#x6743;&#x91CD;&#x5411;&#x91CF;&#xFF08;<img src="../images/tex-7672d625e9a2492987c50d3b87c04349.gif" alt="\theta_1"> &#x5230; <img src="../images/tex-a3026e320c132de94f7c8ebb952bda60.gif" alt="\theta_n">&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x6B63;&#x5219;&#x9879;&#x53EF;&#x4EE5;&#x7B80;&#x5199;&#x6210; <img src="../images/tex-e236013a1d5cfb056aa71c770d62e4ed.gif" alt="\frac{1}{2}{({\parallel \mathbf{w}\parallel_2})}^2">&#xFF0C;&#x5176;&#x4E2D; <img src="../images/tex-3fd16a45c4fce610740da450e9f5a283.gif" alt="\parallel \cdot \parallel_2 "> &#x8868;&#x793A;&#x6743;&#x91CD;&#x5411;&#x91CF;&#x7684; <img src="../images/tex-f2d02eaf32cb7a351989198531c0d12a.gif" alt="\ell_2"> &#x8303;&#x6570;&#x3002;&#x5BF9;&#x4E8E;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x6765;&#x8BF4;&#x4EC5;&#x4EC5;&#x5728;&#x5747;&#x65B9;&#x5DEE;&#x68AF;&#x5EA6;&#x5411;&#x91CF;&#xFF08;&#x516C;&#x5F0F; 4-6&#xFF09;&#x52A0;&#x4E0A;&#x4E00;&#x9879; <img src="../images/tex-b0bb6cfa6e49912f2da3f807dd931480.gif" alt="\alpha\mathbf{w}">&#x3002;</p>
<blockquote>
<p>&#x63D0;&#x793A;</p>
<p>&#x5728;&#x4F7F;&#x7528;&#x5CAD;&#x56DE;&#x5F52;&#x524D;&#xFF0C;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x653E;&#x7F29;&#xFF08;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>StandardScaler</code>&#xFF09;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x7B97;&#x6CD5;&#x5BF9;&#x4E8E;&#x8F93;&#x5165;&#x7279;&#x5F81;&#x7684;&#x6570;&#x503C;&#x5C3A;&#x5EA6;&#xFF08;scale&#xFF09;&#x975E;&#x5E38;&#x654F;&#x611F;&#x3002;&#x5927;&#x591A;&#x6570;&#x7684;&#x6B63;&#x5219;&#x5316;&#x6A21;&#x578B;&#x90FD;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x3002;</p>
</blockquote>
<p>&#x56FE; 4-17 &#x5C55;&#x793A;&#x4E86;&#x5728;&#x76F8;&#x540C;&#x7EBF;&#x6027;&#x6570;&#x636E;&#x4E0A;&#x4F7F;&#x7528;&#x4E0D;&#x540C; <img src="../images/tex-7b7f9dbfea05c83784f8b85149852f08.gif" alt="\alpha"> &#x503C;&#x7684;&#x5CAD;&#x56DE;&#x5F52;&#x6A21;&#x578B;&#x6700;&#x540E;&#x7684;&#x8868;&#x73B0;&#x3002;&#x5DE6;&#x56FE;&#x4E2D;&#xFF0C;&#x4F7F;&#x7528;&#x7B80;&#x5355;&#x7684;&#x5CAD;&#x56DE;&#x5F52;&#x6A21;&#x578B;&#xFF0C;&#x6700;&#x540E;&#x5F97;&#x5230;&#x4E86;&#x7EBF;&#x6027;&#x7684;&#x9884;&#x6D4B;&#x3002;&#x53F3;&#x56FE;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x9996;&#x5148;&#x4F7F;&#x7528; 10 &#x9636;&#x7684;<code>PolynomialFearures</code>&#x8FDB;&#x884C;&#x6269;&#x5C55;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;<code>StandardScaler</code>&#x8FDB;&#x884C;&#x7F29;&#x653E;&#xFF0C;&#x6700;&#x540E;&#x5C06;&#x5CAD;&#x6A21;&#x578B;&#x5E94;&#x7528;&#x5728;&#x5904;&#x7406;&#x8FC7;&#x540E;&#x7684;&#x7279;&#x5F81;&#x4E0A;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x5E26;&#x6709;&#x5CAD;&#x6B63;&#x5219;&#x9879;&#x7684;&#x591A;&#x9879;&#x5F0F;&#x56DE;&#x5F52;&#x3002;&#x6CE8;&#x610F;&#x5F53;<img src="../images/tex-7b7f9dbfea05c83784f8b85149852f08.gif" alt="\alpha">&#x589E;&#x5927;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5BFC;&#x81F4;&#x9884;&#x6D4B;&#x66F2;&#x7EBF;&#x53D8;&#x5F97;&#x6241;&#x5E73;&#xFF08;&#x5373;&#x5C11;&#x4E86;&#x6781;&#x7AEF;&#x503C;&#xFF0C;&#x591A;&#x4E86;&#x4E00;&#x822C;&#x503C;&#xFF09;&#xFF0C;&#x8FD9;&#x6837;&#x51CF;&#x5C11;&#x4E86;&#x6A21;&#x578B;&#x7684;&#x65B9;&#x5DEE;&#xFF0C;&#x5374;&#x589E;&#x52A0;&#x4E86;&#x6A21;&#x578B;&#x7684;&#x504F;&#x5DEE;&#x3002;</p>
<p>&#x5BF9;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x6765;&#x8BF4;&#xFF0C;&#x5BF9;&#x4E8E;&#x5CAD;&#x56DE;&#x5F52;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5C01;&#x95ED;&#x65B9;&#x7A0B;&#x53BB;&#x8BA1;&#x7B97;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x53BB;&#x5904;&#x7406;&#x3002;&#x5B83;&#x4EEC;&#x7684;&#x7F3A;&#x70B9;&#x548C;&#x4F18;&#x70B9;&#x662F;&#x4E00;&#x6837;&#x7684;&#x3002;&#x516C;&#x5F0F; 4-9 &#x8868;&#x793A;&#x5C01;&#x95ED;&#x65B9;&#x7A0B;&#x7684;&#x89E3;&#xFF08;&#x77E9;&#x9635; <img src="../images/tex-6c6404adc033dfed51422fdaf7fa0494.gif" alt="\mathbf{A}"> &#x662F;&#x4E00;&#x4E2A;&#x9664;&#x4E86;&#x5DE6;&#x4E0A;&#x89D2;&#x6709;&#x4E00;&#x4E2A; <img src="../images/tex-cfcd208495d565ef66e7dff9f98764da.gif" alt="0"> &#x7684; <img src="../images/tex-50f17e5c11d610b19c0471830dc4dda1.gif" alt="n \times n"> &#x7684;&#x5355;&#x4F4D;&#x77E9;&#xFF0C;&#x8FD9;&#x4E2A; <img src="../images/tex-cfcd208495d565ef66e7dff9f98764da.gif" alt="0"> &#x4EE3;&#x8868;&#x504F;&#x5DEE;&#x9879;&#x3002;&#x8BD1;&#x8005;&#x6CE8;&#xFF1A;&#x504F;&#x5DEE; <img src="../images/tex-dbc9011a370bca098d4752346ba71d5c.gif" alt="\theta_0"> &#x4E0D;&#x88AB;&#x6B63;&#x5219;&#x5316;&#x7684;&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_4/&#x56FE;4-17.PNG" alt=""></p>
<p>&#x56FE; 4-17&#xFF1A;&#x5CAD;&#x56DE;&#x5F52;</p>
<p>&#x516C;&#x5F0F; 4-9&#xFF1A;&#x5CAD;&#x56DE;&#x5F52;&#x7684;&#x5C01;&#x95ED;&#x65B9;&#x7A0B;&#x7684;&#x89E3;</p>
<p><img src="../images/tex-2ef1c91a9cc8eeb7da8227d4016d702e.gif" alt="\hat{\theta} = ({\mathbf{X}}^T\cdot\mathbf{X}+\alpha\mathbf{A})^{-1}\cdot{\mathbf{X}}^T\cdot\mathbf{y}"></p>
<p>&#x4E0B;&#x9762;&#x662F;&#x5982;&#x4F55;&#x4F7F;&#x7528; Scikit-Learn &#x6765;&#x8FDB;&#x884C;&#x5C01;&#x95ED;&#x65B9;&#x7A0B;&#x7684;&#x6C42;&#x89E3;&#xFF08;&#x4F7F;&#x7528; Cholesky &#x6CD5;&#x8FDB;&#x884C;&#x77E9;&#x9635;&#x5206;&#x89E3;&#x5BF9;&#x516C;&#x5F0F; 4-9 &#x8FDB;&#x884C;&#x53D8;&#x5F62;&#xFF09;:</p>
<pre><code class="lang-python"><span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-keyword">from</span> sklearn.linear_model <span class="hljs-keyword">import</span> Ridge
<span class="hljs-meta">&gt;&gt;&gt; </span>ridge_reg = Ridge(alpha=<span class="hljs-number">1</span>, solver=<span class="hljs-string">&quot;cholesky&quot;</span>)
<span class="hljs-meta">&gt;&gt;&gt; </span>ridge_reg.fit(X, y)
<span class="hljs-meta">&gt;&gt;&gt; </span>ridge_reg.predict([[<span class="hljs-number">1.5</span>]])
array([[ <span class="hljs-number">1.55071465</span>]]
</code></pre>
<p>&#x4F7F;&#x7528;&#x968F;&#x673A;&#x68AF;&#x5EA6;&#x6CD5;&#x8FDB;&#x884C;&#x6C42;&#x89E3;&#xFF1A;</p>
<pre><code class="lang-python"><span class="hljs-meta">&gt;&gt;&gt; </span>sgd_reg = SGDRegressor(penalty=<span class="hljs-string">&quot;l2&quot;</span>)
<span class="hljs-meta">&gt;&gt;&gt; </span>sgd_reg.fit(X, y.ravel())
<span class="hljs-meta">&gt;&gt;&gt; </span>sgd_reg.predict([[<span class="hljs-number">1.5</span>]])
array([[ <span class="hljs-number">1.13500145</span>]])
</code></pre>
<p><code>penalty</code>&#x53C2;&#x6570;&#x6307;&#x7684;&#x662F;&#x6B63;&#x5219;&#x9879;&#x7684;&#x60E9;&#x7F5A;&#x7C7B;&#x578B;&#x3002;&#x6307;&#x5B9A;&#x201C;l2&#x201D;&#x8868;&#x660E;&#x4F60;&#x8981;&#x5728;&#x635F;&#x5931;&#x51FD;&#x6570;&#x4E0A;&#x6DFB;&#x52A0;&#x4E00;&#x9879;&#xFF1A;&#x6743;&#x91CD;&#x5411;&#x91CF; <img src="../images/tex-f2d02eaf32cb7a351989198531c0d12a.gif" alt="\ell_2"> &#x8303;&#x6570;&#x5E73;&#x65B9;&#x7684;&#x4E00;&#x534A;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x7B80;&#x5355;&#x7684;&#x5CAD;&#x56DE;&#x5F52;&#x3002;</p>
<h3 id="lasso-&#x56DE;&#x5F52;">Lasso &#x56DE;&#x5F52;</h3>
<p>Lasso &#x56DE;&#x5F52;&#xFF08;&#x4E5F;&#x79F0; Least Absolute Shrinkage&#xFF0C;&#x6216;&#x8005; Selection Operator Regression&#xFF09;&#x662F;&#x53E6;&#x4E00;&#x79CD;&#x6B63;&#x5219;&#x5316;&#x7248;&#x7684;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#xFF1A;&#x5C31;&#x50CF;&#x5CAD;&#x56DE;&#x5F52;&#x90A3;&#x6837;&#xFF0C;&#x5B83;&#x4E5F;&#x5728;&#x635F;&#x5931;&#x51FD;&#x6570;&#x4E0A;&#x6DFB;&#x52A0;&#x4E86;&#x4E00;&#x4E2A;&#x6B63;&#x5219;&#x5316;&#x9879;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4F7F;&#x7528;&#x6743;&#x91CD;&#x5411;&#x91CF;&#x7684; <img src="../images/tex-8524eb1789cf2093cfccc4c297138c7f.gif" alt="\ell_1"> &#x8303;&#x6570;&#x800C;&#x4E0D;&#x662F;&#x6743;&#x91CD;&#x5411;&#x91CF; <img src="../images/tex-f2d02eaf32cb7a351989198531c0d12a.gif" alt="\ell_2"> &#x8303;&#x6570;&#x5E73;&#x65B9;&#x7684;&#x4E00;&#x534A;&#x3002;&#xFF08;&#x5982;&#x516C;&#x5F0F; 4-10&#xFF09;</p>
<p>&#x516C;&#x5F0F; 4-10&#xFF1A;Lasso &#x56DE;&#x5F52;&#x7684;&#x635F;&#x5931;&#x51FD;&#x6570;</p>
<p><img src="../images/tex-a78e85b9c0eb6446f86c17d6d2190b74.gif" alt="J(\theta)=MSE(\theta)+\alpha\sum\limits_{i=1}^n\left|\theta_i \right|"></p>
<p>&#x56FE; 4-18 &#x5C55;&#x793A;&#x4E86;&#x548C;&#x56FE; 4-17 &#x76F8;&#x540C;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4EC5;&#x4EC5;&#x662F;&#x7528; Lasso &#x6A21;&#x578B;&#x4EE3;&#x66FF;&#x4E86; Ridge &#x6A21;&#x578B;&#xFF0C;&#x540C;&#x65F6;&#x8C03;&#x5C0F;&#x4E86; <img src="../images/tex-fc3ffc226f182559eb73483ccbe7ee65.gif" alt="\alpha&#x200B;"> &#x7684;&#x503C;&#x3002;</p>
<p><img src="../images/chapter_4/&#x56FE;4-18.PNG" alt=""></p>
<p>&#x56FE; 4-18&#xFF1A;Lasso&#x56DE;&#x5F52;</p>
<p>Lasso &#x56DE;&#x5F52;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7279;&#x5F81;&#x662F;&#x5B83;&#x503E;&#x5411;&#x4E8E;&#x5B8C;&#x5168;&#x6D88;&#x9664;&#x6700;&#x4E0D;&#x91CD;&#x8981;&#x7684;&#x7279;&#x5F81;&#x7684;&#x6743;&#x91CD;&#xFF08;&#x5373;&#x5C06;&#x5B83;&#x4EEC;&#x8BBE;&#x7F6E;&#x4E3A;&#x96F6;&#xFF09;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x53F3;&#x56FE;&#x4E2D;&#x7684;&#x865A;&#x7EBF;&#x6240;&#x793A;&#xFF08;<img src="../images/tex-af5e712113f834592672c1a7e4f1bee2.gif" alt="\alpha=10^{-7}">&#xFF09;&#xFF0C;&#x66F2;&#x7EBF;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x4E00;&#x6761;&#x4E8C;&#x6B21;&#x66F2;&#x7EBF;&#xFF0C;&#x800C;&#x4E14;&#x51E0;&#x4E4E;&#x662F;&#x7EBF;&#x6027;&#x7684;&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x6240;&#x6709;&#x7684;&#x9AD8;&#x9636;&#x591A;&#x9879;&#x7279;&#x5F81;&#x90FD;&#x88AB;&#x8BBE;&#x7F6E;&#x4E3A;&#x96F6;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;Lasso&#x56DE;&#x5F52;&#x81EA;&#x52A8;&#x7684;&#x8FDB;&#x884C;&#x7279;&#x5F81;&#x9009;&#x62E9;&#x540C;&#x65F6;&#x8F93;&#x51FA;&#x4E00;&#x4E2A;&#x7A00;&#x758F;&#x6A21;&#x578B;&#xFF08;&#x5373;&#xFF0C;&#x5177;&#x6709;&#x5F88;&#x5C11;&#x7684;&#x975E;&#x96F6;&#x6743;&#x91CD;&#xFF09;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x4ECE;&#x56FE; 4-19 &#x77E5;&#x9053;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x51FA;&#x73B0;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF1A;&#x5728;&#x5DE6;&#x4E0A;&#x89D2;&#x56FE;&#x4E2D;&#xFF0C;&#x540E;&#x80CC;&#x666F;&#x7684;&#x7B49;&#x9AD8;&#x7EBF;&#xFF08;&#x692D;&#x5706;&#xFF09;&#x8868;&#x793A;&#x4E86;&#x6CA1;&#x6709;&#x6B63;&#x5219;&#x5316;&#x7684;&#x5747;&#x65B9;&#x5DEE;&#x635F;&#x5931;&#x51FD;&#x6570;&#xFF08;<img src="../images/tex-2aa447f3144cccc2865e6268c583f0f3.gif" alt="\alpha=0">&#xFF09;&#xFF0C;&#x767D;&#x8272;&#x7684;&#x5C0F;&#x5706;&#x5708;&#x8868;&#x793A;&#x5728;&#x5F53;&#x524D;&#x635F;&#x5931;&#x51FD;&#x6570;&#x4E0A;&#x6279;&#x91CF;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7684;&#x8DEF;&#x5F84;&#x3002;&#x524D;&#x80CC;&#x666F;&#x7684;&#x7B49;&#x9AD8;&#x7EBF;&#xFF08;&#x83F1;&#x5F62;&#xFF09;&#x8868;&#x793A;<img src="../images/tex-8524eb1789cf2093cfccc4c297138c7f.gif" alt="\ell_1">&#x60E9;&#x7F5A;&#xFF0C;&#x9EC4;&#x8272;&#x7684;&#x4E09;&#x89D2;&#x5F62;&#x8868;&#x793A;&#x4E86;&#x4EC5;&#x5728;&#x8FD9;&#x4E2A;&#x60E9;&#x7F5A;&#x4E0B;&#x6279;&#x91CF;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7684;&#x8DEF;&#x5F84;&#xFF08;<img src="../images/tex-7c44c4fd9ee64f79d37dc97e3ceb3c17.gif" alt="\alpha\rightarrow\infty">&#xFF09;&#x3002;&#x6CE8;&#x610F;&#x8DEF;&#x5F84;&#x7B2C;&#x4E00;&#x6B21;&#x662F;&#x5982;&#x4F55;&#x5230;&#x8FBE; <img src="../images/tex-224ba64bbd16cef44085c714ff69b794.gif" alt="\theta_1=0">&#xFF0C;&#x7136;&#x540E;&#x5411;&#x4E0B;&#x6EDA;&#x52A8;&#x76F4;&#x5230;&#x5B83;&#x5230;&#x8FBE; <img src="../images/tex-421570724060381e95985593de9d77c9.gif" alt="\theta_2=0">&#x3002;&#x5728;&#x53F3;&#x4E0A;&#x89D2;&#x56FE;&#x4E2D;&#xFF0C;&#x7B49;&#x9AD8;&#x7EBF;&#x8868;&#x793A;&#x7684;&#x662F;&#x76F8;&#x540C;&#x635F;&#x5931;&#x51FD;&#x6570;&#x518D;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A; <img src="../images/tex-d7e489c9bd21eb7274ea7acd2b4f6b5b.gif" alt="\alpha=0.5"> &#x7684; <img src="../images/tex-8524eb1789cf2093cfccc4c297138c7f.gif" alt="\ell_1"> &#x60E9;&#x7F5A;&#x3002;&#x8FD9;&#x5E45;&#x56FE;&#x4E2D;&#xFF0C;&#x5B83;&#x7684;&#x5168;&#x5C40;&#x6700;&#x5C0F;&#x503C;&#x5728; <img src="../images/tex-421570724060381e95985593de9d77c9.gif" alt="\theta_2=0"> &#x8FD9;&#x6839;&#x8F74;&#x4E0A;&#x3002;&#x6279;&#x91CF;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x9996;&#x5148;&#x5230;&#x8FBE; <img src="../images/tex-421570724060381e95985593de9d77c9.gif" alt="\theta_2=0">&#xFF0C;&#x7136;&#x540E;&#x5411;&#x4E0B;&#x6EDA;&#x52A8;&#x76F4;&#x5230;&#x8FBE;&#x5230;&#x5168;&#x5C40;&#x6700;&#x5C0F;&#x503C;&#x3002; &#x4E24;&#x4E2A;&#x5E95;&#x90E8;&#x56FE;&#x663E;&#x793A;&#x4E86;&#x76F8;&#x540C;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x53EA;&#x662F;&#x4F7F;&#x7528;&#x4E86; <img src="../images/tex-f2d02eaf32cb7a351989198531c0d12a.gif" alt="\ell_2"> &#x60E9;&#x7F5A;&#x3002; &#x89C4;&#x5219;&#x5316;&#x7684;&#x6700;&#x5C0F;&#x503C;&#x6BD4;&#x975E;&#x89C4;&#x8303;&#x5316;&#x7684;&#x6700;&#x5C0F;&#x503C;&#x66F4;&#x63A5;&#x8FD1;&#x4E8E; <img src="../images/tex-cbc3c4cd0071f0ac61b8ce488ff05234.gif" alt="\theta=0">&#xFF0C;&#x4F46;&#x6743;&#x91CD;&#x4E0D;&#x80FD;&#x5B8C;&#x5168;&#x6D88;&#x9664;&#x3002;</p>
<p><img src="../images/chapter_4/&#x56FE;4-19.PNG" alt=""></p>
<p>&#x56FE; 4-19&#xFF1A;Ridge &#x56DE;&#x5F52;&#x548C; Lasso &#x56DE;&#x5F52;&#x5BF9;&#x6BD4;</p>
<blockquote>
<p>&#x63D0;&#x793A;</p>
<p>&#x5728; Lasso &#x635F;&#x5931;&#x51FD;&#x6570;&#x4E2D;&#xFF0C;&#x6279;&#x91CF;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7684;&#x8DEF;&#x5F84;&#x8D8B;&#x5411;&#x4E0E;&#x5728;&#x4F4E;&#x8C37;&#x6709;&#x4E00;&#x4E2A;&#x53CD;&#x5F39;&#x3002;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x5728; <img src="../images/tex-421570724060381e95985593de9d77c9.gif" alt="\theta_2=0"> &#x65F6;&#x659C;&#x7387;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x7A81;&#x53D8;&#x3002;&#x4E3A;&#x4E86;&#x6700;&#x540E;&#x771F;&#x6B63;&#x6536;&#x655B;&#x5230;&#x5168;&#x5C40;&#x6700;&#x5C0F;&#x503C;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x9010;&#x6E10;&#x7684;&#x964D;&#x4F4E;&#x5B66;&#x4E60;&#x7387;&#x3002;</p>
</blockquote>
<p>Lasso &#x635F;&#x5931;&#x51FD;&#x6570;&#x5728; <img src="../images/tex-e4df33b5fe9a1d3789867afe58c9564a.gif" alt="\theta_i=0(i=1,2,\cdots,n) "> &#x5904;&#x65E0;&#x6CD5;&#x8FDB;&#x884C;&#x5FAE;&#x5206;&#x8FD0;&#x7B97;&#xFF0C;&#x4F46;&#x662F;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;&#x5B50;&#x68AF;&#x5EA6;&#x5411;&#x91CF; <img src="../images/tex-d324bced968eda52e62e58cb90c82c2d.gif" alt="\mathbf{g}"> &#x540E;&#x5B83;&#x53EF;&#x4EE5;&#x5728;&#x4EFB;&#x4F55; <img src="../images/tex-a64a4a0de329e98ac7b25d532cd74a4d.gif" alt="\theta_i=0"> &#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x8FDB;&#x884C;&#x8BA1;&#x7B97;&#x3002;&#x516C;&#x5F0F; 4-11 &#x662F;&#x5728; Lasso &#x635F;&#x5931;&#x51FD;&#x6570;&#x4E0A;&#x8FDB;&#x884C;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7684;&#x5B50;&#x68AF;&#x5EA6;&#x5411;&#x91CF;&#x516C;&#x5F0F;&#x3002;</p>
<p>&#x516C;&#x5F0F; 4-11&#xFF1A;Lasso &#x56DE;&#x5F52;&#x5B50;&#x68AF;&#x5EA6;&#x5411;&#x91CF;</p>
<p><img src="../images/tex-93eea6b5c197bbc8d7be8b4c14e9f8f3.gif" alt="g(\theta,J)=\nabla_{\theta}MSE(\theta)+ \alpha{\left(\begin{matrix} sign(\theta_1)\\ sign(\theta_2)\\ \vdots \\ sign(\theta_n)\\ \end{matrix}\right)}\ where\ sign(\theta_i)= \begin{cases} -1, &amp;\theta_i&lt;0 \\ 0, &amp;\theta_i=0 \\ +1,&amp;\theta_i&gt;0 \\ \end{cases}"></p>
<p>&#x4E0B;&#x9762;&#x662F;&#x4E00;&#x4E2A;&#x4F7F;&#x7528; Scikit-Learn &#x7684;<code>Lasso</code>&#x7C7B;&#x7684;&#x5C0F;&#x4F8B;&#x5B50;&#x3002;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>SGDRegressor(penalty=&quot;l1&quot;)</code>&#x6765;&#x4EE3;&#x66FF;&#x5B83;&#x3002;</p>
<pre><code class="lang-python"><span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-keyword">from</span> sklearn.linear_model <span class="hljs-keyword">import</span> Lasso
<span class="hljs-meta">&gt;&gt;&gt; </span>lasso_reg = Lasso(alpha=<span class="hljs-number">0.1</span>)
<span class="hljs-meta">&gt;&gt;&gt; </span>lasso_reg.fit(X, y)
<span class="hljs-meta">&gt;&gt;&gt; </span>lasso_reg.predict([[<span class="hljs-number">1.5</span>]])
array([ <span class="hljs-number">1.53788174</span>]
</code></pre>
<h3 id="&#x5F39;&#x6027;&#x7F51;&#x7EDC;&#xFF08;elasticnet&#xFF09;">&#x5F39;&#x6027;&#x7F51;&#x7EDC;&#xFF08;ElasticNet&#xFF09;</h3>
<p>&#x5F39;&#x6027;&#x7F51;&#x7EDC;&#x4ECB;&#x4E8E; Ridge &#x56DE;&#x5F52;&#x548C; Lasso &#x56DE;&#x5F52;&#x4E4B;&#x95F4;&#x3002;&#x5B83;&#x7684;&#x6B63;&#x5219;&#x9879;&#x662F; Ridge &#x56DE;&#x5F52;&#x548C; Lasso &#x56DE;&#x5F52;&#x6B63;&#x5219;&#x9879;&#x7684;&#x7B80;&#x5355;&#x6DF7;&#x5408;&#xFF0C;&#x540C;&#x65F6;&#x4F60;&#x53EF;&#x4EE5;&#x63A7;&#x5236;&#x5B83;&#x4EEC;&#x7684;&#x6DF7;&#x5408;&#x7387; <img src="../images/tex-4b43b0aee35624cd95b910189b3dc231.gif" alt="r">&#xFF0C;&#x5F53; <img src="../images/tex-2c3db681686c1b080e21688bf57b256a.gif" alt="r=0"> &#x65F6;&#xFF0C;&#x5F39;&#x6027;&#x7F51;&#x7EDC;&#x5C31;&#x662F; Ridge &#x56DE;&#x5F52;&#xFF0C;&#x5F53; <img src="../images/tex-7c6270537cb2cf1c86fd46bbc6975dd3.gif" alt="r=1"> &#x65F6;&#xFF0C;&#x5176;&#x5C31;&#x662F; Lasso &#x56DE;&#x5F52;&#x3002;&#x5177;&#x4F53;&#x8868;&#x793A;&#x5982;&#x516C;&#x5F0F; 4-12&#x3002;</p>
<p>&#x516C;&#x5F0F; 4-12&#xFF1A;&#x5F39;&#x6027;&#x7F51;&#x7EDC;&#x635F;&#x5931;&#x51FD;&#x6570;</p>
<p><img src="../images/tex-e4da079f692fe35778bbdf1fdf120d99.gif" alt="J(\theta)=MSE(\theta)+r\alpha\sum\limits_{i=1}^n\left|\theta_i \right|+\frac{1-r}{2}\alpha\sum\limits_{i=1}^n\theta_i^2"></p>
<p>&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x8BE5;&#x5982;&#x4F55;&#x9009;&#x62E9;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#xFF0C;&#x5CAD;&#x56DE;&#x5F52;&#xFF0C;Lasso &#x56DE;&#x5F52;&#xFF0C;&#x5F39;&#x6027;&#x7F51;&#x7EDC;&#x5462;&#xFF1F;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#x6709;&#x4E00;&#x70B9;&#x6B63;&#x5219;&#x9879;&#x7684;&#x8868;&#x73B0;&#x66F4;&#x597D;&#xFF0C;&#x56E0;&#x6B64;&#x901A;&#x5E38;&#x4F60;&#x5E94;&#x8BE5;&#x907F;&#x514D;&#x4F7F;&#x7528;&#x7B80;&#x5355;&#x7684;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x3002;&#x5CAD;&#x56DE;&#x5F52;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x9996;&#x9009;&#x9879;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x4F60;&#x7684;&#x7279;&#x5F81;&#x4EC5;&#x6709;&#x5C11;&#x6570;&#x662F;&#x771F;&#x6B63;&#x6709;&#x7528;&#x7684;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x9009;&#x62E9; Lasso &#x548C;&#x5F39;&#x6027;&#x7F51;&#x7EDC;&#x3002;&#x5C31;&#x50CF;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x5B83;&#x4E24;&#x80FD;&#x591F;&#x5C06;&#x65E0;&#x7528;&#x7279;&#x5F81;&#x7684;&#x6743;&#x91CD;&#x964D;&#x4E3A;&#x96F6;&#x3002;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x5F39;&#x6027;&#x7F51;&#x7EDC;&#x7684;&#x8868;&#x73B0;&#x8981;&#x6BD4; Lasso &#x597D;&#xFF0C;&#x56E0;&#x4E3A;&#x5F53;&#x7279;&#x5F81;&#x6570;&#x91CF;&#x6BD4;&#x6837;&#x672C;&#x7684;&#x6570;&#x91CF;&#x5927;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6216;&#x8005;&#x7279;&#x5F81;&#x4E4B;&#x95F4;&#x6709;&#x5F88;&#x5F3A;&#x7684;&#x76F8;&#x5173;&#x6027;&#x65F6;&#xFF0C;Lasso &#x53EF;&#x80FD;&#x4F1A;&#x8868;&#x73B0;&#x7684;&#x4E0D;&#x89C4;&#x5F8B;&#x3002;&#x4E0B;&#x9762;&#x662F;&#x4E00;&#x4E2A;&#x4F7F;&#x7528; Scikit-Learn <code>ElasticNet</code>&#xFF08;<code>l1_ratio</code>&#x6307;&#x7684;&#x5C31;&#x662F;&#x6DF7;&#x5408;&#x7387; <img src="../images/tex-4b43b0aee35624cd95b910189b3dc231.gif" alt="r">&#xFF09;&#x7684;&#x7B80;&#x5355;&#x6837;&#x672C;&#xFF1A;</p>
<pre><code class="lang-python"><span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-keyword">from</span> sklearn.linear_model <span class="hljs-keyword">import</span> ElasticNet
<span class="hljs-meta">&gt;&gt;&gt; </span>elastic_net = ElasticNet(alpha=<span class="hljs-number">0.1</span>, l1_ratio=<span class="hljs-number">0.5</span>)
<span class="hljs-meta">&gt;&gt;&gt; </span>elastic_net.fit(X, y)
<span class="hljs-meta">&gt;&gt;&gt; </span>elastic_net.predict([[<span class="hljs-number">1.5</span>]])
array([ <span class="hljs-number">1.54333232</span>])
</code></pre>
<h3 id="&#x65E9;&#x671F;&#x505C;&#x6B62;&#x6CD5;&#xFF08;early-stopping&#xFF09;">&#x65E9;&#x671F;&#x505C;&#x6B62;&#x6CD5;&#xFF08;Early Stopping&#xFF09;</h3>
<p>&#x5BF9;&#x4E8E;&#x8FED;&#x4EE3;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#xFF0C;&#x6709;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x7279;&#x6B8A;&#x7684;&#x6B63;&#x5219;&#x5316;&#x65B9;&#x6CD5;&#xFF0C;&#x5C31;&#x50CF;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x5728;&#x9A8C;&#x8BC1;&#x9519;&#x8BEF;&#x8FBE;&#x5230;&#x6700;&#x5C0F;&#x503C;&#x65F6;&#x7ACB;&#x5373;&#x505C;&#x6B62;&#x8BAD;&#x7EC3;&#x90A3;&#x6837;&#x3002;&#x6211;&#x4EEC;&#x79F0;&#x4E3A;&#x65E9;&#x671F;&#x505C;&#x6B62;&#x6CD5;&#x3002;&#x56FE; 4-20 &#x8868;&#x793A;&#x4F7F;&#x7528;&#x6279;&#x91CF;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x6765;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x590D;&#x6742;&#x7684;&#x6A21;&#x578B;&#xFF08;&#x4E00;&#x4E2A;&#x9AD8;&#x9636;&#x591A;&#x9879;&#x5F0F;&#x56DE;&#x5F52;&#x6A21;&#x578B;&#xFF09;&#x3002;&#x968F;&#x7740;&#x8BAD;&#x7EC3;&#x7684;&#x8FDB;&#x884C;&#xFF0C;&#x7B97;&#x6CD5;&#x4E00;&#x76F4;&#x5B66;&#x4E60;&#xFF0C;&#x5B83;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x7684;&#x9884;&#x6D4B;&#x8BEF;&#x5DEE;&#xFF08;RMSE&#xFF09;&#x81EA;&#x7136;&#x800C;&#x7136;&#x7684;&#x4E0B;&#x964D;&#x3002;&#x7136;&#x800C;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x540E;&#xFF0C;&#x9A8C;&#x8BC1;&#x8BEF;&#x5DEE;&#x505C;&#x6B62;&#x4E0B;&#x964D;&#xFF0C;&#x5E76;&#x5F00;&#x59CB;&#x4E0A;&#x5347;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6A21;&#x578B;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x5F00;&#x59CB;&#x51FA;&#x73B0;&#x8FC7;&#x62DF;&#x5408;&#x3002;&#x4E00;&#x65E6;&#x9A8C;&#x8BC1;&#x9519;&#x8BEF;&#x8FBE;&#x5230;&#x6700;&#x5C0F;&#x503C;&#xFF0C;&#x4FBF;&#x63D0;&#x65E9;&#x505C;&#x6B62;&#x8BAD;&#x7EC3;&#x3002;&#x8FD9;&#x79CD;&#x7B80;&#x5355;&#x6709;&#x6548;&#x7684;&#x6B63;&#x5219;&#x5316;&#x65B9;&#x6CD5;&#x88AB; Geoffrey Hinton &#x79F0;&#x4E3A;&#x201C;&#x5B8C;&#x7F8E;&#x7684;&#x514D;&#x8D39;&#x5348;&#x9910;&#x201D;</p>
<p><img src="../images/chapter_4/&#x56FE;4-20.PNG" alt=""></p>
<p>&#x56FE; 4-20&#xFF1A;&#x65E9;&#x671F;&#x505C;&#x6B62;&#x6CD5;</p>
<blockquote>
<p>&#x63D0;&#x793A;</p>
<p>&#x968F;&#x673A;&#x68AF;&#x5EA6;&#x548C;&#x5C0F;&#x6279;&#x91CF;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x4E0D;&#x662F;&#x5E73;&#x6ED1;&#x66F2;&#x7EBF;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x5F88;&#x96BE;&#x77E5;&#x9053;&#x5B83;&#x662F;&#x5426;&#x8FBE;&#x5230;&#x6700;&#x5C0F;&#x503C;&#x3002; &#x4E00;&#x79CD;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#xFF0C;&#x53EA;&#x6709;&#x5728;&#x9A8C;&#x8BC1;&#x8BEF;&#x5DEE;&#x9AD8;&#x4E8E;&#x6700;&#x5C0F;&#x503C;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x540E;&#xFF08;&#x4F60;&#x786E;&#x4FE1;&#x8BE5;&#x6A21;&#x578B;&#x4E0D;&#x4F1A;&#x53D8;&#x5F97;&#x66F4;&#x597D;&#x4E86;&#xFF09;&#xFF0C;&#x624D;&#x505C;&#x6B62;&#xFF0C;&#x4E4B;&#x540E;&#x5C06;&#x6A21;&#x578B;&#x53C2;&#x6570;&#x56DE;&#x6EDA;&#x5230;&#x9A8C;&#x8BC1;&#x8BEF;&#x5DEE;&#x6700;&#x5C0F;&#x503C;&#x3002;</p>
</blockquote>
<p>&#x4E0B;&#x9762;&#x662F;&#x4E00;&#x4E2A;&#x65E9;&#x671F;&#x505C;&#x6B62;&#x6CD5;&#x7684;&#x57FA;&#x7840;&#x5E94;&#x7528;&#xFF1A;</p>
<pre><code class="lang-python"><span class="hljs-keyword">from</span> sklearn.base <span class="hljs-keyword">import</span> clone
sgd_reg = SGDRegressor(n_iter=<span class="hljs-number">1</span>, warm_start=<span class="hljs-keyword">True</span>, penalty=<span class="hljs-keyword">None</span>,learning_rate=<span class="hljs-string">&quot;constant&quot;</span>, eta0=<span class="hljs-number">0.0005</span>)

minimum_val_error = float(<span class="hljs-string">&quot;inf&quot;</span>)
best_epoch = <span class="hljs-keyword">None</span>
best_model = <span class="hljs-keyword">None</span>
<span class="hljs-keyword">for</span> epoch <span class="hljs-keyword">in</span> range(<span class="hljs-number">1000</span>):
    sgd_reg.fit(X_train_poly_scaled, y_train)
    y_val_predict = sgd_reg.predict(X_val_poly_scaled)
    val_error = mean_squared_error(y_val_predict, y_val)
    <span class="hljs-keyword">if</span> val_error &lt; minimum_val_error:
        minimum_val_error = val_error
        best_epoch = epoch
        best_model = clone(sgd_reg)
</code></pre>
<p>&#x6CE8;&#x610F;&#xFF1A;&#x5F53;<code>warm_start=True</code>&#x65F6;&#xFF0C;&#x8C03;&#x7528;<code>fit()</code>&#x65B9;&#x6CD5;&#x540E;&#xFF0C;&#x8BAD;&#x7EC3;&#x4F1A;&#x4ECE;&#x505C;&#x4E0B;&#x6765;&#x7684;&#x5730;&#x65B9;&#x7EE7;&#x7EED;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4ECE;&#x5934;&#x91CD;&#x65B0;&#x5F00;&#x59CB;&#x3002;</p>
<h2 id="&#x903B;&#x8F91;&#x56DE;&#x5F52;">&#x903B;&#x8F91;&#x56DE;&#x5F52;</h2>
<p>&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x5728;&#x7B2C;1&#x7AE0;&#x4E2D;&#x8BA8;&#x8BBA;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x4E00;&#x4E9B;&#x56DE;&#x5F52;&#x7B97;&#x6CD5;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x5206;&#x7C7B;&#xFF08;&#x53CD;&#x4E4B;&#x4EA6;&#x7136;&#xFF09;&#x3002; Logistic &#x56DE;&#x5F52;&#xFF08;&#x4E5F;&#x79F0;&#x4E3A; Logit &#x56DE;&#x5F52;&#xFF09;&#x901A;&#x5E38;&#x7528;&#x4E8E;&#x4F30;&#x8BA1;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#x5C5E;&#x4E8E;&#x67D0;&#x4E2A;&#x7279;&#x5B9A;&#x7C7B;&#x522B;&#x7684;&#x6982;&#x7387;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x8FD9;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x662F;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x7684;&#x6982;&#x7387;&#x662F;&#x591A;&#x5C11;&#xFF1F;&#xFF09;&#x3002; &#x5982;&#x679C;&#x4F30;&#x8BA1;&#x7684;&#x6982;&#x7387;&#x5927;&#x4E8E; 50%&#xFF0C;&#x90A3;&#x4E48;&#x6A21;&#x578B;&#x9884;&#x6D4B;&#x8FD9;&#x4E2A;&#x5B9E;&#x4F8B;&#x5C5E;&#x4E8E;&#x5F53;&#x524D;&#x7C7B;&#xFF08;&#x79F0;&#x4E3A;&#x6B63;&#x7C7B;&#xFF0C;&#x6807;&#x8BB0;&#x4E3A;&#x201C;1&#x201D;&#xFF09;&#xFF0C;&#x53CD;&#x4E4B;&#x9884;&#x6D4B;&#x5B83;&#x4E0D;&#x5C5E;&#x4E8E;&#x5F53;&#x524D;&#x7C7B;&#xFF08;&#x5373;&#x5B83;&#x5C5E;&#x4E8E;&#x8D1F;&#x7C7B; &#xFF0C;&#x6807;&#x8BB0;&#x4E3A;&#x201C;0&#x201D;&#xFF09;&#x3002; &#x8FD9;&#x6837;&#x4FBF;&#x6210;&#x4E3A;&#x4E86;&#x4E00;&#x4E2A;&#x4E8C;&#x5143;&#x5206;&#x7C7B;&#x5668;&#x3002;</p>
<h3 id="&#x6982;&#x7387;&#x4F30;&#x8BA1;">&#x6982;&#x7387;&#x4F30;&#x8BA1;</h3>
<p>&#x90A3;&#x4E48;&#x5B83;&#x662F;&#x600E;&#x6837;&#x5DE5;&#x4F5C;&#x7684;&#xFF1F; &#x5C31;&#x50CF;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x6A21;&#x578B;&#x4E00;&#x6837;&#xFF0C;Logistic &#x56DE;&#x5F52;&#x6A21;&#x578B;&#x8BA1;&#x7B97;&#x8F93;&#x5165;&#x7279;&#x5F81;&#x7684;&#x52A0;&#x6743;&#x548C;&#xFF08;&#x52A0;&#x4E0A;&#x504F;&#x5DEE;&#x9879;&#xFF09;&#xFF0C;&#x4F46;&#x5B83;&#x4E0D;&#x50CF;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x6A21;&#x578B;&#x90A3;&#x6837;&#x76F4;&#x63A5;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#xFF0C;&#x800C;&#x662F;&#x628A;&#x7ED3;&#x679C;&#x8F93;&#x5165;<code>logistic()</code>&#x51FD;&#x6570;&#x8FDB;&#x884C;&#x4E8C;&#x6B21;&#x52A0;&#x5DE5;&#x540E;&#x8FDB;&#x884C;&#x8F93;&#x51FA;&#xFF08;&#x8BE6;&#x89C1;&#x516C;&#x5F0F; 4-13&#xFF09;&#x3002;</p>
<p>&#x516C;&#x5F0F; 4-13&#xFF1A;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x6A21;&#x578B;&#x7684;&#x6982;&#x7387;&#x4F30;&#x8BA1;&#xFF08;&#x5411;&#x91CF;&#x5F62;&#x5F0F;&#xFF09;</p>
<p><img src="../images/tex-9d6a43d7b758ed2c9684fbbb81f9f1e8.gif" alt="\hat{p}=h_\theta(\mathbf{x})=\sigma(\theta^T  \cdot \mathbf{x})"></p>
<p>Logistic &#x51FD;&#x6570;&#xFF08;&#x4E5F;&#x79F0;&#x4E3A; logit&#xFF09;&#xFF0C;&#x7528; <img src="../images/tex-8a5c57afba70b57b7079f9a60efd5370.gif" alt="\sigma()"> &#x8868;&#x793A;&#xFF0C;&#x5176;&#x662F;&#x4E00;&#x4E2A; sigmoid &#x51FD;&#x6570;&#xFF08;&#x56FE;&#x50CF;&#x5448; S &#x578B;&#xFF09;&#xFF0C;&#x5B83;&#x7684;&#x8F93;&#x51FA;&#x662F;&#x4E00;&#x4E2A;&#x4ECB;&#x4E8E; 0 &#x548C; 1 &#x4E4B;&#x95F4;&#x7684;&#x6570;&#x5B57;&#x3002;&#x5176;&#x5B9A;&#x4E49;&#x5982;&#x516C;&#x5F0F; 4-14 &#x548C;&#x56FE; 4-21 &#x6240;&#x793A;&#x3002;</p>
<p>&#x516C;&#x5F0F; 4-14&#xFF1A;&#x903B;&#x8F91;&#x51FD;&#x6570;</p>
<p><img src="../images/tex-bec5b0923c70096e7336e2debb62ce82.gif" alt="\sigma(t)=\frac{1}{1+exp(-t)}"></p>
<p><img src="../images/chapter_4/&#x56FE;4-21.PNG" alt=""></p>
<p>&#x56FE;4-21&#xFF1A;&#x903B;&#x8F91;&#x51FD;&#x6570;</p>
<p>&#x4E00;&#x65E6; Logistic &#x56DE;&#x5F52;&#x6A21;&#x578B;&#x4F30;&#x8BA1;&#x5F97;&#x5230;&#x4E86; <img src="../images/tex-70e59a996bd69a0c21878b4093375e92.gif" alt="\mathbf{x}"> &#x5C5E;&#x4E8E;&#x6B63;&#x7C7B;&#x7684;&#x6982;&#x7387; <img src="../images/tex-ef33861da9c3ac0329d8c6963e856c71.gif" alt="\hat{p}=h_\theta(\mathbf{x})">&#xFF0C;&#x90A3;&#x5B83;&#x5F88;&#x5BB9;&#x6613;&#x5F97;&#x5230;&#x9884;&#x6D4B;&#x7ED3;&#x679C; <img src="../images/tex-5d28a7ba1a44a73b8c2ed21321697c59.gif" alt="\hat{y}">&#xFF08;&#x89C1;&#x516C;&#x5F0F; 4-15&#xFF09;&#x3002;</p>
<p>&#x516C;&#x5F0F; 4-15&#xFF1A;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x9884;&#x6D4B;&#x6A21;&#x578B;</p>
<p><img src="../images/tex-7b5aaccbd0d9d1237157caedb4e63579.gif" alt="\hat{y}= \begin{cases} 0, &amp;\hat{p}&lt;0.5 \\ 1,&amp;\hat{p}\geq0.5 \\ \end{cases}"></p>
<p>&#x6CE8;&#x610F;&#x5F53; <img src="../images/tex-ff7fa304ecf57b573120bafee2b1cb58.gif" alt="t&lt;0"> &#x65F6; <img src="../images/tex-1c5fbe6b94a96589df8cc11e20542e17.gif" alt="\sigma(t)&lt;0.5">&#xFF0C;&#x5F53; <img src="../images/tex-046a5ffa6a06b4da61d932c172876785.gif" alt="t\geq0">&#x65F6;<img src="../images/tex-e12f172d616cf52e645466237de2557f.gif" alt="\sigma(t)\geq0.5">&#xFF0C;&#x56E0;&#x6B64;&#x5F53;<img src="../images/tex-dc285d84f74bea2336104ee5eafff150.gif" alt="\theta^T  \cdot \mathbf{x}"> &#x662F;&#x6B63;&#x6570;&#x7684;&#x8BDD;&#xFF0C;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x6A21;&#x578B;&#x8F93;&#x51FA; 1&#xFF0C;&#x5982;&#x679C;&#x5B83;&#x662F;&#x8D1F;&#x6570;&#x7684;&#x8BDD;&#xFF0C;&#x5219;&#x8F93;&#x51FA; 0&#x3002;</p>
<h3 id="&#x8BAD;&#x7EC3;&#x548C;&#x635F;&#x5931;&#x51FD;&#x6570;">&#x8BAD;&#x7EC3;&#x548C;&#x635F;&#x5931;&#x51FD;&#x6570;</h3>
<p>&#x597D;&#xFF0C;&#x73B0;&#x5728;&#x4F60;&#x77E5;&#x9053;&#x4E86; Logistic &#x56DE;&#x5F52;&#x6A21;&#x578B;&#x5982;&#x4F55;&#x4F30;&#x8BA1;&#x6982;&#x7387;&#x5E76;&#x8FDB;&#x884C;&#x9884;&#x6D4B;&#x3002; &#x4F46;&#x662F;&#x5B83;&#x662F;&#x5982;&#x4F55;&#x8BAD;&#x7EC3;&#x7684;&#xFF1F; &#x8BAD;&#x7EC3;&#x7684;&#x76EE;&#x7684;&#x662F;&#x8BBE;&#x7F6E;&#x53C2;&#x6570;&#x5411;&#x91CF; <img src="../images/tex-2554a2bb846cffd697389e5dc8912759.gif" alt="\theta">&#xFF0C;&#x4F7F;&#x5F97;&#x6B63;&#x4F8B;&#xFF08;<img src="../images/tex-6a267007228f9f654a0d28dec6932c31.gif" alt="y=1">&#xFF09;&#x6982;&#x7387;&#x589E;&#x5927;&#xFF0C;&#x8D1F;&#x4F8B;&#xFF08;<img src="../images/tex-fab37d6c4a697fe660387d3ff8e889a4.gif" alt="y=0">&#xFF09;&#x7684;&#x6982;&#x7387;&#x51CF;&#x5C0F;&#xFF0C;&#x5176;&#x901A;&#x8FC7;&#x5728;&#x5355;&#x4E2A;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B; <img src="../images/tex-70e59a996bd69a0c21878b4093375e92.gif" alt="\mathbf{x}"> &#x7684;&#x635F;&#x5931;&#x51FD;&#x6570;&#x6765;&#x5B9E;&#x73B0;&#xFF08;&#x516C;&#x5F0F; 4-16&#xFF09;&#x3002;</p>
<p>&#x516C;&#x5F0F; 4-16&#xFF1A;&#x5355;&#x4E2A;&#x6837;&#x672C;&#x7684;&#x635F;&#x5931;&#x51FD;&#x6570;</p>
<p><img src="../images/tex-81c37589241489382297c799f1fc6b45.gif" alt="c(\theta)= \begin{cases} -log(\hat{p}), &amp;y=1 \\ -log(1-\hat{p}),&amp;y=0 \\ \end{cases}"></p>
<p>&#x8FD9;&#x4E2A;&#x635F;&#x5931;&#x51FD;&#x6570;&#x662F;&#x5408;&#x7406;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5F53; <img src="../images/tex-e358efa489f58062f10dd7316b65649e.gif" alt="t"> &#x63A5;&#x8FD1; 0 &#x65F6;&#xFF0C;<img src="../images/tex-0b092886509724e44645878e1391a65d.gif" alt="-log(t)"> &#x53D8;&#x5F97;&#x975E;&#x5E38;&#x5927;&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x6A21;&#x578B;&#x4F30;&#x8BA1;&#x4E00;&#x4E2A;&#x6B63;&#x4F8B;&#x6982;&#x7387;&#x63A5;&#x8FD1;&#x4E8E; 0&#xFF0C;&#x90A3;&#x4E48;&#x635F;&#x5931;&#x51FD;&#x6570;&#x5C06;&#x4F1A;&#x5F88;&#x5927;&#xFF0C;&#x540C;&#x65F6;&#x5982;&#x679C;&#x6A21;&#x578B;&#x4F30;&#x8BA1;&#x4E00;&#x4E2A;&#x8D1F;&#x4F8B;&#x7684;&#x6982;&#x7387;&#x63A5;&#x8FD1; 1&#xFF0C;&#x90A3;&#x4E48;&#x635F;&#x5931;&#x51FD;&#x6570;&#x540C;&#x6837;&#x4F1A;&#x5F88;&#x5927;&#x3002; &#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5F53; <img src="../images/tex-e358efa489f58062f10dd7316b65649e.gif" alt="t"> &#x63A5;&#x8FD1;&#x4E8E; 1 &#x65F6;&#xFF0C;<img src="../images/tex-0b092886509724e44645878e1391a65d.gif" alt="-log(t)"> &#x63A5;&#x8FD1; 0&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x6A21;&#x578B;&#x4F30;&#x8BA1;&#x4E00;&#x4E2A;&#x6B63;&#x4F8B;&#x6982;&#x7387;&#x63A5;&#x8FD1;&#x4E8E; 0&#xFF0C;&#x90A3;&#x4E48;&#x635F;&#x5931;&#x51FD;&#x6570;&#x63A5;&#x8FD1;&#x4E8E; 0&#xFF0C;&#x540C;&#x65F6;&#x5982;&#x679C;&#x6A21;&#x578B;&#x4F30;&#x8BA1;&#x4E00;&#x4E2A;&#x8D1F;&#x4F8B;&#x7684;&#x6982;&#x7387;&#x63A5;&#x8FD1; 0&#xFF0C;&#x90A3;&#x4E48;&#x635F;&#x5931;&#x51FD;&#x6570;&#x540C;&#x6837;&#x4F1A;&#x63A5;&#x8FD1;&#x4E8E; 0&#xFF0C; &#x8FD9;&#x6B63;&#x662F;&#x6211;&#x4EEC;&#x60F3;&#x7684;&#x3002;</p>
<p>&#x6574;&#x4E2A;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x635F;&#x5931;&#x51FD;&#x6570;&#x53EA;&#x662F;&#x6240;&#x6709;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#x7684;&#x5E73;&#x5747;&#x503C;&#x3002;&#x53EF;&#x4EE5;&#x7528;&#x4E00;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#xFF08;&#x4F60;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x8BC1;&#x660E;&#xFF09;&#x6765;&#x7EDF;&#x4E00;&#x8868;&#x793A;&#xFF0C;&#x79F0;&#x4E3A;&#x5BF9;&#x6570;&#x635F;&#x5931;&#xFF0C;&#x5982;&#x516C;&#x5F0F; 4-17 &#x6240;&#x793A;&#x3002;</p>
<p>&#x516C;&#x5F0F; 4-17&#xFF1A;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x7684;&#x635F;&#x5931;&#x51FD;&#x6570;&#xFF08;&#x5BF9;&#x6570;&#x635F;&#x5931;&#xFF09;</p>
<p><img src="../images/tex-b6a0de3f265cdeedc2ac1d0687fef2ea.gif" alt="J(\theta)=-\frac{1}{m}\sum\limits_{i=1}^m\left[y^{(i)}log\left(\hat{p}^{(i)}\right)+\left(1-y^{(i)}\right)log\left(1-\hat{p}^{(i)}\right)\right]"></p>
<p>&#x4F46;&#x662F;&#x8FD9;&#x4E2A;&#x635F;&#x5931;&#x51FD;&#x6570;&#x5BF9;&#x4E8E;&#x6C42;&#x89E3;&#x6700;&#x5C0F;&#x5316;&#x635F;&#x5931;&#x51FD;&#x6570;&#x7684; <img src="../images/tex-2554a2bb846cffd697389e5dc8912759.gif" alt="\theta"> &#x662F;&#x6CA1;&#x6709;&#x516C;&#x5F0F;&#x89E3;&#x7684;&#xFF08;&#x6CA1;&#x6709;&#x7B49;&#x4EF7;&#x7684;&#x6B63;&#x89C4;&#x65B9;&#x7A0B;&#xFF09;&#x3002; &#x4F46;&#x597D;&#x6D88;&#x606F;&#x662F;&#xFF0C;&#x8FD9;&#x4E2A;&#x635F;&#x5931;&#x51FD;&#x6570;&#x662F;&#x51F8;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#xFF08;&#x6216;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x4F18;&#x5316;&#x7B97;&#x6CD5;&#xFF09;&#x4E00;&#x5B9A;&#x80FD;&#x591F;&#x627E;&#x5230;&#x5168;&#x5C40;&#x6700;&#x5C0F;&#x503C;&#xFF08;&#x5982;&#x679C;&#x5B66;&#x4E60;&#x901F;&#x7387;&#x4E0D;&#x662F;&#x592A;&#x5927;&#xFF0C;&#x5E76;&#x4E14;&#x4F60;&#x7B49;&#x5F85;&#x8DB3;&#x591F;&#x957F;&#x7684;&#x65F6;&#x95F4;&#xFF09;&#x3002;&#x516C;&#x5F0F; 4-18 &#x7ED9;&#x51FA;&#x4E86;&#x635F;&#x5931;&#x51FD;&#x6570;&#x5173;&#x4E8E;&#x7B2C; <img src="../images/tex-363b122c528f54df4a0446b6bab05515.gif" alt="j"> &#x4E2A;&#x6A21;&#x578B;&#x53C2;&#x6570; <img src="../images/tex-cb0e17d96e58d55d1eb06dc1b14b7a7b.gif" alt="\theta_j"> &#x7684;&#x504F;&#x5BFC;&#x6570;&#x3002;</p>
<p>&#x516C;&#x5F0F; 4-18&#xFF1A;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x635F;&#x5931;&#x51FD;&#x6570;&#x7684;&#x504F;&#x5BFC;&#x6570;</p>
<p><img src="../images/tex-4e016baa468f852047bbbc1b171743ac.gif" alt="\frac{\partial}{\partial \theta_j}J(\theta_j)=\frac{1}{m} \sum\limits_{i=1}^m{\left(\sigma\left(\theta^T \cdot \mathbf{x}^{(i)}\right)-y^{(i)}\right)}{x_j}^{(i)}"></p>
<p>&#x8FD9;&#x4E2A;&#x516C;&#x5F0F;&#x770B;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x50CF;&#x516C;&#x5F0F; 4-5&#xFF1A;&#x9996;&#x5148;&#x8BA1;&#x7B97;&#x6BCF;&#x4E2A;&#x6837;&#x672C;&#x7684;&#x9884;&#x6D4B;&#x8BEF;&#x5DEE;&#xFF0C;&#x7136;&#x540E;&#x8BEF;&#x5DEE;&#x9879;&#x4E58;&#x4EE5;&#x7B2C; <img src="../images/tex-363b122c528f54df4a0446b6bab05515.gif" alt="j"> &#x9879;&#x7279;&#x5F81;&#x503C;&#xFF0C;&#x6700;&#x540E;&#x6C42;&#x51FA;&#x6240;&#x6709;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#x7684;&#x5E73;&#x5747;&#x503C;&#x3002; &#x4E00;&#x65E6;&#x4F60;&#x6709;&#x4E86;&#x5305;&#x542B;&#x6240;&#x6709;&#x7684;&#x504F;&#x5BFC;&#x6570;&#x7684;&#x68AF;&#x5EA6;&#x5411;&#x91CF;&#xFF0C;&#x4F60;&#x4FBF;&#x53EF;&#x4EE5;&#x5728;&#x68AF;&#x5EA6;&#x5411;&#x91CF;&#x4E0A;&#x4F7F;&#x7528;&#x6279;&#x91CF;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7B97;&#x6CD5;&#x3002; &#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF1A;&#x4F60;&#x5DF2;&#x7ECF;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x8BAD;&#x7EC3; Logistic &#x56DE;&#x5F52;&#x6A21;&#x578B;&#x3002; &#x5BF9;&#x4E8E;&#x968F;&#x673A;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#xFF0C;&#x4F60;&#x5F53;&#x7136;&#x53EA;&#x9700;&#x8981;&#x6BCF;&#x4E00;&#x6B21;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#xFF0C;&#x5BF9;&#x4E8E;&#x5C0F;&#x6279;&#x91CF;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#xFF0C;&#x4F60;&#x5C06;&#x6BCF;&#x4E00;&#x6B21;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x5C0F;&#x578B;&#x5B9E;&#x4F8B;&#x96C6;&#x3002;</p>
<h3 id="&#x51B3;&#x7B56;&#x8FB9;&#x754C;">&#x51B3;&#x7B56;&#x8FB9;&#x754C;</h3>
<p>&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x9E22;&#x5C3E;&#x82B1;&#x6570;&#x636E;&#x96C6;&#x6765;&#x5206;&#x6790; Logistic &#x56DE;&#x5F52;&#x3002; &#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x8457;&#x540D;&#x7684;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x542B; 150 &#x6735;&#x4E09;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x9E22;&#x5C3E;&#x82B1;&#x7684;&#x843C;&#x7247;&#x548C;&#x82B1;&#x74E3;&#x7684;&#x957F;&#x5EA6;&#x548C;&#x5BBD;&#x5EA6;&#x3002;&#x8FD9;&#x4E09;&#x79CD;&#x9E22;&#x5C3E;&#x82B1;&#x4E3A;&#xFF1A;Setosa&#xFF0C;Versicolor&#xFF0C;Virginica&#xFF08;&#x5982;&#x56FE; 4-22&#xFF09;&#x3002;</p>
<p><img src="../images/chapter_4/&#x56FE;4-22.PNG" alt=""></p>
<p>&#x56FE;4-22&#xFF1A;&#x4E09;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x9E22;&#x5C3E;&#x82B1;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x5C1D;&#x8BD5;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x4EC5;&#x4EC5;&#x4F7F;&#x7528;&#x82B1;&#x74E3;&#x7684;&#x5BBD;&#x5EA6;&#x7279;&#x5F81;&#x6765;&#x8BC6;&#x522B; Virginica&#xFF0C;&#x9996;&#x5148;&#x8BA9;&#x6211;&#x4EEC;&#x52A0;&#x8F7D;&#x6570;&#x636E;&#xFF1A;</p>
<pre><code class="lang-python"><span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-keyword">from</span> sklearn <span class="hljs-keyword">import</span> datasets
<span class="hljs-meta">&gt;&gt;&gt; </span>iris = datasets.load_iris()
<span class="hljs-meta">&gt;&gt;&gt; </span>list(iris.keys())
[<span class="hljs-string">&apos;data&apos;</span>, <span class="hljs-string">&apos;target_names&apos;</span>, <span class="hljs-string">&apos;feature_names&apos;</span>, <span class="hljs-string">&apos;target&apos;</span>, <span class="hljs-string">&apos;DESCR&apos;</span>]
<span class="hljs-meta">&gt;&gt;&gt; </span>X = iris[<span class="hljs-string">&quot;data&quot;</span>][:, <span class="hljs-number">3</span>:] <span class="hljs-comment"># petal width</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>y = (iris[<span class="hljs-string">&quot;target&quot;</span>] == <span class="hljs-number">2</span>).astype(np.int)
</code></pre>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x6A21;&#x578B;&#xFF1A;</p>
<pre><code class="lang-python"><span class="hljs-keyword">from</span> sklearn.linear_model <span class="hljs-keyword">import</span> LogisticRegression

log_reg = LogisticRegression()
log_reg.fit(X, y)
</code></pre>
<p>&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;&#x6A21;&#x578B;&#x4F30;&#x8BA1;&#x7684;&#x82B1;&#x74E3;&#x5BBD;&#x5EA6;&#x4ECE; 0 &#x5230; 3 &#x5398;&#x7C73;&#x7684;&#x6982;&#x7387;&#x4F30;&#x8BA1;&#xFF08;&#x5982;&#x56FE; 4-23&#xFF09;&#xFF1A;</p>
<pre><code class="lang-python">X_new = np.linspace(<span class="hljs-number">0</span>, <span class="hljs-number">3</span>, <span class="hljs-number">1000</span>).reshape(<span class="hljs-number">-1</span>, <span class="hljs-number">1</span>)
y_proba = log_reg.predict_proba(X_new)
plt.plot(X_new, y_proba[:, <span class="hljs-number">1</span>], <span class="hljs-string">&quot;g-&quot;</span>, label=<span class="hljs-string">&quot;Iris-Virginica&quot;</span>)
plt.plot(X_new, y_proba[:, <span class="hljs-number">0</span>], <span class="hljs-string">&quot;b--&quot;</span>, label=<span class="hljs-string">&quot;Not Iris-Virginica&quot;</span>)
</code></pre>
<p><img src="../images/chapter_4/&#x56FE;4-23.PNG" alt=""></p>
<p>&#x56FE; 4-23&#xFF1A;&#x6982;&#x7387;&#x4F30;&#x8BA1;&#x548C;&#x51B3;&#x7B56;&#x8FB9;&#x754C;</p>
<p>Virginica &#x82B1;&#x7684;&#x82B1;&#x74E3;&#x5BBD;&#x5EA6;&#xFF08;&#x7528;&#x4E09;&#x89D2;&#x5F62;&#x8868;&#x793A;&#xFF09;&#x5728; 1.4 &#x5398;&#x7C73;&#x5230; 2.5 &#x5398;&#x7C73;&#x4E4B;&#x95F4;&#xFF0C;&#x800C;&#x5176;&#x4ED6;&#x79CD;&#x7C7B;&#x7684;&#x82B1;&#xFF08;&#x7531;&#x6B63;&#x65B9;&#x5F62;&#x8868;&#x793A;&#xFF09;&#x901A;&#x5E38;&#x5177;&#x6709;&#x8F83;&#x5C0F;&#x7684;&#x82B1;&#x74E3;&#x5BBD;&#x5EA6;&#xFF0C;&#x8303;&#x56F4;&#x4ECE; 0.1 &#x5398;&#x7C73;&#x5230; 1.8 &#x5398;&#x7C73;&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x91CD;&#x53E0;&#x3002;&#x5728;&#x5927;&#x7EA6; 2 &#x5398;&#x7C73;&#x4EE5;&#x4E0A;&#x65F6;&#xFF0C;&#x5206;&#x7C7B;&#x5668;&#x975E;&#x5E38;&#x80AF;&#x5B9A;&#x8FD9;&#x6735;&#x82B1;&#x662F;Virginica&#x82B1;&#xFF08;&#x5206;&#x7C7B;&#x5668;&#x6B64;&#x65F6;&#x8F93;&#x51FA;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x9AD8;&#x7684;&#x6982;&#x7387;&#x503C;&#xFF09;&#xFF0C;&#x800C;&#x5728;1&#x5398;&#x7C73;&#x4EE5;&#x4E0B;&#x65F6;&#xFF0C;&#x5B83;&#x975E;&#x5E38;&#x80AF;&#x5B9A;&#x8FD9;&#x6735;&#x82B1;&#x4E0D;&#x662F; Virginica &#x82B1;&#xFF08;&#x4E0D;&#x662F; Virginica &#x82B1;&#x6709;&#x975E;&#x5E38;&#x9AD8;&#x7684;&#x6982;&#x7387;&#xFF09;&#x3002;&#x5728;&#x8FD9;&#x4E24;&#x4E2A;&#x6781;&#x7AEF;&#x4E4B;&#x95F4;&#xFF0C;&#x5206;&#x7C7B;&#x5668;&#x662F;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;&#x5B83;&#x8FDB;&#x884C;&#x9884;&#x6D4B;&#xFF08;&#x4F7F;&#x7528;<code>predict()</code>&#x65B9;&#x6CD5;&#x800C;&#x4E0D;&#x662F;<code>predict_proba()</code>&#x65B9;&#x6CD5;&#xFF09;&#xFF0C;&#x5B83;&#x5C06;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x6700;&#x53EF;&#x80FD;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728; 1.6 &#x5398;&#x7C73;&#x5DE6;&#x53F3;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x51B3;&#x7B56;&#x8FB9;&#x754C;&#xFF0C;&#x8FD9;&#x65F6;&#x4E24;&#x7C7B;&#x60C5;&#x51B5;&#x51FA;&#x73B0;&#x7684;&#x6982;&#x7387;&#x90FD;&#x7B49;&#x4E8E; 50%&#xFF1A;&#x5982;&#x679C;&#x82B1;&#x74E3;&#x5BBD;&#x5EA6;&#x5927;&#x4E8E; 1.6 &#x5398;&#x7C73;&#xFF0C;&#x5219;&#x5206;&#x7C7B;&#x5668;&#x5C06;&#x9884;&#x6D4B;&#x8BE5;&#x82B1;&#x662F; Virginica&#xFF0C;&#x5426;&#x5219;&#x9884;&#x6D4B;&#x5B83;&#x4E0D;&#x662F;&#xFF08;&#x5373;&#x4F7F;&#x5B83;&#x6709;&#x53EF;&#x80FD;&#x9519;&#x4E86;&#xFF09;&#xFF1A;</p>
<pre><code class="lang-python"><span class="hljs-meta">&gt;&gt;&gt; </span>log_reg.predict([[<span class="hljs-number">1.7</span>], [<span class="hljs-number">1.5</span>]])
array([<span class="hljs-number">1</span>, <span class="hljs-number">0</span>])
</code></pre>
<p>&#x56FE; 4-24 &#x8868;&#x793A;&#x76F8;&#x540C;&#x7684;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x6B21;&#x4F7F;&#x7528;&#x4E86;&#x4E24;&#x4E2A;&#x7279;&#x5F81;&#x8FDB;&#x884C;&#x5224;&#x65AD;&#xFF1A;&#x82B1;&#x74E3;&#x7684;&#x5BBD;&#x5EA6;&#x548C;&#x957F;&#x5EA6;&#x3002; &#x4E00;&#x65E6;&#x8BAD;&#x7EC3;&#x5B8C;&#x6BD5;&#xFF0C;Logistic &#x56DE;&#x5F52;&#x5206;&#x7C7B;&#x5668;&#x5C31;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x8FD9;&#x4E24;&#x4E2A;&#x7279;&#x5F81;&#x6765;&#x4F30;&#x8BA1;&#x4E00;&#x6735;&#x82B1;&#x662F; Virginica &#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002; &#x865A;&#x7EBF;&#x8868;&#x793A;&#x8FD9;&#x65F6;&#x4E24;&#x7C7B;&#x60C5;&#x51B5;&#x51FA;&#x73B0;&#x7684;&#x6982;&#x7387;&#x90FD;&#x7B49;&#x4E8E; 50%&#xFF1A;&#x8FD9;&#x662F;&#x6A21;&#x578B;&#x7684;&#x51B3;&#x7B56;&#x8FB9;&#x754C;&#x3002; &#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x7EBF;&#x6027;&#x8FB9;&#x754C;&#x3002;&#x6BCF;&#x6761;&#x5E73;&#x884C;&#x7EBF;&#x90FD;&#x4EE3;&#x8868;&#x4E00;&#x4E2A;&#x5206;&#x7C7B;&#x6807;&#x51C6;&#x4E0B;&#x7684;&#x4E24;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7C7B;&#x7684;&#x6982;&#x7387;&#xFF0C;&#x4ECE; 15%&#xFF08;&#x5DE6;&#x4E0B;&#x89D2;&#xFF09;&#x5230; 90%&#xFF08;&#x53F3;&#x4E0A;&#x89D2;&#xFF09;&#x3002;&#x8D8A;&#x8FC7;&#x53F3;&#x4E0A;&#x89D2;&#x5206;&#x754C;&#x7EBF;&#x7684;&#x70B9;&#x90FD;&#x6709;&#x8D85;&#x8FC7; 90% &#x7684;&#x6982;&#x7387;&#x662F; Virginica &#x82B1;&#x3002;</p>
<p><img src="../images/chapter_4/&#x56FE;4-24.PNG" alt=""></p>
<p>&#x56FE; 4-24&#xFF1A;&#x7EBF;&#x6027;&#x51B3;&#x7B56;&#x8FB9;&#x754C;</p>
<p>&#x5C31;&#x50CF;&#x5176;&#x4ED6;&#x7EBF;&#x6027;&#x6A21;&#x578B;&#xFF0C;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x6A21;&#x578B;&#x4E5F;&#x53EF;&#x4EE5; <img src="../images/tex-8524eb1789cf2093cfccc4c297138c7f.gif" alt="\ell_1"> &#x6216;&#x8005; <img src="../images/tex-f2d02eaf32cb7a351989198531c0d12a.gif" alt="\ell_2"> &#x60E9;&#x7F5A;&#x4F7F;&#x7528;&#x8FDB;&#x884C;&#x6B63;&#x5219;&#x5316;&#x3002;Scikit-Learn &#x9ED8;&#x8BA4;&#x6DFB;&#x52A0;&#x4E86; <img src="../images/tex-f2d02eaf32cb7a351989198531c0d12a.gif" alt="\ell_2"> &#x60E9;&#x7F5A;&#x3002;</p>
<blockquote>
<p>&#x6CE8;&#x610F;</p>
<p>&#x5728; Scikit-Learn &#x7684;<code>LogisticRegression</code>&#x6A21;&#x578B;&#x4E2D;&#x63A7;&#x5236;&#x6B63;&#x5219;&#x5316;&#x5F3A;&#x5EA6;&#x7684;&#x8D85;&#x53C2;&#x6570;&#x4E0D;&#x662F; <img src="../images/tex-7b7f9dbfea05c83784f8b85149852f08.gif" alt="\alpha">&#xFF08;&#x4E0E;&#x5176;&#x4ED6;&#x7EBF;&#x6027;&#x6A21;&#x578B;&#x4E00;&#x6837;&#xFF09;&#xFF0C;&#x800C;&#x662F;&#x5B83;&#x7684;&#x9006;&#xFF1A;<img src="../images/tex-0d61f8370cad1d412f80b84d143e1257.gif" alt="C">&#x3002; <img src="../images/tex-0d61f8370cad1d412f80b84d143e1257.gif" alt="C"> &#x7684;&#x503C;&#x8D8A;&#x5927;&#xFF0C;&#x6A21;&#x578B;&#x6B63;&#x5219;&#x5316;&#x5F3A;&#x5EA6;&#x8D8A;&#x4F4E;&#x3002;</p>
</blockquote>
<h3 id="softmax-&#x56DE;&#x5F52;">Softmax &#x56DE;&#x5F52;</h3>
<p>Logistic &#x56DE;&#x5F52;&#x6A21;&#x578B;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x63A8;&#x5E7F;&#x5230;&#x652F;&#x6301;&#x591A;&#x7C7B;&#x522B;&#x5206;&#x7C7B;&#xFF0C;&#x4E0D;&#x5FC5;&#x7EC4;&#x5408;&#x548C;&#x8BAD;&#x7EC3;&#x591A;&#x4E2A;&#x4E8C;&#x5206;&#x7C7B;&#x5668;&#xFF08;&#x5982;&#x7B2C; 3 &#x7AE0;&#x6240;&#x8FF0;&#xFF09;&#xFF0C; &#x5176;&#x79F0;&#x4E3A; Softmax &#x56DE;&#x5F52;&#x6216;&#x591A;&#x7C7B;&#x522B; Logistic &#x56DE;&#x5F52;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x5F88;&#x7B80;&#x5355;&#xFF1A;&#x5F53;&#x7ED9;&#x5B9A;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B; <img src="../images/tex-70e59a996bd69a0c21878b4093375e92.gif" alt="\mathbf{x}"> &#x65F6;&#xFF0C;Softmax &#x56DE;&#x5F52;&#x6A21;&#x578B;&#x9996;&#x5148;&#x8BA1;&#x7B97; <img src="../images/tex-8ce4b16b22b58894aa86c421e8759df3.gif" alt="k"> &#x7C7B;&#x7684;&#x5206;&#x6570; <img src="../images/tex-a840076f36cc4bef1947d97a65426bb3.gif" alt="s_k(\mathbf{x})">&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x5206;&#x6570;&#x5E94;&#x7528;&#x5728;<code>Softmax</code>&#x51FD;&#x6570;&#xFF08;&#x4E5F;&#x79F0;&#x4E3A;&#x5F52;&#x4E00;&#x5316;&#x6307;&#x6570;&#xFF09;&#x4E0A;&#xFF0C;&#x4F30;&#x8BA1;&#x51FA;&#x6BCF;&#x7C7B;&#x7684;&#x6982;&#x7387;&#x3002; &#x8BA1;&#x7B97; <img src="../images/tex-a840076f36cc4bef1947d97a65426bb3.gif" alt="s_k(\mathbf{x})"> &#x7684;&#x516C;&#x5F0F;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x719F;&#x6089;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5C31;&#x50CF;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x9884;&#x6D4B;&#x7684;&#x516C;&#x5F0F;&#x4E00;&#x6837;&#xFF08;&#x89C1;&#x516C;&#x5F0F; 4-19&#xFF09;&#x3002;</p>
<p>&#x516C;&#x5F0F; 4-19&#xFF1A;<code>k</code>&#x7C7B;&#x7684; Softmax &#x5F97;&#x5206;</p>
<p><img src="../images/tex-ae05c183b5c444d17b885e8f7392e33c.gif" alt="s_k(\mathbf{x})= \theta^T  \cdot \mathbf{x}"></p>
<p>&#x6CE8;&#x610F;&#xFF0C;&#x6BCF;&#x4E2A;&#x7C7B;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x72EC;&#x4E00;&#x65E0;&#x4E8C;&#x7684;&#x53C2;&#x6570;&#x5411;&#x91CF; <img src="../images/tex-9f888eddb683fe5f80f87f44bd727b08.gif" alt="\theta_k">&#x3002; &#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x5411;&#x91CF;&#x901A;&#x5E38;&#x4F5C;&#x4E3A;&#x884C;&#x653E;&#x5728;&#x53C2;&#x6570;&#x77E9;&#x9635; <img src="../images/tex-b9dce96eb3d5a71b28f9f198c28d2d1b.gif" alt="\Theta"> &#x4E2D;&#x3002;</p>
<p>&#x4E00;&#x65E6;&#x4F60;&#x8BA1;&#x7B97;&#x4E86;&#x6837;&#x672C; <img src="../images/tex-70e59a996bd69a0c21878b4093375e92.gif" alt="\mathbf{x}"> &#x7684;&#x6BCF;&#x4E00;&#x7C7B;&#x7684;&#x5F97;&#x5206;&#xFF0C;&#x4F60;&#x4FBF;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;<code>Softmax</code>&#x51FD;&#x6570;&#xFF08;&#x516C;&#x5F0F; 4-20&#xFF09;&#x4F30;&#x8BA1;&#x51FA;&#x6837;&#x672C;&#x5C5E;&#x4E8E;&#x7B2C; <img src="../images/tex-8ce4b16b22b58894aa86c421e8759df3.gif" alt="k"> &#x7C7B;&#x7684;&#x6982;&#x7387; <img src="../images/tex-6d3e49353ea5640912d4b8ae768bdb32.gif" alt="\hat{p}_k">&#xFF1A;&#x901A;&#x8FC7;&#x8BA1;&#x7B97; <img src="../images/tex-e1671797c52e15f763380b45e841ec32.gif" alt="e"> &#x7684; <img src="../images/tex-a840076f36cc4bef1947d97a65426bb3.gif" alt="s_k(\mathbf{x})"> &#x6B21;&#x65B9;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x5B83;&#x4EEC;&#x8FDB;&#x884C;&#x5F52;&#x4E00;&#x5316;&#xFF08;&#x9664;&#x4EE5;&#x6240;&#x6709;&#x5206;&#x5B50;&#x7684;&#x603B;&#x548C;&#xFF09;&#x3002;</p>
<p>&#x516C;&#x5F0F; 4-20&#xFF1A;Softmax &#x51FD;&#x6570;</p>
<p><img src="../images/tex-9fff59e9f5c122d355124bb1bf98c0ff.gif" alt="\hat{p_k}=\sigma{(\mathbf{s}(\mathbf{x}))}k= \frac{exp\left(s_k(\mathbf{x})\right)} {\sum_{j=1}^{K}exp\left(s_j(\mathbf{x})\right)}"></p>
<ul>
<li><img src="../images/tex-a5f3c6a11b03839d46af9fb43c97c188.gif" alt="K"> &#x8868;&#x793A;&#x6709;&#x591A;&#x5C11;&#x7C7B;</li>
<li><img src="../images/tex-875757e99c779a8aaac585041fe96bb7.gif" alt="\mathbf{s}(\mathbf{x})"> &#x8868;&#x793A;&#x5305;&#x542B;&#x6837;&#x672C; <img src="../images/tex-70e59a996bd69a0c21878b4093375e92.gif" alt="\mathbf{x}"> &#x6BCF;&#x4E00;&#x7C7B;&#x5F97;&#x5206;&#x7684;&#x5411;&#x91CF;</li>
<li><img src="../images/tex-7ccc7a43b364826d3d3caf874433ba74.gif" alt="\sigma{(\mathbf{s}(\mathbf{x}))_k}"> &#x8868;&#x793A;&#x7ED9;&#x5B9A;&#x6BCF;&#x4E00;&#x7C7B;&#x5206;&#x6570;&#x4E4B;&#x540E;&#xFF0C;&#x5B9E;&#x4F8B; <img src="../images/tex-70e59a996bd69a0c21878b4093375e92.gif" alt="\mathbf{x}"> &#x5C5E;&#x4E8E;&#x7B2C; <img src="../images/tex-8ce4b16b22b58894aa86c421e8759df3.gif" alt="k"> &#x7C7B;&#x7684;&#x6982;&#x7387;</li>
</ul>
<p>&#x548C; Logistic &#x56DE;&#x5F52;&#x5206;&#x7C7B;&#x5668;&#x4E00;&#x6837;&#xFF0C;Softmax &#x56DE;&#x5F52;&#x5206;&#x7C7B;&#x5668;&#x5C06;&#x4F30;&#x8BA1;&#x6982;&#x7387;&#x6700;&#x9AD8;&#xFF08;&#x5B83;&#x53EA;&#x662F;&#x5F97;&#x5206;&#x6700;&#x9AD8;&#x7684;&#x7C7B;&#xFF09;&#x7684;&#x90A3;&#x7C7B;&#x4F5C;&#x4E3A;&#x9884;&#x6D4B;&#x7ED3;&#x679C;&#xFF0C;&#x5982;&#x516C;&#x5F0F; 4-21 &#x6240;&#x793A;&#x3002;</p>
<p>&#x516C;&#x5F0F; 4-21&#xFF1A;Softmax &#x56DE;&#x5F52;&#x6A21;&#x578B;&#x5206;&#x7C7B;&#x5668;&#x9884;&#x6D4B;&#x7ED3;&#x679C;</p>
<p><img src="../images/tex-a294eed0207348e7e8d2b0ca72aabf83.gif" alt="\hat{y}=argmax\ \sigma{(\mathbf{s}(\mathbf{x}))_k}=argmax \ s_k(\mathbf{x})=argmax \ \left( \theta_k^T  \cdot \mathbf{x}\right)"></p>
<ul>
<li><code>argmax</code>&#x8FD0;&#x7B97;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x53D6;&#x5230;&#x6700;&#x5927;&#x503C;&#x7684;&#x53D8;&#x91CF;&#x503C;&#x3002; &#x5728;&#x8FD9;&#x4E2A;&#x7B49;&#x5F0F;&#xFF0C;&#x5B83;&#x8FD4;&#x56DE;&#x4F7F; <img src="../images/tex-7ccc7a43b364826d3d3caf874433ba74.gif" alt="\sigma{(\mathbf{s}(\mathbf{x}))_k}"> &#x6700;&#x5927;&#x65F6;&#x7684; <img src="../images/tex-8ce4b16b22b58894aa86c421e8759df3.gif" alt="k"> &#x7684;&#x503C;</li>
</ul>
<blockquote>
<p>&#x6CE8;&#x610F;</p>
<p>Softmax &#x56DE;&#x5F52;&#x5206;&#x7C7B;&#x5668;&#x4E00;&#x6B21;&#x53EA;&#x80FD;&#x9884;&#x6D4B;&#x4E00;&#x4E2A;&#x7C7B;&#xFF08;&#x5373;&#x5B83;&#x662F;&#x591A;&#x7C7B;&#x7684;&#xFF0C;&#x4F46;&#x4E0D;&#x662F;&#x591A;&#x8F93;&#x51FA;&#x7684;&#xFF09;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x53EA;&#x80FD;&#x7528;&#x4E8E;&#x5224;&#x65AD;&#x4E92;&#x65A5;&#x7684;&#x7C7B;&#x522B;&#xFF0C;&#x5982;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x690D;&#x7269;&#x3002; &#x4F60;&#x4E0D;&#x80FD;&#x7528;&#x5B83;&#x6765;&#x8BC6;&#x522B;&#x4E00;&#x5F20;&#x7167;&#x7247;&#x4E2D;&#x7684;&#x591A;&#x4E2A;&#x4EBA;&#x3002;</p>
</blockquote>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#x5982;&#x4F55;&#x4F30;&#x8BA1;&#x6982;&#x7387;&#x5E76;&#x8FDB;&#x884C;&#x9884;&#x6D4B;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x5C06;&#x4ECB;&#x7ECD;&#x5982;&#x4F55;&#x8BAD;&#x7EC3;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#x662F;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x6A21;&#x578B;&#x5728;&#x76EE;&#x6807;&#x7C7B;&#x522B;&#x4E0A;&#x6709;&#x7740;&#x8F83;&#x9AD8;&#x7684;&#x6982;&#x7387;&#xFF08;&#x56E0;&#x6B64;&#x5176;&#x4ED6;&#x7C7B;&#x522B;&#x7684;&#x6982;&#x7387;&#x8F83;&#x4F4E;&#xFF09;&#xFF0C;&#x6700;&#x5C0F;&#x5316;&#x516C;&#x5F0F; 4-22 &#x53EF;&#x4EE5;&#x8FBE;&#x5230;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#xFF0C;&#x5176;&#x8868;&#x793A;&#x4E86;&#x5F53;&#x524D;&#x6A21;&#x578B;&#x7684;&#x635F;&#x5931;&#x51FD;&#x6570;&#xFF0C;&#x79F0;&#x4E3A;&#x4EA4;&#x53C9;&#x71B5;&#xFF0C;&#x5F53;&#x6A21;&#x578B;&#x5BF9;&#x76EE;&#x6807;&#x7C7B;&#x5F97;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x8F83;&#x4F4E;&#x7684;&#x6982;&#x7387;&#xFF0C;&#x5176;&#x4F1A;&#x60E9;&#x7F5A;&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#x3002; &#x4EA4;&#x53C9;&#x71B5;&#x901A;&#x5E38;&#x7528;&#x4E8E;&#x8861;&#x91CF;&#x5F85;&#x6D4B;&#x7C7B;&#x522B;&#x4E0E;&#x76EE;&#x6807;&#x7C7B;&#x522B;&#x7684;&#x5339;&#x914D;&#x7A0B;&#x5EA6;&#xFF08;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x540E;&#x9762;&#x7684;&#x7AE0;&#x8282;&#x4E2D;&#x591A;&#x6B21;&#x4F7F;&#x7528;&#x5B83;&#xFF09;</p>
<p>&#x516C;&#x5F0F; 4-22&#xFF1A;&#x4EA4;&#x53C9;&#x71B5;</p>
<p><img src="../images/tex-b20e626988e6c696012b02def76d5c6a.gif" alt="J(\Theta)=-\frac{1}{m}\sum\limits_{i=1}^m\sum\limits_{k=1}^Ky_k^{(i)}log\left(\hat{p}_k^{(i)}\right)"></p>
<ul>
<li>&#x5982;&#x679C;&#x5BF9;&#x4E8E;&#x7B2C; <img src="../images/tex-865c0c0b4ab0e063e5caa3387c1a8741.gif" alt="i"> &#x4E2A;&#x5B9E;&#x4F8B;&#x7684;&#x76EE;&#x6807;&#x7C7B;&#x662F; <img src="../images/tex-8ce4b16b22b58894aa86c421e8759df3.gif" alt="k">&#xFF0C;&#x90A3;&#x4E48; <img src="../images/tex-8691f6b1f536233c7a2929e62280ffa0.gif" alt="y_k^{(i)}=1">&#xFF0C;&#x53CD;&#x4E4B; <img src="../images/tex-c8dda7e9c58592db5a22add487f77cf9.gif" alt="y_k^{(i)}=0">&#x3002;</li>
</ul>
<p>&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x5F53;&#x53EA;&#x6709;&#x4E24;&#x4E2A;&#x7C7B;&#xFF08;<img src="../images/tex-5869b95a3404e737433d626520200848.gif" alt="K=2">&#xFF09;&#x65F6;&#xFF0C;&#x6B64;&#x635F;&#x5931;&#x51FD;&#x6570;&#x7B49;&#x540C;&#x4E8E; Logistic &#x56DE;&#x5F52;&#x7684;&#x635F;&#x5931;&#x51FD;&#x6570;&#xFF08;&#x5BF9;&#x6570;&#x635F;&#x5931;&#xFF1B;&#x8BF7;&#x53C2;&#x9605;&#x516C;&#x5F0F; 4-17&#xFF09;&#x3002;</p>
<blockquote>
<p>&#x4EA4;&#x53C9;&#x71B5;</p>
<p>&#x4EA4;&#x53C9;&#x71B5;&#x6E90;&#x4E8E;&#x4FE1;&#x606F;&#x8BBA;&#x3002;&#x5047;&#x8BBE;&#x4F60;&#x60F3;&#x8981;&#x9AD8;&#x6548;&#x5730;&#x4F20;&#x8F93;&#x6BCF;&#x5929;&#x7684;&#x5929;&#x6C14;&#x4FE1;&#x606F;&#x3002;&#x5982;&#x679C;&#x6709;&#x516B;&#x4E2A;&#x9009;&#x9879;&#xFF08;&#x6674;&#x5929;&#xFF0C;&#x96E8;&#x5929;&#x7B49;&#xFF09;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;3&#x4F4D;&#x5BF9;&#x6BCF;&#x4E2A;&#x9009;&#x9879;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#xFF0C;&#x56E0;&#x4E3A; <img src="../images/tex-5f344a952e29992de54b8cfe645b2d5b.gif" alt="2^3=8">&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8BA4;&#x4E3A;&#x51E0;&#x4E4E;&#x6BCF;&#x5929;&#x90FD;&#x662F;&#x6674;&#x5929;&#xFF0C;&#x66F4;&#x9AD8;&#x6548;&#x7684;&#x7F16;&#x7801;&#x201C;&#x6674;&#x5929;&#x201D;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#xFF1A;&#x53EA;&#x7528;&#x4E00;&#x4F4D;&#xFF08;0&#xFF09;&#x3002;&#x5269;&#x4E0B;&#x7684;&#x4E03;&#x9879;&#x4F7F;&#x7528;&#x56DB;&#x4F4D;&#xFF08;&#x4ECE; 1 &#x5F00;&#x59CB;&#xFF09;&#x3002;&#x4EA4;&#x53C9;&#x71B5;&#x5EA6;&#x91CF;&#x6BCF;&#x4E2A;&#x9009;&#x9879;&#x5B9E;&#x9645;&#x53D1;&#x9001;&#x7684;&#x5E73;&#x5747;&#x6BD4;&#x7279;&#x6570;&#x3002; &#x5982;&#x679C;&#x4F60;&#x5BF9;&#x5929;&#x6C14;&#x7684;&#x5047;&#x8BBE;&#x662F;&#x5B8C;&#x7F8E;&#x7684;&#xFF0C;&#x4EA4;&#x53C9;&#x71B5;&#x5C31;&#x7B49;&#x4E8E;&#x5929;&#x6C14;&#x672C;&#x8EAB;&#x7684;&#x71B5;&#xFF08;&#x5373;&#x5176;&#x5185;&#x90E8;&#x7684;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#xFF09;&#x3002; &#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7684;&#x5047;&#x8BBE;&#x662F;&#x9519;&#x8BEF;&#x7684;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x7ECF;&#x5E38;&#x4E0B;&#x96E8;&#xFF09;&#x4EA4;&#x53C9;&#x71B5;&#x5C06;&#x4F1A;&#x66F4;&#x5927;&#xFF0C;&#x79F0;&#x4E3A; Kullback-Leibler &#x6563;&#x5EA6;&#xFF08;KL &#x6563;&#x5EA6;&#xFF09;&#x3002;</p>
<p>&#x4E24;&#x4E2A;&#x6982;&#x7387;&#x5206;&#x5E03; <img src="../images/tex-83878c91171338902e0fe0fb97a8c47a.gif" alt="p"> &#x548C; <img src="../images/tex-7694f4a66316e53c8cdd9d9954bd611d.gif" alt="q"> &#x4E4B;&#x95F4;&#x7684;&#x4EA4;&#x53C9;&#x71B5;&#x5B9A;&#x4E49;&#x4E3A;&#xFF1A;<img src="../images/tex-6bc68f603b52e51645b4bbd318f8cdfe.gif" alt="H(p,q)=-\sum_xp(x)\log q(x)">&#xFF08;&#x5206;&#x5E03;&#x81F3;&#x5C11;&#x662F;&#x79BB;&#x6563;&#x7684;&#xFF09;</p>
</blockquote>
<p>&#x8FD9;&#x4E2A;&#x635F;&#x5931;&#x51FD;&#x6570;&#x5173;&#x4E8E; <img src="../images/tex-9f888eddb683fe5f80f87f44bd727b08.gif" alt="\theta_k"> &#x7684;&#x68AF;&#x5EA6;&#x5411;&#x91CF;&#x4E3A;&#x516C;&#x5F0F; 4-23&#xFF1A;</p>
<p>&#x516C;&#x5F0F; 4-23&#xFF1A;<code>k</code>&#x7C7B;&#x4EA4;&#x53C9;&#x71B5;&#x7684;&#x68AF;&#x5EA6;&#x5411;&#x91CF;</p>
<p><img src="../images/tex-5dfdb421c5936031346fc0e53a028caf.gif" alt="\nabla_{\theta_k}J(\Theta)=\frac{1}{m}\sum\limits_{i=1}^m\left(\hat{p}_k^{(i)}-y_k^{(i)}\right)\mathbf{x}^{(i)}"></p>
<p>&#x73B0;&#x5728;&#x4F60;&#x53EF;&#x4EE5;&#x8BA1;&#x7B97;&#x6BCF;&#x4E00;&#x7C7B;&#x7684;&#x68AF;&#x5EA6;&#x5411;&#x91CF;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#xFF08;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x7684;&#x4F18;&#x5316;&#x7B97;&#x6CD5;&#xFF09;&#x627E;&#x5230;&#x4F7F;&#x5F97;&#x635F;&#x5931;&#x51FD;&#x6570;&#x8FBE;&#x5230;&#x6700;&#x5C0F;&#x503C;&#x7684;&#x53C2;&#x6570;&#x77E9;&#x9635; <img src="../images/tex-b9dce96eb3d5a71b28f9f198c28d2d1b.gif" alt="\Theta">&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x4F7F;&#x7528; Softmax &#x56DE;&#x5F52;&#x5BF9;&#x4E09;&#x79CD;&#x9E22;&#x5C3E;&#x82B1;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#x3002;&#x5F53;&#x4F60;&#x4F7F;&#x7528;<code>LogisticRregression</code>&#x5BF9;&#x6A21;&#x578B;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#x65F6;&#xFF0C;Scikit Learn &#x9ED8;&#x8BA4;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x4E00;&#x5BF9;&#x591A;&#x6A21;&#x578B;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;<code>multi_class</code>&#x53C2;&#x6570;&#x4E3A;&#x201C;multinomial&#x201D;&#x6765;&#x628A;&#x5B83;&#x6539;&#x53D8;&#x4E3A; Softmax &#x56DE;&#x5F52;&#x3002;&#x4F60;&#x8FD8;&#x5FC5;&#x987B;&#x6307;&#x5B9A;&#x4E00;&#x4E2A;&#x652F;&#x6301; Softmax &#x56DE;&#x5F52;&#x7684;&#x6C42;&#x89E3;&#x5668;&#xFF0C;&#x4F8B;&#x5982;&#x201C;lbfgs&#x201D;&#x6C42;&#x89E3;&#x5668;&#xFF08;&#x6709;&#x5173;&#x66F4;&#x591A;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x9605; Scikit-Learn &#x7684;&#x6587;&#x6863;&#xFF09;&#x3002;&#x5176;&#x9ED8;&#x8BA4;&#x4F7F;&#x7528; <img src="../images/tex-f2d02eaf32cb7a351989198531c0d12a.gif" alt="\ell_12"> &#x6B63;&#x5219;&#x5316;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8D85;&#x53C2;&#x6570; <img src="../images/tex-0d61f8370cad1d412f80b84d143e1257.gif" alt="C"> &#x63A7;&#x5236;&#x5B83;&#x3002;</p>
<pre><code class="lang-python">X = iris[<span class="hljs-string">&quot;data&quot;</span>][:, (<span class="hljs-number">2</span>, <span class="hljs-number">3</span>)] <span class="hljs-comment"># petal length, petal width</span>
y = iris[<span class="hljs-string">&quot;target&quot;</span>]

softmax_reg = LogisticRegression(multi_class=<span class="hljs-string">&quot;multinomial&quot;</span>,solver=<span class="hljs-string">&quot;lbfgs&quot;</span>, C=<span class="hljs-number">10</span>)
softmax_reg.fit(X, y)
</code></pre>
<p>&#x6240;&#x4EE5;&#x4E0B;&#x6B21;&#x4F60;&#x53D1;&#x73B0;&#x4E00;&#x4E2A;&#x82B1;&#x74E3;&#x957F;&#x4E3A; 5 &#x5398;&#x7C73;&#xFF0C;&#x5BBD;&#x4E3A; 2 &#x5398;&#x7C73;&#x7684;&#x9E22;&#x5C3E;&#x82B1;&#x65F6;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x95EE;&#x4F60;&#x7684;&#x6A21;&#x578B;&#x4F60;&#x5B83;&#x662F;&#x54EA;&#x4E00;&#x7C7B;&#x9E22;&#x5C3E;&#x82B1;&#xFF0C;&#x5B83;&#x4F1A;&#x56DE;&#x7B54; 94.2% &#x662F; Virginica &#x82B1;&#xFF08;&#x7B2C;&#x4E8C;&#x7C7B;&#xFF09;&#xFF0C;&#x6216;&#x8005; 5.8% &#x662F;&#x5176;&#x4ED6;&#x9E22;&#x5C3E;&#x82B1;&#x3002;</p>
<pre><code class="lang-python"><span class="hljs-meta">&gt;&gt;&gt; </span>softmax_reg.predict([[<span class="hljs-number">5</span>, <span class="hljs-number">2</span>]])
array([<span class="hljs-number">2</span>])
<span class="hljs-meta">&gt;&gt;&gt; </span>softmax_reg.predict_proba([[<span class="hljs-number">5</span>, <span class="hljs-number">2</span>]])
array([[ <span class="hljs-number">6.33134078e-07</span>, <span class="hljs-number">5.75276067e-02</span>, <span class="hljs-number">9.42471760e-01</span>]])&#x662F;
</code></pre>
<p><img src="../images/chapter_4/&#x56FE;4-25.PNG" alt=""></p>
<p>&#x56FE; 4-25&#xFF1A;Softmax &#x56DE;&#x5F52;&#x7684;&#x51B3;&#x7B56;&#x8FB9;&#x754C;</p>
<p>&#x56FE; 4-25 &#x7528;&#x4E0D;&#x540C;&#x80CC;&#x666F;&#x8272;&#x8868;&#x793A;&#x4E86;&#x7ED3;&#x679C;&#x7684;&#x51B3;&#x7B56;&#x8FB9;&#x754C;&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x4EFB;&#x4F55;&#x4E24;&#x4E2A;&#x7C7B;&#x4E4B;&#x95F4;&#x7684;&#x51B3;&#x7B56;&#x8FB9;&#x754C;&#x662F;&#x7EBF;&#x6027;&#x7684;&#x3002; &#x8BE5;&#x56FE;&#x7684;&#x66F2;&#x7EBF;&#x8868;&#x793A; Versicolor &#x7C7B;&#x7684;&#x6982;&#x7387;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x7528; 0.450 &#x6807;&#x8BB0;&#x7684;&#x66F2;&#x7EBF;&#x8868;&#x793A; 45% &#x7684;&#x6982;&#x7387;&#x8FB9;&#x754C;&#xFF09;&#x3002;&#x6CE8;&#x610F;&#x6A21;&#x578B;&#x4E5F;&#x53EF;&#x4EE5;&#x9884;&#x6D4B;&#x4E00;&#x4E2A;&#x6982;&#x7387;&#x4F4E;&#x4E8E; 50% &#x7684;&#x7C7B;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x6240;&#x6709;&#x51B3;&#x7B56;&#x8FB9;&#x754C;&#x76F8;&#x9047;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x6240;&#x6709;&#x7C7B;&#x7684;&#x4F30;&#x8BA1;&#x6982;&#x7387;&#x76F8;&#x7B49;&#xFF0C;&#x5206;&#x522B;&#x4E3A; 33%&#x3002;</p>
<h2 id="&#x7EC3;&#x4E60;">&#x7EC3;&#x4E60;</h2>
<ol>
<li>&#x5982;&#x679C;&#x4F60;&#x6709;&#x4E00;&#x4E2A;&#x6570;&#x767E;&#x4E07;&#x7279;&#x5F81;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x9009;&#x62E9;&#x54EA;&#x79CD;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x8BAD;&#x7EC3;&#x7B97;&#x6CD5;&#xFF1F;</li>
<li>&#x5047;&#x8BBE;&#x4F60;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#x7279;&#x5F81;&#x7684;&#x6570;&#x503C;&#x5C3A;&#x5EA6;&#xFF08;scale&#xFF09;&#x6709;&#x7740;&#x975E;&#x5E38;&#x5927;&#x7684;&#x5DEE;&#x5F02;&#xFF0C;&#x54EA;&#x79CD;&#x7B97;&#x6CD5;&#x4F1A;&#x53D7;&#x5230;&#x5F71;&#x54CD;&#xFF1F;&#x6709;&#x591A;&#x5927;&#x7684;&#x5F71;&#x54CD;&#xFF1F;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E9B;&#x5F71;&#x54CD;&#x4F60;&#x53EF;&#x4EE5;&#x505A;&#x4EC0;&#x4E48;&#xFF1F;</li>
<li>&#x8BAD;&#x7EC3; Logistic &#x56DE;&#x5F52;&#x6A21;&#x578B;&#x65F6;&#xFF0C;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x662F;&#x5426;&#x4F1A;&#x9677;&#x5165;&#x5C40;&#x90E8;&#x6700;&#x4F4E;&#x70B9;&#xFF1F;</li>
<li>&#x5728;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x8BAD;&#x7EC3;&#x65F6;&#x95F4;&#x4E0B;&#xFF0C;&#x662F;&#x5426;&#x6240;&#x6709;&#x7684;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x90FD;&#x4F1A;&#x5F97;&#x5230;&#x76F8;&#x540C;&#x7684;&#x6A21;&#x578B;&#x53C2;&#x6570;&#xFF1F;</li>
<li>&#x5047;&#x8BBE;&#x4F60;&#x4F7F;&#x7528;&#x6279;&#x91CF;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x6CD5;&#xFF0C;&#x753B;&#x51FA;&#x6BCF;&#x4E00;&#x4EE3;&#x7684;&#x9A8C;&#x8BC1;&#x8BEF;&#x5DEE;&#x3002;&#x5F53;&#x4F60;&#x53D1;&#x73B0;&#x9A8C;&#x8BC1;&#x8BEF;&#x5DEE;&#x4E00;&#x76F4;&#x589E;&#x5927;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#xFF1F;&#x4F60;&#x600E;&#x4E48;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF1F;</li>
<li>&#x5F53;&#x9A8C;&#x8BC1;&#x8BEF;&#x5DEE;&#x5347;&#x9AD8;&#x65F6;&#xFF0C;&#x7ACB;&#x5373;&#x505C;&#x6B62;&#x5C0F;&#x6279;&#x91CF;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x662F;&#x5426;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x4E3B;&#x610F;&#xFF1F;</li>
<li>&#x54EA;&#x4E2A;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7B97;&#x6CD5;&#xFF08;&#x5728;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x7684;&#x90A3;&#x4E9B;&#x7B97;&#x6CD5;&#x4E2D;&#xFF09;&#x53EF;&#x4EE5;&#x6700;&#x5FEB;&#x5230;&#x8FBE;&#x89E3;&#x7684;&#x9644;&#x8FD1;&#xFF1F;&#x54EA;&#x4E2A;&#x7684;&#x786E;&#x5B9E;&#x4F1A;&#x6536;&#x655B;&#xFF1F;&#x600E;&#x4E48;&#x4F7F;&#x5176;&#x4ED6;&#x7B97;&#x6CD5;&#x4E5F;&#x6536;&#x655B;&#xFF1F;</li>
<li>&#x5047;&#x8BBE;&#x4F60;&#x4F7F;&#x7528;&#x591A;&#x9879;&#x5F0F;&#x56DE;&#x5F52;&#xFF0C;&#x753B;&#x51FA;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;&#xFF0C;&#x5728;&#x56FE;&#x4E0A;&#x53D1;&#x73B0;&#x5B66;&#x4E60;&#x8BEF;&#x5DEE;&#x548C;&#x9A8C;&#x8BC1;&#x8BEF;&#x5DEE;&#x4E4B;&#x95F4;&#x6709;&#x7740;&#x5F88;&#x5927;&#x7684;&#x95F4;&#x9699;&#x3002;&#x8FD9;&#x8868;&#x793A;&#x53D1;&#x751F;&#x4E86;&#x4EC0;&#x4E48;&#xFF1F;&#x6709;&#x54EA;&#x4E09;&#x79CD;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF1F;</li>
<li>&#x5047;&#x8BBE;&#x4F60;&#x4F7F;&#x7528;&#x5CAD;&#x56DE;&#x5F52;&#xFF0C;&#x5E76;&#x53D1;&#x73B0;&#x8BAD;&#x7EC3;&#x8BEF;&#x5DEE;&#x548C;&#x9A8C;&#x8BC1;&#x8BEF;&#x5DEE;&#x90FD;&#x5F88;&#x9AD8;&#xFF0C;&#x5E76;&#x4E14;&#x51E0;&#x4E4E;&#x76F8;&#x7B49;&#x3002;&#x4F60;&#x7684;&#x6A21;&#x578B;&#x8868;&#x73B0;&#x662F;&#x9AD8;&#x504F;&#x5DEE;&#x8FD8;&#x662F;&#x9AD8;&#x65B9;&#x5DEE;&#xFF1F;&#x8FD9;&#x65F6;&#x4F60;&#x5E94;&#x8BE5;&#x589E;&#x5927;&#x6B63;&#x5219;&#x5316;&#x53C2;&#x6570; <img src="../images/tex-7b7f9dbfea05c83784f8b85149852f08.gif" alt="\alpha">&#xFF0C;&#x8FD8;&#x662F;&#x964D;&#x4F4E;&#x5B83;&#xFF1F;</li>
<li>&#x4F60;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x8FD9;&#x6837;&#x505A;&#xFF1A;<ul>
<li>&#x4F7F;&#x7528;&#x5CAD;&#x56DE;&#x5F52;&#x4EE3;&#x66FF;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#xFF1F;</li>
<li>Lasso &#x56DE;&#x5F52;&#x4EE3;&#x66FF;&#x5CAD;&#x56DE;&#x5F52;&#xFF1F;</li>
<li>&#x5F39;&#x6027;&#x7F51;&#x7EDC;&#x4EE3;&#x66FF; Lasso &#x56DE;&#x5F52;&#xFF1F;</li>
</ul>
</li>
<li>&#x5047;&#x8BBE;&#x4F60;&#x60F3;&#x5224;&#x65AD;&#x4E00;&#x526F;&#x56FE;&#x7247;&#x662F;&#x5BA4;&#x5185;&#x8FD8;&#x662F;&#x5BA4;&#x5916;&#xFF0C;&#x767D;&#x5929;&#x8FD8;&#x662F;&#x665A;&#x4E0A;&#x3002;&#x4F60;&#x5E94;&#x8BE5;&#x9009;&#x62E9;&#x4E8C;&#x4E2A;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x8FD8;&#x662F;&#x4E00;&#x4E2A; Softmax &#x5206;&#x7C7B;&#x5668;&#xFF1F;</li>
<li>&#x5728; Softmax &#x56DE;&#x5F52;&#x4E0A;&#x5E94;&#x7528;&#x6279;&#x91CF;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7684;&#x65E9;&#x671F;&#x505C;&#x6B62;&#x6CD5;&#xFF08;&#x4E0D;&#x4F7F;&#x7528; Scikit-Learn&#xFF09;&#x3002;</li>
</ol>
<p>&#x9644;&#x5F55; A &#x63D0;&#x4F9B;&#x4E86;&#x8FD9;&#x4E9B;&#x7EC3;&#x4E60;&#x7684;&#x7B54;&#x6848;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="3.分类.html" class="navigation navigation-prev " aria-label="Previous page: 三、分类">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="5.支持向量机.html" class="navigation navigation-next " aria-label="Next page: 五、支持向量机">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"四、训练模型","level":"1.6","depth":1,"next":{"title":"五、支持向量机","level":"1.7","depth":1,"path":"docs/5.支持向量机.md","ref":"docs/5.支持向量机.md","articles":[]},"previous":{"title":"三、分类","level":"1.5","depth":1,"path":"docs/3.分类.md","ref":"docs/3.分类.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"docs/4.训练模型.md","mtime":"2019-04-18T03:01:37.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-05-07T09:41:36.357Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

