
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>八、降维 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="9.启动并运行_TensorFlow.html" />
    
    
    <link rel="prev" href="7.集成学习和随机森林.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Sklearn 与 TensorFlow 机器学习实用指南
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="0.前言.html">
            
                <a href="0.前言.html">
            
                    
                    零、前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="1.机器学习概览.html">
            
                <a href="1.机器学习概览.html">
            
                    
                    一、机器学习概览
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="2.一个完整的机器学习项目.html">
            
                <a href="2.一个完整的机器学习项目.html">
            
                    
                    二、一个完整的机器学习项目
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="3.分类.html">
            
                <a href="3.分类.html">
            
                    
                    三、分类
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="4.训练模型.html">
            
                <a href="4.训练模型.html">
            
                    
                    四、训练模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="5.支持向量机.html">
            
                <a href="5.支持向量机.html">
            
                    
                    五、支持向量机
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="6.决策树.html">
            
                <a href="6.决策树.html">
            
                    
                    六、决策树
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="7.集成学习和随机森林.html">
            
                <a href="7.集成学习和随机森林.html">
            
                    
                    七、集成学习和随机森林
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.10" data-path="8.降维.html">
            
                <a href="8.降维.html">
            
                    
                    八、降维
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="9.启动并运行_TensorFlow.html">
            
                <a href="9.启动并运行_TensorFlow.html">
            
                    
                    九、启动并运行 TensorFlow
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="10.人工神经网络介绍.html">
            
                <a href="10.人工神经网络介绍.html">
            
                    
                    十、人工神经网络介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="11.训练深层神经网络.html">
            
                <a href="11.训练深层神经网络.html">
            
                    
                    十一、训练深层神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="12.设备和服务器上的分布式_TensorFlow.html">
            
                <a href="12.设备和服务器上的分布式_TensorFlow.html">
            
                    
                    十二、设备和服务器上的分布式 TensorFlow
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="13.卷积神经网络.html">
            
                <a href="13.卷积神经网络.html">
            
                    
                    十三、卷积神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="14.循环神经网络.html">
            
                <a href="14.循环神经网络.html">
            
                    
                    十四、循环神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="15.自编码器.html">
            
                <a href="15.自编码器.html">
            
                    
                    十五、自编码器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="16.强化学习.html">
            
                <a href="16.强化学习.html">
            
                    
                    十六、强化学习
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="B.机器学习项目清单.html">
            
                <a href="B.机器学习项目清单.html">
            
                    
                    附录 B、机器学习项目清单
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="C.SVM_对偶问题.html">
            
                <a href="C.SVM_对偶问题.html">
            
                    
                    附录 C、SVM 对偶问题
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="D.自动微分.html">
            
                <a href="D.自动微分.html">
            
                    
                    附录 D、自动微分
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >八、降维</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x516B;&#x3001;&#x964D;&#x7EF4;">&#x516B;&#x3001;&#x964D;&#x7EF4;</h1>
<blockquote>
<p>&#x8BD1;&#x8005;&#xFF1A;<a href="https://github.com/zehuichen123" target="_blank">@loveSnowBest</a></p>
<p>&#x6821;&#x5BF9;&#x8005;&#xFF1A;<a href="https://github.com/wizardforcel" target="_blank">@&#x98DE;&#x9F99;</a>&#x3001;<a href="https://github.com/PeterHo" target="_blank">@PeterHo</a>&#x3001;<a href="https://github.com/yanmengk" target="_blank">@yanmengk</a>&#x3001;<a href="https://github.com/xinqiu" target="_blank">@XinQiu</a>&#x3001;<a href="https://github.com/Lisanaaa" target="_blank">@Lisanaaa</a></p>
</blockquote>
<p>&#x5F88;&#x591A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x95EE;&#x9898;&#x90FD;&#x4F1A;&#x6D89;&#x53CA;&#x5230;&#x6709;&#x7740;&#x51E0;&#x5343;&#x751A;&#x81F3;&#x6570;&#x767E;&#x4E07;&#x7EF4;&#x7684;&#x7279;&#x5F81;&#x7684;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#x3002;&#x8FD9;&#x4E0D;&#x4EC5;&#x8BA9;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x7F13;&#x6162;&#xFF0C;&#x540C;&#x65F6;&#x8FD8;&#x5F88;&#x96BE;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x89E3;&#xFF0C;&#x6211;&#x4EEC;&#x63A5;&#x4E0B;&#x6765;&#x5C31;&#x4F1A;&#x9047;&#x5230;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x3002;&#x8FD9;&#x79CD;&#x95EE;&#x9898;&#x901A;&#x5E38;&#x88AB;&#x79F0;&#x4E3A;&#x7EF4;&#x6570;&#x707E;&#x96BE;&#xFF08;curse of dimentionality&#xFF09;&#x3002;  </p>
<p>&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x73B0;&#x5B9E;&#x751F;&#x6D3B;&#x4E2D;&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x53EF;&#x4EE5;&#x6781;&#x5927;&#x7684;&#x964D;&#x4F4E;&#x7279;&#x5F81;&#x7EF4;&#x5EA6;&#xFF0C;&#x5C06;&#x4E00;&#x4E2A;&#x5341;&#x5206;&#x68D8;&#x624B;&#x7684;&#x95EE;&#x9898;&#x8F6C;&#x53D8;&#x6210;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x8F83;&#x4E3A;&#x5BB9;&#x6613;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5BF9;&#x4E8E; MNIST &#x56FE;&#x7247;&#x96C6;&#xFF08;&#x7B2C; 3 &#x7AE0;&#x4E2D;&#x63D0;&#x5230;&#xFF09;&#xFF1A;&#x56FE;&#x7247;&#x56DB;&#x5468;&#x8FB9;&#x7F18;&#x90E8;&#x5206;&#x7684;&#x50CF;&#x7D20;&#x51E0;&#x4E4E;&#x603B;&#x662F;&#x767D;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x4F60;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x5C06;&#x8FD9;&#x4E9B;&#x50CF;&#x7D20;&#x4ECE;&#x4F60;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#x6254;&#x6389;&#x800C;&#x4E0D;&#x4F1A;&#x4E22;&#x5931;&#x592A;&#x591A;&#x4FE1;&#x606F;&#x3002;&#x56FE; 7-6 &#x5411;&#x6211;&#x4EEC;&#x8BC1;&#x5B9E;&#x4E86;&#x8FD9;&#x4E9B;&#x50CF;&#x7D20;&#x7684;&#x786E;&#x5BF9;&#x6211;&#x4EEC;&#x7684;&#x5206;&#x7C7B;&#x4EFB;&#x52A1;&#x662F;&#x5B8C;&#x5168;&#x4E0D;&#x91CD;&#x8981;&#x7684;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x4E24;&#x4E2A;&#x76F8;&#x90BB;&#x7684;&#x50CF;&#x7D20;&#x5F80;&#x5F80;&#x662F;&#x9AD8;&#x5EA6;&#x76F8;&#x5173;&#x7684;&#xFF1A;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8981;&#x5C06;&#x4ED6;&#x4EEC;&#x5408;&#x5E76;&#x6210;&#x4E00;&#x4E2A;&#x50CF;&#x7D20;&#xFF08;&#x6BD4;&#x5982;&#x53D6;&#x8FD9;&#x4E24;&#x4E2A;&#x50CF;&#x7D20;&#x70B9;&#x7684;&#x5E73;&#x5747;&#x503C;&#xFF09;&#x4F60;&#x5E76;&#x4E0D;&#x4F1A;&#x4E22;&#x5931;&#x5F88;&#x591A;&#x4FE1;&#x606F;&#x3002;  </p>
<blockquote>
<p>&#x8B66;&#x544A;&#xFF1A;&#x964D;&#x7EF4;&#x80AF;&#x5B9A;&#x4F1A;&#x4E22;&#x5931;&#x4E00;&#x4E9B;&#x4FE1;&#x606F;&#xFF08;&#x8FD9;&#x5C31;&#x597D;&#x6BD4;&#x5C06;&#x4E00;&#x4E2A;&#x56FE;&#x7247;&#x538B;&#x7F29;&#x6210; JPEG &#x7684;&#x683C;&#x5F0F;&#x4F1A;&#x964D;&#x4F4E;&#x56FE;&#x50CF;&#x7684;&#x8D28;&#x91CF;&#xFF09;&#xFF0C;&#x56E0;&#x6B64;&#x5373;&#x4F7F;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x52A0;&#x5FEB;&#x8BAD;&#x7EC3;&#x7684;&#x901F;&#x5EA6;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x4F1A;&#x8BA9;&#x4F60;&#x7684;&#x7CFB;&#x7EDF;&#x8868;&#x73B0;&#x7684;&#x7A0D;&#x5FAE;&#x5DEE;&#x4E00;&#x70B9;&#x3002;&#x964D;&#x7EF4;&#x4F1A;&#x8BA9;&#x4F60;&#x7684;&#x5DE5;&#x4F5C;&#x6D41;&#x6C34;&#x7EBF;&#x66F4;&#x590D;&#x6742;&#x56E0;&#x800C;&#x66F4;&#x96BE;&#x7EF4;&#x62A4;&#x3002;&#x6240;&#x6709;&#x4F60;&#x5E94;&#x8BE5;&#x5148;&#x5C1D;&#x8BD5;&#x4F7F;&#x7528;&#x539F;&#x59CB;&#x7684;&#x6570;&#x636E;&#x6765;&#x8BAD;&#x7EC3;&#xFF0C;&#x5982;&#x679C;&#x8BAD;&#x7EC3;&#x901F;&#x5EA6;&#x592A;&#x6162;&#x7684;&#x8BDD;&#x518D;&#x8003;&#x8651;&#x4F7F;&#x7528;&#x964D;&#x7EF4;&#x3002;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x964D;&#x4F4E;&#x8BAD;&#x7EC3;&#x96C6;&#x6570;&#x636E;&#x7684;&#x7EF4;&#x5EA6;&#x53EF;&#x80FD;&#x4F1A;&#x7B5B;&#x9009;&#x6389;&#x4E00;&#x4E9B;&#x566A;&#x97F3;&#x548C;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x4F1A;&#x8BA9;&#x4F60;&#x7684;&#x7ED3;&#x679C;&#x6BD4;&#x964D;&#x7EF4;&#x4E4B;&#x524D;&#x66F4;&#x597D;&#xFF08;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x901A;&#x5E38;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#xFF1B;&#x5B83;&#x53EA;&#x4F1A;&#x52A0;&#x5FEB;&#x4F60;&#x8BAD;&#x7EC3;&#x7684;&#x901F;&#x5EA6;&#xFF09;&#x3002;</p>
</blockquote>
<p>&#x964D;&#x7EF4;&#x9664;&#x4E86;&#x53EF;&#x4EE5;&#x52A0;&#x5FEB;&#x8BAD;&#x7EC3;&#x901F;&#x5EA6;&#x5916;&#xFF0C;&#x5728;&#x6570;&#x636E;&#x53EF;&#x89C6;&#x5316;&#x65B9;&#x9762;&#xFF08;&#x6216;&#x8005; DataViz&#xFF09;&#x4E5F;&#x5341;&#x5206;&#x6709;&#x7528;&#x3002;&#x964D;&#x4F4E;&#x7279;&#x5F81;&#x7EF4;&#x5EA6;&#x5230; 2&#xFF08;&#x6216;&#x8005; 3&#xFF09;&#x7EF4;&#x4ECE;&#x800C;&#x53EF;&#x4EE5;&#x5728;&#x56FE;&#x4E2D;&#x753B;&#x51FA;&#x4E00;&#x4E2A;&#x9AD8;&#x7EF4;&#x5EA6;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x89C6;&#x89C9;&#x76F4;&#x89C2;&#x7684;&#x53D1;&#x73B0;&#x4E00;&#x4E9B;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x6BD4;&#x5982;&#x805A;&#x7C7B;&#x3002;  </p>
<p>&#x5728;&#x8FD9;&#x4E00;&#x7AE0;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x8BA8;&#x8BBA;&#x7EF4;&#x6570;&#x707E;&#x96BE;&#x95EE;&#x9898;&#x5E76;&#x4E14;&#x4E86;&#x89E3;&#x5728;&#x9AD8;&#x7EF4;&#x7A7A;&#x95F4;&#x7684;&#x6570;&#x636E;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x5C55;&#x793A;&#x4E24;&#x79CD;&#x4E3B;&#x8981;&#x7684;&#x964D;&#x7EF4;&#x65B9;&#x6CD5;&#xFF1A;&#x6295;&#x5F71;&#xFF08;projection&#xFF09;&#x548C;&#x6D41;&#x5F62;&#x5B66;&#x4E60;&#xFF08;Manifold Learning&#xFF09;&#xFF0C;&#x540C;&#x65F6;&#x6211;&#x4EEC;&#x8FD8;&#x4F1A;&#x4ECB;&#x7ECD;&#x4E09;&#x79CD;&#x6D41;&#x884C;&#x7684;&#x964D;&#x7EF4;&#x6280;&#x672F;&#xFF1A;&#x4E3B;&#x6210;&#x5206;&#x5206;&#x6790;&#xFF08;PCA&#xFF09;&#xFF0C;&#x6838;&#x4E3B;&#x6210;&#x5206;&#x5206;&#x6790;&#xFF08;Kernel PCA&#xFF09;&#x548C;&#x5C40;&#x90E8;&#x7EBF;&#x6027;&#x5D4C;&#x5165;&#xFF08;LLE&#xFF09;&#x3002;  </p>
<h2 id="&#x7EF4;&#x6570;&#x707E;&#x96BE;">&#x7EF4;&#x6570;&#x707E;&#x96BE;</h2>
<p>&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x4E60;&#x60EF;&#x751F;&#x6D3B;&#x5728;&#x4E00;&#x4E2A;&#x4E09;&#x7EF4;&#x7684;&#x4E16;&#x754C;&#x91CC;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x5F53;&#x6211;&#x4EEC;&#x5C1D;&#x8BD5;&#x60F3;&#x8C61;&#x66F4;&#x9AD8;&#x7EF4;&#x7684;&#x7A7A;&#x95F4;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x76F4;&#x89C9;&#x4E0D;&#x7BA1;&#x7528;&#x4E86;&#x3002;&#x5373;&#x4F7F;&#x662F;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x7684; 4D &#x8D85;&#x6B63;&#x65B9;&#x4F53;&#x4E5F;&#x5F88;&#x96BE;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x8111;&#x4E2D;&#x60F3;&#x8C61;&#x51FA;&#x6765;&#xFF08;&#x89C1;&#x56FE; 8-1&#xFF09;&#xFF0C;&#x66F4;&#x4E0D;&#x7528;&#x8BF4;&#x4E00;&#x4E2A; 200 &#x7EF4;&#x7684;&#x692D;&#x7403;&#x5F2F;&#x66F2;&#x5728;&#x4E00;&#x4E2A; 1000 &#x7EF4;&#x7684;&#x7A7A;&#x95F4;&#x91CC;&#x4E86;&#x3002;  </p>
<p><img src="../images/chapter_8/8-1.gif" alt=""></p>
<p>&#x56FE; 8-1 &#x70B9;&#xFF0C;&#x7EBF;&#xFF0C;&#x65B9;&#x5F62;&#xFF0C;&#x7ACB;&#x65B9;&#x4F53;&#x548C;&#x8D85;&#x6B63;&#x65B9;&#x4F53;&#xFF08;0D &#x5230; 4D &#x8D85;&#x6B63;&#x65B9;&#x4F53;&#xFF09;  </p>
<p>&#x8FD9;&#x8868;&#x660E;&#x5F88;&#x591A;&#x7269;&#x4F53;&#x5728;&#x9AD8;&#x7EF4;&#x7A7A;&#x95F4;&#x8868;&#x73B0;&#x7684;&#x5341;&#x5206;&#x4E0D;&#x540C;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5728;&#x4E00;&#x4E2A;&#x6B63;&#x65B9;&#x5F62;&#x5355;&#x5143;&#x4E2D;&#x968F;&#x673A;&#x53D6;&#x4E00;&#x4E2A;&#x70B9;&#xFF08;&#x4E00;&#x4E2A;<code>1&#xD7;1</code>&#x7684;&#x6B63;&#x65B9;&#x5F62;&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x968F;&#x673A;&#x9009;&#x7684;&#x70B9;&#x79BB;&#x6240;&#x6709;&#x8FB9;&#x754C;&#x5927;&#x4E8E; 0.001&#xFF08;&#x9760;&#x8FD1;&#x4E2D;&#x95F4;&#x4F4D;&#x7F6E;&#xFF09;&#x7684;&#x6982;&#x7387;&#x4E3A; 0.4%&#xFF08;<code>1 - 0.998^2</code>&#xFF09;&#xFF08;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x4EA7;&#x751F;&#x7684;&#x70B9;&#x4E0D;&#x5927;&#x53EF;&#x80FD;&#x4E25;&#x683C;&#x843D;&#x5728;&#x67D0;&#x4E00;&#x4E2A;&#x7EF4;&#x5EA6;&#x4E0A;&#x3002;&#x4F46;&#x662F;&#x5728;&#x4E00;&#x4E2A; 1,0000 &#x7EF4;&#x7684;&#x5355;&#x4F4D;&#x8D85;&#x6B63;&#x65B9;&#x4F53;&#xFF08;&#x4E00;&#x4E2A;<code>1&#xD7;1&#xD7;...&#xD7;1</code>&#x7684;&#x7ACB;&#x65B9;&#x4F53;&#xFF0C;&#x6709; 10,000 &#x4E2A; 1&#xFF09;&#xFF0C;&#x8FD9;&#x79CD;&#x53EF;&#x80FD;&#x6027;&#x8D85;&#x8FC7;&#x4E86; 99.999999%&#x3002;&#x5728;&#x9AD8;&#x7EF4;&#x8D85;&#x6B63;&#x65B9;&#x4F53;&#x4E2D;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x70B9;&#x90FD;&#x5206;&#x5E03;&#x5728;&#x8FB9;&#x754C;&#x5904;&#x3002;   </p>
<p>&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x66F4;&#x9EBB;&#x70E6;&#x7684;&#x533A;&#x522B;&#xFF1A;&#x5982;&#x679C;&#x4F60;&#x5728;&#x4E00;&#x4E2A;&#x5E73;&#x65B9;&#x5355;&#x4F4D;&#x4E2D;&#x968F;&#x673A;&#x9009;&#x53D6;&#x4E24;&#x4E2A;&#x70B9;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E24;&#x4E2A;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x8DDD;&#x79BB;&#x5E73;&#x5747;&#x7EA6;&#x4E3A; 0.52&#x3002;&#x5982;&#x679C;&#x60A8;&#x5728;&#x5355;&#x4F4D; 3D &#x7ACB;&#x65B9;&#x4F53;&#x4E2D;&#x9009;&#x53D6;&#x4E24;&#x4E2A;&#x968F;&#x673A;&#x70B9;&#xFF0C;&#x5E73;&#x5747;&#x8DDD;&#x79BB;&#x5C06;&#x5927;&#x81F4;&#x4E3A; 0.66&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5728;&#x4E00;&#x4E2A; 1,000,000 &#x7EF4;&#x8D85;&#x7ACB;&#x65B9;&#x4F53;&#x4E2D;&#x968F;&#x673A;&#x62BD;&#x53D6;&#x4E24;&#x70B9;&#x5462;&#xFF1F;&#x90A3;&#x4E48;&#xFF0C;&#x5E73;&#x5747;&#x8DDD;&#x79BB;&#xFF0C;&#x4FE1;&#x4E0D;&#x4FE1;&#x7531;&#x4F60;&#xFF0C;&#x5927;&#x6982;&#x4E3A; 408.25&#xFF08;&#x5927;&#x81F4; <img src="../images/tex-50eeccb6ef846e2d0af5daef5cab1fa0.gif" alt="\sqrt{1,000,000/6}">&#xFF09;&#xFF01;&#x8FD9;&#x975E;&#x5E38;&#x8FDD;&#x53CD;&#x76F4;&#x89C9;&#xFF1A;&#x5F53;&#x5B83;&#x4EEC;&#x90FD;&#x4F4D;&#x4E8E;&#x540C;&#x4E00;&#x5355;&#x5143;&#x8D85;&#x7ACB;&#x65B9;&#x4F53;&#x5185;&#x65F6;&#xFF0C;&#x4E24;&#x70B9;&#x662F;&#x600E;&#x4E48;&#x8DDD;&#x79BB;&#x8FD9;&#x4E48;&#x8FDC;&#x7684;&#xFF1F;&#x8FD9;&#x4E00;&#x4E8B;&#x5B9E;&#x610F;&#x5473;&#x7740;&#x9AD8;&#x7EF4;&#x6570;&#x636E;&#x96C6;&#x6709;&#x5F88;&#x5927;&#x98CE;&#x9669;&#x5206;&#x5E03;&#x7684;&#x975E;&#x5E38;&#x7A00;&#x758F;&#xFF1A;&#x5927;&#x591A;&#x6570;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#x53EF;&#x80FD;&#x5F7C;&#x6B64;&#x8FDC;&#x79BB;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x4E5F;&#x610F;&#x5473;&#x7740;&#x4E00;&#x4E2A;&#x65B0;&#x5B9E;&#x4F8B;&#x53EF;&#x80FD;&#x8FDC;&#x79BB;&#x4EFB;&#x4F55;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x9884;&#x6D4B;&#x7684;&#x53EF;&#x9760;&#x6027;&#x8FDC;&#x4F4E;&#x4E8E;&#x6211;&#x4EEC;&#x5904;&#x7406;&#x8F83;&#x4F4E;&#x7EF4;&#x5EA6;&#x6570;&#x636E;&#x7684;&#x9884;&#x6D4B;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x5C06;&#x57FA;&#x4E8E;&#x66F4;&#x5927;&#x7684;&#x63A8;&#x6D4B;&#xFF08;extrapolations&#xFF09;&#x3002;&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x7EF4;&#x5EA6;&#x8D8A;&#x9AD8;&#xFF0C;&#x8FC7;&#x62DF;&#x5408;&#x7684;&#x98CE;&#x9669;&#x5C31;&#x8D8A;&#x5927;&#x3002;  </p>
<p>&#x7406;&#x8BBA;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x7EF4;&#x6570;&#x7206;&#x70B8;&#x7684;&#x4E00;&#x4E2A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x589E;&#x52A0;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x5927;&#x5C0F;&#x4ECE;&#x800C;&#x8FBE;&#x5230;&#x62E5;&#x6709;&#x8DB3;&#x591F;&#x5BC6;&#x5EA6;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#x3002;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x8FBE;&#x5230;&#x7ED9;&#x5B9A;&#x5BC6;&#x5EA6;&#x6240;&#x9700;&#x7684;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#x7684;&#x6570;&#x91CF;&#x968F;&#x7740;&#x7EF4;&#x5EA6;&#x7684;&#x6570;&#x91CF;&#x5448;&#x6307;&#x6570;&#x589E;&#x957F;&#x3002;&#x5982;&#x679C;&#x53EA;&#x6709; 100 &#x4E2A;&#x7279;&#x5F81;&#xFF08;&#x6BD4; MNIST &#x95EE;&#x9898;&#x8981;&#x5C11;&#x5F97;&#x591A;&#xFF09;&#x5E76;&#x4E14;&#x5047;&#x8BBE;&#x5B83;&#x4EEC;&#x5747;&#x5300;&#x5206;&#x5E03;&#x5728;&#x6240;&#x6709;&#x7EF4;&#x5EA6;&#x4E0A;&#xFF0C;&#x90A3;&#x4E48;&#x5982;&#x679C;&#x60F3;&#x8981;&#x5404;&#x4E2A;&#x4E34;&#x8FD1;&#x7684;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#x4E4B;&#x95F4;&#x7684;&#x8DDD;&#x79BB;&#x5728; 0.1 &#x4EE5;&#x5185;&#xFF0C;&#x60A8;&#x9700;&#x8981;&#x6BD4;&#x5B87;&#x5B99;&#x4E2D;&#x7684;&#x539F;&#x5B50;&#x8FD8;&#x8981;&#x591A;&#x7684;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#x3002;  </p>
<h2 id="&#x964D;&#x7EF4;&#x7684;&#x4E3B;&#x8981;&#x65B9;&#x6CD5;">&#x964D;&#x7EF4;&#x7684;&#x4E3B;&#x8981;&#x65B9;&#x6CD5;</h2>
<p>&#x5728;&#x6211;&#x4EEC;&#x6DF1;&#x5165;&#x7814;&#x7A76;&#x5177;&#x4F53;&#x7684;&#x964D;&#x7EF4;&#x7B97;&#x6CD5;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;&#x964D;&#x4F4E;&#x7EF4;&#x5EA6;&#x7684;&#x4E24;&#x79CD;&#x4E3B;&#x8981;&#x65B9;&#x6CD5;&#xFF1A;&#x6295;&#x5F71;&#x548C;&#x6D41;&#x5F62;&#x5B66;&#x4E60;&#x3002;  </p>
<h3 id="&#x6295;&#x5F71;&#xFF08;projection&#xFF09;">&#x6295;&#x5F71;&#xFF08;Projection&#xFF09;</h3>
<p>&#x5728;&#x5927;&#x591A;&#x6570;&#x73B0;&#x5B9E;&#x751F;&#x6D3B;&#x7684;&#x95EE;&#x9898;&#x4E2D;&#xFF0C;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#x5E76;&#x4E0D;&#x662F;&#x5728;&#x6240;&#x6709;&#x7EF4;&#x5EA6;&#x4E0A;&#x5747;&#x5300;&#x5206;&#x5E03;&#x7684;&#x3002;&#x8BB8;&#x591A;&#x7279;&#x5F81;&#x51E0;&#x4E4E;&#x662F;&#x5E38;&#x6570;&#xFF0C;&#x800C;&#x5176;&#x4ED6;&#x7279;&#x5F81;&#x5219;&#x9AD8;&#x5EA6;&#x76F8;&#x5173;&#xFF08;&#x5982;&#x524D;&#x9762;&#x8BA8;&#x8BBA;&#x7684; MNIST&#xFF09;&#x3002;&#x7ED3;&#x679C;&#xFF0C;&#x6240;&#x6709;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#x5B9E;&#x9645;&#x4E0A;&#x4F4D;&#x4E8E;&#xFF08;&#x6216;&#x63A5;&#x8FD1;&#xFF09;&#x9AD8;&#x7EF4;&#x7A7A;&#x95F4;&#x7684;&#x4F4E;&#x7EF4;&#x5B50;&#x7A7A;&#x95F4;&#x5185;&#x3002;&#x8FD9;&#x542C;&#x8D77;&#x6765;&#x6709;&#x4E9B;&#x62BD;&#x8C61;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x4E0D;&#x59A8;&#x6765;&#x770B;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x3002;&#x5728;&#x56FE; 8-2 &#x4E2D;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x7531;&#x5706;&#x5708;&#x8868;&#x793A;&#x7684; 3D &#x6570;&#x636E;&#x96C6;&#x3002;  </p>
<p><img src="../images/chapter_8/8-2.jpeg" alt=""></p>
<p>&#x56FE; 8-2 &#x4E00;&#x4E2A;&#x5206;&#x5E03;&#x63A5;&#x8FD1;&#x4E8E;2D&#x5B50;&#x7A7A;&#x95F4;&#x7684;3D&#x6570;&#x636E;&#x96C6;</p>
<p>&#x6CE8;&#x610F;&#x5230;&#x6240;&#x6709;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#x7684;&#x5206;&#x5E03;&#x90FD;&#x8D34;&#x8FD1;&#x4E00;&#x4E2A;&#x5E73;&#x9762;&#xFF1A;&#x8FD9;&#x662F;&#x9AD8;&#x7EF4;&#xFF08;3D&#xFF09;&#x7A7A;&#x95F4;&#x7684;&#x8F83;&#x4F4E;&#x7EF4;&#xFF08;2D&#xFF09;&#x5B50;&#x7A7A;&#x95F4;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5C06;&#x6BCF;&#x4E2A;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#x5782;&#x76F4;&#x6295;&#x5F71;&#x5230;&#x8FD9;&#x4E2A;&#x5B50;&#x7A7A;&#x95F4;&#x4E0A;&#xFF08;&#x5C31;&#x50CF;&#x5C06;&#x77ED;&#x7EBF;&#x8FDE;&#x63A5;&#x5230;&#x5E73;&#x9762;&#x7684;&#x70B9;&#x6240;&#x8868;&#x793A;&#x7684;&#x90A3;&#x6837;&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x5982;&#x56FE;8-3&#x6240;&#x793A;&#x7684;&#x65B0;2D&#x6570;&#x636E;&#x96C6;&#x3002;&#x94DB;&#x94DB;&#x94DB;&#xFF01;&#x6211;&#x4EEC;&#x521A;&#x521A;&#x5C06;&#x6570;&#x636E;&#x96C6;&#x7684;&#x7EF4;&#x5EA6;&#x4ECE; 3D &#x964D;&#x4F4E;&#x5230;&#x4E86; 2D&#x3002;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x5750;&#x6807;&#x8F74;&#x5BF9;&#x5E94;&#x4E8E;&#x65B0;&#x7684;&#x7279;&#x5F81;<code>z1</code>&#x548C;<code>z2</code>&#xFF08;&#x5E73;&#x9762;&#x4E0A;&#x6295;&#x5F71;&#x7684;&#x5750;&#x6807;&#xFF09;&#x3002;  </p>
<p><img src="../images/chapter_8/8-3.gif" alt=""></p>
<p>&#x56FE; 8-3 &#x4E00;&#x4E2A;&#x7ECF;&#x8FC7;&#x6295;&#x5F71;&#x540E;&#x7684;&#x65B0;&#x7684; 2D &#x6570;&#x636E;&#x96C6;  </p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x6295;&#x5F71;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x964D;&#x7EF4;&#x7684;&#x6700;&#x4F73;&#x65B9;&#x6CD5;&#x3002;&#x5728;&#x5F88;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B50;&#x7A7A;&#x95F4;&#x53EF;&#x80FD;&#x4F1A;&#x626D;&#x66F2;&#x548C;&#x8F6C;&#x52A8;&#xFF0C;&#x6BD4;&#x5982;&#x56FE; 8-4 &#x6240;&#x793A;&#x7684;&#x7740;&#x540D;&#x745E;&#x58EB;&#x6EDA;&#x52A8;&#x73A9;&#x5177;&#x6570;&#x636E;&#x96C6;&#x3002;  </p>
<p><img src="../images/chapter_8/8-4.jpeg" alt=""></p>
<p>&#x56FE; 8-4 &#x745E;&#x58EB;&#x6EDA;&#x52A8;&#x6570;&#x73A9;&#x5177;&#x6570;&#x636E;&#x96C6;  </p>
<p>&#x7B80;&#x5355;&#x5730;&#x5C06;&#x6570;&#x636E;&#x96C6;&#x6295;&#x5C04;&#x5230;&#x4E00;&#x4E2A;&#x5E73;&#x9762;&#x4E0A;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x76F4;&#x63A5;&#x4E22;&#x5F03;<code>x3</code>&#xFF09;&#x4F1A;&#x5C06;&#x745E;&#x58EB;&#x5377;&#x7684;&#x4E0D;&#x540C;&#x5C42;&#x53E0;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x5982;&#x56FE; 8-5 &#x5DE6;&#x4FA7;&#x6240;&#x793A;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4F60;&#x771F;&#x6B63;&#x60F3;&#x8981;&#x7684;&#x662F;&#x5C55;&#x5F00;&#x745E;&#x58EB;&#x5377;&#x6240;&#x83B7;&#x53D6;&#x5230;&#x7684;&#x7C7B;&#x4F3C;&#x56FE; 8-5 &#x53F3;&#x4FA7;&#x7684; 2D &#x6570;&#x636E;&#x96C6;&#x3002;  </p>
<p><img src="../images/chapter_8/8-5.jpeg" alt=""></p>
<p>&#x56FE; 8-5 &#x6295;&#x5C04;&#x5230;&#x5E73;&#x9762;&#x7684;&#x538B;&#x7F29;&#xFF08;&#x5DE6;&#xFF09;vs &#x5C55;&#x5F00;&#x745E;&#x58EB;&#x5377;&#xFF08;&#x53F3;&#xFF09;</p>
<h3 id="&#x6D41;&#x5F62;&#x5B66;&#x4E60;">&#x6D41;&#x5F62;&#x5B66;&#x4E60;</h3>
<p>&#x745E;&#x58EB;&#x5377;&#x4E00;&#x4E2A;&#x662F;&#x4E8C;&#x7EF4;&#x6D41;&#x5F62;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x4E8C;&#x7EF4;&#x6D41;&#x5F62;&#x662F;&#x4E00;&#x79CD;&#x4E8C;&#x7EF4;&#x5F62;&#x72B6;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5728;&#x66F4;&#x9AD8;&#x7EF4;&#x7A7A;&#x95F4;&#x4E2D;&#x5F2F;&#x66F2;&#x6216;&#x626D;&#x66F2;&#x3002;&#x66F4;&#x4E00;&#x822C;&#x5730;&#xFF0C;&#x4E00;&#x4E2A;<code>d</code>&#x7EF4;&#x6D41;&#x5F62;&#x662F;&#x7C7B;&#x4F3C;&#x4E8E;<code>d</code>&#x7EF4;&#x8D85;&#x5E73;&#x9762;&#x7684;<code>n</code>&#x7EF4;&#x7A7A;&#x95F4;&#xFF08;&#x5176;&#x4E2D;<code>d &lt; n</code>&#xFF09;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x5728;&#x6211;&#x4EEC;&#x745E;&#x58EB;&#x5377;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;<code>d = 2</code>&#xFF0C;<code>n = 3</code>&#xFF1A;&#x5B83;&#x6709;&#x4E9B;&#x50CF; 2D &#x5E73;&#x9762;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x5728;&#x7B2C;&#x4E09;&#x7EF4;&#x4E2D;&#x5377;&#x66F2;&#x3002;  </p>
<p>&#x8BB8;&#x591A;&#x964D;&#x7EF4;&#x7B97;&#x6CD5;&#x901A;&#x8FC7;&#x5BF9;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#x6240;&#x5728;&#x7684;&#x6D41;&#x5F62;&#x8FDB;&#x884C;&#x5EFA;&#x6A21;&#x4ECE;&#x800C;&#x8FBE;&#x5230;&#x964D;&#x7EF4;&#x76EE;&#x7684;&#xFF1B;&#x8FD9;&#x53EB;&#x505A;&#x6D41;&#x5F62;&#x5B66;&#x4E60;&#x3002;&#x5B83;&#x4F9D;&#x8D56;&#x4E8E;&#x6D41;&#x5F62;&#x731C;&#x60F3;&#xFF08;manifold assumption&#xFF09;&#xFF0C;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;&#x6D41;&#x5F62;&#x5047;&#x8BBE;&#xFF08;manifold hypothesis&#xFF09;&#xFF0C;&#x5B83;&#x8BA4;&#x4E3A;&#x5927;&#x591A;&#x6570;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x7684;&#x9AD8;&#x7EF4;&#x6570;&#x636E;&#x96C6;&#x5927;&#x90FD;&#x9760;&#x8FD1;&#x4E00;&#x4E2A;&#x66F4;&#x4F4E;&#x7EF4;&#x7684;&#x6D41;&#x5F62;&#x3002;&#x8FD9;&#x79CD;&#x5047;&#x8BBE;&#x7ECF;&#x5E38;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x88AB;&#x8BC1;&#x5B9E;&#x3002;  </p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x518D;&#x56DE;&#x5230; MNIST &#x6570;&#x636E;&#x96C6;&#xFF1A;&#x6240;&#x6709;&#x624B;&#x5199;&#x6570;&#x5B57;&#x56FE;&#x50CF;&#x90FD;&#x6709;&#x4E00;&#x4E9B;&#x76F8;&#x4F3C;&#x4E4B;&#x5904;&#x3002;&#x5B83;&#x4EEC;&#x7531;&#x8FDE;&#x7EBF;&#x7EC4;&#x6210;&#xFF0C;&#x8FB9;&#x754C;&#x662F;&#x767D;&#x8272;&#x7684;&#xFF0C;&#x5927;&#x591A;&#x662F;&#x5728;&#x56FE;&#x7247;&#x4E2D;&#x4E2D;&#x95F4;&#x7684;&#xFF0C;&#x7B49;&#x7B49;&#x3002;&#x5982;&#x679C;&#x4F60;&#x968F;&#x673A;&#x751F;&#x6210;&#x56FE;&#x50CF;&#xFF0C;&#x53EA;&#x6709;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x624B;&#x5199;&#x6570;&#x5B57;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x5C1D;&#x8BD5;&#x521B;&#x5EFA;&#x6570;&#x5B57;&#x56FE;&#x50CF;&#xFF0C;&#x90A3;&#x4E48;&#x60A8;&#x7684;&#x81EA;&#x7531;&#x5EA6;&#x8FDC;&#x4F4E;&#x4E8E;&#x60A8;&#x751F;&#x6210;&#x4EFB;&#x4F55;&#x968F;&#x4FBF;&#x4E00;&#x4E2A;&#x56FE;&#x50CF;&#x65F6;&#x7684;&#x81EA;&#x7531;&#x5EA6;&#x3002;&#x8FD9;&#x4E9B;&#x7EA6;&#x675F;&#x5F80;&#x5F80;&#x4F1A;&#x5C06;&#x6570;&#x636E;&#x96C6;&#x538B;&#x7F29;&#x5230;&#x8F83;&#x4F4E;&#x7EF4;&#x6D41;&#x5F62;&#x4E2D;&#x3002;  </p>
<p>&#x6D41;&#x5F62;&#x5047;&#x8BBE;&#x901A;&#x5E38;&#x5305;&#x542B;&#x7740;&#x53E6;&#x4E00;&#x4E2A;&#x9690;&#x542B;&#x7684;&#x5047;&#x8BBE;&#xFF1A;&#x4F60;&#x73B0;&#x5728;&#x7684;&#x624B;&#x4E0A;&#x7684;&#x5DE5;&#x4F5C;&#xFF08;&#x4F8B;&#x5982;&#x5206;&#x7C7B;&#x6216;&#x56DE;&#x5F52;&#xFF09;&#x5982;&#x679C;&#x5728;&#x6D41;&#x5F62;&#x7684;&#x8F83;&#x4F4E;&#x7EF4;&#x7A7A;&#x95F4;&#x4E2D;&#x8868;&#x793A;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x4EEC;&#x4F1A;&#x53D8;&#x5F97;&#x66F4;&#x7B80;&#x5355;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x56FE; 8-6 &#x7684;&#x7B2C;&#x4E00;&#x884C;&#x4E2D;&#xFF0C;&#x745E;&#x58EB;&#x5377;&#x88AB;&#x5206;&#x4E3A;&#x4E24;&#x7C7B;&#xFF1A;&#x5728;&#x4E09;&#x7EF4;&#x7A7A;&#x95F4;&#x4E2D;&#xFF08;&#x56FE;&#x5DE6;&#x4E0A;&#xFF09;&#xFF0C;&#x5206;&#x7C7B;&#x8FB9;&#x754C;&#x4F1A;&#x76F8;&#x5F53;&#x590D;&#x6742;&#xFF0C;&#x4F46;&#x5728;&#x4E8C;&#x7EF4;&#x5C55;&#x5F00;&#x7684;&#x6D41;&#x5F62;&#x7A7A;&#x95F4;&#x4E2D;&#xFF08;&#x56FE;&#x53F3;&#x4E0A;&#xFF09;&#xFF0C;&#x5206;&#x7C7B;&#x8FB9;&#x754C;&#x662F;&#x4E00;&#x6761;&#x7B80;&#x5355;&#x7684;&#x76F4;&#x7EBF;&#x3002;  </p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x4E2A;&#x5047;&#x8BBE;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x6210;&#x7ACB;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x56FE; 8-6 &#x7684;&#x6700;&#x4E0B;&#x9762;&#x4E00;&#x884C;&#xFF0C;&#x51B3;&#x7B56;&#x8FB9;&#x754C;&#x4F4D;&#x4E8E;<code>x1 = 5</code>&#xFF08;&#x56FE;&#x5DE6;&#x4E0B;&#xFF09;&#x3002;&#x8FD9;&#x4E2A;&#x51B3;&#x7B56;&#x8FB9;&#x754C;&#x5728;&#x539F;&#x59CB;&#x4E09;&#x7EF4;&#x7A7A;&#x95F4;&#xFF08;&#x4E00;&#x4E2A;&#x5782;&#x76F4;&#x5E73;&#x9762;&#xFF09;&#x770B;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x5728;&#x5C55;&#x5F00;&#x7684;&#x6D41;&#x5F62;&#x4E2D;&#x5374;&#x53D8;&#x5F97;&#x66F4;&#x590D;&#x6742;&#x4E86;&#xFF08;&#x56DB;&#x4E2A;&#x72EC;&#x7ACB;&#x7EBF;&#x6BB5;&#x7684;&#x96C6;&#x5408;&#xFF09;&#xFF08;&#x56FE;&#x53F3;&#x4E0B;&#xFF09;&#x3002;  </p>
<p>&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x8BAD;&#x7EC3;&#x6A21;&#x578B;&#x4E4B;&#x524D;&#x964D;&#x4F4E;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x7EF4;&#x6570;&#xFF0C;&#x90A3;&#x8BAD;&#x7EC3;&#x901F;&#x5EA6;&#x80AF;&#x5B9A;&#x4F1A;&#x52A0;&#x5FEB;&#xFF0C;&#x4F46;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x4F1A;&#x5F97;&#x51FA;&#x66F4;&#x597D;&#x7684;&#x8BAD;&#x7EC3;&#x6548;&#x679C;&#xFF1B;&#x8FD9;&#x4E00;&#x5207;&#x90FD;&#x53D6;&#x51B3;&#x4E8E;&#x6570;&#x636E;&#x96C6;&#x3002;  </p>
<p>&#x5E0C;&#x671B;&#x4F60;&#x73B0;&#x5728;&#x5BF9;&#x4E8E;&#x7EF4;&#x6570;&#x7206;&#x70B8;&#x4EE5;&#x53CA;&#x964D;&#x7EF4;&#x7B97;&#x6CD5;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x6709;&#x4E86;&#x4E00;&#x5B9A;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5BF9;&#x6D41;&#x5F62;&#x5047;&#x8BBE;&#x63D0;&#x51FA;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x672C;&#x7AE0;&#x7684;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x5C06;&#x4ECB;&#x7ECD;&#x4E00;&#x4E9B;&#x6700;&#x6D41;&#x884C;&#x7684;&#x964D;&#x7EF4;&#x7B97;&#x6CD5;&#x3002;  </p>
<p><img src="../images/chapter_8/8-6.jpeg" alt=""></p>
<p>&#x56FE; 8-6 &#x51B3;&#x7B56;&#x8FB9;&#x754C;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x4F1A;&#x5728;&#x4F4E;&#x7EF4;&#x7A7A;&#x95F4;&#x4E2D;&#x53D8;&#x7684;&#x7B80;&#x5355;  </p>
<h2 id="&#x4E3B;&#x6210;&#x5206;&#x5206;&#x6790;&#xFF08;pca&#xFF09;">&#x4E3B;&#x6210;&#x5206;&#x5206;&#x6790;&#xFF08;PCA&#xFF09;</h2>
<p>&#x4E3B;&#x6210;&#x5206;&#x5206;&#x6790;&#xFF08;Principal Component Analysis&#xFF09;&#x662F;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x6700;&#x6D41;&#x884C;&#x7684;&#x964D;&#x7EF4;&#x7B97;&#x6CD5;&#x3002;&#x9996;&#x5148;&#x5B83;&#x627E;&#x5230;&#x63A5;&#x8FD1;&#x6570;&#x636E;&#x96C6;&#x5206;&#x5E03;&#x7684;&#x8D85;&#x5E73;&#x9762;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x90FD;&#x6295;&#x5F71;&#x5230;&#x8FD9;&#x4E2A;&#x8D85;&#x5E73;&#x9762;&#x4E0A;&#x3002;  </p>
<h3 id="&#x4FDD;&#x7559;&#xFF08;&#x6700;&#x5927;&#xFF09;&#x65B9;&#x5DEE;">&#x4FDD;&#x7559;&#xFF08;&#x6700;&#x5927;&#xFF09;&#x65B9;&#x5DEE;</h3>
<p>&#x5728;&#x5C06;&#x8BAD;&#x7EC3;&#x96C6;&#x6295;&#x5F71;&#x5230;&#x8F83;&#x4F4E;&#x7EF4;&#x8D85;&#x5E73;&#x9762;&#x4E4B;&#x524D;&#xFF0C;&#x60A8;&#x9996;&#x5148;&#x9700;&#x8981;&#x9009;&#x62E9;&#x6B63;&#x786E;&#x7684;&#x8D85;&#x5E73;&#x9762;&#x3002;&#x4F8B;&#x5982;&#x56FE; 8-7 &#x5DE6;&#x4FA7;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4E8C;&#x7EF4;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x4EE5;&#x53CA;&#x4E09;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x8F74;&#xFF08;&#x5373;&#x4E00;&#x7EF4;&#x8D85;&#x5E73;&#x9762;&#xFF09;&#x3002;&#x56FE;&#x53F3;&#x8FB9;&#x662F;&#x5C06;&#x6570;&#x636E;&#x96C6;&#x6295;&#x5F71;&#x5230;&#x6BCF;&#x4E2A;&#x8F74;&#x4E0A;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x6B63;&#x5982;&#x4F60;&#x6240;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x6295;&#x5F71;&#x5230;&#x5B9E;&#x7EBF;&#x4E0A;&#x4FDD;&#x7559;&#x4E86;&#x6700;&#x5927;&#x65B9;&#x5DEE;&#xFF0C;&#x800C;&#x5728;&#x70B9;&#x7EBF;&#x4E0A;&#x7684;&#x6295;&#x5F71;&#x53EA;&#x4FDD;&#x7559;&#x4E86;&#x975E;&#x5E38;&#x5C0F;&#x7684;&#x65B9;&#x5DEE;&#xFF0C;&#x6295;&#x5F71;&#x5230;&#x865A;&#x7EBF;&#x4E0A;&#x4FDD;&#x7559;&#x7684;&#x65B9;&#x5DEE;&#x5219;&#x5904;&#x4E8E;&#x4E0A;&#x8FF0;&#x4E24;&#x8005;&#x4E4B;&#x95F4;&#x3002;  </p>
<p><img src="../images/chapter_8/8-7.jpeg" alt=""></p>
<p>&#x56FE; 8-7 &#x9009;&#x62E9;&#x6295;&#x5C04;&#x5230;&#x54EA;&#x4E00;&#x4E2A;&#x5B50;&#x7A7A;&#x95F4;  </p>
<p>&#x9009;&#x62E9;&#x4FDD;&#x6301;&#x6700;&#x5927;&#x65B9;&#x5DEE;&#x7684;&#x8F74;&#x770B;&#x8D77;&#x6765;&#x662F;&#x5408;&#x7406;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5F88;&#x53EF;&#x80FD;&#x6BD4;&#x5176;&#x4ED6;&#x6295;&#x5F71;&#x635F;&#x5931;&#x66F4;&#x5C11;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x8BC1;&#x660E;&#x8FD9;&#x79CD;&#x9009;&#x62E9;&#x7684;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#xFF0C;&#x9009;&#x62E9;&#x8FD9;&#x4E2A;&#x8F74;&#x4F7F;&#x5F97;&#x5C06;&#x539F;&#x59CB;&#x6570;&#x636E;&#x96C6;&#x6295;&#x5F71;&#x5230;&#x8BE5;&#x8F74;&#x4E0A;&#x7684;&#x5747;&#x65B9;&#x8DDD;&#x79BB;&#x6700;&#x5C0F;&#x3002;&#x8FD9;&#x662F;&#x5C31; PCA &#x80CC;&#x540E;&#x7684;&#x601D;&#x60F3;&#xFF0C;&#x76F8;&#x5F53;&#x7B80;&#x5355;&#x3002;  </p>
<h3 id="&#x4E3B;&#x6210;&#x5206;&#xFF08;principle-componets&#xFF09;">&#x4E3B;&#x6210;&#x5206;&#xFF08;Principle Componets&#xFF09;</h3>
<p>PCA &#x5BFB;&#x627E;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#x53EF;&#x83B7;&#x5F97;&#x6700;&#x5927;&#x65B9;&#x5DEE;&#x7684;&#x8F74;&#x3002;&#x5728;&#x56FE; 8-7 &#x4E2D;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x6761;&#x5B9E;&#x7EBF;&#x3002;&#x5B83;&#x8FD8;&#x53D1;&#x73B0;&#x4E86;&#x4E00;&#x4E2A;&#x4E0E;&#x7B2C;&#x4E00;&#x4E2A;&#x8F74;&#x6B63;&#x4EA4;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x8F74;&#xFF0C;&#x9009;&#x62E9;&#x5B83;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x6700;&#x5927;&#x7684;&#x6B8B;&#x5DEE;&#x3002;&#x5728;&#x8FD9;&#x4E2A; 2D &#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6CA1;&#x6709;&#x9009;&#x62E9;&#xFF1A;&#x5C31;&#x53EA;&#x6709;&#x8FD9;&#x6761;&#x70B9;&#x7EBF;&#x3002;&#x4F46;&#x5982;&#x679C;&#x5728;&#x4E00;&#x4E2A;&#x66F4;&#x9AD8;&#x7EF4;&#x7684;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#xFF0C;PCA &#x4E5F;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x4E0E;&#x524D;&#x4E24;&#x4E2A;&#x8F74;&#x6B63;&#x4EA4;&#x7684;&#x7B2C;&#x4E09;&#x4E2A;&#x8F74;&#xFF0C;&#x4EE5;&#x53CA;&#x4E0E;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x7EF4;&#x6570;&#x76F8;&#x540C;&#x7684;&#x7B2C;&#x56DB;&#x4E2A;&#x8F74;&#xFF0C;&#x7B2C;&#x4E94;&#x4E2A;&#x8F74;&#x7B49;&#x3002;
&#x5B9A;&#x4E49;&#x7B2C;<code>i</code>&#x4E2A;&#x8F74;&#x7684;&#x5355;&#x4F4D;&#x77E2;&#x91CF;&#x88AB;&#x79F0;&#x4E3A;&#x7B2C;<code>i</code>&#x4E2A;&#x4E3B;&#x6210;&#x5206;&#xFF08;PC&#xFF09;&#x3002;&#x5728;&#x56FE; 8-7 &#x4E2D;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A; PC &#x662F;<code>c1</code>&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A; PC &#x662F;<code>c2</code>&#x3002;&#x5728;&#x56FE; 8-2 &#x4E2D;&#xFF0C;&#x524D;&#x4E24;&#x4E2A; PC &#x7528;&#x5E73;&#x9762;&#x4E2D;&#x7684;&#x6B63;&#x4EA4;&#x7BAD;&#x5934;&#x8868;&#x793A;&#xFF0C;&#x7B2C;&#x4E09;&#x4E2A; PC &#x4E0E;&#x4E0A;&#x8FF0; PC &#x5F62;&#x6210;&#x7684;&#x5E73;&#x9762;&#x6B63;&#x4EA4;&#xFF08;&#x6307;&#x5411;&#x4E0A;&#x6216;&#x4E0B;&#xFF09;&#x3002;  </p>
<blockquote>
<p>&#x6982;&#x8FF0;&#xFF1A; &#x4E3B;&#x6210;&#x5206;&#x7684;&#x65B9;&#x5411;&#x4E0D;&#x7A33;&#x5B9A;&#xFF1A;&#x5982;&#x679C;&#x60A8;&#x7A0D;&#x5FAE;&#x6253;&#x4E71;&#x4E00;&#x4E0B;&#x8BAD;&#x7EC3;&#x96C6;&#x5E76;&#x518D;&#x6B21;&#x8FD0;&#x884C; PCA&#xFF0C;&#x5219;&#x67D0;&#x4E9B;&#x65B0; PC &#x53EF;&#x80FD;&#x4F1A;&#x6307;&#x5411;&#x4E0E;&#x539F;&#x59CB; PC &#x65B9;&#x5411;&#x76F8;&#x53CD;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5B83;&#x4EEC;&#x901A;&#x5E38;&#x4ECD;&#x4F4D;&#x4E8E;&#x540C;&#x4E00;&#x8F74;&#x7EBF;&#x4E0A;&#x3002;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E00;&#x5BF9; PC &#x751A;&#x81F3;&#x53EF;&#x80FD;&#x4F1A;&#x65CB;&#x8F6C;&#x6216;&#x4EA4;&#x6362;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x5B9A;&#x4E49;&#x7684;&#x5E73;&#x9762;&#x901A;&#x5E38;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#x3002;  </p>
</blockquote>
<p>&#x90A3;&#x4E48;&#x5982;&#x4F55;&#x627E;&#x5230;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x4E3B;&#x6210;&#x5206;&#x5462;&#xFF1F;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x6709;&#x4E00;&#x79CD;&#x79F0;&#x4E3A;&#x5947;&#x5F02;&#x503C;&#x5206;&#x89E3;&#xFF08;SVD&#xFF09;&#x7684;&#x6807;&#x51C6;&#x77E9;&#x9635;&#x5206;&#x89E3;&#x6280;&#x672F;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x8BAD;&#x7EC3;&#x96C6;&#x77E9;&#x9635;<code>X</code>&#x5206;&#x89E3;&#x4E3A;&#x4E09;&#x4E2A;&#x77E9;&#x9635;<code>U&#xB7;&#x3A3;&#xB7;V^T</code>&#x7684;&#x70B9;&#x79EF;&#xFF0C;&#x5176;&#x4E2D;<code>V^T</code>&#x5305;&#x542B;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x7684;&#x6240;&#x6709;&#x4E3B;&#x6210;&#x5206;&#xFF0C;&#x5982;&#x516C;&#x5F0F; 8-1 &#x6240;&#x793A;&#x3002;  </p>
<p>&#x516C;&#x5F0F; 8-1 &#x4E3B;&#x6210;&#x5206;&#x77E9;&#x9635;</p>
<p><img src="../images/chapter_8/e-8-1.gif" alt=""></p>
<p>&#x4E0B;&#x9762;&#x7684; Python &#x4EE3;&#x7801;&#x4F7F;&#x7528;&#x4E86; Numpy &#x63D0;&#x4F9B;&#x7684;<code>svd()</code>&#x51FD;&#x6570;&#x83B7;&#x5F97;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x6240;&#x6709;&#x4E3B;&#x6210;&#x5206;&#xFF0C;&#x7136;&#x540E;&#x63D0;&#x53D6;&#x524D;&#x4E24;&#x4E2A; PC:  </p>
<pre><code class="lang-Python">X_centered=X-X.mean(axis=<span class="hljs-number">0</span>)
U,s,V=np.linalg.svd(X_centered)
c1=V.T[:,<span class="hljs-number">0</span>]
c2=V.T[:,<span class="hljs-number">1</span>]
</code></pre>
<blockquote>
<p>&#x8B66;&#x544A;&#xFF1A;PCA &#x5047;&#x5B9A;&#x6570;&#x636E;&#x96C6;&#x4EE5;&#x539F;&#x70B9;&#x4E3A;&#x4E2D;&#x5FC3;&#x3002;&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x5230;&#x7684;&#xFF0C;Scikit-Learn &#x7684;<code>PCA</code>&#x7C7B;&#x8D1F;&#x8D23;&#x4E3A;&#x60A8;&#x7684;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x5FC3;&#x5316;&#x5904;&#x7406;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x81EA;&#x5DF1;&#x5B9E;&#x73B0; PCA&#xFF08;&#x5982;&#x524D;&#x9762;&#x7684;&#x793A;&#x4F8B;&#x6240;&#x793A;&#xFF09;&#xFF0C;&#x6216;&#x8005;&#x5982;&#x679C;&#x60A8;&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x5E93;&#xFF0C;&#x4E0D;&#x8981;&#x5FD8;&#x8BB0;&#x9996;&#x5148;&#x8981;&#x5148;&#x5BF9;&#x6570;&#x636E;&#x505A;&#x4E2D;&#x5FC3;&#x5316;&#x5904;&#x7406;&#x3002;</p>
</blockquote>
<h3 id="&#x6295;&#x5F71;&#x5230;d&#x7EF4;&#x7A7A;&#x95F4;">&#x6295;&#x5F71;&#x5230;<code>d</code>&#x7EF4;&#x7A7A;&#x95F4;</h3>
<p>&#x4E00;&#x65E6;&#x786E;&#x5B9A;&#x4E86;&#x6240;&#x6709;&#x7684;&#x4E3B;&#x6210;&#x5206;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5C06;&#x6570;&#x636E;&#x96C6;&#x6295;&#x5F71;&#x5230;&#x7531;&#x524D;<code>d</code>&#x4E2A;&#x4E3B;&#x6210;&#x5206;&#x6784;&#x6210;&#x7684;&#x8D85;&#x5E73;&#x9762;&#x4E0A;&#xFF0C;&#x4ECE;&#x800C;&#x5C06;&#x6570;&#x636E;&#x96C6;&#x7684;&#x7EF4;&#x6570;&#x964D;&#x81F3;<code>d</code>&#x7EF4;&#x3002;&#x9009;&#x62E9;&#x8FD9;&#x4E2A;&#x8D85;&#x5E73;&#x9762;&#x53EF;&#x4EE5;&#x786E;&#x4FDD;&#x6295;&#x5F71;&#x5C06;&#x4FDD;&#x7559;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x7684;&#x65B9;&#x5DEE;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x56FE; 8-2 &#x4E2D;&#xFF0C;3D &#x6570;&#x636E;&#x96C6;&#x88AB;&#x6295;&#x5F71;&#x5230;&#x7531;&#x524D;&#x4E24;&#x4E2A;&#x4E3B;&#x6210;&#x5206;&#x5B9A;&#x4E49;&#x7684; 2D &#x5E73;&#x9762;&#xFF0C;&#x4FDD;&#x7559;&#x4E86;&#x5927;&#x90E8;&#x5206;&#x6570;&#x636E;&#x96C6;&#x7684;&#x65B9;&#x5DEE;&#x3002;&#x56E0;&#x6B64;&#xFF0C;2D &#x6295;&#x5F71;&#x770B;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x50CF;&#x539F;&#x59CB; 3D &#x6570;&#x636E;&#x96C6;&#x3002;  </p>
<p>&#x4E3A;&#x4E86;&#x5C06;&#x8BAD;&#x7EC3;&#x96C6;&#x6295;&#x5F71;&#x5230;&#x8D85;&#x5E73;&#x9762;&#x4E0A;&#xFF0C;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x5730;&#x901A;&#x8FC7;&#x8BA1;&#x7B97;&#x8BAD;&#x7EC3;&#x96C6;&#x77E9;&#x9635;<code>X</code>&#x548C;<code>Wd</code>&#x7684;&#x70B9;&#x79EF;&#xFF0C;<code>Wd</code>&#x5B9A;&#x4E49;&#x4E3A;&#x5305;&#x542B;&#x524D;<code>d</code>&#x4E2A;&#x4E3B;&#x6210;&#x5206;&#x7684;&#x77E9;&#x9635;&#xFF08;&#x5373;&#x7531;<code>V^T</code>&#x7684;&#x524D;<code>d</code>&#x5217;&#x7EC4;&#x6210;&#x7684;&#x77E9;&#x9635;&#xFF09;&#xFF0C;&#x5982;&#x516C;&#x5F0F; 8-2 &#x6240;&#x793A;&#x3002;</p>
<p>&#x516C;&#x5F0F; 8-2 &#x5C06;&#x8BAD;&#x7EC3;&#x96C6;&#x6295;&#x5F71;&#x5230;<code>d</code>&#x7EF4;&#x7A7A;&#x95F4;</p>
<p><img src="../images/tex-4d58b6f45f2e33f3ceb537b2b174c09b.gif" alt="X_{d-proj} = X \cdot W_d"></p>
<p>&#x4E0B;&#x9762;&#x7684; Python &#x4EE3;&#x7801;&#x5C06;&#x8BAD;&#x7EC3;&#x96C6;&#x6295;&#x5F71;&#x5230;&#x7531;&#x524D;&#x4E24;&#x4E2A;&#x4E3B;&#x6210;&#x5206;&#x5B9A;&#x4E49;&#x7684;&#x8D85;&#x5E73;&#x9762;&#x4E0A;&#xFF1A;  </p>
<pre><code class="lang-Python">W2=V.T[:,:<span class="hljs-number">2</span>]
X2D=X_centered.dot(W2)
</code></pre>
<p>&#x597D;&#x4E86;&#x4F60;&#x5DF2;&#x7ECF;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x4E86;&#xFF01;&#x4F60;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x7ED9;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#x964D;&#x7EF4;&#x800C;&#x53C8;&#x80FD;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x4FDD;&#x7559;&#x539F;&#x6570;&#x636E;&#x96C6;&#x7684;&#x65B9;&#x5DEE;&#x4E86;&#x3002;  </p>
<h3 id="&#x4F7F;&#x7528;-scikit-learn">&#x4F7F;&#x7528; Scikit-Learn</h3>
<p>Scikit-Learn &#x7684; PCA &#x7C7B;&#x4F7F;&#x7528; SVD &#x5206;&#x89E3;&#x6765;&#x5B9E;&#x73B0;&#xFF0C;&#x5C31;&#x50CF;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x505A;&#x7684;&#x90A3;&#x6837;&#x3002;&#x4EE5;&#x4E0B;&#x4EE3;&#x7801;&#x5E94;&#x7528; PCA &#x5C06;&#x6570;&#x636E;&#x96C6;&#x7684;&#x7EF4;&#x5EA6;&#x964D;&#x81F3;&#x4E24;&#x7EF4;&#xFF08;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x5B83;&#x4F1A;&#x81EA;&#x52A8;&#x5904;&#x7406;&#x6570;&#x636E;&#x7684;&#x4E2D;&#x5FC3;&#x5316;&#xFF09;&#xFF1A;  </p>
<pre><code class="lang-Python"><span class="hljs-keyword">from</span> sklearn.decomposition <span class="hljs-keyword">import</span> PCA

pca=PCA(n_components=<span class="hljs-number">2</span>)
X2D=pca.fit_transform(X)
</code></pre>
<p>&#x5C06; PCA &#x8F6C;&#x5316;&#x5668;&#x5E94;&#x7528;&#x4E8E;&#x6570;&#x636E;&#x96C6;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>components_</code>&#x8BBF;&#x95EE;&#x6BCF;&#x4E00;&#x4E2A;&#x4E3B;&#x6210;&#x5206;&#xFF08;&#x6CE8;&#x610F;&#xFF0C;&#x5B83;&#x8FD4;&#x56DE;&#x4EE5; PC &#x4F5C;&#x4E3A;&#x6C34;&#x5E73;&#x5411;&#x91CF;&#x7684;&#x77E9;&#x9635;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x83B7;&#x5F97;&#x7B2C;&#x4E00;&#x4E2A;&#x4E3B;&#x6210;&#x5206;&#x5219;&#x53EF;&#x4EE5;&#x5199;&#x6210;<code>pca.components_.T[:,0]</code>&#xFF09;&#x3002;</p>
<h3 id="&#x65B9;&#x5DEE;&#x89E3;&#x91CA;&#x7387;&#xFF08;explained-variance-ratio&#xFF09;">&#x65B9;&#x5DEE;&#x89E3;&#x91CA;&#x7387;&#xFF08;Explained Variance Ratio&#xFF09;</h3>
<p>&#x53E6;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x6709;&#x7528;&#x7684;&#x4FE1;&#x606F;&#x662F;&#x6BCF;&#x4E2A;&#x4E3B;&#x6210;&#x5206;&#x7684;&#x65B9;&#x5DEE;&#x89E3;&#x91CA;&#x7387;&#xFF0C;&#x53EF;&#x901A;&#x8FC7;<code>explained_variance_ratio_</code>&#x53D8;&#x91CF;&#x83B7;&#x5F97;&#x3002;&#x5B83;&#x8868;&#x793A;&#x4F4D;&#x4E8E;&#x6BCF;&#x4E2A;&#x4E3B;&#x6210;&#x5206;&#x8F74;&#x4E0A;&#x7684;&#x6570;&#x636E;&#x96C6;&#x65B9;&#x5DEE;&#x7684;&#x6BD4;&#x4F8B;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x4E00;&#x4E0B;&#x56FE; 8-2 &#x4E2D;&#x8868;&#x793A;&#x7684;&#x4E09;&#x7EF4;&#x6570;&#x636E;&#x96C6;&#x524D;&#x4E24;&#x4E2A;&#x5206;&#x91CF;&#x7684;&#x65B9;&#x5DEE;&#x89E3;&#x91CA;&#x7387;&#xFF1A;  </p>
<pre><code>&gt;&gt;&gt; print(pca.explained_variance_ratio_)
array([0.84248607, 0.14631839])
</code></pre><p>&#x8FD9;&#x8868;&#x660E;&#xFF0C;84.2% &#x7684;&#x6570;&#x636E;&#x96C6;&#x65B9;&#x5DEE;&#x4F4D;&#x4E8E;&#x7B2C;&#x4E00;&#x8F74;&#xFF0C;14.6% &#x7684;&#x65B9;&#x5DEE;&#x4F4D;&#x4E8E;&#x7B2C;&#x4E8C;&#x8F74;&#x3002;&#x7B2C;&#x4E09;&#x8F74;&#x7684;&#x8FD9;&#x4E00;&#x6BD4;&#x4F8B;&#x4E0D;&#x5230;1.2&#xFF05;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x5B83;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x5305;&#x542B;&#x4EC0;&#x4E48;&#x4FE1;&#x606F;&#x3002;  </p>
<h3 id="&#x9009;&#x62E9;&#x6B63;&#x786E;&#x7684;&#x7EF4;&#x5EA6;">&#x9009;&#x62E9;&#x6B63;&#x786E;&#x7684;&#x7EF4;&#x5EA6;</h3>
<p>&#x901A;&#x5E38;&#x6211;&#x4EEC;&#x503E;&#x5411;&#x4E8E;&#x9009;&#x62E9;&#x52A0;&#x8D77;&#x6765;&#x5230;&#x65B9;&#x5DEE;&#x89E3;&#x91CA;&#x7387;&#x80FD;&#x591F;&#x8FBE;&#x5230;&#x8DB3;&#x591F;&#x5360;&#x6BD4;&#xFF08;&#x4F8B;&#x5982; 95%&#xFF09;&#x7684;&#x7EF4;&#x5EA6;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4EFB;&#x610F;&#x9009;&#x62E9;&#x8981;&#x964D;&#x4F4E;&#x5230;&#x7684;&#x7EF4;&#x5EA6;&#x6570;&#x91CF;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x9664;&#x975E;&#x60A8;&#x6B63;&#x5728;&#x4E3A;&#x6570;&#x636E;&#x53EF;&#x89C6;&#x5316;&#x800C;&#x964D;&#x4F4E;&#x7EF4;&#x5EA6; -- &#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x60A8;&#x901A;&#x5E38;&#x5E0C;&#x671B;&#x5C06;&#x7EF4;&#x5EA6;&#x964D;&#x4F4E;&#x5230; 2 &#x6216; 3&#x3002;  </p>
<p>&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x5728;&#x4E0D;&#x964D;&#x7EF4;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x8FDB;&#x884C; PCA&#xFF0C;&#x7136;&#x540E;&#x8BA1;&#x7B97;&#x51FA;&#x4FDD;&#x7559;&#x8BAD;&#x7EC3;&#x96C6;&#x65B9;&#x5DEE; 95% &#x6240;&#x9700;&#x7684;&#x6700;&#x5C0F;&#x7EF4;&#x6570;&#xFF1A;  </p>
<pre><code class="lang-Python">pca=PCA()
pac.fit(X)
cumsum=np.cumsum(pca.explained_variance_ratio_)
d=np.argmax(cumsum&gt;=<span class="hljs-number">0.95</span>)+<span class="hljs-number">1</span>
</code></pre>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;<code>n_components = d</code>&#x5E76;&#x518D;&#x6B21;&#x8FD0;&#x884C; PCA&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x66F4;&#x597D;&#x7684;&#x9009;&#x62E9;&#xFF1A;&#x4E0D;&#x6307;&#x5B9A;&#x4F60;&#x60F3;&#x8981;&#x4FDD;&#x7559;&#x7684;&#x4E3B;&#x6210;&#x5206;&#x4E2A;&#x6570;&#xFF0C;&#x800C;&#x662F;&#x5C06;<code>n_components</code>&#x8BBE;&#x7F6E;&#x4E3A; 0.0 &#x5230; 1.0 &#x4E4B;&#x95F4;&#x7684;&#x6D6E;&#x70B9;&#x6570;&#xFF0C;&#x8868;&#x660E;&#x60A8;&#x5E0C;&#x671B;&#x4FDD;&#x7559;&#x7684;&#x65B9;&#x5DEE;&#x6BD4;&#x7387;&#xFF1A;  </p>
<pre><code class="lang-Python">pca=PCA(n_components=<span class="hljs-number">0.95</span>)
X_reduced=pca.fit_transform(X)
</code></pre>
<p>&#x53E6;&#x4E00;&#x79CD;&#x9009;&#x62E9;&#x662F;&#x753B;&#x51FA;&#x65B9;&#x5DEE;&#x89E3;&#x91CA;&#x7387;&#x5173;&#x4E8E;&#x7EF4;&#x6570;&#x7684;&#x51FD;&#x6570;&#xFF08;&#x7B80;&#x5355;&#x5730;&#x7ED8;&#x5236;<code>cumsum</code>&#xFF1B;&#x53C2;&#x89C1;&#x56FE; 8-8&#xFF09;&#x3002;&#x66F2;&#x7EBF;&#x4E2D;&#x901A;&#x5E38;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x8098;&#x90E8;&#xFF0C;&#x65B9;&#x5DEE;&#x89E3;&#x91CA;&#x7387;&#x505C;&#x6B62;&#x5FEB;&#x901F;&#x589E;&#x957F;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x89C6;&#x4E3A;&#x6570;&#x636E;&#x96C6;&#x7684;&#x771F;&#x6B63;&#x7684;&#x7EF4;&#x5EA6;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5C06;&#x7EF4;&#x5EA6;&#x964D;&#x4F4E;&#x5230;&#x5927;&#x7EA6;100&#x4E2A;&#x7EF4;&#x5EA6;&#x4E0D;&#x4F1A;&#x5931;&#x53BB;&#x592A;&#x591A;&#x7684;&#x53EF;&#x89E3;&#x91CA;&#x65B9;&#x5DEE;&#x3002;  </p>
<p><img src="../images/chapter_8/8-8.jpeg" alt=""></p>
<p>&#x56FE; 8-8 &#x53EF;&#x89E3;&#x91CA;&#x65B9;&#x5DEE;&#x5173;&#x4E8E;&#x7EF4;&#x6570;&#x7684;&#x51FD;&#x6570;  </p>
<h3 id="pca-&#x538B;&#x7F29;">PCA &#x538B;&#x7F29;</h3>
<p>&#x663E;&#x7136;&#xFF0C;&#x5728;&#x964D;&#x7EF4;&#x4E4B;&#x540E;&#xFF0C;&#x8BAD;&#x7EC3;&#x96C6;&#x5360;&#x7528;&#x7684;&#x7A7A;&#x95F4;&#x8981;&#x5C11;&#x5F97;&#x591A;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5C1D;&#x8BD5;&#x5C06; PCA &#x5E94;&#x7528;&#x4E8E; MNIST &#x6570;&#x636E;&#x96C6;&#xFF0C;&#x540C;&#x65F6;&#x4FDD;&#x7559; 95% &#x7684;&#x65B9;&#x5DEE;&#x3002;&#x4F60;&#x5E94;&#x8BE5;&#x53D1;&#x73B0;&#x6BCF;&#x4E2A;&#x5B9E;&#x4F8B;&#x53EA;&#x6709; 150 &#x591A;&#x4E2A;&#x7279;&#x5F81;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x539F;&#x6765;&#x7684; 784 &#x4E2A;&#x7279;&#x5F81;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5C3D;&#x7BA1;&#x5927;&#x90E8;&#x5206;&#x65B9;&#x5DEE;&#x90FD;&#x4FDD;&#x7559;&#x4E0B;&#x6765;&#xFF0C;&#x4F46;&#x6570;&#x636E;&#x96C6;&#x73B0;&#x5728;&#x8FD8;&#x4E0D;&#x5230;&#x5176;&#x539F;&#x59CB;&#x5927;&#x5C0F;&#x7684; 20%&#xFF01;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5408;&#x7406;&#x7684;&#x538B;&#x7F29;&#x6BD4;&#x7387;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x8FD9;&#x53EF;&#x4EE5;&#x5982;&#x4F55;&#x6781;&#x5927;&#x5730;&#x52A0;&#x5FEB;&#x5206;&#x7C7B;&#x7B97;&#x6CD5;&#xFF08;&#x5982; SVM &#x5206;&#x7C7B;&#x5668;&#xFF09;&#x7684;&#x901F;&#x5EA6;&#x3002;  </p>
<p>&#x901A;&#x8FC7;&#x5E94;&#x7528; PCA &#x6295;&#x5F71;&#x7684;&#x9006;&#x53D8;&#x6362;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5C06;&#x7F29;&#x5C0F;&#x7684;&#x6570;&#x636E;&#x96C6;&#x89E3;&#x538B;&#x7F29;&#x56DE; 784 &#x7EF4;&#x3002;&#x5F53;&#x7136;&#x8FD9;&#x5E76;&#x4E0D;&#x4F1A;&#x8FD4;&#x56DE;&#x7ED9;&#x4F60;&#x6700;&#x539F;&#x59CB;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x56E0;&#x4E3A;&#x6295;&#x5F71;&#x4E22;&#x5931;&#x4E86;&#x4E00;&#x4E9B;&#x4FE1;&#x606F;&#xFF08;&#x5728;5&#xFF05;&#x7684;&#x65B9;&#x5DEE;&#x5185;&#xFF09;&#xFF0C;&#x4F46;&#x5B83;&#x53EF;&#x80FD;&#x975E;&#x5E38;&#x63A5;&#x8FD1;&#x539F;&#x59CB;&#x6570;&#x636E;&#x3002;&#x539F;&#x59CB;&#x6570;&#x636E;&#x548C;&#x91CD;&#x6784;&#x6570;&#x636E;&#x4E4B;&#x95F4;&#x7684;&#x5747;&#x65B9;&#x8DDD;&#x79BB;&#xFF08;&#x538B;&#x7F29;&#x7136;&#x540E;&#x89E3;&#x538B;&#x7F29;&#xFF09;&#x88AB;&#x79F0;&#x4E3A;&#x91CD;&#x6784;&#x8BEF;&#x5DEE;&#xFF08;reconstruction error&#xFF09;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x5C06; MNIST &#x6570;&#x636E;&#x96C6;&#x538B;&#x7F29;&#x5230; 154 &#x7EF4;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;<code>inverse_transform()</code>&#x65B9;&#x6CD5;&#x5C06;&#x5176;&#x89E3;&#x538B;&#x7F29;&#x56DE; 784 &#x7EF4;&#x3002;&#x56FE; 8-9 &#x663E;&#x793A;&#x4E86;&#x539F;&#x59CB;&#x8BAD;&#x7EC3;&#x96C6;&#xFF08;&#x5DE6;&#x4FA7;&#xFF09;&#x7684;&#x51E0;&#x4F4D;&#x6570;&#x5B57;&#x5728;&#x538B;&#x7F29;&#x5E76;&#x89E3;&#x538B;&#x7F29;&#x540E;&#xFF08;&#x53F3;&#x4FA7;&#xFF09;&#x7684;&#x5BF9;&#x5E94;&#x6570;&#x5B57;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x6709;&#x8F7B;&#x5FAE;&#x7684;&#x56FE;&#x50CF;&#x8D28;&#x91CF;&#x964D;&#x4F4E;&#xFF0C;&#x4F46;&#x6570;&#x5B57;&#x4ECD;&#x7136;&#x5927;&#x90E8;&#x5206;&#x5B8C;&#x597D;&#x65E0;&#x635F;&#x3002;  </p>
<pre><code class="lang-Python">pca=PCA(n_components=<span class="hljs-number">154</span>)
X_mnist_reduced=pca.fit_transform(X_mnist)
X_mnist_recovered=pca.inverse_transform(X_mnist_reduced)
</code></pre>
<p><img src="../images/chapter_8/8-9.gif" alt=""></p>
<p>&#x56FE; 8-9 MNIST &#x4FDD;&#x7559; 95 &#x65B9;&#x5DEE;&#x7684;&#x538B;&#x7F29;  </p>
<p>&#x9006;&#x53D8;&#x6362;&#x7684;&#x516C;&#x5F0F;&#x5982;&#x516C;&#x5F0F; 8-3 &#x6240;&#x793A;  </p>
<p>&#x516C;&#x5F0F; 8-3 PCA&#x9006;&#x53D8;&#x6362;&#xFF0C;&#x56DE;&#x9000;&#x5230;&#x539F;&#x6765;&#x7684;&#x6570;&#x636E;&#x7EF4;&#x5EA6;</p>
<p><img src="../images/tex-9c33b504c86e9c53fd2dab1952e0db41.gif" alt="X_{recovered} = X_{d-proj} \cdot W_d^T"></p>
<h3 id="&#x589E;&#x91CF;-pca&#xFF08;incremental-pca&#xFF09;">&#x589E;&#x91CF; PCA&#xFF08;Incremental PCA&#xFF09;</h3>
<p>&#x5148;&#x524D; PCA &#x5B9E;&#x73B0;&#x7684;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#x5B83;&#x9700;&#x8981;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x5904;&#x7406;&#x6574;&#x4E2A;&#x8BAD;&#x7EC3;&#x96C6;&#x4EE5;&#x4FBF; SVD &#x7B97;&#x6CD5;&#x8FD0;&#x884C;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5F00;&#x53D1;&#x4E86;&#x589E;&#x91CF; PCA&#xFF08;IPCA&#xFF09;&#x7B97;&#x6CD5;&#xFF1A;&#x60A8;&#x53EF;&#x4EE5;&#x5C06;&#x8BAD;&#x7EC3;&#x96C6;&#x5206;&#x6279;&#xFF0C;&#x5E76;&#x4E00;&#x6B21;&#x53EA;&#x5BF9;&#x4E00;&#x4E2A;&#x6279;&#x91CF;&#x4F7F;&#x7528; IPCA &#x7B97;&#x6CD5;&#x3002;&#x8FD9;&#x5BF9;&#x5927;&#x578B;&#x8BAD;&#x7EC3;&#x96C6;&#x975E;&#x5E38;&#x6709;&#x7528;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x5728;&#x7EBF;&#x5E94;&#x7528; PCA&#xFF08;&#x5373;&#x5728;&#x65B0;&#x5B9E;&#x4F8B;&#x5230;&#x8FBE;&#x65F6;&#x5373;&#x65F6;&#x8FD0;&#x884C;&#xFF09;&#x3002;  </p>
<p>&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x5C06; MNIST &#x6570;&#x636E;&#x96C6;&#x5206;&#x6210; 100 &#x4E2A;&#x5C0F;&#x6279;&#x91CF;&#xFF08;&#x4F7F;&#x7528; NumPy &#x7684;<code>array_split()</code>&#x51FD;&#x6570;&#xFF09;&#xFF0C;&#x5E76;&#x5C06;&#x5B83;&#x4EEC;&#x63D0;&#x4F9B;&#x7ED9; Scikit-Learn &#x7684;<code>IncrementalPCA</code>&#x7C7B;&#xFF0C;&#x4EE5;&#x5C06; MNIST &#x6570;&#x636E;&#x96C6;&#x7684;&#x7EF4;&#x5EA6;&#x964D;&#x4F4E;&#x5230; 154 &#x7EF4;&#xFF08;&#x5C31;&#x50CF;&#x4EE5;&#x524D;&#x4E00;&#x6837;&#xFF09;&#x3002;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x60A8;&#x5FC5;&#x987B;&#x5BF9;&#x6BCF;&#x4E2A;&#x6700;&#x5C0F;&#x6279;&#x6B21;&#x8C03;&#x7528;<code>partial_fit()</code>&#x65B9;&#x6CD5;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5BF9;&#x6574;&#x4E2A;&#x8BAD;&#x7EC3;&#x96C6;&#x4F7F;&#x7528;<code>fit()</code>&#x65B9;&#x6CD5;&#xFF1A; </p>
<pre><code class="lang-Python"><span class="hljs-keyword">from</span> sklearn.decomposition <span class="hljs-keyword">import</span> IncrementalPCA

n_batches=<span class="hljs-number">100</span>
inc_pca=IncrementalPCA(n_components=<span class="hljs-number">154</span>)
<span class="hljs-keyword">for</span> X_batch <span class="hljs-keyword">in</span> np.array_spplit(X_mnist,n_batches):
    inc_pca.partial_fit(X_batch)
X_mnist_reduced=inc_pca.transform(X_mnist)
</code></pre>
<p>&#x6216;&#x8005;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; NumPy &#x7684;<code>memmap</code>&#x7C7B;&#xFF0C;&#x5B83;&#x5141;&#x8BB8;&#x60A8;&#x64CD;&#x4F5C;&#x5B58;&#x50A8;&#x5728;&#x78C1;&#x76D8;&#x4E0A;&#x4E8C;&#x8FDB;&#x5236;&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x5927;&#x578B;&#x6570;&#x7EC4;&#xFF0C;&#x5C31;&#x597D;&#x50CF;&#x5B83;&#x5B8C;&#x5168;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#xFF1B;&#x8BE5;&#x7C7B;&#x4EC5;&#x5728;&#x9700;&#x8981;&#x65F6;&#x52A0;&#x8F7D;&#x5185;&#x5B58;&#x4E2D;&#x6240;&#x9700;&#x7684;&#x6570;&#x636E;&#x3002;&#x7531;&#x4E8E;&#x589E;&#x91CF; PCA &#x7C7B;&#x5728;&#x4EFB;&#x4F55;&#x65F6;&#x95F4;&#x5185;&#x4EC5;&#x4F7F;&#x7528;&#x6570;&#x7EC4;&#x7684;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#xFF0C;&#x56E0;&#x6B64;&#x5185;&#x5B58;&#x4F7F;&#x7528;&#x91CF;&#x4ECD;&#x53D7;&#x5230;&#x63A7;&#x5236;&#x3002;&#x8FD9;&#x53EF;&#x4EE5;&#x8C03;&#x7528;&#x901A;&#x5E38;&#x7684;<code>fit()</code>&#x65B9;&#x6CD5;&#xFF0C;&#x5982;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x6240;&#x793A;&#xFF1A;  </p>
<pre><code class="lang-Python">X_mm=np.memmap(filename,dtype=<span class="hljs-string">&apos;float32&apos;</span>,mode=<span class="hljs-string">&apos;readonly&apos;</span>,shape=(m,n))
batch_size=m//n_batches
inc_pca=IncrementalPCA(n_components=<span class="hljs-number">154</span>,batch_size=batch_size)
inc_pca.fit(X_mm)
</code></pre>
<h3 id="&#x968F;&#x673A;-pca&#xFF08;randomized-pca&#xFF09;">&#x968F;&#x673A; PCA&#xFF08;Randomized PCA&#xFF09;</h3>
<p>Scikit-Learn &#x63D0;&#x4F9B;&#x4E86;&#x53E6;&#x4E00;&#x79CD;&#x6267;&#x884C; PCA &#x7684;&#x9009;&#x62E9;&#xFF0C;&#x79F0;&#x4E3A;&#x968F;&#x673A; PCA&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x968F;&#x673A;&#x7B97;&#x6CD5;&#xFF0C;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x627E;&#x5230;&#x524D;d&#x4E2A;&#x4E3B;&#x6210;&#x5206;&#x7684;&#x8FD1;&#x4F3C;&#x503C;&#x3002;&#x5B83;&#x7684;&#x8BA1;&#x7B97;&#x590D;&#x6742;&#x5EA6;&#x662F;<code>O(m &#xD7; d^2) + O(d^3)</code>&#xFF0C;&#x800C;&#x4E0D;&#x662F;<code>O(m &#xD7; n^2) + O(n^3)</code>&#xFF0C;&#x6240;&#x4EE5;&#x5F53;<code>d</code>&#x8FDC;&#x5C0F;&#x4E8E;<code>n</code>&#x65F6;&#xFF0C;&#x5B83;&#x6BD4;&#x4E4B;&#x524D;&#x7684;&#x7B97;&#x6CD5;&#x5FEB;&#x5F97;&#x591A;&#x3002;  </p>
<pre><code class="lang-Python">rnd_pca=PCA(n_components=<span class="hljs-number">154</span>,svd_solver=<span class="hljs-string">&apos;randomized&apos;</span>)
X_reduced=rnd_pca.fit_transform(X_mnist)
</code></pre>
<h2 id="&#x6838;-pca&#xFF08;kernel-pca&#xFF09;">&#x6838; PCA&#xFF08;Kernel PCA&#xFF09;</h2>
<p>&#x5728;&#x7B2C; 5 &#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E86;&#x6838;&#x6280;&#x5DE7;&#xFF0C;&#x4E00;&#x79CD;&#x5C06;&#x5B9E;&#x4F8B;&#x9690;&#x5F0F;&#x6620;&#x5C04;&#x5230;&#x975E;&#x5E38;&#x9AD8;&#x7EF4;&#x7A7A;&#x95F4;&#xFF08;&#x79F0;&#x4E3A;&#x7279;&#x5F81;&#x7A7A;&#x95F4;&#xFF09;&#x7684;&#x6570;&#x5B66;&#x6280;&#x672F;&#xFF0C;&#x8BA9;&#x652F;&#x6301;&#x5411;&#x91CF;&#x673A;&#x53EF;&#x4EE5;&#x5E94;&#x7528;&#x4E8E;&#x975E;&#x7EBF;&#x6027;&#x5206;&#x7C7B;&#x548C;&#x56DE;&#x5F52;&#x3002;&#x56DE;&#x60F3;&#x4E00;&#x4E0B;&#xFF0C;&#x9AD8;&#x7EF4;&#x7279;&#x5F81;&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x7EBF;&#x6027;&#x51B3;&#x7B56;&#x8FB9;&#x754C;&#x5BF9;&#x5E94;&#x4E8E;&#x539F;&#x59CB;&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x590D;&#x6742;&#x975E;&#x7EBF;&#x6027;&#x51B3;&#x7B56;&#x8FB9;&#x754C;&#x3002;  </p>
<p>&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#xFF0C;&#x540C;&#x6837;&#x7684;&#x6280;&#x5DE7;&#x53EF;&#x4EE5;&#x5E94;&#x7528;&#x4E8E; PCA&#xFF0C;&#x4ECE;&#x800C;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x590D;&#x6742;&#x7684;&#x975E;&#x7EBF;&#x6027;&#x6295;&#x5F71;&#x6765;&#x964D;&#x4F4E;&#x7EF4;&#x5EA6;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684;&#x6838; PCA&#xFF08;kPCA&#xFF09;&#x3002;&#x5B83;&#x901A;&#x5E38;&#x80FD;&#x591F;&#x5F88;&#x597D;&#x5730;&#x4FDD;&#x7559;&#x6295;&#x5F71;&#x540E;&#x7684;&#x7C07;&#xFF0C;&#x6709;&#x65F6;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x5C55;&#x5F00;&#x5206;&#x5E03;&#x8FD1;&#x4F3C;&#x4E8E;&#x626D;&#x66F2;&#x6D41;&#x5F62;&#x7684;&#x6570;&#x636E;&#x96C6;&#x3002;  </p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x4F7F;&#x7528; Scikit-Learn &#x7684;<code>KernelPCA</code>&#x7C7B;&#x6765;&#x6267;&#x884C;&#x5E26;&#x6709; RBF &#x6838;&#x7684; kPCA&#xFF08;&#x6709;&#x5173; RBF &#x6838;&#x548C;&#x5176;&#x4ED6;&#x6838;&#x7684;&#x66F4;&#x591A;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x9605;&#x7B2C; 5 &#x7AE0;&#xFF09;&#xFF1A;</p>
<pre><code class="lang-Python"><span class="hljs-keyword">from</span> sklearn.decomposition <span class="hljs-keyword">import</span> KernelPCA

rbf_pca=KernelPCA(n_components=<span class="hljs-number">2</span>,kernel=<span class="hljs-string">&apos;rbf&apos;</span>,gamma=<span class="hljs-number">0.04</span>)
X_reduced=rbf_pca.fit_transform(X)
</code></pre>
<p>&#x56FE; 8-10 &#x5C55;&#x793A;&#x4E86;&#x4F7F;&#x7528;&#x7EBF;&#x6027;&#x6838;&#xFF08;&#x7B49;&#x540C;&#x4E8E;&#x7B80;&#x5355;&#x7684;&#x4F7F;&#x7528; PCA &#x7C7B;&#xFF09;&#xFF0C;RBF &#x6838;&#xFF0C;sigmoid &#x6838;&#xFF08;Logistic&#xFF09;&#x5C06;&#x745E;&#x58EB;&#x5377;&#x964D;&#x5230; 2 &#x7EF4;&#x3002;</p>
<p><img src="../images/chapter_8/8-10.jpeg" alt=""></p>
<p>&#x56FE; 8-10 &#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x6838;&#x7684; kPCA &#x5C06;&#x745E;&#x58EB;&#x5377;&#x964D;&#x5230; 2 &#x7EF4;</p>
<h3 id="&#x9009;&#x62E9;&#x4E00;&#x79CD;&#x6838;&#x5E76;&#x8C03;&#x6574;&#x8D85;&#x53C2;&#x6570;">&#x9009;&#x62E9;&#x4E00;&#x79CD;&#x6838;&#x5E76;&#x8C03;&#x6574;&#x8D85;&#x53C2;&#x6570;</h3>
<p>&#x7531;&#x4E8E; kPCA &#x662F;&#x65E0;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#xFF0C;&#x56E0;&#x6B64;&#x6CA1;&#x6709;&#x660E;&#x663E;&#x7684;&#x6027;&#x80FD;&#x6307;&#x6807;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x60A8;&#x9009;&#x62E9;&#x6700;&#x4F73;&#x7684;&#x6838;&#x65B9;&#x6CD5;&#x548C;&#x8D85;&#x53C2;&#x6570;&#x503C;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x964D;&#x7EF4;&#x901A;&#x5E38;&#x662F;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x4EFB;&#x52A1;&#xFF08;&#x4F8B;&#x5982;&#x5206;&#x7C7B;&#xFF09;&#x7684;&#x51C6;&#x5907;&#x6B65;&#x9AA4;&#xFF0C;&#x56E0;&#x6B64;&#x60A8;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x5730;&#x4F7F;&#x7528;&#x7F51;&#x683C;&#x641C;&#x7D22;&#x6765;&#x9009;&#x62E9;&#x53EF;&#x4EE5;&#x8BA9;&#x8BE5;&#x4EFB;&#x52A1;&#x8FBE;&#x5230;&#x6700;&#x4F73;&#x8868;&#x73B0;&#x7684;&#x6838;&#x65B9;&#x6CD5;&#x548C;&#x8D85;&#x53C2;&#x6570;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x4E24;&#x6B65;&#x7684;&#x6D41;&#x6C34;&#x7EBF;&#xFF0C;&#x9996;&#x5148;&#x4F7F;&#x7528; kPCA &#x5C06;&#x7EF4;&#x5EA6;&#x964D;&#x81F3;&#x4E24;&#x7EF4;&#xFF0C;&#x7136;&#x540E;&#x5E94;&#x7528; Logistic &#x56DE;&#x5F52;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#x3002;&#x7136;&#x540E;&#x5B83;&#x4F7F;&#x7528;<code>Grid SearchCV</code>&#x4E3A; kPCA &#x627E;&#x5230;&#x6700;&#x4F73;&#x7684;&#x6838;&#x548C;<code>gamma</code>&#x503C;&#xFF0C;&#x4EE5;&#x4FBF;&#x5728;&#x6700;&#x540E;&#x83B7;&#x5F97;&#x6700;&#x4F73;&#x7684;&#x5206;&#x7C7B;&#x51C6;&#x786E;&#x6027;&#xFF1A;  </p>
<pre><code class="lang-Python"><span class="hljs-keyword">from</span> sklearn.model_selection <span class="hljs-keyword">import</span> GridSearchCV 
<span class="hljs-keyword">from</span> sklearn.linear_model <span class="hljs-keyword">import</span> LogisticRegression 
<span class="hljs-keyword">from</span> sklearn.pipeline <span class="hljs-keyword">import</span> Pipeline

clf = Pipeline([
        (<span class="hljs-string">&quot;kpca&quot;</span>, KernelPCA(n_components=<span class="hljs-number">2</span>)),
        (<span class="hljs-string">&quot;log_reg&quot;</span>, LogisticRegression())
])
param_grid = [{
        <span class="hljs-string">&quot;kpca__gamma&quot;</span>: np.linspace(<span class="hljs-number">0.03</span>, <span class="hljs-number">0.05</span>, <span class="hljs-number">10</span>),
        <span class="hljs-string">&quot;kpca__kernel&quot;</span>: [<span class="hljs-string">&quot;rbf&quot;</span>, <span class="hljs-string">&quot;sigmoid&quot;</span>]
    }]
grid_search = GridSearchCV(clf, param_grid, cv=<span class="hljs-number">3</span>)
grid_search.fit(X, y)
</code></pre>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8C03;&#x7528;<code>best_params_</code>&#x53D8;&#x91CF;&#x6765;&#x67E5;&#x770B;&#x4F7F;&#x6A21;&#x578B;&#x6548;&#x679C;&#x6700;&#x597D;&#x7684;&#x6838;&#x548C;&#x8D85;&#x53C2;&#x6570;&#xFF1A;</p>
<pre><code class="lang-Python"><span class="hljs-meta">&gt;&gt;&gt; </span>print(grid_search.best_params_)
{<span class="hljs-string">&apos;kpca__gamma&apos;</span>: <span class="hljs-number">0.043333333333333335</span>, <span class="hljs-string">&apos;kpca__kernel&apos;</span>: <span class="hljs-string">&apos;rbf&apos;</span>}
</code></pre>
<p>&#x53E6;&#x4E00;&#x79CD;&#x5B8C;&#x5168;&#x4E3A;&#x975E;&#x76D1;&#x7763;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x662F;&#x9009;&#x62E9;&#x4EA7;&#x751F;&#x6700;&#x4F4E;&#x91CD;&#x5EFA;&#x8BEF;&#x5DEE;&#x7684;&#x6838;&#x548C;&#x8D85;&#x53C2;&#x6570;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x91CD;&#x5EFA;&#x5E76;&#x4E0D;&#x50CF;&#x7EBF;&#x6027; PCA &#x90A3;&#x6837;&#x5BB9;&#x6613;&#x3002;&#x8FD9;&#x91CC;&#x662F;&#x539F;&#x56E0;&#xFF1A;&#x56FE; 8-11 &#x663E;&#x793A;&#x4E86;&#x539F;&#x59CB;&#x745E;&#x58EB;&#x5377; 3D &#x6570;&#x636E;&#x96C6;&#xFF08;&#x5DE6;&#x4E0A;&#x89D2;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x4F7F;&#x7528; RBF &#x6838;&#x5E94;&#x7528; kPCA &#x540E;&#x751F;&#x6210;&#x7684;&#x4E8C;&#x7EF4;&#x6570;&#x636E;&#x96C6;&#xFF08;&#x53F3;&#x4E0A;&#x89D2;&#xFF09;&#x3002;&#x7531;&#x4E8E;&#x6838;&#x6280;&#x5DE7;&#xFF0C;&#x8FD9;&#x5728;&#x6570;&#x5B66;&#x4E0A;&#x7B49;&#x540C;&#x4E8E;&#x4F7F;&#x7528;&#x7279;&#x5F81;&#x6620;&#x5C04;<code>&#x3C6;</code>&#x5C06;&#x8BAD;&#x7EC3;&#x96C6;&#x6620;&#x5C04;&#x5230;&#x65E0;&#x9650;&#x7EF4;&#x7279;&#x5F81;&#x7A7A;&#x95F4;&#xFF08;&#x53F3;&#x4E0B;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x7EBF;&#x6027; PCA &#x5C06;&#x53D8;&#x6362;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#x6295;&#x5F71;&#x5230; 2D&#x3002;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x7F29;&#x51CF;&#x7A7A;&#x95F4;&#x4E2D;&#x5BF9;&#x7ED9;&#x5B9A;&#x5B9E;&#x4F8B;&#x5B9E;&#x73B0;&#x53CD;&#x5411;&#x7EBF;&#x6027; PCA &#x6B65;&#x9AA4;&#xFF0C;&#x5219;&#x91CD;&#x6784;&#x70B9;&#x5C06;&#x4F4D;&#x4E8E;&#x7279;&#x5F81;&#x7A7A;&#x95F4;&#x4E2D;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4F4D;&#x4E8E;&#x539F;&#x59CB;&#x7A7A;&#x95F4;&#x4E2D;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x56FE;&#x4E2D;&#x7531;<code>x</code>&#x8868;&#x793A;&#x7684;&#x90A3;&#x6837;&#xFF09;&#x3002;&#x7531;&#x4E8E;&#x7279;&#x5F81;&#x7A7A;&#x95F4;&#x662F;&#x65E0;&#x9650;&#x7EF4;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x627E;&#x51FA;&#x91CD;&#x5EFA;&#x70B9;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x8BA1;&#x7B97;&#x771F;&#x5B9E;&#x7684;&#x91CD;&#x5EFA;&#x8BEF;&#x5DEE;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x539F;&#x59CB;&#x7A7A;&#x95F4;&#x4E2D;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x8D34;&#x8FD1;&#x91CD;&#x5EFA;&#x70B9;&#x7684;&#x70B9;&#x3002;&#x8FD9;&#x88AB;&#x79F0;&#x4E3A;&#x91CD;&#x5EFA;&#x524D;&#x56FE;&#x50CF;&#xFF08;reconstruction pre-image&#xFF09;&#x3002;&#x4E00;&#x65E6;&#x4F60;&#x6709;&#x8FD9;&#x4E2A;&#x524D;&#x56FE;&#x50CF;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x6D4B;&#x91CF;&#x5176;&#x4E0E;&#x539F;&#x59CB;&#x5B9E;&#x4F8B;&#x7684;&#x5E73;&#x65B9;&#x8DDD;&#x79BB;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x6700;&#x5C0F;&#x5316;&#x91CD;&#x5EFA;&#x524D;&#x56FE;&#x50CF;&#x9519;&#x8BEF;&#x7684;&#x6838;&#x548C;&#x8D85;&#x53C2;&#x6570;&#x3002;</p>
<p><img src="../images/chapter_8/8-11.jpeg" alt=""></p>
<p>&#x56FE; 8-11 &#x6838; PCA &#x548C;&#x91CD;&#x5EFA;&#x524D;&#x56FE;&#x50CF;&#x8BEF;&#x5DEE;  </p>
<p>&#x60A8;&#x53EF;&#x80FD;&#x60F3;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x8FDB;&#x884C;&#x8FD9;&#x79CD;&#x91CD;&#x5EFA;&#x3002;&#x4E00;&#x79CD;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x76D1;&#x7763;&#x56DE;&#x5F52;&#x6A21;&#x578B;&#xFF0C;&#x5C06;&#x9884;&#x8BA1;&#x5B9E;&#x4F8B;&#x4F5C;&#x4E3A;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x5E76;&#x5C06;&#x539F;&#x59CB;&#x5B9E;&#x4F8B;&#x4F5C;&#x4E3A;&#x8BAD;&#x7EC3;&#x76EE;&#x6807;&#x3002;&#x5982;&#x679C;&#x60A8;&#x8BBE;&#x7F6E;&#x4E86;<code>fit_inverse_transform = True</code>&#xFF0C;Scikit-Learn &#x5C06;&#x81EA;&#x52A8;&#x6267;&#x884C;&#x6B64;&#x64CD;&#x4F5C;&#xFF0C;&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<pre><code class="lang-Python">rbf_pca = KernelPCA(n_components = <span class="hljs-number">2</span>, kernel=<span class="hljs-string">&quot;rbf&quot;</span>, gamma=<span class="hljs-number">0.0433</span>,fit_inverse_transform=<span class="hljs-keyword">True</span>)
X_reduced = rbf_pca.fit_transform(X)
X_preimage = rbf_pca.inverse_transform(X_reduced)
</code></pre>
<blockquote>
<p>&#x6982;&#x8FF0;&#xFF1A;&#x9ED8;&#x8BA4;&#x6761;&#x4EF6;&#x4E0B;&#xFF0C;<code>fit_inverse_transform = False</code>&#x5E76;&#x4E14;<code>KernelPCA</code>&#x6CA1;&#x6709;<code>inverse_tranfrom()</code>&#x65B9;&#x6CD5;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x4EC5;&#x4EC5;&#x5F53;<code>fit_inverse_transform = True</code>&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x624D;&#x4F1A;&#x521B;&#x5EFA;&#x3002;  </p>
</blockquote>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x8BA1;&#x7B97;&#x91CD;&#x5EFA;&#x524D;&#x56FE;&#x50CF;&#x8BEF;&#x5DEE;&#xFF1A;</p>
<pre><code class="lang-Python"><span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-keyword">from</span> sklearn.metrics <span class="hljs-keyword">import</span> mean_squared_error
<span class="hljs-meta">&gt;&gt;&gt; </span>mean_squared_error(X, X_preimage) <span class="hljs-number">32.786308795766132</span>
</code></pre>
<p>&#x73B0;&#x5728;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x7684;&#x65B9;&#x683C;&#x641C;&#x7D22;&#x6765;&#x5BFB;&#x627E;&#x53EF;&#x4EE5;&#x6700;&#x5C0F;&#x5316;&#x91CD;&#x5EFA;&#x524D;&#x56FE;&#x50CF;&#x8BEF;&#x5DEE;&#x7684;&#x6838;&#x65B9;&#x6CD5;&#x548C;&#x8D85;&#x53C2;&#x6570;&#x3002;  </p>
<h3 id="lle">LLE</h3>
<p>&#x5C40;&#x90E8;&#x7EBF;&#x6027;&#x5D4C;&#x5165;&#xFF08;Locally Linear Embedding&#xFF09;&#x662F;&#x53E6;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x6709;&#x6548;&#x7684;&#x975E;&#x7EBF;&#x6027;&#x964D;&#x7EF4;&#xFF08;NLDR&#xFF09;&#x65B9;&#x6CD5;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x6D41;&#x5F62;&#x5B66;&#x4E60;&#x6280;&#x672F;&#xFF0C;&#x4E0D;&#x4F9D;&#x8D56;&#x4E8E;&#x50CF;&#x4EE5;&#x524D;&#x7B97;&#x6CD5;&#x90A3;&#x6837;&#x7684;&#x6295;&#x5F71;&#x3002;&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;LLE &#x9996;&#x5148;&#x6D4B;&#x91CF;&#x6BCF;&#x4E2A;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#x4E0E;&#x5176;&#x6700;&#x8FD1;&#x90BB;&#xFF08;c.n.&#xFF09;&#x4E4B;&#x95F4;&#x7684;&#x7EBF;&#x6027;&#x5173;&#x7CFB;&#xFF0C;&#x7136;&#x540E;&#x5BFB;&#x627E;&#x80FD;&#x6700;&#x597D;&#x5730;&#x4FDD;&#x7559;&#x8FD9;&#x4E9B;&#x5C40;&#x90E8;&#x5173;&#x7CFB;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x4F4E;&#x7EF4;&#x8868;&#x793A;&#xFF08;&#x7A0D;&#x540E;&#x4F1A;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#xFF09; &#x3002;&#x8FD9;&#x4F7F;&#x5F97;&#x5B83;&#x7279;&#x522B;&#x64C5;&#x957F;&#x5C55;&#x5F00;&#x626D;&#x66F2;&#x7684;&#x6D41;&#x5F62;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5728;&#x6CA1;&#x6709;&#x592A;&#x591A;&#x566A;&#x97F3;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x3002;  </p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x4EE5;&#x4E0B;&#x4EE3;&#x7801;&#x4F7F;&#x7528; Scikit-Learn &#x7684;<code>LocallyLinearEmbedding</code>&#x7C7B;&#x6765;&#x5C55;&#x5F00;&#x745E;&#x58EB;&#x5377;&#x3002;&#x5F97;&#x5230;&#x7684;&#x4E8C;&#x7EF4;&#x6570;&#x636E;&#x96C6;&#x5982;&#x56FE; 8-12 &#x6240;&#x793A;&#x3002;&#x6B63;&#x5982;&#x60A8;&#x6240;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x745E;&#x58EB;&#x5377;&#x88AB;&#x5B8C;&#x5168;&#x5C55;&#x5F00;&#xFF0C;&#x5B9E;&#x4F8B;&#x4E4B;&#x95F4;&#x7684;&#x8DDD;&#x79BB;&#x4FDD;&#x5B58;&#x5F97;&#x5F88;&#x597D;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8DDD;&#x79BB;&#x4E0D;&#x80FD;&#x5728;&#x8F83;&#x5927;&#x8303;&#x56F4;&#x5185;&#x4FDD;&#x7559;&#x7684;&#x5F88;&#x597D;&#xFF1A;&#x5C55;&#x5F00;&#x7684;&#x745E;&#x58EB;&#x5377;&#x7684;&#x5DE6;&#x4FA7;&#x88AB;&#x6324;&#x538B;&#xFF0C;&#x800C;&#x53F3;&#x4FA7;&#x7684;&#x90E8;&#x5206;&#x88AB;&#x62C9;&#x957F;&#x3002;&#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#xFF0C;LLE &#x5728;&#x5BF9;&#x6D41;&#x5F62;&#x5EFA;&#x6A21;&#x65B9;&#x9762;&#x505A;&#x5F97;&#x975E;&#x5E38;&#x597D;&#x3002;  </p>
<pre><code class="lang-Python"><span class="hljs-keyword">from</span> sklearn.manifold <span class="hljs-keyword">import</span> LocallyLinearEmbedding

lle=LocallyLinearEmbedding(n_components=<span class="hljs-number">2</span>,n_neighbors=<span class="hljs-number">10</span>)
X_reduced=lle.fit_transform(X)
</code></pre>
<p><img src="../images/chapter_8/8-12.jpeg" alt=""></p>
<p>&#x56FE; 8-12 &#x4F7F;&#x7528; LLE &#x5C55;&#x5F00;&#x745E;&#x58EB;&#x5377;  </p>
<p>&#x8FD9;&#x662F;LLE&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#xFF1A;&#x9996;&#x5148;&#xFF0C;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B; <img src="../images/tex-e8fa5b806940d1b4d0059fba40646506.gif" alt="x^{(i)}">&#xFF0C;&#x8BE5;&#x7B97;&#x6CD5;&#x8BC6;&#x522B;&#x5176;&#x6700;&#x8FD1;&#x7684;<code>k</code>&#x4E2A;&#x90BB;&#x5C45;&#xFF08;&#x5728;&#x524D;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x4E2D;<code>k = 10</code>&#x4E2D;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x5C1D;&#x8BD5;&#x5C06; <img src="../images/tex-e8fa5b806940d1b4d0059fba40646506.gif" alt="x^{(i)}"> &#x91CD;&#x6784;&#x4E3A;&#x8FD9;&#x4E9B;&#x90BB;&#x5C45;&#x7684;&#x7EBF;&#x6027;&#x51FD;&#x6570;&#x3002;&#x66F4;&#x5177;&#x4F53;&#x5730;&#xFF0C;&#x627E;&#x5230;&#x6743;&#x91CD; <img src="../images/tex-e32c5b6b54ce1398ae1134e7688631ad.gif" alt="w_{i,j}"> &#x4ECE;&#x800C;&#x4F7F; <img src="../images/tex-e8fa5b806940d1b4d0059fba40646506.gif" alt="x^{(i)}"> &#x548C; <img src="../images/tex-3a4d978e6657d768ca9a800d0e1a8130.gif" alt="\sum_{j=1}^{m}w_{i,j} x^{(j)}"> &#x4E4B;&#x95F4;&#x7684;&#x5E73;&#x65B9;&#x8DDD;&#x79BB;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x5C0F;&#xFF0C;&#x5047;&#x8BBE;&#x5982;&#x679C; <img src="../images/tex-b7762ca6ebcdab26862a6cd2ff27ac16.gif" alt="x^{(j)}"> &#x4E0D;&#x662F; <img src="../images/tex-e8fa5b806940d1b4d0059fba40646506.gif" alt="x^{(i)}"> &#x7684;<code>k</code>&#x4E2A;&#x6700;&#x8FD1;&#x90BB;&#x65F6; <img src="../images/tex-095a09304bbece2585736594cca6bdbf.gif" alt="w_{i,j}=0">&#x3002;&#x56E0;&#x6B64;&#xFF0C;LLE &#x7684;&#x7B2C;&#x4E00;&#x6B65;&#x662F;&#x65B9;&#x7A0B; 8-4 &#x4E2D;&#x63CF;&#x8FF0;&#x7684;&#x7EA6;&#x675F;&#x4F18;&#x5316;&#x95EE;&#x9898;&#xFF0C;&#x5176;&#x4E2D;<code>W</code>&#x662F;&#x5305;&#x542B;&#x6240;&#x6709;&#x6743;&#x91CD; <img src="../images/tex-e32c5b6b54ce1398ae1134e7688631ad.gif" alt="w_{i,j}"> &#x7684;&#x6743;&#x91CD;&#x77E9;&#x9635;&#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x7EA6;&#x675F;&#x7B80;&#x5355;&#x5730;&#x5BF9;&#x6BCF;&#x4E2A;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B; <img src="../images/tex-e8fa5b806940d1b4d0059fba40646506.gif" alt="x^{(i)}"> &#x7684;&#x6743;&#x91CD;&#x8FDB;&#x884C;&#x5F52;&#x4E00;&#x5316;&#x3002;  </p>
<p>&#x516C;&#x5F0F; 8-2 LLE &#x7B2C;&#x4E00;&#x6B65;&#xFF1A;&#x5BF9;&#x5C40;&#x90E8;&#x5173;&#x7CFB;&#x8FDB;&#x884C;&#x7EBF;&#x6027;&#x5EFA;&#x6A21;</p>
<p><img src="../images/chapter_8/e-8-2.gif" alt=""></p>
<p>&#x5728;&#x8FD9;&#x6B65;&#x4E4B;&#x540E;&#xFF0C;&#x6743;&#x91CD;&#x77E9;&#x9635;  <img src="../images/tex-ad2c883a17ec87bc3c34797652592af5.gif" alt="\widehat{W}">&#xFF08;&#x5305;&#x542B;&#x6743;&#x91CD; <img src="../images/tex-fa862454300a16183669e45840e8ac40.gif" alt="\hat{w_{i,j}}"> &#x5BF9;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#x7684;&#x7EBF;&#x5F62;&#x5173;&#x7CFB;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#x3002;&#x73B0;&#x5728;&#x7B2C;&#x4E8C;&#x6B65;&#x662F;&#x5C06;&#x8BAD;&#x7EC3;&#x5B9E;&#x4F8B;&#x6295;&#x5F71;&#x5230;&#x4E00;&#x4E2A;<code>d</code>&#x7EF4;&#x7A7A;&#x95F4;&#xFF08;<code>d &lt; n</code>&#xFF09;&#x4E2D;&#x53BB;&#xFF0C;&#x540C;&#x65F6;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x4FDD;&#x7559;&#x8FD9;&#x4E9B;&#x5C40;&#x90E8;&#x5173;&#x7CFB;&#x3002;&#x5982;&#x679C; <img src="../images/tex-a6f367725930ab547e010046a9c80bb4.gif" alt="z^{(i)}"> &#x662F; <img src="../images/tex-e8fa5b806940d1b4d0059fba40646506.gif" alt="x^{(i)}"> &#x5728;&#x8FD9;&#x4E2A;<code>d</code>&#x7EF4;&#x7A7A;&#x95F4;&#x7684;&#x56FE;&#x50CF;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x60F3;&#x8981; <img src="../images/tex-a6f367725930ab547e010046a9c80bb4.gif" alt="z^{(i)}"> &#x548C; <img src="../images/tex-c1505d74d64c3d2bd20ccaa668c131d1.gif" alt="\sum_{j=1}^{m}\hat{w_{i,j}}\ z^{(j)}"> &#x4E4B;&#x95F4;&#x7684;&#x5E73;&#x65B9;&#x8DDD;&#x79BB;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x5C0F;&#x3002;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x8BA9;&#x6211;&#x4EEC;&#x63D0;&#x51FA;&#x4E86;&#x516C;&#x5F0F;8-5&#x4E2D;&#x7684;&#x975E;&#x9650;&#x5236;&#x6027;&#x4F18;&#x5316;&#x95EE;&#x9898;&#x3002;&#x5B83;&#x770B;&#x8D77;&#x6765;&#x4E0E;&#x7B2C;&#x4E00;&#x6B65;&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x8981;&#x505A;&#x7684;&#x4E0D;&#x662F;&#x4FDD;&#x6301;&#x5B9E;&#x4F8B;&#x56FA;&#x5B9A;&#x5E76;&#x627E;&#x5230;&#x6700;&#x4F73;&#x6743;&#x91CD;&#xFF0C;&#x800C;&#x662F;&#x6070;&#x76F8;&#x53CD;&#xFF1A;&#x4FDD;&#x6301;&#x6743;&#x91CD;&#x4E0D;&#x53D8;&#xFF0C;&#x5E76;&#x5728;&#x4F4E;&#x7EF4;&#x7A7A;&#x95F4;&#x4E2D;&#x627E;&#x5230;&#x5B9E;&#x4F8B;&#x56FE;&#x50CF;&#x7684;&#x6700;&#x4F73;&#x4F4D;&#x7F6E;&#x3002;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;<code>Z</code>&#x662F;&#x5305;&#x542B;&#x6240;&#x6709; <img src="../images/tex-a6f367725930ab547e010046a9c80bb4.gif" alt="z^{(i)}"> &#x7684;&#x77E9;&#x9635;&#x3002;  </p>
<p>&#x516C;&#x5F0F; 8-3 LLE &#x7B2C;&#x4E8C;&#x6B65;&#xFF1A;&#x4FDD;&#x6301;&#x5173;&#x7CFB;&#x7684;&#x540C;&#x65F6;&#x8FDB;&#x884C;&#x964D;&#x7EF4;</p>
<p><img src="../images/chapter_8/e-8-3.gif" alt="">  </p>
<p>Scikit-Learn &#x7684; LLE &#x5B9E;&#x73B0;&#x5177;&#x6709;&#x5982;&#x4E0B;&#x7684;&#x8BA1;&#x7B97;&#x590D;&#x6742;&#x5EA6;&#xFF1A;&#x67E5;&#x627E;<code>k</code>&#x4E2A;&#x6700;&#x8FD1;&#x90BB;&#x4E3A;<code>O(m log(m) n log(k))</code>&#xFF0C;&#x4F18;&#x5316;&#x6743;&#x91CD;&#x4E3A;<code>O(m n k^3)</code>&#xFF0C;&#x5EFA;&#x7ACB;&#x4F4E;&#x7EF4;&#x8868;&#x793A;&#x4E3A;<code>O(d m^2)</code>&#x3002;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x6700;&#x540E;&#x4E00;&#x9879;<code>m^2</code>&#x4F7F;&#x5F97;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x5728;&#x5904;&#x7406;&#x5927;&#x6570;&#x636E;&#x96C6;&#x7684;&#x65F6;&#x5019;&#x8868;&#x73B0;&#x8F83;&#x5DEE;&#x3002;  </p>
<h2 id="&#x5176;&#x4ED6;&#x964D;&#x7EF4;&#x65B9;&#x6CD5;">&#x5176;&#x4ED6;&#x964D;&#x7EF4;&#x65B9;&#x6CD5;</h2>
<p>&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x5176;&#x4ED6;&#x7684;&#x964D;&#x7EF4;&#x65B9;&#x6CD5;&#xFF0C;Scikit-Learn &#x652F;&#x6301;&#x5176;&#x4E2D;&#x7684;&#x597D;&#x51E0;&#x79CD;&#x3002;&#x8FD9;&#x91CC;&#x662F;&#x5176;&#x4E2D;&#x6700;&#x6D41;&#x884C;&#x7684;&#xFF1A; </p>
<ul>
<li>&#x591A;&#x7EF4;&#x7F29;&#x653E;&#xFF08;MDS&#xFF09;&#x5728;&#x5C1D;&#x8BD5;&#x4FDD;&#x6301;&#x5B9E;&#x4F8B;&#x4E4B;&#x95F4;&#x8DDD;&#x79BB;&#x7684;&#x540C;&#x65F6;&#x964D;&#x4F4E;&#x4E86;&#x7EF4;&#x5EA6;&#xFF08;&#x53C2;&#x89C1;&#x56FE; 8-13&#xFF09;</li>
<li>Isomap &#x901A;&#x8FC7;&#x5C06;&#x6BCF;&#x4E2A;&#x5B9E;&#x4F8B;&#x8FDE;&#x63A5;&#x5230;&#x6700;&#x8FD1;&#x7684;&#x90BB;&#x5C45;&#x6765;&#x521B;&#x5EFA;&#x56FE;&#x5F62;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x5C1D;&#x8BD5;&#x4FDD;&#x6301;&#x5B9E;&#x4F8B;&#x4E4B;&#x95F4;&#x7684;&#x6D4B;&#x5730;&#x8DDD;&#x79BB;&#x65F6;&#x964D;&#x4F4E;&#x7EF4;&#x5EA6;&#x3002;  </li>
<li>t-&#x5206;&#x5E03;&#x968F;&#x673A;&#x90BB;&#x57DF;&#x5D4C;&#x5165;&#xFF08;t-Distributed Stochastic Neighbor Embedding&#xFF0C;t-SNE&#xFF09;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x964D;&#x4F4E;&#x7EF4;&#x200B;&#x200B;&#x5EA6;&#xFF0C;&#x540C;&#x65F6;&#x8BD5;&#x56FE;&#x4FDD;&#x6301;&#x76F8;&#x4F3C;&#x7684;&#x5B9E;&#x4F8B;&#x4E34;&#x8FD1;&#x5E76;&#x5C06;&#x4E0D;&#x76F8;&#x4F3C;&#x7684;&#x5B9E;&#x4F8B;&#x5206;&#x5F00;&#x3002;&#x5B83;&#x4E3B;&#x8981;&#x7528;&#x4E8E;&#x53EF;&#x89C6;&#x5316;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x7528;&#x4E8E;&#x53EF;&#x89C6;&#x5316;&#x9AD8;&#x7EF4;&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x5B9E;&#x4F8B;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;MNIST&#x56FE;&#x50CF;&#x964D;&#x7EF4;&#x5230; 2D &#x53EF;&#x89C6;&#x5316;&#xFF09;&#x3002;  </li>
<li>&#x7EBF;&#x6027;&#x5224;&#x522B;&#x5206;&#x6790;&#xFF08;Linear Discriminant Analysis&#xFF0C;LDA&#xFF09;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x4E00;&#x79CD;&#x5206;&#x7C7B;&#x7B97;&#x6CD5;&#xFF0C;&#x4F46;&#x5728;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5B83;&#x4F1A;&#x5B66;&#x4E60;&#x7C7B;&#x4E4B;&#x95F4;&#x6700;&#x6709;&#x533A;&#x522B;&#x7684;&#x8F74;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x8F74;&#x6765;&#x5B9A;&#x4E49;&#x7528;&#x4E8E;&#x6295;&#x5F71;&#x6570;&#x636E;&#x7684;&#x8D85;&#x5E73;&#x9762;&#x3002;LDA &#x7684;&#x597D;&#x5904;&#x662F;&#x6295;&#x5F71;&#x4F1A;&#x5C3D;&#x53EF;&#x80FD;&#x5730;&#x4FDD;&#x6301;&#x5404;&#x4E2A;&#x7C7B;&#x4E4B;&#x95F4;&#x8DDD;&#x79BB;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x8FD0;&#x884C;&#x53E6;&#x4E00;&#x79CD;&#x5206;&#x7C7B;&#x7B97;&#x6CD5;&#xFF08;&#x5982; SVM &#x5206;&#x7C7B;&#x5668;&#xFF09;&#x4E4B;&#x524D;&#xFF0C;LDA &#x662F;&#x5F88;&#x597D;&#x7684;&#x964D;&#x7EF4;&#x6280;&#x672F;&#x3002;  </li>
</ul>
<p><img src="../images/chapter_8/8-13.jpeg" alt=""></p>
<p>&#x56FE; 8-13 &#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x6280;&#x672F;&#x5C06;&#x745E;&#x58EB;&#x5377;&#x964D;&#x7EF4;&#x81F3; 2D</p>
<h2 id="&#x7EC3;&#x4E60;">&#x7EC3;&#x4E60;</h2>
<ol>
<li>&#x51CF;&#x5C11;&#x6570;&#x636E;&#x96C6;&#x7EF4;&#x5EA6;&#x7684;&#x4E3B;&#x8981;&#x52A8;&#x673A;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x4E3B;&#x8981;&#x7F3A;&#x70B9;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</li>
<li>&#x4EC0;&#x4E48;&#x662F;&#x7EF4;&#x5EA6;&#x7206;&#x70B8;&#xFF1F;  </li>
<li>&#x4E00;&#x65E6;&#x5BF9;&#x67D0;&#x6570;&#x636E;&#x96C6;&#x964D;&#x7EF4;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x6062;&#x590D;&#x5B83;&#x5417;&#xFF1F;&#x5982;&#x679C;&#x53EF;&#x4EE5;&#xFF0C;&#x600E;&#x6837;&#x505A;&#x624D;&#x80FD;&#x6062;&#x590D;&#xFF1F;&#x5982;&#x679C;&#x4E0D;&#x53EF;&#x4EE5;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#xFF1F;  </li>
<li>PCA &#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x964D;&#x4F4E;&#x4E00;&#x4E2A;&#x9AD8;&#x5EA6;&#x975E;&#x7EBF;&#x6027;&#x5BF9;&#x6570;&#x636E;&#x96C6;&#x5417;&#xFF1F;  </li>
<li>&#x5047;&#x8BBE;&#x4F60;&#x5BF9;&#x4E00;&#x4E2A; 1000 &#x7EF4;&#x7684;&#x6570;&#x636E;&#x96C6;&#x5E94;&#x7528; PCA&#xFF0C;&#x540C;&#x65F6;&#x8BBE;&#x7F6E;&#x65B9;&#x5DEE;&#x89E3;&#x91CA;&#x7387;&#x4E3A; 95%&#xFF0C;&#x4F60;&#x7684;&#x6700;&#x7EC8;&#x6570;&#x636E;&#x96C6;&#x5C06;&#x4F1A;&#x6709;&#x591A;&#x5C11;&#x7EF4;&#xFF1F;  </li>
<li>&#x5728;&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#x4E0B;&#x4F60;&#x4F1A;&#x4F7F;&#x7528;&#x666E;&#x901A;&#x7684; PCA&#xFF0C;&#x589E;&#x91CF; PCA&#xFF0C;&#x968F;&#x673A; PCA &#x548C;&#x6838; PCA&#xFF1F;  </li>
<li>&#x4F60;&#x8BE5;&#x5982;&#x4F55;&#x8BC4;&#x4EF7;&#x4F60;&#x7684;&#x964D;&#x7EF4;&#x7B97;&#x6CD5;&#x5728;&#x4F60;&#x6570;&#x636E;&#x96C6;&#x4E0A;&#x7684;&#x8868;&#x73B0;&#xFF1F;  </li>
<li>&#x5C06;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x964D;&#x7EF4;&#x7B97;&#x6CD5;&#x4E32;&#x8054;&#x4F7F;&#x7528;&#x6709;&#x610F;&#x4E49;&#x5417;&#xFF1F;  </li>
<li>&#x52A0;&#x8F7D; MNIST &#x6570;&#x636E;&#x96C6;&#xFF08;&#x5728;&#x7B2C; 3 &#x7AE0;&#x4E2D;&#x4ECB;&#x7ECD;&#xFF09;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x5206;&#x6210;&#x4E00;&#x4E2A;&#x8BAD;&#x7EC3;&#x96C6;&#x548C;&#x4E00;&#x4E2A;&#x6D4B;&#x8BD5;&#x96C6;&#xFF08;&#x5C06;&#x524D; 60,000 &#x4E2A;&#x5B9E;&#x4F8B;&#x7528;&#x4E8E;&#x8BAD;&#x7EC3;&#xFF0C;&#x5176;&#x4F59; 10,000 &#x4E2A;&#x7528;&#x4E8E;&#x6D4B;&#x8BD5;&#xFF09;&#x3002;&#x5728;&#x6570;&#x636E;&#x96C6;&#x4E0A;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x68EE;&#x6797;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x5E76;&#x8BB0;&#x5F55;&#x4E86;&#x82B1;&#x8D39;&#x591A;&#x957F;&#x65F6;&#x95F4;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x6D4B;&#x8BD5;&#x96C6;&#x4E0A;&#x8BC4;&#x4F30;&#x6A21;&#x578B;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x4F7F;&#x7528; PCA &#x964D;&#x4F4E;&#x6570;&#x636E;&#x96C6;&#x7684;&#x7EF4;&#x5EA6;&#xFF0C;&#x8BBE;&#x7F6E;&#x65B9;&#x5DEE;&#x89E3;&#x91CA;&#x7387;&#x4E3A; 95%&#x3002;&#x5728;&#x964D;&#x7EF4;&#x540E;&#x7684;&#x6570;&#x636E;&#x96C6;&#x4E0A;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x968F;&#x673A;&#x68EE;&#x6797;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x5E76;&#x67E5;&#x770B;&#x9700;&#x8981;&#x591A;&#x957F;&#x65F6;&#x95F4;&#x3002;&#x8BAD;&#x7EC3;&#x901F;&#x5EA6;&#x66F4;&#x5FEB;&#xFF1F;&#x63A5;&#x4E0B;&#x6765;&#x8BC4;&#x4F30;&#x6D4B;&#x8BD5;&#x96C6;&#x4E0A;&#x7684;&#x5206;&#x7C7B;&#x5668;&#xFF1A;&#x5B83;&#x4E0E;&#x4EE5;&#x524D;&#x7684;&#x5206;&#x7C7B;&#x5668;&#x6BD4;&#x8F83;&#x8D77;&#x6765;&#x5982;&#x4F55;&#xFF1F;  </li>
<li>&#x4F7F;&#x7528; t-SNE &#x5C06; MNIST &#x6570;&#x636E;&#x96C6;&#x7F29;&#x51CF;&#x5230;&#x4E8C;&#x7EF4;&#xFF0C;&#x5E76;&#x4F7F;&#x7528; Matplotlib &#x7ED8;&#x5236;&#x7ED3;&#x679C;&#x56FE;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; 10 &#x79CD;&#x4E0D;&#x540C;&#x989C;&#x8272;&#x7684;&#x6563;&#x70B9;&#x56FE;&#x6765;&#x8868;&#x793A;&#x6BCF;&#x4E2A;&#x56FE;&#x50CF;&#x7684;&#x76EE;&#x6807;&#x7C7B;&#x522B;&#x3002;&#x6216;&#x8005;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5728;&#x6BCF;&#x4E2A;&#x5B9E;&#x4F8B;&#x7684;&#x4F4D;&#x7F6E;&#x5199;&#x5165;&#x5F69;&#x8272;&#x6570;&#x5B57;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x7ED8;&#x5236;&#x6570;&#x5B57;&#x56FE;&#x50CF;&#x672C;&#x8EAB;&#x7684;&#x964D;&#x7EF4;&#x7248;&#x672C;&#xFF08;&#x5982;&#x679C;&#x7ED8;&#x5236;&#x6240;&#x6709;&#x6570;&#x5B57;&#xFF0C;&#x5219;&#x53EF;&#x89C6;&#x5316;&#x53EF;&#x80FD;&#x4F1A;&#x8FC7;&#x4E8E;&#x6DF7;&#x4E71;&#xFF0C;&#x56E0;&#x6B64;&#x60A8;&#x5E94;&#x8BE5;&#x7ED8;&#x5236;&#x968F;&#x673A;&#x6837;&#x672C;&#x6216;&#x53EA;&#x5728;&#x5468;&#x56F4;&#x6CA1;&#x6709;&#x5176;&#x4ED6;&#x5B9E;&#x4F8B;&#x88AB;&#x7ED8;&#x5236;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x7ED8;&#x5236;&#xFF09;&#x3002;&#x4F60;&#x5C06;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x5206;&#x9694;&#x826F;&#x597D;&#x7684;&#x7684;&#x53EF;&#x89C6;&#x5316;&#x6570;&#x5B57;&#x96C6;&#x7FA4;&#x3002;&#x5C1D;&#x8BD5;&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x964D;&#x7EF4;&#x7B97;&#x6CD5;&#xFF0C;&#x5982; PCA&#xFF0C;LLE &#x6216; MDS&#xFF0C;&#x5E76;&#x6BD4;&#x8F83;&#x53EF;&#x89C6;&#x5316;&#x7ED3;&#x679C;&#x3002;  </li>
</ol>
<p>&#x7EC3;&#x4E60;&#x7B54;&#x6848;&#x8BF7;&#x89C1;&#x9644;&#x5F55; A&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="7.集成学习和随机森林.html" class="navigation navigation-prev " aria-label="Previous page: 七、集成学习和随机森林">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="9.启动并运行_TensorFlow.html" class="navigation navigation-next " aria-label="Next page: 九、启动并运行 TensorFlow">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"八、降维","level":"1.10","depth":1,"next":{"title":"九、启动并运行 TensorFlow","level":"1.11","depth":1,"path":"docs/9.启动并运行_TensorFlow.md","ref":"docs/9.启动并运行_TensorFlow.md","articles":[]},"previous":{"title":"七、集成学习和随机森林","level":"1.9","depth":1,"path":"docs/7.集成学习和随机森林.md","ref":"docs/7.集成学习和随机森林.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"docs/8.降维.md","mtime":"2019-04-18T03:01:37.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-05-07T09:41:36.357Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

